{
  "paperId": "40c5b71cf509efe7737fe2e5d3548fed29aca680",
  "title": "Research on Optimization and Application of University Student Development and Management Strategy Driven by Multidimensional Big Data",
  "abstract": "The purpose of education is to enable students to develop fully, freely, comprehensively, and harmoniously. The development of college students is a social problem that must be focused on in higher education under the background of China’s powerful human resources. It is an important subject that higher education must attach great importance to and solve to find out the way and method to solve and avoid the development of college students to help them face risks correctly, meet challenges, and grow healthily. Under the background in the era of big data, Internet and mobile intelligent terminal has great popularity in colleges and universities, especially in the digital library, the official platform construction, and is widely used in Internet multimedia technology in college classroom, although for college students and the teacher provides vast amounts of information data, exploring the college students’ horizons, enriching the students’ knowledge structure. But the explosive growth of data and information security threat to the development of college students management work still bring the severe test of this; education workers in colleges and universities should comply with the development of The Times, the big data organic blend in the current education system, and the specific practice of education, for modern education practice and college students’ all-round development’s age characteristic new development mode and effective way. In order to adapt to the new form of the development of The Times, the management of colleges and universities should keep pace with The Times, and integrate the concept of big data and advanced technology into the education management work, so as to realize the national deployment of the education system innovation development strategy, explore teaching rules, students’ growth and development tasks, and other realistic needs of the times. In addition, making big data the most powerful internal driving force for educational development helps colleges and universities to realize the frontier, timeliness, interactivity, and individuation of educational management. Colleges and universities should actively apply the idea of big data, improve the data resource integration and use ability of the staff in the field of education management through diversified means, improve the management level in multiple dimensions, and promote the updating and upgrading of the management structure of higher education and teaching. By analyzing the background of big data era, this paper analyzes the challenges of college students’ management in the era of big data and puts forward the strategies of college students’ management in the era of big data, so as to improve the quality and efficiency of college students’ management.",
  "tldr": "大学生の発展と管理戦略を多次元ビッグデータに基づいて最適化し、教育管理の質と効率を向上させる方法を探る。ビッグデータを活用し、教育システムに統合することで、大学の管理構造を更新し、学生の成長を支援する新しいアプローチを提案。"
}