{
  "paperId": "66a941202042bc808f05504616b5c0bfc7f60603",
  "title": "A Dual-Store Structure for Knowledge Graphs",
  "abstract": "To effectively manage increasing knowledge graphs in various domains, a hot research topic, knowledge graph storage management, has emerged. Existing methods are classified to relational stores and native graph stores. Relational stores are able to store large-scale knowledge graphs and convenient in updating knowledge, but the query performance weakens obviously when the selectivity of a knowledge graph query is large. Native graph stores are efficient in processing complex knowledge graph queries due to its index-free adjacent property, but they are inapplicable to manage a large-scale knowledge graph due to limited storage budgets or inflexible updating process. Motivated by this, we propose a dual-store structure which leverages a graph store to accelerate the complex query process in the relational store. However, it is challenging to determine <italic>what</italic> data to transfer from relational store to graph store at <italic>what</italic> time. To address this problem, we formulate it as a Markov Decision Process and derive a physical design tuner <inline-formula><tex-math notation=\"LaTeX\">${{\\sf DOTIL}}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">DOTIL</mml:mi></mml:math><inline-graphic xlink:href=\"wang-ieq1-3093200.gif\"/></alternatives></inline-formula> based on reinforcement learning. With <inline-formula><tex-math notation=\"LaTeX\">${{\\sf DOTIL}}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\">DOTIL</mml:mi></mml:math><inline-graphic xlink:href=\"wang-ieq2-3093200.gif\"/></alternatives></inline-formula>, the dual-store structure is adaptive to dynamic changing workloads. Experimental results on real knowledge graphs demonstrate that our proposed dual-store structure improves query performance up to average 50.11 percent compared with the most commonly used relational stores.",
  "tldr": "This paper presents a dual-store structure for managing knowledge graphs, combining relational and native graph stores to enhance query performance. By using reinforcement learning to optimize data transfer, the approach improves query efficiency by an average of 50.11% over traditional relational stores."
}