{
  "paperId": "811bad48d9793240e64ee7281545a0180787347b",
  "title": "باشترکردنی ئەدای بنکەدراوەی فەزایی لەسەر بنەمای تێکەڵى فێربوونی ئامێری و پێکهاتەی داتاى هيلى هیلبێرت",
  "abstract": "يقدم هذا العمل ويحلل نهجًا جديدًا للفهرسة متعددة الأبعاد. يعتمد على مفاهيم الفهرسة المكانية المختلطة المكتسبة باستخدام خوارزمية منحنى هيلبرت لملء الفراغ مع التعلم الآلي. استخدام خوارزمية Hilbert للحصول على فهرسة لكل كائن مكاني (نقطة ، خط ، مضلع) ، ثم تنفيذ أقرب استعلامات جار في التقنية التقليدية. الاستفادة من طريقة التعلم الآلي لتعلم مؤشرات الكائنات المكانية ، في الطريقة التي تم تعلمها ، استخدمنا أيضًا منحنى هيلبرت لفهرسة الكائنات المكانية كما في الطريقة التقليدية ، وتعلم المؤشرات ، ثم تنفيذ استعلام الجار الأقرب كما هو الحال في الطريقة التقليدية ، وحساب وقت التنفيذ أخيرًا. النتيجة المهمة التي تتجاوز خوارزمية فهرسة التعلم المختلط المقترحة (HLI) وهي تحسين الأداء على منحنى هيلبرت رائعة في الطريقة المكتسبة من خلال المقارنة بين الطرق التقليدية والمتعلمة والتي تتم عن طريق حساب وقت تنفيذ كل تقنيات معالجة الاستعلام لـ جميع أنواع الكائنات المكانية الثلاثة. لقد اختبرنا كلتا طريقتين الفهرسة لمقارنة وتقييم كلتا الطريقتين ، HLI المقترحة لدينا ، لها نتائج مهمة من حيث وقت تنفيذ الاستعلام أقل والذي يرجع إلى تحسين أداء قاعدة البيانات المكانية. تم تقييم الفهرسة المقترحة من خلال منحنى خصائص تشغيل المستقبِل (منحنى ROC) لنموذج أمثلية النظام ، وكذلك المقاييس الإحصائية MSE و R2. \n  \nپوختە \nئەم کارە ڕێبازێکی نوێ بۆ ئیندێکسی فرەڕەهەند دەناسێنێت و شیکاری دەکات. لەسەر بنەمای چەمکەکانی ئیندێکسکردنی فەزایی فێربووی تێکەڵە بە بەکارهێنانی ئەلگۆریتمەکانی  پڕکردنەوەی بۆشایی هیلبێرت لەگەڵ فێربوونی ئامێر. بەکارهێنانی ئەلگۆریتمەکەی هیلبێرت بۆ بەدەستهێنانی ئیندێکسکردن بۆ هەر شتێکی فەزایی (خاڵ، هێڵ، فرەگۆشە)، پاشان جێبەجێکردنی پرسیارەکانی نزیکترین دراوسێ بە تەکنیکێکی تەقلیدی. بە وەرگرتنی سوود لە شێوازی فێربوونی ئامێر بۆ فێربوونی پێوەرەکانی شتە فەزاییەکان، لە شێوازی فێربوودا ئێمە ئەلگۆریتمی هیلبێرتمان بەکارهێنا بۆ ئیندێکسکردنی شتە فەزاییەکان وەک لە شێوازی تەقلیدیدا، و فێربوونی ئەو پێوەرانە، پاشان پرسیاری نزیکترین دراوسێ وەک لە تەقلیدیدا جێبەجێ بکەین، لە کۆتاییدا کاتی جێبەجێکردن حیساب دەکەین. ئەنجامێکی گرنگ کە لە ئەلگۆریتمێکی پێشنیارکراوی ئیندێکسی فێربوونی تێکەڵاو (HLI) تێدەپەڕێت کە باشتربوونی ئەدای کارکردنە بەسەر کێوی هیلبێرتدا لە شێوازی فێربوودا گەورەیە بە بەراوردکردنی نێوان شێوازە تەقلیدی و فێربووەکان کە لەڕێگەی حیسابکردنی کاتی جێبەجێکردنی هەر تەکنیکێکی پرۆسێسی پرسیار بۆ ئەنجام دەدرێت هەر سێ جۆری شتە فەزاییەکان. ئێمە هەردوو شێوازی ئیندێکسکردنمان تاقیکردەوە بۆ بەراوردکردن و هەڵسەنگاندنی هەردوو تەکنیکەکە، HLI پێشنیارکراوی ئێمە، ئەنجامە بەرچاوەکانی هەیە لەڕووی کەمتر لە کاتی جێبەجێکردنی پرسیار کە بەهۆی بەرزکردنەوەی ئەدای بنکەدراوەی فەزایی. ئیندێکسی پێشنیارکراوی کە لە ڕێگەی کێوی تایبەتمەندی کارکردنی وەرگرەوە هەڵسەنگێندراوە (هێلی ROC-curve) بۆ مۆدێلی باشی سیستەم، هەروەها پێوەرە ئامارییەکانی MSE و R2.",
  "tldr": "この研究は、ヒルベルト曲線を用いた新しい多次元インデックス手法を提案し、機械学習を活用して空間オブジェクトのインデックスを最適化することで、従来の手法と比較してクエリ処理時間を短縮することに成功した。提案手法（HLI）は、空間データベースのパフォーマンスを向上させ、ROC曲線やMSE、R2などの統計指標で評価されている。"
}