{
  "paperId": "c69bf2e1fdddd66ddc322f587867047e47c5bdfc",
  "title": "Honeycomb: Ordered Key-Value Store Acceleration on an FPGA-Based SmartNIC",
  "abstract": "In-memory ordered key-value stores are an important building block in modern distributed applications. We present Honeycomb, a hybrid software-hardware system for accelerating read-dominated workloads on ordered key-value stores that provides linearizability for all operations including scans. Honeycomb stores a B-Tree in host memory. It executes <sc>put</sc>, <sc>update</sc> and <sc>delete</sc> on a CPU. At the same time, it offloads <sc>scan</sc> and <sc>get</sc> onto an FPGA-based SmartNIC. This approach enables large stores and simplifies the FPGA implementation but raises the challenge of data access and synchronization across the slow PCIe bus. We describe how Honeycomb overcomes this challenge with careful data structure design, caching, request parallelism with out-of-order execution, wait-free read operations, and fast synchronization between the CPU and the FPGA. For read-heavy YCSB workloads, Honeycomb increases the throughput of a state-of-the-art ordered key-value store by at least <inline-formula><tex-math notation=\"LaTeX\">$1.8\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mn>1.8</mml:mn><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"liu-ieq1-3345173.gif\"/></alternatives></inline-formula>. For scan-heavy workloads inspired by cloud storage, Honeycomb increases the throughput by more than <inline-formula><tex-math notation=\"LaTeX\">$2\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mn>2</mml:mn><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"liu-ieq2-3345173.gif\"/></alternatives></inline-formula>. The cost-performance, which is more important for large-scale deployments, is improved by at least <inline-formula><tex-math notation=\"LaTeX\">$1.5\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mn>1.5</mml:mn><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"liu-ieq3-3345173.gif\"/></alternatives></inline-formula> on these workloads.",
  "tldr": "Honeycomb is a hybrid software-hardware system that accelerates read-dominated workloads in ordered key-value stores using an FPGA-based SmartNIC, achieving up to 2x throughput improvements and 1.5x better cost-performance for large-scale deployments while ensuring linearizability for all operations."
}