{
    "paperId": "0033ea07b646576cdb2b4d873e1fac305140ee20",
    "title": "Benchmarking Network Embedding Models for Link Prediction: Are We Making Progress?",
    "year": 2020,
    "venue": "International Conference on Data Science and Advanced Analytics",
    "authors": [
        "A. Mara",
        "Jefrey Lijffijt",
        "T. D. Bie"
    ],
    "doi": "10.1109/DSAA49011.2020.00026",
    "arxivId": "2002.11522",
    "url": "https://www.semanticscholar.org/paper/0033ea07b646576cdb2b4d873e1fac305140ee20",
    "isOpenAccess": true,
    "openAccessPdf": "https://biblio.ugent.be/publication/8675297/file/8675298.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Network embedding methods map a network’s nodes to vectors in an embedding space, in such a way that these representations are useful for estimating some notion of similarity or proximity between pairs of nodes in the network. The quality of these node representations is then showcased through results of downstream prediction tasks. Commonly used benchmark tasks such as link prediction, however, present complex evaluation pipelines and an abundance of design choices. This, together with a lack of standardized evaluation setups can obscure the real progress in the field. In this paper, we aim to shed light on the state-of-the-art of network embedding methods for link prediction and show, using a consistent evaluation pipeline, that only thin progress has been made over the last years. The newly conducted benchmark that we present here, including 17 embedding methods, also shows that many approaches are outperformed even by simple heuristics. Finally, we argue that standardized evaluation tools can repair this situation and boost future progress in this field.",
    "citationCount": 23,
    "referenceCount": 43
}