{
    "paperId": "003a2377e1a5f19221b9e4f746fecdee197a1da0",
    "title": "Intelligent Reflective Surface-Aided Communications for Small-Cell MISO Systems",
    "year": 2022,
    "venue": "IEEE Conference on Standards for Communications and Networking",
    "authors": [
        "Diogo Pereira",
        "Rodolfo Oliveira",
        "D. B. D. Costa",
        "Hyong S. Kim"
    ],
    "doi": "10.1109/CSCN57023.2022.10051117",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/003a2377e1a5f19221b9e4f746fecdee197a1da0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper considers a millimeter wave multiple-input-single-output (MISO) communication system assisted by one intelligent reflecting surface (IRS) placed at the edge of two small-cells. Our goal is to improve the communication system by allocating the IRS to assist one of the small-cells through a two-stage algorithm. In the first-stage, the algorithm selects which small-cell is assisted by the IRS. In the second stage, the phase shift of each IRS reflecting element and the beam-forming coefficients from each small-cell are computed. Unlike the majority of the solutions already proposed, the algorithm is designed to combine two distinct approaches. In the first stage, a data-driven reinforcement learning model is adopted to configure the general characteristics of each cell. While a traditional alternating optimization algorithm is adopted in the second stage to compute the coefficients associated with the IRS and small-cells. The performance of the two-stage algorithm is compared with three benchmark decision policies: random assignment, maximum capacity, and minimum capacity. Numerical results demonstrate the similarity between the communication system obtained through the proposed algorithm and the maximum capacity benchmark, confirming the effectiveness of the proposed solution to achieve a near-optimal capacity.",
    "citationCount": 0,
    "referenceCount": 17
}