{
    "paperId": "003cbd7a131a0d6ebbf8ba15db71678b0466d235",
    "title": "OneSearch: A Preliminary Exploration of the Unified End-to-End Generative Framework for E-commerce Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Ben Chen",
        "Xian Guo",
        "Siyuan Wang",
        "Zihan Liang",
        "Yue Lv",
        "Yufei Ma",
        "Xinlong Xiao",
        "Bowen Xue",
        "Xuxin Zhang",
        "Ying Yang",
        "Huangyu Dai",
        "Xing Xu",
        "Tong Zhao",
        "Mingcan Peng",
        "Xiaoyang Zheng",
        "Chao Wang",
        "Qihang Zhao",
        "Zhixin Zhai",
        "Yang Zhao",
        "Bochao Liu",
        "Jingshan Lv",
        "Xiao Liang",
        "Yuqing Ding",
        "Jing Chen",
        "Chenyi Lei",
        "Wenwu Ou",
        "Han Li",
        "Kun Gai"
    ],
    "doi": "10.48550/arXiv.2509.03236",
    "arxivId": "2509.03236",
    "url": "https://www.semanticscholar.org/paper/003cbd7a131a0d6ebbf8ba15db71678b0466d235",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional e-commerce search systems employ multi-stage cascading architectures (MCA) that progressively filter items through recall, pre-ranking, and ranking stages. While effective at balancing computational efficiency with business conversion, these systems suffer from fragmented computation and optimization objective collisions across stages, which ultimately limit their performance ceiling. To address these, we propose \\textbf{OneSearch}, the first industrial-deployed end-to-end generative framework for e-commerce search. This framework introduces three key innovations: (1) a Keyword-enhanced Hierarchical Quantization Encoding (KHQE) module, to preserve both hierarchical semantics and distinctive item attributes while maintaining strong query-item relevance constraints; (2) a multi-view user behavior sequence injection strategy that constructs behavior-driven user IDs and incorporates both explicit short-term and implicit long-term sequences to model user preferences comprehensively; and (3) a Preference-Aware Reward System (PARS) featuring multi-stage supervised fine-tuning and adaptive reward-weighted ranking to capture fine-grained user preferences. Extensive offline evaluations on large-scale industry datasets demonstrate OneSearch's superior performance for high-quality recall and ranking. The rigorous online A/B tests confirm its ability to enhance relevance in the same exposure position, achieving statistically significant improvements: +1.67% item CTR, +2.40% buyer, and +3.22% order volume. Furthermore, OneSearch reduces operational expenditure by 75.40% and improves Model FLOPs Utilization from 3.26% to 27.32%. The system has been successfully deployed across multiple search scenarios in Kuaishou, serving millions of users, generating tens of millions of PVs daily.",
    "citationCount": 5,
    "referenceCount": 45
}