{
    "paperId": "0041c633c6dbb361cff7ff4703a723f89960be6b",
    "title": "Trajectory Planning of Robot Manipulator Based on RBF Neural Network",
    "year": 2021,
    "venue": "Entropy",
    "authors": [
        "Qisong Song",
        "Shaobo Li",
        "Q. Bai",
        "Jing Yang",
        "Ansi Zhang",
        "Xingxing Zhang",
        "Longxuan Zhe"
    ],
    "doi": "10.3390/e23091207",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0041c633c6dbb361cff7ff4703a723f89960be6b",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1099-4300/23/9/1207/pdf?version=1631702510",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Robot manipulator trajectory planning is one of the core robot technologies, and the design of controllers can improve the trajectory accuracy of manipulators. However, most of the controllers designed at this stage have not been able to effectively solve the nonlinearity and uncertainty problems of the high degree of freedom manipulators. In order to overcome these problems and improve the trajectory performance of the high degree of freedom manipulators, a manipulator trajectory planning method based on a radial basis function (RBF) neural network is proposed in this work. Firstly, a 6-DOF robot experimental platform was designed and built. Secondly, the overall manipulator trajectory planning framework was designed, which included manipulator kinematics and dynamics and a quintic polynomial interpolation algorithm. Then, an adaptive robust controller based on an RBF neural network was designed to deal with the nonlinearity and uncertainty problems, and Lyapunov theory was used to ensure the stability of the manipulator control system and the convergence of the tracking error. Finally, to test the method, a simulation and experiment were carried out. The simulation results showed that the proposed method improved the response and tracking performance to a certain extent, reduced the adjustment time and chattering, and ensured the smooth operation of the manipulator in the course of trajectory planning. The experimental results verified the effectiveness and feasibility of the method proposed in this paper.",
    "citationCount": 28,
    "referenceCount": 43
}