{
    "paperId": "0054b9ca26742250dc9bf92e7f9092f2cf0d0904",
    "title": "Beyond Modelling: Understanding Mental Disorders in Online Social Media",
    "year": 2020,
    "venue": "European Conference on Information Retrieval",
    "authors": [
        "E. A. Ríssola",
        "Mohammad Aliannejadi",
        "F. Crestani"
    ],
    "doi": "10.1007/978-3-030-45439-5_20",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0054b9ca26742250dc9bf92e7f9092f2cf0d0904",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mental disorders are a major concern in societies all over the world, and in spite of the improved diagnosis rates of such disorders in recent years, many cases still go undetected. Nowadays, many people are increasingly utilising online social media platforms to share their feelings and moods. Despite the collective efforts in the community to develop models for identifying potential cases of mental disorders, not much work has been done to provide insights that could be used by a predictive system or a health practitioner in the elaboration of a diagnosis. In this paper, we present our research towards better visualising and understanding the factors that characterise and differentiate social media users who are affected by mental disorders from those who are not. Furthermore, we study to which extent various mental disorders, such as depression and anorexia, differ in terms of language use. We conduct different experiments considering various dimensions of language such as vocabulary, psychometric attributes and emotional indicators. Our findings reveal that positive instances of mental disorders show significant differences from control individuals in the way they write and express emotions in social media. However, there are not quantifiable differences that could be used to distinguish one mental disorder from each other.",
    "citationCount": 30,
    "referenceCount": 35
}