{
    "paperId": "0073d8049d0ebd46be67ceb4927e28907930fab1",
    "title": "Benchmarking Adaptive Multidimensional Indices",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Konstantinos Lampropoulos",
        "Fatemeh Zardbani",
        "Nikos Mamoulis",
        "Panagiotis Karras"
    ],
    "doi": "10.14778/3749646.3749709",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0073d8049d0ebd46be67ceb4927e28907930fab1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n By\n adaptive indexing\n , an index grows dynamically and progressively through query processing. This mode of index-building, well explored over the past fifteen years, proves especially useful in exploratory scenarios where prebuilt indexes do not pay off the time to construct them, as the query workload variably focuses on particular areas of the search space, or the data become quickly obsolete. Despite a significant body of work in multidimensional adaptive indexing, there remains a gap in comparative studies that evaluate these methods on equal terms in a wide spectrum of settings, including data types, distributions, sizes, and workload patterns. This work fills this gap with a comprehensive benchmark to thoroughly evaluate the performance, strengths, and limitations of existing multidimensional adaptive indexing methods across diverse scenarios, contributing valuable insights that complement previous works. Further, we suggest supplementary technical extensions that enhance the efficiency of existing methods.\n",
    "citationCount": 0,
    "referenceCount": 40
}