{
    "paperId": "007d5eb499b7b418104f060e72cfe366666e18de",
    "title": "Visual comfort generative design framework based on parametric network in underground space",
    "year": 2022,
    "venue": "Comput. Aided Civ. Infrastructure Eng.",
    "authors": [
        "Yingbin Gui",
        "Biao Zhou",
        "Xiongyao Xie"
    ],
    "doi": "10.1111/mice.12936",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/007d5eb499b7b418104f060e72cfe366666e18de",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growing demand for a high‐quality life, visual comfort (VC) is becoming increasingly important for improving the quality of underground spaces. The underground space landscape features can be defined by the spatial and material parameters of the components. This study proposes a novel parametric generative network (StepGN) for the 3D generative design of VC. It combines parametric modeling, VC evaluation, and a novel reinforcement learning (RL) model called encoded soft actor critic (ESAC) and simplifies the optimization of complex VC scenes into a parameter‐generating optimization process. Among them, parametric modeling is used to generate a 3D underground space scene with components and material properties through parameterization, and the optimization of parameters depends on the evaluation and RL model. The evaluation model provides reward value, and a new ESAC algorithm is developed. It combines the soft actor‐critic (SAC) algorithm with the encoder process and by setting the reward with a confidence threshold. In addition, the Swin cosine distance (SCD) is used to measure the diversity of the generated scenes. A comparison of the policy types and range conversion methods proves that the stochastic policy and Sigmoid function are more suitable for the generative design of VC. By comparing StepGN with a generative adversarial network‐based generative network (VCGN) and other RL processes, it shows that StepGN can generate discrete distributions of the VC levels and can realize a high‐comfort level scene, and the training speed and stability are considerably improved. Finally, StepGN is applied for the optimization of the Wujiaochang subway station scene in Shanghai, and it is proved that the VC of the generated results can provide a high comfort level.",
    "citationCount": 3,
    "referenceCount": 40
}