{
    "paperId": "007e673c73c539ee4dd8b5aafffbdf3fd6a0fd4e",
    "title": "HPG-Tree: An Enhanced B+-Tree for Spatial Indexing",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Amal Saif",
        "Alaa Altarazi",
        "A. Al-badarneh",
        "Mohammad J. Abdel-Rahman"
    ],
    "doi": "10.1109/ACCESS.2025.3573152",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/007e673c73c539ee4dd8b5aafffbdf3fd6a0fd4e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In modern applications such as geographic information systems, game development, and image processing, the demand for efficient two-dimensional spatial indexing is rising exponentially. Traditional approaches like R-tree can suffer from excessive overlap and fragmentation, while standard <inline-formula> <tex-math notation=\"LaTeX\">$B^{+}$ </tex-math></inline-formula>-trees are limited to one-dimensional data. Motivated by these gaps, we propose the hyperbolic paraboloid grid (HPG) tree, an enhanced <inline-formula> <tex-math notation=\"LaTeX\">$B^{+}$ </tex-math></inline-formula>-tree structure specifically tailored for two-dimensional datasets. First, we employ a grid-based strategy that maps two-dimensional points into one-dimensional values without resorting to hashing. By combining grid partitioning with the <inline-formula> <tex-math notation=\"LaTeX\">$B^{+}$ </tex-math></inline-formula>-tree’s efficient, self-balancing properties, the HPG-tree simultaneously addresses overlap, storage utilization, and query performance. Unlike purely one-dimensional indexes, this method preserves spatial locality and avoids excessive rebalancing. Further, the HPG-tree integrates a hyperbolic paraboloid-like framework in its node layout, allowing it to halve the number of index nodes in many cases. This optimization is key to reducing disk or memory scans, thereby accelerating point lookups, range queries, and updates. Our experiments demonstrate that the HPG-tree outperforms comparable state-of-the-art structures like <inline-formula> <tex-math notation=\"LaTeX\">$R^{*}$ </tex-math></inline-formula>-tree, achieving up to a 50% improvement in storage utilization and significant gains in query throughput. HPG-tree opens a promising avenue for modern spatial databases that require both high scalability and sub-second response, making it a robust and flexible option for today’s evolving data-intensive environments. These advantages make HPG-tree particularly well-suited to large-scale spatial databases requiring both high scalability and sub-second responsiveness. Following a detailed discussion of the shortcomings in existing methods, the paper presents the HPG-tree methodology, including its grid partitioning, node layout, and insertion procedures, illustrating why this hybrid strategy stands out as a robust and flexible option for evolving data-intensive environments.",
    "citationCount": 0,
    "referenceCount": 40
}