{
    "paperId": "00cb6bfb9e04b711e9cd94a6c567336ff5d83f60",
    "title": "Two‐Step Estimation Strategy for Predicting Petroleum Reservoir Simulation Jobs Runtime on an HPC Cluster",
    "year": 2025,
    "venue": "Concurrency and Computation",
    "authors": [
        "Alan L. Nunes",
        "Bernardo Gallo",
        "Bruno Lopes",
        "Felipe A. Portella",
        "José Viterbo",
        "Lúcia M. A. Drummond",
        "Luciano Andrade",
        "Miguel de Lima",
        "Paulo J. B. Estrela",
        "Renzo Q. Malini"
    ],
    "doi": "10.1002/cpe.70026",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/00cb6bfb9e04b711e9cd94a6c567336ff5d83f60",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modeling petroleum field behavior provides crucial knowledge for risk quantification regarding extraction prospects. Since their processing requires significant computational and storage capabilities, oil companies run reservoir simulation jobs on high‐performance computing clusters managed by job managers, for example, Slurm. In this scenario, efficiently using machine learning algorithms to predict the runtime of incoming jobs can improve the effectiveness of cluster resources, such as enhancing the resource usage rate and reducing the jobs queue time. This work analyses diverse machine learning‐based predictors built from a real‐world Slurm jobs log from Petrobras, a globally renowned Brazilian energy company. Furthermore, a two‐step estimation strategy that predicts the duration time interval of reservoir simulation jobs is proposed and assessed, indicating that such estimated runtimes, when employed by job managers in their scheduling decisions, can positively impact the throughput of a real‐world batch system.",
    "citationCount": 1,
    "referenceCount": 51
}