{
    "paperId": "00ffcc997b0bcf0dbf60ff04c29d701919582a62",
    "title": "Towards Multi-spatiotemporal-scale Generalized PDE Modeling",
    "year": 2022,
    "venue": "Trans. Mach. Learn. Res.",
    "authors": [
        "Jayesh K. Gupta",
        "Johannes Brandstetter"
    ],
    "doi": "10.48550/arXiv.2209.15616",
    "arxivId": "2209.15616",
    "url": "https://www.semanticscholar.org/paper/00ffcc997b0bcf0dbf60ff04c29d701919582a62",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2209.15616",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Partial differential equations (PDEs) are central to describing complex physical system simulations. Their expensive solution techniques have led to an increased interest in deep neural network based surrogates. However, the practical utility of training such surrogates is contingent on their ability to model complex multi-scale spatio-temporal phenomena. Various neural network architectures have been proposed to target such phenomena, most notably Fourier Neural Operators (FNOs), which give a natural handle over local&global spatial information via parameterization of different Fourier modes, and U-Nets which treat local and global information via downsampling and upsampling paths. However, generalizing across different equation parameters or time-scales still remains a challenge. In this work, we make a comprehensive comparison between various FNO, ResNet, and U-Net like approaches to fluid mechanics problems in both vorticity-stream and velocity function form. For U-Nets, we transfer recent architectural improvements from computer vision, most notably from object segmentation and generative modeling. We further analyze the design considerations for using FNO layers to improve performance of U-Net architectures without major degradation of computational cost. Finally, we show promising results on generalization to different PDE parameters and time-scales with a single surrogate model. Source code for our PyTorch benchmark framework is available at https://github.com/microsoft/pdearena.",
    "citationCount": 166,
    "referenceCount": 144
}