{
    "paperId": "011b15968341ceff85e28079feaa9afee4de5c1d",
    "title": "The Potential of AutoML for Recommender Systems",
    "year": 2024,
    "venue": "User Modeling, Adaptation, and Personalization",
    "authors": [
        "Tobias Vente",
        "Lukas Wegmeth",
        "Joeran Beel"
    ],
    "doi": "10.1145/3708319.3734173",
    "arxivId": "2402.04453",
    "url": "https://www.semanticscholar.org/paper/011b15968341ceff85e28079feaa9afee4de5c1d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automated Machine Learning (AutoML) has significantly advanced Machine Learning (ML) applications, including model compression, machine translation, and computer vision. Recommender Systems (RecSys) can be seen as an application of ML. Yet AutoML has received little attention from the RecSys community, and RecSys has not received notable attention from the AutoML community. Only a few relatively simple Automated Recommender Systems (AutoRecSys) libraries exist that adopt AutoML techniques. However, these libraries are based on student projects and do not offer the features and thorough development of AutoML libraries. We set out to determine how AutoML libraries perform in the scenario of an inexperienced user who wants to implement a recommender system. We compared the predictive performance of 60 AutoML, AutoRecSys, ML, and RecSys algorithms from 15 libraries, including a mean predictor baseline, on 14 explicit feedback RecSys datasets. We found that AutoML and AutoRecSys libraries performed best. AutoML libraries performed best for six of the 14 datasets (43%), but the same AutoML library did not always perform best. The single-best library was the AutoRecSys library Auto-Surprise, which performed best on five datasets (36%). On three datasets (21%), AutoML libraries performed poorly, and RecSys libraries with default parameters performed best. Although while obtaining 50% of all placements in the top five per dataset, RecSys algorithms fall behind AutoML on average. ML algorithms generally performed the worst.",
    "citationCount": 3,
    "referenceCount": 56
}