{
    "paperId": "0180a125afaecf84a3b879b4f377f3d0ae7d262b",
    "title": "Subsampled Ensemble Can Improve Generalization Tail Exponentially",
    "year": 2024,
    "venue": "",
    "authors": [
        "Huajie Qian",
        "Donghao Ying",
        "Henry Lam",
        "Wotao Yin"
    ],
    "doi": null,
    "arxivId": "2405.14741",
    "url": "https://www.semanticscholar.org/paper/0180a125afaecf84a3b879b4f377f3d0ae7d262b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ensemble learning is a popular technique to improve the accuracy of machine learning models. It traditionally hinges on the rationale that aggregating multiple weak models can lead to better models with lower variance and hence higher stability, especially for discontinuous base learners. In this paper, we provide a new perspective on ensembling. By selecting the best model trained on subsamples via majority voting, we can attain exponentially decaying tails for the excess risk, even if the base learner suffers from slow (i.e., polynomial) decay rates. This tail enhancement power of ensembling is agnostic to the underlying base learner and is stronger than variance reduction in the sense of exhibiting rate improvement. We demonstrate how our ensemble methods can substantially improve out-of-sample performances in a range of numerical examples involving heavy-tailed data or intrinsically slow rates. Code for the proposed methods is available at https://github.com/mickeyhqian/VoteEnsemble.",
    "citationCount": 1,
    "referenceCount": 98
}