{
    "paperId": "01c27abcb2525bb6ca1912c2bc0cab13cc5771d4",
    "title": "Learning the Solution Operator of Boundary Value Problems using Graph Neural Networks",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Winfried Lotzsch",
        "Simon Ohler",
        "J. Otterbach"
    ],
    "doi": "10.48550/arXiv.2206.14092",
    "arxivId": "2206.14092",
    "url": "https://www.semanticscholar.org/paper/01c27abcb2525bb6ca1912c2bc0cab13cc5771d4",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.14092",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As an alternative to classical numerical solvers for partial differential equations (PDEs) subject to boundary value constraints, there has been a surge of interest in investigating neural networks that can solve such problems efficiently. In this work, we design a general solution operator for two different time-independent PDEs using graph neural networks (GNNs) and spectral graph convolutions. We train the networks on simulated data from a finite elements solver on a variety of shapes and inhomogeneities. In contrast to previous works, we focus on the ability of the trained operator to generalize to previously unseen scenarios. Specifically, we test generalization to meshes with different shapes and superposition of solutions for a different number of inhomogeneities. We find that training on a diverse dataset with lots of variation in the finite element meshes is a key ingredient for achieving good generalization results in all cases. With this, we believe that GNNs can be used to learn solution operators that generalize over a range of properties and produce solutions much faster than a generic solver. Our dataset, which we make publicly available, can be used and extended to verify the robustness of these models under varying conditions.",
    "citationCount": 20,
    "referenceCount": 30
}