{
    "paperId": "01fdb301e410af33200207594ddd2fd0dd30c4bc",
    "title": "Virtual Glamour: AI-Enhanced Makeup Recommendations and Trials",
    "year": 2024,
    "venue": "International Conference Intelligent Data Communication Technologies and Internet Things",
    "authors": [
        "Likhitha Daram",
        "Gayathri Pullakhandam",
        "Nageshwari Godari",
        "S.Shobarani"
    ],
    "doi": "10.1109/ICICI62254.2024.00043",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/01fdb301e410af33200207594ddd2fd0dd30c4bc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Makeup Recommendation System is a tribute to the potential of data-driven technology to improve the user experience in the ever-changing world of beauty and cosmetics. This unique technology creates personalised designs for cosmetics, skin care items and makeup application techniques using complex algorithms and data analysis methodologies. This method not only speeds up shopping, but also allows users to make informed decisions about their beauty products and procedures by considering the user’s unique characteristics such as skin type, complexion, personal preferences and the latest beauty trends. The technology also dives deep into personal preferences to provide a personalised experience that matches an individual’s own interests. This level of customization ensures that the recommendations are not only relevant, but also resonate with the consumer on a deeper level. Users can experiment with different lip colors, eyeshadows and foundations, and thanks to the excellent images, they can see the possible results as if they were physically doing the makeup. The Makeup Recommendation System helps users make more confident makeup decisions by providing personalised recommendations and a virtual trial experience. It not only makes shopping easier, but also fosters a stronger bond between people and their beauty products. This in turn improves the overall user experience, making beauty shopping enjoyable and stress-free.By accurately applying numerous makeup styles to users’ faces, this makeup transfer application’s outcomes aim to enhance the realism of photos. This technology allows users to see realistic previews of various makeup styles before making a purchase, and it finds uses in the production of cosmetic products and virtual makeup try-on experiences.",
    "citationCount": 0,
    "referenceCount": 19
}