{
    "paperId": "020bb2ba5f3923858cd6882ba5c5a44ea8041ab6",
    "title": "Meta-Learning in Neural Networks: A Survey",
    "year": 2020,
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "authors": [
        "Timothy M. Hospedales",
        "Antreas Antoniou",
        "P. Micaelli",
        "A. Storkey"
    ],
    "doi": "10.1109/TPAMI.2021.3079209",
    "arxivId": "2004.05439",
    "url": "https://www.semanticscholar.org/paper/020bb2ba5f3923858cd6882ba5c5a44ea8041ab6",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/34/4359286/09428530.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The field of meta-learning, or learning-to-learn, has seen a dramatic rise in interest in recent years. Contrary to conventional approaches to AI where tasks are solved from scratch using a fixed learning algorithm, meta-learning aims to improve the learning algorithm itself, given the experience of multiple learning episodes. This paradigm provides an opportunity to tackle many conventional challenges of deep learning, including data and computation bottlenecks, as well as generalization. This survey describes the contemporary meta-learning landscape. We first discuss definitions of meta-learning and position it with respect to related fields, such as transfer learning and hyperparameter optimization. We then propose a new taxonomy that provides a more comprehensive breakdown of the space of meta-learning methods today. We survey promising applications and successes of meta-learning such as few-shot learning and reinforcement learning. Finally, we discuss outstanding challenges and promising areas for future research.",
    "citationCount": 2266,
    "referenceCount": 333
}