{
    "paperId": "0217aa3acc27d07a2ea2aa53618459943a8d97e2",
    "title": "Effective Explanations for Entity Resolution Models",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Tommaso Teofili",
        "D. Firmani",
        "Nick Koudas",
        "Vincenzo Martello",
        "P. Merialdo",
        "D. Srivastava"
    ],
    "doi": "10.48550/arXiv.2203.12978",
    "arxivId": "2203.12978",
    "url": "https://www.semanticscholar.org/paper/0217aa3acc27d07a2ea2aa53618459943a8d97e2",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2203.12978",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Entity resolution (ER) aims at matching records that refer to the same real-world entity. Although widely studied for the last 50 years, ER still represents a challenging data management problem, and several recent works have started to investigate the opportunity of applying deep learning (DL) techniques to solve this problem. In this paper, we study the fundamental problem of explainability of the DL solution for ER. Understanding the matching predictions of an ER solution is indeed crucial to assess the trustworthiness of the DL model and to discover its biases. We treat the DL model as a black box classifier and - while previous approaches to provide explanations for DL predictions are agnostic to the classification task - we propose the CERTA approach that is aware of the semantics of the ER problem. Our approach produces both saliency explanations, which associate each attribute with a saliency score, and counterfactual explanations, which provide examples of values that can flip the prediction. CERTA builds on a probabilistic framework that aims at computing the explanations evaluating the outcomes produced by using perturbed copies of the input records. We experimentally evaluate CERTA'S explanations of state-of-the-art ER solutions based on DL models using publicly available datasets, and demonstrate the effectiveness of CERTA over recently proposed methods for this problem.",
    "citationCount": 17,
    "referenceCount": 37
}