{
    "paperId": "02373f2a421650144000b28e65a42e7f5816067d",
    "title": "An Overview of Neuromorphic Computing for Artificial Intelligence Enabled Hardware-Based Hopfield Neural Network",
    "year": 2020,
    "venue": "IEEE Access",
    "authors": [
        "Zheqi Yu",
        "Amir M. Abdulghani",
        "A. Zahid",
        "H. Heidari",
        "M. Imran",
        "Q. Abbasi"
    ],
    "doi": "10.1109/ACCESS.2020.2985839",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02373f2a421650144000b28e65a42e7f5816067d",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/8948470/09057570.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Compared with von Neumann’s computer architecture, neuromorphic systems offer more unique and novel solutions to the artificial intelligence discipline. Inspired by biology, this novel system has implemented the theory of human brain modeling by connecting feigned neurons and synapses to reveal the new neuroscience concepts. Many researchers have vastly invested in neuro-inspired models, algorithms, learning approaches, operation systems for the exploration of the neuromorphic system and have implemented many corresponding applications. Recently, some researchers have demonstrated the capabilities of Hopfield algorithms in some large-scale notable hardware projects and seen significant progression. This paper presents a comprehensive review and focuses extensively on the Hopfield algorithm’s model and its potential advancement in new research applications. Towards the end, we conclude with a broad discussion and a viable plan for the latest application prospects to facilitate developers with a better understanding of the aforementioned model in accordance to build their own artificial intelligence projects.",
    "citationCount": 56,
    "referenceCount": 161
}