{
    "paperId": "027589fd5c9f781510594bf7ed2af8e6088736e9",
    "title": "Transforming Precision Agriculture with Quantum Computing: A Novel Algorithm for Boosting Crop Yields and Optimizing Resources",
    "year": 2025,
    "venue": "EPJ Web of Conferences",
    "authors": [
        "Anshit Mukherjee",
        "Biswadip Basu Mallik"
    ],
    "doi": "10.1051/epjconf/202532501004",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/027589fd5c9f781510594bf7ed2af8e6088736e9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1051/epjconf/202532501004",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "New zenith of agriculture technology, precision agriculture has emerged as a crucial tool to feed India and manage the scarce irrigation facility where nearly 600 million people are facing hardship of severe water crisis. This paper proposes a new algorithm of variational quantum computing (VQC), which has showed potential in optimizing crop yield and resource utilisation based on the data sets such as soil quality, climate and genetic makeup of crops. The algorithm makes use of qubits to allow the real time data processing through IoT sensors to allow for real time monitoring and decision making. Two trials performed on various agricultural data sets this approach presented about 30% increase in the predictive accuracy of crop yields and 25% decrease in water and fertilizer usage. Furthermore, enhanced detection capacities enhanced illness control capacities by 40% thereby leading to decreased crop losses. In addition to bridging significant gaps in the currently available literature, this paper incorporates quantum computing into precision agriculture to offer farmers and other stakeholders’ usable formulations that may shape the future of farming with the help of advancing quantum technologies.",
    "citationCount": 1,
    "referenceCount": 38
}