{
    "paperId": "027553595bb25fb86b522c5009c1bcf19b8945fc",
    "title": "3DB-ROC Data Structure Organization for Three-Dimensional Building Models",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Jiangtao Lei",
        "Bin Fan",
        "Qing Liu",
        "Shuhong Mei",
        "Yongsheng Huang",
        "Xiaoli Yang"
    ],
    "doi": "10.1109/ACCESS.2025.3594352",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/027553595bb25fb86b522c5009c1bcf19b8945fc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development of technologies such as smart city, digital twin, and metaverse, the data volume of three-dimensional building models is experiencing explosive growth. To address the issue of efficient organization and management, existing approaches primarily rely on single-structure spatial indices (e.g., R-tree, Octree) or hybrid indices. However, single-structure methods often suffer from limitations like node overlap (R-tree) or unbalanced structures (Octree) with uneven data distribution. While hybrid indices are effective for point clouds, their application to 3D building models remains limited, and existing implementations may introduce inefficiencies during construction or for fine-grained data organization within complex buildings. Hereby, this paper proposes a 3DB-ROC data structure organization method for three-dimensional building models. This method combines the advantages of R-tree and octree. Firstly, using a single building as the basic unit, the R-tree organizes the 3D building model data in a coarse-grained manner. Then, in a fine-grained manner, the octree is employed to organize the individual building model data within a single building. This hierarchical strategy minimizes tree depth, balances structure, and boosts data handling and query performance. Experimental evaluation on metaverse platform data demonstrates that: Firstly, 3DB-ROC outperforms R-tree, octree, KD-tree, BVH, and 3DOR in construction speed and insertion efficiency; Secondly, it achieves faster region retrieval than octree, particularly for small-area queries; Moreover, the method maintains balanced spatial utilization and acceptable global retrieval latency. These results confirm that 3DB-ROC effectively addresses the requirements of efficient organization and management of 3D building models, especially in applications requiring frequent data construction and insertion.",
    "citationCount": 0,
    "referenceCount": 54
}