{
    "paperId": "0287fb4794dacaac394ebd842b1f0155ed2c7cef",
    "title": "Privacy-Preserving Bloom Filter-Based Keyword Search Over Large Encrypted Cloud Data",
    "year": 2023,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Yanrong Liang",
        "Jianfeng Ma",
        "Yinbin Miao",
        "Da Kuang",
        "Xiangdong Meng",
        "R. Deng"
    ],
    "doi": "10.1109/TC.2023.3285103",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0287fb4794dacaac394ebd842b1f0155ed2c7cef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To achieve the search over encrypted data in cloud server, Searchable Encryption (SE) has attracted extensive attention from both academic and industrial fields. The existing Bloom filter-based SE schemes can achieve similarity search, but will generally incur high false positive rates, and even leak the privacy of values in Bloom filters (BF). To solve the above problems, we first propose a basic Privacy-preserving Bloom filter-based Keyword Search scheme using the Circular Shift and Coalesce-Bloom Filter (CSC-BF) and Symmetric-key Hidden Vector Encryption (SHVE) technology (namely PBKS), which can achieve effective search while protecting the values in BFs. Then, we design a new index structure T-CSCBF utilizing the Twin Bloom Filter (TBF) technology. Based on this, we propose an improved scheme PBKS+, which assigns a unique inclusion identifier to each position in each BF with privacy protection. Formal security analysis proves that our schemes are secure against Indistinguishability under Selective Chosen-Plaintext Attack (IND-SCPA), and extensive experiments using real-world datasets demonstrate that our schemes are feasible in practice.",
    "citationCount": 11,
    "referenceCount": 34
}