{
    "paperId": "028d21636dd26b98d8104612305ec31e7d7a6683",
    "title": "Pollution Attacks on Counting Bloom Filters for Black Box Adversaries",
    "year": 2020,
    "venue": "Conference on Network and Service Management",
    "authors": [
        "P. Reviriego",
        "Ori Rottenstreich"
    ],
    "doi": "10.23919/CNSM50824.2020.9269076",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/028d21636dd26b98d8104612305ec31e7d7a6683",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The wide adoption of Bloom filters makes their security an important issue to be addressed. For example, an attacker can increase their error rate through polluting and eventually saturating the filter by inserting elements that set to one a large number of positions in the filter. This is known as a pollution attack and requires that the attacker knows the hash functions used to construct the filter. Such information is not available in many practical settings and in addition a simple protection can be achieved through using a random salt in the hash functions. The same pollution attacks can also be done to counting Bloom filters that in addition to insertions and lookups support removals. This paper considers pollution attacks on counting Bloom filters. We describe two novel pollution attacks that do not require any knowledge of the counting Bloom filter implementation details and evaluate them. These methods show that a counting Bloom filter is vulnerable to pollution attacks even when the attacker has only access to the filter as a black box to perform insertions, removals, and lookups.",
    "citationCount": 9,
    "referenceCount": 24
}