{
    "paperId": "02a126650cce68bf39fae22bf7064b161425527a",
    "title": "TCAmMCogniGron: Energy Efficient Memristor-Based TCAM for Match-Action Processing",
    "year": 2022,
    "venue": "International Conference on Rebooting Computing",
    "authors": [
        "Saad Saleh",
        "A. Goossens",
        "T. Banerjee",
        "B. Koldehofe"
    ],
    "doi": "10.1109/ICRC57508.2022.00013",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02a126650cce68bf39fae22bf7064b161425527a",
    "isOpenAccess": true,
    "openAccessPdf": "https://pure.rug.nl/ws/files/645544958/TCAmMCogniGron_Energy_Efficient_Memristor_Based_TCAM_for_Match_Action_Processing.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet relies heavily on programmable match-action processors for matching network packets against locally available network rules and taking actions, such as forwarding and modification of network packets. This match-action process must be performed at high speed, i.e., commonly within one clock cycle, using a specialized memory unit called Ternary Content Addressable Memory (TCAM). Building on transistor-based CMOS designs, state-of-the-art TCAM architectures have high energy consumption and lack resilient designs for incorporating novel technologies for performing appropriate actions. In this article, we motivate the use of a novel fundamental component, the ‘Memristor’, for the development of TCAM architecture for match-action processing. Memristors can provide energy efficiency, non-volatility and better resource density as compared to transistors. We have proposed a novel memristor-based TCAM architecture called TCAmMCogniGron, built upon the voltage divider principle and requiring only two memristors and five transistors for storage and search operations compared to sixteen transistors in the traditional TCAM architecture. We analyzed its performance over an experimental data set of Nb-doped SrTiO3-based memristor. The analysis of TCAmMCogniGronshowed promising power consumption statistics of 16 µW and 1 µW for match and mismatch operations along with twice the improvement in resources density as compared to the traditional architectures.",
    "citationCount": 5,
    "referenceCount": 51
}