{
    "paperId": "02b96ead688253be50efbcd757b37874da58a970",
    "title": "An Integrated Stablecoin and Subsidised Node Design for Payment Channel Networks",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Anupa de Silva",
        "S. Thakur",
        "John G. Breslin"
    ],
    "doi": "10.1109/ACCESS.2024.3477258",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02b96ead688253be50efbcd757b37874da58a970",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3477258",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The financial landscape has undergone a profound shift due to the decentralisation and digitisation brought about by cryptocurrencies. As people begin to reevaluate traditional notions of monetary ownership, cryptocurrencies will be poised to play an even more critical role in the future. However, the widespread adoption of cryptocurrencies has been hampered by several challenges, including volatility and scalability. The concepts of Stablecoin and Payment Channel Network (PCN) are promising proposals for these problems, providing effective individual solutions. While PCN addresses the scalability issue of cryptocurrencies, its transaction reliability is not always up to par for widespread use. Similarly, the increasing centralisation of Stablecoins contradicts the fundamental principle of introducing cryptocurrencies. This paper introduces a decentralised model that integrates both approaches to establish a monetary system while mitigating their inherent drawbacks. It encompasses a subsidised node and stablecoin designs for PCN with a dedicated and incentivised layer of entities to facilitate reliable PCN transactions and contribute to stabilising the underlying currency of PCN. It introduces an integrated network-backed stablecoin for PCN, achieving both stability and scalability concurrently. Also, approximately half of the initial funding required to establish payment channels is derived from external sources, ensuring a guaranteed return on investment within an under-collateralised and decentralised environment. Our system has been substantiated through game theory and simulations, demonstrating its capacity to stabilise the coin’s value and effectively fulfil the expected functionalities of a currency. Empirical tests have confirmed its retention of PCN’s scalability, even with additional steps integrated to implement the proposed protocol. We also highlight its resilience to potential attacks. Our solution will improve transaction reliability, collateralisation, and underlying coin stability, making cryptocurrencies more suitable for widespread adoption.",
    "citationCount": 0,
    "referenceCount": 29
}