{
    "paperId": "02bd4721eaa61e82d9d47a9fa8803a145cc75277",
    "title": "A Recent Review on Subjective and Objective Assessment of Trust in Human Autonomy Teaming",
    "year": 2025,
    "venue": "IEEE Transactions on Human-Machine Systems",
    "authors": [
        "J. J. Jui",
        "Imali T. Hettiarachchi",
        "Asim Bhatti",
        "M. Farghaly",
        "Douglas Creighton"
    ],
    "doi": "10.1109/THMS.2025.3589981",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02bd4721eaa61e82d9d47a9fa8803a145cc75277",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing sophistication of autonomous systems and robotics has spurred research into the unique dynamics of human-autonomy teaming (HAT). These advanced technologies aim to enhance decision-making, situational awareness, mutual understanding, and interpersonal relationships, thereby minimizing risks in collaborative endeavors. However, achieving effective HAT requires careful attention to team trust, particularly in scenarios that move beyond simple human–machine dyads to involve complex, multiagent systems and distributed teams. This review undertakes a comprehensive exploration and evaluation of trust measurement techniques within the domain of HAT, focusing on methods that are sensitive to the nuances of these complex team dynamics. Emphasising the significance of trust measurement in optimising team performance, the review categorizes existing empirical works into subjective (e.g., self-report, questionnaires, surveys) and objective (e.g., behavioral, physiological) indices. Drawing insights from recent literature (2019–2024), the article explores the complexities of trust measurement, addressing methodologies employed by researchers and synthesizing their findings. The study suggests directions for further investigation into improving trust assessment techniques and developing practical models to better suit the evolving context of human-autonomy collaboration. The review highlights gaps in current methods and suggests avenues for future research, particularly in refining trust calibration models for dynamic, evolving contexts in human-autonomy collaboration and for understanding how trust is distributed and managed across complex team structures.",
    "citationCount": 0,
    "referenceCount": 159
}