{
    "paperId": "02be46dbc54c4325fab72048c0a92dd3eeefbd03",
    "title": "Development of an artificial intelligence-enabled non-invasive digital stethoscope for monitoring the heart condition of athletes in real-time",
    "year": 2024,
    "venue": "Retos",
    "authors": [
        "Batyrkhan Omarov",
        "Bakhytzhan Omarov",
        "Alpamys Rakhymzhanov",
        "Askarbay Niyazov",
        "Daniyar Sultan",
        "Meirzhan Baikuvekov"
    ],
    "doi": "10.47197/retos.v60.108633",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02be46dbc54c4325fab72048c0a92dd3eeefbd03",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.47197/retos.v60.108633",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study investigates the efficacy of AI-enabled digital stethoscopes in enhancing physical performance, increasing student engagement and motivation, and improving psychological well-being among physical culture students. The experimental design involved two groups of 40 students each: the experimental group used AI-enabled stethoscopes for real-time cardiovascular monitoring, while the control group relied on traditional heart rate monitoring methods. The results indicated significant improvements in physical performance, engagement, and psychological well-being for the experimental group. Real-time monitoring facilitated personalized training adjustments, optimizing training loads and preventing overexertion, leading to superior performance outcomes. Additionally, the use of innovative monitoring tools significantly increased student motivation and engagement in physical culture classes, as reflected in higher attendance rates and more enthusiastic participation. Psychological assessments revealed that continuous health monitoring reduced anxiety levels and enhanced overall mental well-being, providing students with a sense of security and proactive health management. These findings underscore the transformative potential of integrating advanced monitoring technologies into physical education and rehabilitation programs, offering precise, real-time data that supports individualized and responsive interventions. The study concludes with a call for further research to explore the long-term impacts and broader applications of AI-enabled health monitoring tools in diverse educational and clinical settings, aiming to maximize their benefits and improve overall student and patient outcomes.\nKeywords: Sports therapy, Physical culture education, Health monitoring technology, Personalized training, Student engagement, Real-time cardiovascular monitoring, AI-enabled stethoscope.",
    "citationCount": 11,
    "referenceCount": 29
}