{
    "paperId": "02d23efff48cf9caaf8e411c39550ac3928e0283",
    "title": "Learn to Rapidly and Robustly Optimize Hybrid Precoding",
    "year": 2023,
    "venue": "IEEE Transactions on Communications",
    "authors": [
        "Ortal Lavi",
        "Nir Shlezinger"
    ],
    "doi": "10.1109/TCOMM.2023.3292472",
    "arxivId": "2301.00369",
    "url": "https://www.semanticscholar.org/paper/02d23efff48cf9caaf8e411c39550ac3928e0283",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2301.00369",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hybrid precoding plays a key role in realizing massive multiple-input multiple-output (MIMO) transmitters with controllable cost. MIMO precoders are required to frequently adapt based on the variations in the channel conditions. In hybrid MIMO, where precoding is comprised of digital and analog beamforming, such an adaptation involves lengthy optimization and depends on accurate channel state information (CSI). This affects the spectral efficiency when the channel varies rapidly and when operating with noisy CSI. In this work we employ deep learning techniques to learn how to rapidly and robustly optimize hybrid precoders, while being fully interpretable. We leverage data to learn iteration-dependent hyperparameter settings of projected gradient sum-rate optimization with a predefined number of iterations. The algorithm maps channel realizations into hybrid precoding settings while preserving the interpretable flow of the optimizer and improving its inference speed. To cope with noisy CSI, we learn to optimize the minimal achievable sum-rate among all tolerable errors, proposing a hybrid precoder based on the projected conceptual mirror prox minimax optimizer. Numerical results demonstrate that our approach allows using over ten times less iterations compared to that required by conventional optimization with shared hyperparameters, while achieving similar and even improved performance.",
    "citationCount": 31,
    "referenceCount": 55
}