{
    "paperId": "02d497c3bddaa3ee22b61b17250d89926a79a28e",
    "title": "Development of sex-specific molecular markers for early sex identification in Hippophae gyantsensis based on whole-genome resequencing",
    "year": 2024,
    "venue": "BMC Plant Biology",
    "authors": [
        "Zhefei Zeng",
        "Junwei Wang",
        "Zhongqiong Tian",
        "Ngawang Norbu",
        "Yonghao Chen",
        "Jinfang Chen",
        "Wenju Zhang",
        "L. Qiong"
    ],
    "doi": "10.1186/s12870-024-05978-6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02d497c3bddaa3ee22b61b17250d89926a79a28e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s12870-024-05978-6",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hippophae gyantsensis is a dioecious plant endemic to the Qinghai-Tibet Plateau and is significant for ecological restoration and sand stabilization. Its fruit is rich in bioactive compounds that offer economic potential. However, the inability to distinguish sexes before flowering and prolonged maturation hinder breeding and cultivation. We performed whole-genome resequencing on male and female plants, identified large insertion/deletion (InDel) variants, and developed two sex-specific primers (Higy_04 and Higy_06). These primers enable rapid, accurate PCR-based sex identification. All sex-specific sites were located on chromosome 2, suggesting its potential role as the sex chromosome. Additionally, we found a 1:1 sex ratio among offspring from the same mother plant, consistent with Mendelian inheritance, indicating that sex segregation is mainly genetically controlled. This work lays the foundation for developing molecular markers applicable across the entire genus Hippophae and contributes to understanding sex chromosome formation and adaptive evolution within the genus. Supplementary Information The online version contains supplementary material available at 10.1186/s12870-024-05978-6.",
    "citationCount": 5,
    "referenceCount": 39
}