{
    "paperId": "02dd3fd2642b9e681c3d9143325b14347e403652",
    "title": "Zero Botnets: An Observe-Pursue-Counter Approach",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "J. Kepner",
        "Jonathan Bernays",
        "Stephen Buckley",
        "Kenjiro Cho",
        "Cary Conrad",
        "L. Daigle",
        "Keeley Erhardt",
        "V. Gadepally",
        "Barry Greene",
        "Michael Jones",
        "Rob Knake",
        "B. Maggs",
        "P. Michaleas",
        "C. Meiners",
        "Andrew Morris",
        "A. Pentland",
        "Sandeep Pisharody",
        "Sarah Powazek",
        "Andrew Prout",
        "Philip J. Reiner",
        "Koichi Suzuki",
        "Kenji Takahashi",
        "Tony Tauber",
        "L. Walker",
        "Douglas Stetson"
    ],
    "doi": null,
    "arxivId": "2201.06068",
    "url": "https://www.semanticscholar.org/paper/02dd3fd2642b9e681c3d9143325b14347e403652",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Adversarial Internet robots (botnets) represent a growing threat to the safe use and stability of the Internet. Botnets can play a role in launching adversary reconnaissance (scanning and phishing), influence operations (upvoting), and financing operations (ransomware, market manipulation, denial of service, spamming, and ad click fraud) while obfuscating tailored tactical operations. Reducing the presence of botnets on the Internet, with the aspirational target of zero, is a powerful vision for galvanizing policy action. Setting a global goal, encouraging international cooperation, creating incentives for improving networks, and supporting entities for botnet takedowns are among several policies that could advance this goal. These policies raise significant questions regarding proper authorities/access that cannot be answered in the abstract. Systems analysis has been widely used in other domains to achieve sufficient detail to enable these questions to be dealt with in concrete terms. Defeating botnets using an observe-pursue-counter architecture is analyzed, the technical feasibility is affirmed, and the authorities/access questions are significantly narrowed. Recommended next steps include: supporting the international botnet takedown community, expanding network observatories, enhancing the underlying network science at scale, conducting detailed systems analysis, and developing appropriate policy frameworks.",
    "citationCount": 22,
    "referenceCount": 45
}