{
    "paperId": "02dfb8971035a31d62cee975d4b5c8a1dd927754",
    "title": "Explainable Database Management System Configuration Tuning through Counterfactuals",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Xinyue Shao",
        "Hongzhi Wang",
        "Xiao-Wen Zhu",
        "Tianyu Mu",
        "Yan Zhang"
    ],
    "doi": "10.1109/ICDE60146.2024.00017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02dfb8971035a31d62cee975d4b5c8a1dd927754",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data management system configuration optimization has been the focus of database-related research. It can improve the adaptability of DBMS to various business scenarios by selecting the right parameter combination. However, this has been a daunting task because of the vast number of configuration “knobs” involved, and the information about the effects of each knob usually comes from valuable experience, which is very labor-intensive. While machine learning techniques show promise in certain database tasks, they encounter challenges when applied to configuration optimization. Traditional machine learning models excel in prediction tasks through data fitting, but they lack direct applicability in configuration tuning. Moreover, the lack of explainability in machine learning poses a significant obstacle in quantifying the impact of individual knobs on the database performance. Affected by the above factors, this paper proposes CFTune, a method that can accurately evaluate the performance of a DBMS under each configuration using experience and achieve automatic DBMS configuration tuning with counterfactual techniques. Based on various optimization requirements, the approach can offer configuration tuning advice with minimal modification knobs for DBMS that perform badly under specified workloads. Furthermore, to address model shifts resulting from training data, we offer additional strategies to enhance the robustness of the tuning advice. The experimental results demonstrate that the CFTune effectively optimizes the configuration and enhances the performance.",
    "citationCount": 0,
    "referenceCount": 54
}