{
    "paperId": "02e2aa5a1cdfa4a2f2097dc1d0996cbf0bc2c22d",
    "title": "Tantangan Generasi Muda untuk Terjun Kedalam Bidang Software Engineering pada Society 5.0",
    "year": 2022,
    "venue": "Jurnal Inovasi Teknologi dan Edukasi Teknik",
    "authors": [
        "Eka Robyanto",
        "A. Wibawa",
        "Khurin Nabila"
    ],
    "doi": "10.17977/um068v2i12022p27-30",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/02e2aa5a1cdfa4a2f2097dc1d0996cbf0bc2c22d",
    "isOpenAccess": true,
    "openAccessPdf": "http://journal3.um.ac.id/index.php/ft/article/download/3339/2128",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "Society 5.0 brings significant changes not only on the technical side which provides new challenges for merging the virtual world with the physical world, but also brings changes to the structure and business processes of a company. Because of this, companies are also competing to get experts in the field of Software Engineering or software engineers so they can follow and adapt to the changes brought about by society 5.0. Developments in the world of Information technology (IT) have made the world move towards the era of the Industrial revolution 4.0, this has made IT one of the key elements in everyday life in that era. This makes a career as a software engineer look promising for the younger generation who are confused about determining their career path. In choosing a career to become a software engineer, there are challenges that must be faced by the younger generation in society 5.0. This article will conduct research on the challenges that must be faced and try to find solutions to solve these challenges. \nSociety 5.0 membawa perubahan signifikan yang bukan hanya pada sisi teknis yang memberikan tantangan baru untuk melakukan penggabungan dunia maya dengan dunia fisik, akan tetapi juga membawa perubahan terhadap struktur dan juga proses bisnis dari sebuah perusahaan. Dikarenakan hal tersebut, perusahaan juga berlomba-lomba untuk mendapatkan tenaga ahli dalam bidang Software Engineering atau para software engineer agar dapat mengikuti dan beradaptasi dengan perubahan-perubahan yang dibawa oleh society 5.0. Perkembangan dalam dunia teknologi Informasi (IT) telah membuat dunia beranjak menuju era revolusi Industri 4.0, hal ini membuat IT menjadi salah satu elemen kunci dalam kehidupan sehari-hari pada era tersebut. Hal ini membuat karir menjadi seorang software engineer terlihat menjanjikan untuk generasi muda yang sedang kebingungan dalam menentukan perjalanan karirnya. Dalam memilih karir menjadi seorang software engineer terdapat tantangan-tantangan yang harus dihadapi oleh para generasi muda di society 5.0, dalam artikel ini akan dilakukan penelitian mengenai tantangan-tantangan yang harus dihadapi serta mencoba untuk mencari solusi untuk menyelesaikan tantangan tersebut.",
    "citationCount": 0,
    "referenceCount": 11
}