{
    "paperId": "03033f6f3a4aee6583eba3a06b812a5cf27cb777",
    "title": "Experience Report from a Distributed Database Internals Course",
    "year": 2025,
    "venue": "ACM Southeast Regional Conference",
    "authors": [
        "Ronald J. Nowling"
    ],
    "doi": "10.1145/3696673.3723079",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/03033f6f3a4aee6583eba3a06b812a5cf27cb777",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Students aiming for careers in machine learning and data engineering benefit from an understanding of the algorithmic and system performance and correctness characteristics of data-intensive systems. To serve this need, we designed and taught a course on the internal design and implementation of distributed storage systems, particularly databases, for students in a Master's of Machine Learning program offered by our medium-size, Master's-level polytechnic institution. The course was taught to a bimodal population of full-time, accelerated 4+1 B.S. / M.S. students and part-time M.S. students who were also full-time working professionals with multiple years of industry experience. Nearly all of the students completed the course successfully and reported positive experiences in surveys. Interestingly, the perceived benefits reported by the students differed across the groups. The full-time students reported the value of the systems programming content (effective use of caching, external-memory data structures, network programming, etc.), while the full-time professionals reported the insights into the performance and consistency characteristics of commercial databases and their use cases. Based on the positive outcomes, we plan to continue offering the course as part of a regular rotation of electives. Our materials are made available under the Creative Commons Attribution-ShareAlike 4.0 license.",
    "citationCount": 0,
    "referenceCount": 33
}