{
    "paperId": "0328c14c6e0ace12ddccb48d92bb86c50a386428",
    "title": "Evaluation metrics for measuring bias in search engine results",
    "year": 2021,
    "venue": "Information Retrieval Journal",
    "authors": [
        "Gizem Gezici",
        "Aldo Lipani",
        "Y. Saygin",
        "Emine Yilmaz"
    ],
    "doi": "10.1007/s10791-020-09386-w",
    "arxivId": "2210.10517",
    "url": "https://www.semanticscholar.org/paper/0328c14c6e0ace12ddccb48d92bb86c50a386428",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Search engines decide what we see for a given search query. Since many people are exposed to information through search engines, it is fair to expect that search engines are neutral. However, search engine results do not necessarily cover all the viewpoints of a search query topic, and they can be biased towards a specific view since search engine results are returned based on relevance, which is calculated using many features and sophisticated algorithms where search neutrality is not necessarily the focal point. Therefore, it is important to evaluate the search engine results with respect to bias. In this work we propose novel web search bias evaluation measures which take into account the rank and relevance. We also propose a framework to evaluate web search bias using the proposed measures and test our framework on two popular search engines based on 57 controversial query topics such as abortion, medical marijuana, and gay marriage. We measure the stance bias (in support or against), as well as the ideological bias (conservative or liberal). We observe that the stance does not necessarily correlate with the ideological leaning, e.g. a positive stance on abortion indicates a liberal leaning but a positive stance on Cuba embargo indicates a conservative leaning. Our experiments show that neither of the search engines suffers from stance bias. However, both search engines suffer from ideological bias, both favouring one ideological leaning to the other, which is more significant from the perspective of polarisation in our society.",
    "citationCount": 48,
    "referenceCount": 80
}