{
    "paperId": "03323fe27447fee94c0a91c156e2155b54a5a52e",
    "title": "Cost Models for Big Data Query Processing: Learning, Retrofitting, and Our Findings",
    "year": 2020,
    "venue": "SIGMOD Conference",
    "authors": [
        "Tarique Siddiqui",
        "Alekh Jindal",
        "S. Qiao",
        "Hiren Patel",
        "Wangchao Le"
    ],
    "doi": "10.1145/3318464.3380584",
    "arxivId": "2002.12393",
    "url": "https://www.semanticscholar.org/paper/03323fe27447fee94c0a91c156e2155b54a5a52e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2002.12393",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Query processing over big data is ubiquitous in modern clouds, where the system takes care of picking both the physical query execution plans and the resources needed to run those plans, using a cost-based query optimizer. A good cost model, therefore, is akin to better resource efficiency and lower operational costs. Unfortunately, the production workloads at Microsoft show that costs are very complex to model for big data systems. In this work, we investigate two key questions: (i) can we learn accurate cost models for big data systems, and (ii) can we integrate the learned models within the query optimizer. To answer these, we make three core contributions. First, we exploit workload patterns to learn a large number of individual cost models and combine them to achieve high accuracy and coverage over a long period. Second, we propose extensions to Cascades framework to pick optimal resources, i.e, number of containers, during query planning. And third, we integrate the learned cost models within the Cascade-style query optimizer of SCOPE at Microsoft. We evaluate the resulting system, Cleo, in a production environment using both production and TPC-H workloads. Our results show that the learned cost models are 2 to 3 orders of magnitude more accurate, and 20X more correlated with the actual runtimes, with a large majority (70%) of the plan changes leading to substantial improvements in latency as well as resource usage.",
    "citationCount": 90,
    "referenceCount": 49
}