{
    "paperId": "033e0d26137cb4c6f858fe6d83bdcb7c9aca2c98",
    "title": "Material Compound-Property Retrieval Using Electron Microscope Images for Rubber Material Development",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Rintaro Yanagi",
        "Ren Togo",
        "Keisuke Maeda",
        "Takahiro Ogawa",
        "M. Haseyama"
    ],
    "doi": "10.1109/ACCESS.2023.3304341",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/033e0d26137cb4c6f858fe6d83bdcb7c9aca2c98",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10214542.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper tackles the electron microscope image processing for rubber material discovery. In rubber material science fields, electron microscope images are used to observe the properties of materials during their development process. Hence, by analyzing the electron microscope images with the recent image processing technology, it is expected that further effective material developments can be realized. In this paper, we propose a rubber material compound and physical property image retrieval method using the rubber material electron microscope images. The aim of our method is to support material technologists to grasp the relationships between material compounds and physical properties visually and comprehensively. Our method constructs an electron microscope image space through a conditional image generation model. The generated images are used to retrieve materials with similar compounds and physical properties. By effectively using the constructed electron microscope image space, it is expected that the technologists visually and comprehensively understand the relationships of similar materials, and the advances in material developments are accelerated.",
    "citationCount": 0,
    "referenceCount": 36
}