{
    "paperId": "035ee61b7a9dddaa16f9aa12e66bec4b78ebf324",
    "title": "Artificial Intelligence in Maritime Transportation: A Comprehensive Review of Safety and Risk Management Applications",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Irmina Durlik",
        "Tymoteusz Miller",
        "Ewelina Kostecka",
        "Tomasz Tuński"
    ],
    "doi": "10.3390/app14188420",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/035ee61b7a9dddaa16f9aa12e66bec4b78ebf324",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maritime transportation is crucial for global trade but faces significant risks and operational challenges. Ensuring safety is essential for protecting lives, the environment, and economic stability. This review explores the role of artificial intelligence (AI) in enhancing maritime safety and risk management. Key AI applications include risk analysis, crew resource management, hazardous material handling, predictive maintenance, and navigation systems. AI systems identify potential hazards, provide real-time decision support, monitor hazardous materials, predict equipment failures, and optimize shipping routes. Case studies, such as Wärtsilä’s Fleet Operations Solution and ABB Ability™ Marine Pilot Vision, illustrate the benefits of AI in improving safety and efficiency. Despite these advancements, integrating AI poses challenges related to infrastructure compatibility, data quality, and regulatory issues. Addressing these is essential for successful AI implementation. This review highlights AI’s potential to transform maritime safety, emphasizing the need for innovation, standardized practices, and robust regulatory frameworks to achieve safer and more efficient maritime operations.",
    "citationCount": 25,
    "referenceCount": 98
}