{
    "paperId": "035f2dd4f219f67b6321c48931b00f2e3edf54ff",
    "title": "Recurrent Neural Networks: A Comprehensive Review of Architectures, Variants, and Applications",
    "year": 2024,
    "venue": "Inf.",
    "authors": [
        "Ibomoiye Domor Mienye",
        "Theo G. Swart",
        "G. Obaido"
    ],
    "doi": "10.3390/info15090517",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/035f2dd4f219f67b6321c48931b00f2e3edf54ff",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2078-2489/15/9/517/pdf?version=1724574257",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recurrent neural networks (RNNs) have significantly advanced the field of machine learning (ML) by enabling the effective processing of sequential data. This paper provides a comprehensive review of RNNs and their applications, highlighting advancements in architectures, such as long short-term memory (LSTM) networks, gated recurrent units (GRUs), bidirectional LSTM (BiLSTM), echo state networks (ESNs), peephole LSTM, and stacked LSTM. The study examines the application of RNNs to different domains, including natural language processing (NLP), speech recognition, time series forecasting, autonomous vehicles, and anomaly detection. Additionally, the study discusses recent innovations, such as the integration of attention mechanisms and the development of hybrid models that combine RNNs with convolutional neural networks (CNNs) and transformer architectures. This review aims to provide ML researchers and practitioners with a comprehensive overview of the current state and future directions of RNN research.",
    "citationCount": 227,
    "referenceCount": 120
}