{
    "paperId": "03705fe979459f3fd89a1cdd88e5790207f2f088",
    "title": "Evaluation of neural networks defenses and attacks using NDCG and reciprocal rank metrics",
    "year": 2022,
    "venue": "International Journal of Information Security",
    "authors": [
        "Haya Brama",
        "L. Dery",
        "Tal Grinshpoun"
    ],
    "doi": "10.1007/s10207-022-00652-0",
    "arxivId": "2201.05071",
    "url": "https://www.semanticscholar.org/paper/03705fe979459f3fd89a1cdd88e5790207f2f088",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2201.05071",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The problem of attacks on neural networks through input modification (i.e., adversarial examples) has attracted much attention recently. Being relatively easy to generate and hard to detect, these attacks pose a security breach that many suggested defenses try to mitigate. However, the evaluation of the effect of attacks and defenses commonly relies on traditional classification metrics, without adequate adaptation to adversarial scenarios. Most of these metrics are accuracy-based and therefore may have a limited scope and low distinctive power. Other metrics do not consider the unique characteristics of neural network functionality or measure the effectiveness of the attacks indirectly (e.g., through the complexity of their generation). In this paper, we present two metrics that are specifically designed to measure the effect of attacks, or the recovery effect of defenses, on the output of neural networks in multiclass classification tasks. Inspired by the normalized discounted cumulative gain and the reciprocal rank metrics used in information retrieval literature, we treat the neural network predictions as ranked lists of results. Using additional information about the probability of the rank enabled us to define novel metrics that are suited to the task at hand. We evaluate our metrics using various attacks and defenses on a pre-trained VGG19 model and the ImageNet dataset. Compared to the common classification metrics, our proposed metrics demonstrate superior informativeness and distinctiveness.",
    "citationCount": 9,
    "referenceCount": 70
}