{
    "paperId": "037974d90ec2cfa108f72eac7f540d266c01d0a9",
    "title": "INTACT: Compact Storage of Data Streams in Mobile Devices to Unlock User Privacy at the Edge",
    "year": 2025,
    "venue": "Journal of Internet Services and Applications",
    "authors": [
        "Rémy Raes",
        "Olivier Ruas",
        "Adrien Luxey-Bitri",
        "Romain Rouvoy"
    ],
    "doi": "10.48550/arXiv.2506.21998",
    "arxivId": "2506.21998",
    "url": "https://www.semanticscholar.org/paper/037974d90ec2cfa108f72eac7f540d266c01d0a9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data streams produced by mobile devices, such as smartphones, offer highly valuable sources of information to build ubiquitous services. Such data streams are generally uploaded and centralized to be processed by third parties, potentially exposing sensitive personal information. In this context, existing protection mechanisms, such as Location Privacy Protection Mechanisms (LPPMs), have been investigated. Alas, none of them have actually been implemented, nor deployed in real-life, in mobile devices to enforce user privacy at the edge. Moreover, the diversity of embedded sensors and the resulting data deluge makes it impractical to provision such services directly on mobiles, due to their constrained storage capacity, communication bandwidth and processing power. This article reports on the FLI technique, which leverages a piece-wise linear approximation technique to capture compact representations of data streams in mobile devices. Beyond the FLI storage layer, we introduce Divide & Stay, a new privacy preservation technique to execute Points of Interest (POIs) inference. Finally, we deploy both of them on Android and iOS as the INTACT framework, making a concrete step towards enforcing privacy and trust in ubiquitous computing systems.",
    "citationCount": 0,
    "referenceCount": 45
}