{
    "paperId": "039b8eed1af9aae4c08b0de2b9099b118e22d119",
    "title": "An Abstraction-Refinement Approach to Verifying Convolutional Neural Networks",
    "year": 2022,
    "venue": "Automated Technology for Verification and Analysis",
    "authors": [
        "Matan Ostrovsky",
        "Clark W. Barrett",
        "Guy Katz"
    ],
    "doi": "10.1007/978-3-031-19992-9_25",
    "arxivId": "2201.01978",
    "url": "https://www.semanticscholar.org/paper/039b8eed1af9aae4c08b0de2b9099b118e22d119",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Convolutional neural networks have gained vast popularity due to their excellent performance in the fields of computer vision, image processing, and others. Unfortunately, it is now well known that convolutional networks often produce erroneous results - for example, minor perturbations of the inputs of these networks can result in severe classification errors. Numerous verification approaches have been proposed in recent years to prove the absence of such errors, but these are typically geared for fully connected networks and suffer from exacerbated scalability issues when applied to convolutional networks. To address this gap, we present here the Cnn-Abs framework, which is particularly aimed at the verification of convolutional networks. The core of Cnn-Abs is an abstraction-refinement technique, which simplifies the verification problem through the removal of convolutional connections in a way that soundly creates an over-approximation of the original problem; and which restores these connections if the resulting problem becomes too abstract. Cnn-Abs is designed to use existing verification engines as a backend, and our evaluation demonstrates that it can significantly boost the performance of a state-of-the-art DNN verification engine, reducing runtime by 15.7% on average.",
    "citationCount": 29,
    "referenceCount": 76
}