{
    "paperId": "03aa5b8a9738b2ba04235012b76120d7d3745671",
    "title": "A Bioinformatics Toolkit for Next-Generation Sequencing in Clinical Oncology",
    "year": 2023,
    "venue": "Current Issues in Molecular Biology",
    "authors": [
        "Simon Cabello-Aguilar",
        "J. Vendrell",
        "J. Solassol"
    ],
    "doi": "10.3390/cimb45120608",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/03aa5b8a9738b2ba04235012b76120d7d3745671",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1467-3045/45/12/608/pdf?version=1701707460",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Next-generation sequencing (NGS) has taken on major importance in clinical oncology practice. With the advent of targeted therapies capable of effectively targeting specific genomic alterations in cancer patients, the development of bioinformatics processes has become crucial. Thus, bioinformatics pipelines play an essential role not only in the detection and in identification of molecular alterations obtained from NGS data but also in the analysis and interpretation of variants, making it possible to transform raw sequencing data into meaningful and clinically useful information. In this review, we aim to examine the multiple steps of a bioinformatics pipeline as used in current clinical practice, and we also provide an updated list of the necessary bioinformatics tools. This resource is intended to assist researchers and clinicians in their genetic data analyses, improving the precision and efficiency of these processes in clinical research and patient care.",
    "citationCount": 7,
    "referenceCount": 101
}