{
    "paperId": "03b592f7311bc93a1b473485ee3feb514d10a2b0",
    "title": "KV-CSD: A Hardware-Accelerated Key-Value Store for Data-Intensive Applications",
    "year": 2023,
    "venue": "IEEE International Conference on Cluster Computing",
    "authors": [
        "Inhyuk Park",
        "Qing Zheng",
        "Dominic Manno",
        "Soonyeal Yang",
        "Jason Lee",
        "David Bonnie",
        "Bradley W. Settlemyer",
        "Youngjae Kim",
        "Woosuk Chung",
        "Gary A. Grider"
    ],
    "doi": "10.1109/CLUSTER52292.2023.00019",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/03b592f7311bc93a1b473485ee3feb514d10a2b0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Popular software key-value stores such as LevelDB and RocksDB are often tailored for efficient writing. Yet, they tend to also perform well on read operations. This is because while data is initially stored in a format that favors writes, it is later transformed by the DB in the background into a format that better accommodates reads. Write-optimized key-value stores can still block writes. This happens when those background workers cannot keep up with the foreground insertion workload.This paper advocates for a hardware-accelerated key-value store, enabling performance-critical operations, like background data reorganization and queries, to execute directly on storage instead of a host as existing key-value stores do. This better hides background work latency, prevents it from blocking foreground writes, and improves overall I/O efficiency. Our prototype, called KV-CSD, is a key-value based computational storage device consisting of an NVMe SSD and a System-on-a-Chip (SoC) that implements an ordered key-value store atop the SSD. Through offloaded processing, KV-CSD streamlines data insertion, reduces host-device data movement for both background data reorganization and query processing, and shows up to 10.6× lower write times and up to 7.4× faster queries compared to the current state-of-the-art software key-value stores on a real scientific dataset.",
    "citationCount": 7,
    "referenceCount": 77
}