{
    "paperId": "03c5e8ad1013da1588368586a9d4b13a18864367",
    "title": "A BERT-Based Multimodal Framework for Enhanced Fake News Detection Using Text and Image Data Fusion",
    "year": 2025,
    "venue": "De Computis",
    "authors": [
        "Mohammed Al-alshaqi",
        "Danda B. Rawat",
        "Chunmei Liu"
    ],
    "doi": "10.3390/computers14060237",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/03c5e8ad1013da1588368586a9d4b13a18864367",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The spread of fake news on social media is complicated by the fact that fake information spreads extremely fast in both textual and visual formats. Traditional approaches to the detection of fake news focus mainly on text and image features, thereby missing valuable information contained within images and texts. In response to this, we propose a multimodal fake news detection method based on BERT, with an extension to text combined with the extracted text from images through Optical Character Recognition (OCR). Here, we consider extending feature analysis with BERT_base_uncased to process inputs for retrieving relevant text from images and determining a confidence score that suggests the probability of the news being authentic. We report extensive experimental results on the ISOT, WELFAKE, TRUTHSEEKER, and ISOT_WELFAKE_TRUTHSEEKER datasets. Our proposed model demonstrates better generalization on the TRUTHSEEKER dataset with an accuracy of 99.97%, achieving substantial improvements over existing methods with an F1-score of 0.98. Experimental results indicate a potential accuracy increment of +3.35% compared to the latest baselines. These results highlight the potential of our approach to serve as a strong resource for automatic fake news detection by effectively integrating both text and visual data streams. Findings suggest that using diverse datasets enhances the resilience of detection systems against misinformation strategies.",
    "citationCount": 1,
    "referenceCount": 48
}