{
    "paperId": "03caf2c8fb9dfe51ab9f471700157d77e65bd2c2",
    "title": "NeuroFlow: Development of lightweight and efficient model integration scheduling strategy for autonomous driving system",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Eunbin Seo",
        "Gwanjun Shin",
        "Eunho Lee"
    ],
    "doi": "10.48550/arXiv.2312.09588",
    "arxivId": "2312.09588",
    "url": "https://www.semanticscholar.org/paper/03caf2c8fb9dfe51ab9f471700157d77e65bd2c2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper proposes a specialized autonomous driving system that takes into account the unique constraints and characteristics of automotive systems, aiming for innovative advancements in autonomous driving technology. The proposed system systematically analyzes the intricate data flow in autonomous driving and provides functionality to dynamically adjust various factors that influence deep learning models. Additionally, for algorithms that do not rely on deep learning models, the system analyzes the flow to determine resource allocation priorities. In essence, the system optimizes data flow and schedules efficiently to ensure real-time performance and safety. The proposed system was implemented in actual autonomous vehicles and experimentally validated across various driving scenarios. The experimental results provide evidence of the system's stable inference and effective control of autonomous vehicles, marking a significant turning point in the development of autonomous driving systems.",
    "citationCount": 0,
    "referenceCount": 37
}