{
    "paperId": "04043eef28e263190b27c037b22868c761d08900",
    "title": "First steps towards improving official statistics data accessibility in Mexico: Query expansion with neural networks and ad-hoc space vectors",
    "year": 2023,
    "venue": "Statistical Journal of the IAOS",
    "authors": [
        "Alejandro Pimentel",
        "Oswaldo Diaz",
        "E. Villaseñor",
        "Jose-Luis Jiménez"
    ],
    "doi": "10.3233/SJI-230014",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04043eef28e263190b27c037b22868c761d08900",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mexico’s National Institute of Statistics and Geography (INEGI) is exploring new opportunities to improve its information search service, with the aim of increasing the accessibility of official statistical data. The upgraded search engine will include a new component that offers more sophisticated search capabilities. These include the ability to conduct intelligent searches that do not require an exact match of the search text, as well as the expansion of searches using related ad-hoc terms. Additionally, the new component will provide feedback through the most appropriate relations. To achieve this, the system will utilize neural network-based distributional word representation systems to identify relationships between related terms. The vector spaces and representation will be manipulated to keep connections within the most relevant vocabulary for the institute’s type of searches. The usability testing department at the institute conducted blind pilot tests to compare the quality reported by users with and without the new enhancements. Although the evaluation survey showed significant improvements in the search engine’s performance, the tool presented is just the first step towards a system that allows continuous interaction and feedback with users to improve the quality of the responses presented. This strategy is not currently implemented by the institute, making this an immediate and easy-to-replicate approach for obtaining useful interactions with users.",
    "citationCount": 0,
    "referenceCount": 28
}