{
    "paperId": "040ed76a71fd8de3ad6f34bc433c0a95a0c96052",
    "title": "Optimizing Identification of Local Medical Services Using Whale Optimization Algorithm",
    "year": 2025,
    "venue": "2025 Third International Conference on Networks, Multimedia and Information Technology (NMITCON)",
    "authors": [
        "A. S",
        "Abhinand K P",
        "Athul Sajikumar",
        "Sreenath K",
        "Hariram J S"
    ],
    "doi": "10.1109/NMITCON65824.2025.11188416",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/040ed76a71fd8de3ad6f34bc433c0a95a0c96052",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current approaches to diagnostic centers have sev- eral inefficiencies in terms of not providing real-time feedback, leading to delayed or uninformed choices and poor patient satisfaction levels. It makes use of geolocation technology, and the Whale Optimization Algorithm integrates to provide the users with real-time information on availability, cost, and location for diagnostic services to make efficient decisions. It has advanced data visualization techniques integrated to enhance the user's experience and utility. These methods enable the categorization of diagnostic centers based on service quality, cost-effectiveness, and proximity. Additionally, the best route planning reduces travel time for patients, minimizes logistical inconveniences, and increases accessibility to diagnostic services. The work addresses the longstanding issues of outdated service information, incon- sistent updates, and spatial inefficiencies in healthcare delivery systems. This work contributes to the overall creation of a more resilient and patient-centric healthcare ecosystem by integrating modern technology and optimization methods. The average travel time before optimization is 12.8 minutes. The average travel time after WOA optimization is $\\mathbf{1 0. 3}$ minutes, and the Travel time saved is 19.5%. The diagnostic service finder empowers patients with relevant, timely, and actionoriented data and promotes enhanced decision-making processes, leading eventually to better health outcomes.",
    "citationCount": 0,
    "referenceCount": 23
}