{
    "paperId": "0472d505508b9a2169dc0e0872e4fb1128a0b0e1",
    "title": "Machine Learning Design for High-Entropy Alloys: Models and Algorithms",
    "year": 2024,
    "venue": "Metals",
    "authors": [
        "Sijia Liu",
        "Chao Yang"
    ],
    "doi": "10.3390/met14020235",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0472d505508b9a2169dc0e0872e4fb1128a0b0e1",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2075-4701/14/2/235/pdf?version=1707993141",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-entropy alloys (HEAs) have attracted worldwide interest due to their excellent properties and vast compositional space for design. However, obtaining HEAs with low density and high properties through experimental trial-and-error methods results in low efficiency and high costs. Although high-throughput calculation (HTC) improves the design efficiency of HEAs, the accuracy of prediction is limited owing to the indirect correlation between the theoretical calculation values and performances. Recently, machine learning (ML) from real data has attracted increasing attention to assist in material design, which is closely related to performance. This review introduces common and advanced ML models and algorithms which are used in current HEA design. The advantages and limitations of these ML models and algorithms are analyzed and their potential weaknesses and corresponding optimization strategies are discussed as well. This review suggests that the acquisition, utilization, and generation of effective data are the key issues for the development of ML models and algorithms for future HEA design.",
    "citationCount": 25,
    "referenceCount": 122
}