{
    "paperId": "04c7a017b8e0592c7c98297e4296e630534aa3ce",
    "title": "Self-adaptive Federated Learning in Internet of Things Systems: A Review",
    "year": 2025,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Abdulaziz Aljohani",
        "Omer F. Rana",
        "Charith Perera"
    ],
    "doi": "10.1145/3725527",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04c7a017b8e0592c7c98297e4296e630534aa3ce",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, Federated Learning (FL) and the Internet of Things (IoT) have enabled numerous artificial intelligence applications. FL offers advantages over traditional machine learning and deep learning by shifting model training to the edge. However, the dynamic nature of IoT environments often interferes with FL’s ability to converge quickly and deliver consistent performance. Therefore, a self-adaptive approach is necessary to react to context changes and maintain system performance. This article provides a systematic overview of current efforts to integrate self-adaptation in FL for IoT. We review key computing disciplines, including Self-Adaptive Systems, Feedback Controls, IoT, and FL. Additionally, we present (i) a multidimensional taxonomy to highlight the core characteristics of self-adaptive FL systems and (ii) a conceptual architecture for self-adaptive FL in IoT, applied to anomaly detection in smart homes. Finally, we discuss the motivations, implementations, applications, and challenges of self-adaptive FL systems in IoT contexts.",
    "citationCount": 0,
    "referenceCount": 114
}