{
    "paperId": "04cc90534a1d0bebeb9f82217166a62f77d095e5",
    "title": "Reconfigurable Intelligent Surface (RIS)-Assisted Non-Terrestrial Network (NTN)-Based 6G Communications: A Contemporary Survey",
    "year": 2024,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Chika E. Worka",
        "F. Khan",
        "Q. Ahmed",
        "P. Sureephong",
        "T. Alade"
    ],
    "doi": "10.3390/s24216958",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04cc90534a1d0bebeb9f82217166a62f77d095e5",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/s24216958",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article examines the transformative potential of integrating reconfigurable intelligent surfaces (RISs) into sixth-generation (6G) wireless non-terrestrial networks (NTNs). The focus is on the RIS’s capability to address diverse user requirements, including secure data transmission, power efficiency, extended coverage, and enhanced data rates. The paper delves into the synergy between RISs and NTNs, emphasizing key components like multiple-input multiple-output (MIMO) systems and advanced radio communications. Additionally, it highlights the crucial role of artificial intelligence (AI) and machine learning (ML) in optimizing RIS-based beamforming to solve scientific and engineering challenges while ensuring energy efficiency and sustainability in NTN operations. By positioning RISs as a key enabler in shaping the future of wireless communication systems, this research underscores their significance in unlocking the full potential of NTNs and advancing next-generation wireless communications. This paper contributes valuable insights and projections for future research directions, highlighting RISs’ potential to revolutionize NTNs for 6G technologies.",
    "citationCount": 6,
    "referenceCount": 107
}