{
    "paperId": "04d5754465ab6cc7866a2bef2356783a85bd273a",
    "title": "Semantic Analysis and Query Suggestions for Distributed Redshift Systems",
    "year": 2025,
    "venue": "International Conference on Innovative Mechanisms for Industry Applications",
    "authors": [
        "S. Panda"
    ],
    "doi": "10.1109/ICIMIA67127.2025.11200784",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04d5754465ab6cc7866a2bef2356783a85bd273a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The adoption of distributed Amazon Redshift deployments is increasing among large enterprises, resulting in complex data environments where analytical queries often span multiple clusters and regions. Traditional query optimization methods are insufficient for addressing the specific challenges present in distributed settings, such as cross-cluster join operations, optimizing for data locality, and comprehending distributed data relationships. This paper introduces Distributed Query Optimizer (DQO), a system designed to leverage semantic analysis and machine learning to deliver intelligent query recommendations for distributed Redshift platforms. The proposed approach integrates natural language processing, graph-based relationship modeling, and reinforcement learning to systematically enhance query performance across cluster boundaries. Evaluation in production environments indicates that DQO improves cross-cluster query performance by 73%, reduces data transfer costs by 58%, and achieves 84% accuracy in predicting optimal query execution plans. The system effectively supports complex analytical workloads, including federated queries, temporal data analyses, and real-time reporting scenarios, while sustaining sub-second response times for query suggestion generation.",
    "citationCount": 0,
    "referenceCount": 12
}