{
    "paperId": "04ea1b56cd9b9fa9ba136dcd59e6a2c9bee49c7d",
    "title": "An improved Vision Systems for modern computer applications using Deep Learning",
    "year": 2024,
    "venue": "International Conference on Computing Communication and Networking Technologies",
    "authors": [
        "N.R Gladiss Merlin",
        "S. Gobinath",
        "G. Srimathy",
        "Nune Divya",
        "Y. Abid"
    ],
    "doi": "10.1109/ICCCNT61001.2024.10726167",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04ea1b56cd9b9fa9ba136dcd59e6a2c9bee49c7d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Vision systems, or laptop systems that could interpret and examine visible information, have grown to be today’s vital in current computer programs together with self-sufficient riding, facial reputation, and clinical photograph evaluation. The fulfillment of these packages is based heavily on the accuracy and efficiency of the ultra-modern imaginative and prescient device’s photograph reputation and interpretation abilities. Latest advancements in Deep-gaining knowledge state modern, a subfield of ultra-modern synthetic intelligence, have revolutionized the sector of modern-day imaginative and prescient systems by presenting extra accurate and bendy ultra-modern algorithms. These deep, cutting-edge algorithms can mechanically analyze and extract rugged capabilities from photos, making them the best for complex visible responsibilities. This project aims to expand an advanced vision system for modern-day laptop applications by leveraging the energy of today’s Deep modern-day. Our proposed device will comprise deep ultra-modern algorithms to enhance the accuracy and velocity of state-of-the-art photo popularity and interpretation. Furthermore, we can design and train our system on massive and various datasets to improve its potential in dealing with specific trendy images and environments.",
    "citationCount": 0,
    "referenceCount": 10
}