{
    "paperId": "04f5164f9edfbb15e5b479b31341bd28f02f882b",
    "title": "Demonstration of ViTA: Visualizing, Testing and Analyzing Index Advisors",
    "year": 2023,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Wei Zhou",
        "Chen Lin",
        "Xuanhe Zhou",
        "Guoliang Li",
        "Tianqing Wang"
    ],
    "doi": "10.1145/3583780.3614738",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/04f5164f9edfbb15e5b479b31341bd28f02f882b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index advisors have become an essential tool to optimize index selection and accelerate query processing. Various index advisors have been developed in recent years, and comprehensively assessing their performance from multiple aspects is necessary. In this demonstration, we introduce VITA, a user-friendly and informative tool for interactively Visualizing, Testing, and Analyzing index advisors. For a user-given workload, VITA can visualize the main steps of the index selection procedure in ten existing index advisors to facilitate the management of index advisors. Moreover, VITA can assess the index advisor's robustness w.r.t. workload drift by generating testing workloads, i.e., potentially future workloads that may damage the index advisor's performance. Finally, VITA provides a comparative analysis across index advisors on four aspects, including the index advisor's utility (i.e., the ratio of the reduced workload cost), robustness (i.e., the performance under dynamic workload), overhead (i.e., the time to acquire the final configuration), and scalability (i.e., the volume of the enumerated index candidates). Therefore, VITA can thoroughly compare existing index advisors to help users determine the most suitable index advisor that meets their requirements. VITA is now being integrated into the openGauss platform as a plug-in.",
    "citationCount": 2,
    "referenceCount": 17
}