{
    "paperId": "052f0806dd8f00249a86d52c0665876277d3ac3f",
    "title": "Time-Series Analysis in Financial Prediction: A Literature Review",
    "year": 2024,
    "venue": "Sainstek : Jurnal Sains dan Teknologi",
    "authors": [
        "Syaharuddin Syaharuddin"
    ],
    "doi": "10.31958/js.v16i2.13117",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/052f0806dd8f00249a86d52c0665876277d3ac3f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.31958/js.v16i2.13117",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "AbstractTime-series analysis in financial prediction has become a primary focus for many researchers and practitioners in the fields of economics and finance, particularly due to the complexity and dynamism of the evolving market. This research aims to identify the challenges and recent advancements in the application of time-series analysis for financial predictions, encompassing market volatility, non-stationary data, and unpredictable external factors such as geopolitical events and economic policy changes. The research methodology is qualitative, employing a Systematic Literature Review approach. Literature sources are drawn from indexed databases including Scopus, DOAJ, and Google Scholar, covering publications from 2013 to 2024. Based on recent studies, it is concluded that the primary challenges in financial time-series prediction are managing significant market volatility and capturing changes in non-stationary financial data. Traditional models such as GARCH and ARCH, although still relevant, exhibit limitations in handling the complexity of temporal dependencies and dynamic structural changes. In contrast, deep learning models like Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU) demonstrate superiority in capturing complex temporal patterns and overcoming issues of vanishing or exploding gradients. Additionally, the integration of external data sources such as financial news and social media has been shown to enhance predictive accuracy. Unpredictable external factors, such as geopolitical events and economic policy changes, also significantly impact financial predictions, underscoring the importance of flexibility and adaptability in prediction models. This research is expected to make a significant contribution to enhancing financial predictions and addressing the challenges of market volatility and global uncertainty.",
    "citationCount": 2,
    "referenceCount": 44
}