{
    "paperId": "053f082228bbd969b161990ec4ab9477de55e470",
    "title": "Sample2SQL: A Visual Interface for Querying Risky Enterprises",
    "year": 2024,
    "venue": "IEEE Pacific Visualization Symposium",
    "authors": [
        "Hongjia Wu",
        "Shan-Chen Zou",
        "Jiazhi Xia",
        "Hongxin Zhang",
        "Wei Chen"
    ],
    "doi": "10.1109/PacificVis60374.2024.00034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/053f082228bbd969b161990ec4ab9477de55e470",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose a visual query system for risky enterprises. Based on a small number of input samples of risky enterprises, users can interactively analyze and obtain SQL statements that express the query results, facilitating subsequent task operations and understanding risk criteria. Due to the diversity of enterprises and the complexity of economic indicators, understanding, evaluating, and querying risky enterprises is a challenging task for ordinary users. To solve this problem, our visual query system integrates multicriteria decision-making techniques and data mining through a visual analysis interface. The system facilitates efficient identification of risky enterprises, leveraging knowledge gained from a small number of known risk company samples. Our system includes an analytic hierarchy model to express domain knowledge, a query tree construction algorithm, and a well-designed visual interface. Two real cases demonstrate the effectiveness of our system.",
    "citationCount": 0,
    "referenceCount": 46
}