{
    "paperId": "05bba1530b951c85fa2263c4c26374a4518eb25c",
    "title": "Artificial Intelligence in Medicine",
    "year": 2024,
    "venue": "International Journal For Multidisciplinary Research",
    "authors": [
        "Syamala Devi"
    ],
    "doi": "10.36948/ijfmr.2024.v06i01.12490",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/05bba1530b951c85fa2263c4c26374a4518eb25c",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ijfmr.com/papers/2024/1/12490.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial Intelligence (AI) is the technology related to simulating human behaviour in machines. Machine intelligence is a subfield of AI in which available raw data is processed to learn inherent patterns and build a model to adapt to new data. Deep learning models utilize very large amount of data and extract important features and classify the data. Multiagent systems or distributed AI systems are autonomous, proactive, reactive and have ability to interact with humans and other agents. Medicine includes all the processes involved in preventing, diagnosing and curing diseases. It includes medical staff and supporting staff records, drug information, decision support information for medical professionals, clinical lab tests, X-rays, magnetic resonance images, surgeries, and so on. AI has a number of applications in medicine including expert systems, medical robots, medial image analysis and distributed medical agents etc. Expert systems can function as medical experts and helpful for patients who are unable to reach a medical specialist due to cost, or being in a remote area. The role of AI is significant in radiology as abnormal data is labelled in medical images obtained from computed tomography, X-rays, and magnetic resonance imaging etc. more accurately. Medical robots assist in patient care, clinical settings, surgeries and in many other ways. Distributed medical agents enable the availability of a number of medical experts online to examine critical cases. In this paper the role of artificial intelligence in the above mentioned medical applications is elaborated with relevant examples. It is concluded that AI is indispensable in medicine for effective and efficient healthcare.",
    "citationCount": 0,
    "referenceCount": 40
}