{
    "paperId": "05d70a97554d7a210aada1161e1b7488564da169",
    "title": "Polyglot Data Management: State of the Art & Open Challenges",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Felix Kiehn",
        "Mareike Schmidt",
        "Daniel Glake",
        "Fabian Panse",
        "Wolfram Wingerath",
        "Benjamin Wollmer",
        "Martin Poppinga",
        "N. Ritter"
    ],
    "doi": "10.14778/3554821.3554891",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/05d70a97554d7a210aada1161e1b7488564da169",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the increasing variety of the current database landscape, polyglot data management has become a hot research topic in recent years. The underlying idea is to combine the benefits of different data stores behind a predefined set of common interfaces and thus address use cases that individual stores cannot meet. This can be accomplished using different approaches which vary greatly in terms of capabilities, functionality, and architectural concepts. This tutorial provides a detailed overview of the current state of research in polyglot data management. We motivate its use by showing the high diversity of existing data stores and discussing three use cases in which individual stores are insufficient. Thereafter, we present different taxonomies for classifying polyglot data systems and give a detailed review of a number of selected systems. Finally, we compare these systems based on their features and discuss open challenges that still need to be addressed in future research.",
    "citationCount": 10,
    "referenceCount": 39
}