{
    "paperId": "060a1452047de3cf0d680945719b1526a7eadb58",
    "title": "Machine Learning Meets Big Spatial Data (Revised)",
    "year": 2021,
    "venue": "International Conference on Mobile Data Management",
    "authors": [
        "Ibrahim Sabek",
        "M. Mokbel"
    ],
    "doi": "10.1109/MDM52706.2021.00014",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/060a1452047de3cf0d680945719b1526a7eadb58",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The proliferation in amounts of generated data has propelled the rise of scalable machine learning solutions to efficiently analyze and extract useful insights from such data. Meanwhile, spatial data has become ubiquitous, e.g., GPS data, with increasingly sheer sizes in recent years. The applications of big spatial data span a wide spectrum of interests including tracking infectious disease, climate change simulation, drug addiction, among others. Consequently, major research efforts are exerted to support efficient analysis and intelligence inside these applications by either providing spatial extensions to existing machine learning solutions or building new solutions from scratch. In this 90-minutes seminar, we comprehensively review the state-of-the-art work in the intersection of machine learning and big spatial data. We cover existing research efforts and challenges in three major areas of machine learning, namely, data analysis, deep learning and statistical inference. We also discuss the existing end-to-end systems, and highlight open problems and challenges for future research in this area.",
    "citationCount": 5,
    "referenceCount": 82
}