{
    "paperId": "06160db7b944a5437f52b353f9510d3fcbd52912",
    "title": "CRM: Retrieval Model with Controllable Condition",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Chi Liu",
        "Jiangxia Cao",
        "Rui Huang",
        "Kuo Cai",
        "Weifeng Ding",
        "Qiang Luo",
        "Kun Gai",
        "Guorui Zhou"
    ],
    "doi": "10.48550/arXiv.2412.13844",
    "arxivId": "2412.13844",
    "url": "https://www.semanticscholar.org/paper/06160db7b944a5437f52b353f9510d3fcbd52912",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommendation systems (RecSys) are designed to connect users with relevant items from a vast pool of candidates while aligning with the business goals of the platform. A typical industrial RecSys is composed of two main stages, retrieval and ranking: (1) the retrieval stage aims at searching hundreds of item candidates satisfied user interests; (2) based on the retrieved items, the ranking stage aims at selecting the best dozen items by multiple targets estimation for each item candidate, including classification and regression targets. Compared with ranking model, the retrieval model absence of item candidate information during inference, therefore retrieval models are often trained by classification target only (e.g., click-through rate), but failed to incorporate regression target (e.g., the expected watch-time), which limit the effectiveness of retrieval. In this paper, we propose the Controllable Retrieval Model (CRM), which integrates regression information as conditional features into the two-tower retrieval paradigm. This modification enables the retrieval stage could fulfill the target gap with ranking model, enhancing the retrieval model ability to search item candidates satisfied the user interests and condition effectively. We validate the effectiveness of CRM through real-world A/B testing and demonstrate its successful deployment in Kuaishou short-video recommendation system, which serves over 400 million users.",
    "citationCount": 1,
    "referenceCount": 21
}