{
    "paperId": "066488ac4b5dd7f52e10eee07cd0de855845e7c3",
    "title": "PDSP-Bench: A Benchmarking System for Parallel and Distributed Stream Processing",
    "year": 2025,
    "venue": "TPC Technology Conference",
    "authors": [
        "Pratyush Agnihotri",
        "B. Koldehofe",
        "Roman Heinrich",
        "Carsten Binnig",
        "Manisha Luthra"
    ],
    "doi": "10.48550/arXiv.2504.10704",
    "arxivId": "2504.10704",
    "url": "https://www.semanticscholar.org/paper/066488ac4b5dd7f52e10eee07cd0de855845e7c3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The paper introduces PDSP-Bench, a novel benchmarking system designed for a systematic understanding of performance of parallel stream processing in a distributed environment. Such an understanding is essential for determining how Stream Processing Systems (SPS) use operator parallelism and the available resources to process massive workloads of modern applications. Existing benchmarking systems focus on analyzing SPS using queries with sequential operator pipelines within a homogeneous centralized environment. Quite differently, PDSP-Bench emphasizes the aspects of parallel stream processing in a distributed heterogeneous environment and simultaneously allows the integration of machine learning models for SPS workloads. In our results, we benchmark a well-known SPS, Apache Flink, using parallel query structures derived from real-world applications and synthetic queries to show the capabilities of PDSP-Bench towards parallel stream processing. Moreover, we compare different learned cost models using generated SPS workloads on PDSP-Bench by showcasing their evaluations on model and training efficiency. We present key observations from our experiments using PDSP-Bench that highlight interesting trends given different query workloads, such as non-linearity and paradoxical effects of parallelism on the performance.",
    "citationCount": 3,
    "referenceCount": 55
}