{
    "paperId": "068293a78416df68b47c6def9a9c429c204edaf8",
    "title": "SF-SGL: Solver-Free Spectral Graph Learning From Linear Measurements",
    "year": 2023,
    "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "authors": [
        "Ying Zhang",
        "Zhiqiang Zhao",
        "Zhuo Feng"
    ],
    "doi": "10.1109/TCAD.2022.3198513",
    "arxivId": "2302.04384",
    "url": "https://www.semanticscholar.org/paper/068293a78416df68b47c6def9a9c429c204edaf8",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2302.04384",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work introduces a highly scalable spectral graph densification (SGL) framework for learning resistor networks with linear measurements, such as node voltages and currents. We show that the proposed graph learning approach is equivalent to solving the classical graphical Lasso problems with Laplacian-like precision matrices. We prove that given $O(\\log N)$ pairs of voltage and current measurements, it is possible to recover sparse $N$ -node resistor networks that can well preserve the effective resistance distances on the original graph. In addition, the learned graphs also preserve the structural (spectral) properties of the original graph, which can potentially be leveraged in many circuit design and optimization tasks. To achieve more scalable performance, we also introduce a solver-free method (SF-SGL) that exploits multilevel spectral approximation of the graphs and allows for a scalable and flexible decomposition of the entire graph spectrum (to be learned) into multiple different eigenvalue clusters (frequency bands). Such a solver-free approach allows us to more efficiently identify the most spectrally critical edges for reducing various ranges of spectral embedding distortions. A unique property of the learned graphs is that the spectral embedding or effective-resistance distances on the constructed graph will encode the similarities between the original input data points (node voltage measurements). Through extensive experiments for a variety of real-world test cases, we show that the proposed approach is highly scalable for learning sparse resistor networks without sacrificing the solution quality. We also introduce a data-driven EDA algorithm for vectorless power/thermal integrity verifications to allow estimating worst case voltage/temperature (gradient) distributions across the entire chip by leveraging a few voltage/temperature measurements.",
    "citationCount": 3,
    "referenceCount": 54
}