{
    "paperId": "069ebe686afab1bec3d25d9e8de41e563b62c1df",
    "title": "Evaluating Google Maps’ Eco-Routes: A Metaheuristic-Driven Microsimulation Approach",
    "year": 2024,
    "venue": "Geographies",
    "authors": [
        "Aleksandar Jovanovic",
        "Slavica Gavric",
        "Aleksandar Stevanovic"
    ],
    "doi": "10.3390/geographies4040040",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/069ebe686afab1bec3d25d9e8de41e563b62c1df",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Eco-routing, as a key strategy for mitigating urban pollution, is gaining prominence due to the fact that minimizing travel time alone does not necessarily result in the lowest fuel consumption. This research focuses on the challenge of selecting environmentally friendly routes within an urban street network. Employing microsimulation modelling and a computer-generated mirror of a small traffic network, the study integrates real-world traffic patterns to enhance accuracy. The route selection process is informed by fuel consumption and emissions data from trajectory parameters obtained during simulation, utilizing the Comprehensive Modal Emission Model (CMEM) for emission estimation. A comprehensive analysis of specific origin–destination pairs was conducted to assess the methodology, with all vehicles adhering to routes recommended by Google Maps. The findings reveal a noteworthy disparity between microsimulation results and Google Maps recommendations for eco-friendly routes within the University of Pittsburgh Campus street network. This incongruence underscores the necessity for further investigations to validate the accuracy of Google Maps’ eco-route suggestions in urban settings. As urban areas increasingly grapple with pollution challenges, such research becomes pivotal for refining and optimizing eco-routing strategies to effectively contribute to sustainable urban mobility.",
    "citationCount": 0,
    "referenceCount": 34
}