{
    "paperId": "06d04ab17369511a870505488b14d9a190684953",
    "title": "Adaptive HTAP through Elastic Resource Scheduling",
    "year": 2020,
    "venue": "SIGMOD Conference",
    "authors": [
        "Aunn Raza",
        "Periklis Chrysogelos",
        "Angelos-Christos G. Anadiotis",
        "A. Ailamaki"
    ],
    "doi": "10.1145/3318464.3389783",
    "arxivId": "2004.05437",
    "url": "https://www.semanticscholar.org/paper/06d04ab17369511a870505488b14d9a190684953",
    "isOpenAccess": true,
    "openAccessPdf": "https://infoscience.epfl.ch/record/276997/files/adaptive-htap-technical-report.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern Hybrid Transactional/Analytical Processing (HTAP) systems use an integrated data processing engine that performs analytics on fresh data, which are ingested from a transactional engine. HTAP systems typically consider data freshness at design time, and are optimized for a fixed range of freshness requirements, addressed at a performance cost for either OLTP or OLAP. The data freshness and the performance requirements of both engines, however, may vary with the workload. We approach HTAP as a scheduling problem, addressed at runtime through elastic resource management. We model an HTAP system as a set of three individual engines: an OLTP, an OLAP and a Resource and Data Exchange (RDE) engine. We devise a scheduling algorithm which traverses the HTAP design spectrum through elastic resource management, to meet the workload data freshness requirements. We propose an in-memory system design which is non-intrusive to the current state-of-art OLTP and OLAP engines, and we use it to evaluate the performance of our approach. Our evaluation shows that the performance benefit of our system for OLAP queries increases over time, reaching up to 50% compared to static schedules for 100 query sequences, while maintaining a small, and controlled, drop in the OLTP throughput.",
    "citationCount": 44,
    "referenceCount": 39
}