{
    "paperId": "06e95425108884ff08def096cc22591a04b90f08",
    "title": "The gap-free genome assembly and multi-omics analyses illustrate the evolutionary history and the synthesis of medicinal components of Ligustrum lucidum.",
    "year": 2025,
    "venue": "The Plant Journal",
    "authors": [
        "Yong Li",
        "Meng-Jie Yuan",
        "Zi-Yan Zhang",
        "Nan-Cai Pei"
    ],
    "doi": "10.1111/tpj.70029",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/06e95425108884ff08def096cc22591a04b90f08",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ligustrum lucidum, an important ornamental and medicinal plant in the Oleaceae family, has become a globally notorious invasive species because of its high adaptability. However, the lack of a high quality genome has hindered the understanding of the genetic basis for its broad adaptability and the mechanisms of its medicinal component synthesis. In this study, we successfully assembled a gap free telomere to telomere genome of L. lucidum. Through the reconstruction of the phylogenetic tree, we presented evidence that Jasmineae diverged from Oleaceae earlier than Forsythieae, which challenges the existing phylogenetic relationships within Oleaceae. Comparative genomics has found that two rounds of gene family expansions in L. lucidum significantly increased the number of genes related to its biotic and abiotic stress resistances, which may lay the genetic foundation for its broad adaptability. Among the L. lucidum fruits from January to March in our investigation, the results of metabolome show that March may be the optimal harvesting time. By integrating genomic, transcriptomic, and metabolomic data, we identified candidate genes involved in the synthesis of compounds, such as specnuezhenide, salidroside, and oleanolic acid. This study provides valuable genomic resources for comparative genomics studies within Oleaceae and for the genetic research of L. lucidum.",
    "citationCount": 0,
    "referenceCount": 100
}