{
    "paperId": "06f83e665a81fdaf7c85a707f7c491f049e5f5ea",
    "title": "A comprehensive survey on online social networks security and privacy issues: Threats, machine learning‐based solutions, and open challenges",
    "year": 2022,
    "venue": "Security and Privacy",
    "authors": [
        "Munmun Bhattacharya",
        "Sandipan Roy",
        "Samiran Chattopadhyay",
        "A. Das",
        "Sachin Shetty"
    ],
    "doi": "10.1002/spy2.275",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/06f83e665a81fdaf7c85a707f7c491f049e5f5ea",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Over the past few years, online social networks (OSNs) have become an inseparable part of people's daily lives. Instead of being passive readers, people are now enjoying their role as content contributors. OSN has permitted its users to share their information including the multimedia content. OSN users can express themselves in virtual communities by providing their opinions and interacting with others. As a consequence, the privacy and security threats in OSNs have emerged as a major concern to the research and business world. In the recent past, a number of survey works have been conducted to discuss different security and privacy threats in OSNs. However, till date, no survey work has been conducted that aims to classify and analyze various machine learning (ML)‐based solutions adapted for the security defense of OSNs. In this survey article, we present a detailed taxonomy with a classification of various works done on various security attacks in OSNs. We then review and summarize the existing state of art survey works on OSN security, and indicate the merits and limitations of these survey works. Next, we review all recent works that aim to provide ML‐based solutions toward defense of security attacks on OSNs. Finally, we discuss the future road‐map on OSN security and provide a comprehensive analysis on the open research issues with feasible measurements and possible solutions.",
    "citationCount": 21,
    "referenceCount": 219
}