{
    "paperId": "06fadd9d6e5342bd173543141d805d0c458efb03",
    "title": "A Concept Paper on an Alert System for Profiling Attention Deficits Through Neurofeedback to Enhance Effective Learning",
    "year": 2024,
    "venue": "International Conference Computing Engineering and Design",
    "authors": [
        "Dini Handayani",
        "Hayani Nazurah Binti Hasram",
        "Nora Alissa Binti Ismail",
        "Ms.Ohud Falemban",
        "Z. Suryady",
        "Ratna Yunita Setiyani Subardjo"
    ],
    "doi": "10.1109/ICCED64257.2024.10983072",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/06fadd9d6e5342bd173543141d805d0c458efb03",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Attention deficits significantly impede students' learning outcomes and academic performance, yet current educational frameworks often lack the tools to effectively identify and address these challenges. This concept paper proposes a novel Brain-Computer Interface (BCI) system to monitor and profile student attention deficits, leveraging deep learning models and neurofeedback mechanisms. Specifically, the system employs Long Short-Term Memory (LSTM) networks to analyze real-time electroencephalogram (EEG) data, detecting shifts in attention during learning activities. By integrating neurofeedback, the BCI system provides personalized interventions tailored to individual cognitive states, enhancing student engagement and facilitating improved academic performance. The research structures itself into four phases: (1) developing deep learning models for attention detection, (2) creating a real-time BCI system, (3) integrating neurofeedback mechanisms, and (4) evaluating the system's effectiveness in educational settings. This study aims to bridge the gap in existing literature regarding attention deficits in education, providing educators with actionable insights and innovative tools to foster cognitive engagement. Ultimately, the proposed system has the potential to transform educational practices, support at-risk students, and contribute to the growing field of BCI applications in education.",
    "citationCount": 1,
    "referenceCount": 24
}