{
    "paperId": "070f07154871c39aaa6b1589fa1b4a43b387a578",
    "title": "Unsupervised Deep Background Matting Using Deep Matte Prior",
    "year": 2022,
    "venue": "IEEE transactions on circuits and systems for video technology (Print)",
    "authors": [
        "Yong Xu",
        "Baoling Liu",
        "Yuhui Quan",
        "Hui Ji"
    ],
    "doi": "10.1109/TCSVT.2021.3132461",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/070f07154871c39aaa6b1589fa1b4a43b387a578",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background matting is a recently developed image matting approach, with applications to image and video editing. It refers to estimating both the alpha matte and foreground from a pair of images with and without foreground objects. Recent work has applied deep learning to background matting, with very promising performance achieved. However, existing deep models are supervised which require a large dataset with ground truth alpha mattes for training. To avoid the cost of data collection and possible bias in training data, this paper proposes a dataset-free unsupervised deep learning-based approach for background matting. Observing that the local smoothness of alpha matte can be well characterized by the untrained network prior called deep matte prior, we model the foreground and alpha matte using the priors encoded by two generative convolutional neural networks. To avoid possible overfitting during unsupervised learning, a two-stage learning scheme is developed which contains projection-based training and Bayesian post refinement. An alpha-matte-driven initialization scheme is also developed for performance boost. Even without calling external training data, the proposed approach provides competitive performance to recent supervised learning-based methods in the experiments.",
    "citationCount": 12,
    "referenceCount": 39
}