{
    "paperId": "071bf71956d4bae4caa5f846897a3db2bc4ca4a0",
    "title": "PriceAggregator: An Intelligent System for Hotel Price Fetching",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Jiangwei Zhang",
        "Li Zhang",
        "Vigneshwaran Raveendran",
        "Ziv Ben-Zuk",
        "Leonard L. Lu"
    ],
    "doi": null,
    "arxivId": "2008.02087",
    "url": "https://www.semanticscholar.org/paper/071bf71956d4bae4caa5f846897a3db2bc4ca4a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper describes the hotel price aggregation system - PriceAggregator, deployed at Agoda, a global online travel agency for hotels, vacation rentals, flights and airport transfer. Agoda aggregates non-direct suppliers' hotel rooms to ensure that Agoda's customers always have the widest selection of hotels, room types and packages. As of today, Agoda aggregates millions of hotels. The major challenge is that each supplier only allows Agoda to fetch for the hotel price with a limited amount of Queries Per Second (QPS). Due to the sheer volume of Agoda's user search traffic, this limited amount of QPS is never enough to cover all user searches. Inevitably, many user searches have to be ignored. Hence, booking lost. To overcome the challenge, we built PriceAggregator. PriceAggregator intelligently determines when, how and what to send to the suppliers to fetch for price. In this paper, we not only prove PriceAggregator is optimal theoretically but also demonstrate that PriceAggregator performs well in practice. PriceAggregator has been deployed in Agoda. Extensive online A/B experimentation have shown that PriceAggregator increases Agoda's bookings significantly.",
    "citationCount": 0,
    "referenceCount": 12
}