{
    "paperId": "072425ff28727511b5d0d63567f1ea883d1bdb17",
    "title": "LEGOLAS: Learning & Enhancing Golf Skills through LLM-Augmented System",
    "year": 2025,
    "venue": "CHI Extended Abstracts",
    "authors": [
        "Kangbeen Ko",
        "Minwoo Oh",
        "Minwoo Seong",
        "Seungjun Kim"
    ],
    "doi": "10.1145/3706599.3720141",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/072425ff28727511b5d0d63567f1ea883d1bdb17",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Effective skill acquisition in sports like golf requires both physical practice and proper feedback. Beyond error detection, valuable feedback helps learners understand underlying causes, refine mental representations, and enhance performance. While visual feedback (ViF) in self-training systems excels at identifying errors, it often lacks the capacity to address root causes or guide meaningful corrections—areas where verbal feedback (VeF) has proven highly beneficial. This study investigates the use of Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) to deliver expert-level VeF for self-training. The results show that LLM-generated VeF retains the proven advantages of traditional VeF, improving learners’ mental representations and facilitating consistent progress. Additionally, integrating VeF with ViF enhances learning efficiency, self-assessment confidence, and overall performance without increasing cognitive load. This approach offers a scalable solution for effective self-training, leveraging LLMs to capture the proven advantages of VeF and bridging the gap between traditional coaching and automated systems.",
    "citationCount": 1,
    "referenceCount": 62
}