{
    "paperId": "0742f0ee9785bbd30c23ef046297241afe97a624",
    "title": "Unmasking the Internet: A Survey of Fine-Grained Network Traffic Analysis",
    "year": 2025,
    "venue": "IEEE Communications Surveys &amp; Tutorials",
    "authors": [
        "Yebo Feng",
        "Jun Li",
        "Jelena Mirkovic",
        "Cong Wu",
        "Chong Wang",
        "Hao Ren",
        "Jiahua Xu",
        "Yang Liu"
    ],
    "doi": "10.1109/comst.2025.3545541",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0742f0ee9785bbd30c23ef046297241afe97a624",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "—Fine-grained traffic analysis (FGTA), as an advanced form of traffic analysis (TA), aims to analyze network traffic to deduce fine-grained information on or above the application layer, such as application-layer activities, fine-grained user behaviors, or message content, even in the presence of traffic encryption or traffic obfuscation. Different from traditional TA, FGTA approaches are usually based on complicated processing pipelines or sophisticated data mining techniques such as deep learning or high-dimensional clustering, enabling them to discover subtle differences between different network traffic groups. Nowadays, with the increasingly complex Internet architecture, the increasingly frequent transmission of user data, and the widespread use of traffic encryption, FGTA is becoming an essential tool for both network administrators and attackers to gain different levels of visibility over the network. It plays a critical role in intrusion and anomaly detection, quality of experience investigation, user activity inference, website fingerprinting, location estimation, etc. To help scholars and developers research and advance this technology, in this survey paper, we examine the literature that deals with FGTA, investigating the frontier developments in this domain. By comprehensively surveying different approaches toward FGTA, we introduce their input traffic data, elaborate on their operating principles by different use cases, indicate their limitations and countermeasures, and raise several promising future research avenues.",
    "citationCount": 7,
    "referenceCount": 305
}