{
    "paperId": "076bbb9efd68a1096f30d118cbed211e8597496c",
    "title": "Systemic interindividual epigenetic variation in humans is associated with transposable elements and under strong genetic control",
    "year": 2022,
    "venue": "bioRxiv",
    "authors": [
        "Chathura J Gunasekara",
        "Harry MacKay",
        "C. A. Scott",
        "Shaobo Li",
        "Eleonora Laritsky",
        "Maria S. Baker",
        "S. Grimm",
        "G. Jun",
        "Yumei Li",
        "Rui Chen",
        "J. Wiemels",
        "C. Coarfa",
        "R. Waterland"
    ],
    "doi": "10.1186/s13059-022-02827-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/076bbb9efd68a1096f30d118cbed211e8597496c",
    "isOpenAccess": true,
    "openAccessPdf": "https://genomebiology.biomedcentral.com/counter/pdf/10.1186/s13059-022-02827-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Genetic variants can modulate phenotypic outcomes via epigenetic intermediates, for example at methylation quantitative trait loci (mQTL). We present the first large-scale assessment of mQTL at human genomic regions selected for interindividual variation in CpG methylation, which we call correlated regions of systemic interindividual variation (CoRSIVs). These can be assayed in blood DNA and do not reflect interindividual variation in cellular composition. Results We use target-capture bisulfite sequencing to assess DNA methylation at 4086 CoRSIVs in multiple tissues from each of 188 donors in the NIH Gene-Tissue Expression (GTEx) program. At CoRSIVs, DNA methylation in peripheral blood correlates with methylation and gene expression in internal organs. We also discover unprecedented mQTL at these regions. Genetic influences on CoRSIV methylation are extremely strong (median R 2 =0.76), cumulatively comprising over 70-fold more human mQTL than detected in the most powerful previous study. Moreover, mQTL beta coefficients at CoRSIVs are highly skewed (i.e., the major allele predicts higher methylation). Both surprising findings are independently validated in a cohort of 47 non-GTEx individuals. Genomic regions flanking CoRSIVs show long-range enrichments for LINE-1 and LTR transposable elements; the skewed beta coefficients may therefore reflect evolutionary selection of genetic variants that promote their methylation and silencing. Analyses of GWAS summary statistics show that mQTL polymorphisms at CoRSIVs are associated with metabolic and other classes of disease. Conclusions A focus on systemic interindividual epigenetic variants, clearly enhanced in mQTL content, should likewise benefit studies attempting to link human epigenetic variation to the risk of disease.",
    "citationCount": 27,
    "referenceCount": 95
}