{
    "paperId": "0770963d895c31e3f73d5d9708517511fea27143",
    "title": "Mass: Workload-Aware Storage Policy for OpenStack Swift",
    "year": 2020,
    "venue": "International Conference on Parallel Processing",
    "authors": [
        "Yu Chen",
        "Wei Tong",
        "D. Feng",
        "Zike Wang"
    ],
    "doi": "10.1145/3404397.3404427",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0770963d895c31e3f73d5d9708517511fea27143",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A cloud object store entails serving workloads of multi tenants. Different applications have different access characteristics and various performance requirements. Thus, it is necessary for the cloud object store to provide tenant-specific policies. OpenStack Swift develops a storage policy mechanism to enable separate storage configurations for different applications. However, the limited configurability of the policy mechanism makes it difficult to provide efficient and flexible policies to meet the evolving needs of the applications. First, original policies only control the frontend paths of the request forwarding without covering the backend paths of the request processing. Thus, they cannot provide sufficient optimizations for workload performance. Second, those policies need to be pre-defined and remain unchanged at runtime, so that they lack the flexibility to adapt to the possible workload changes during runtime. In addition, effective execution of tenant-specific policies is based on the premise that all storage layers are aware of the requests’ sources, while the storage server layer lacks the requisite information to distinguish requests from multi tenants. In this paper, we propose Mass, a programmable framework to provide the enhanced storage policies for diverse workloads based on their access characteristics. Mass intercepts the incoming requests, and collects the requisite metrics to analyze the workload characteristics and track their changes. Policies are specified to provide flexible optimizations for the workloads. By separating the policy control from the actual storage, the policies can be enforced over the full storage paths of the requests and be dynamically adjusted during runtime to adapt to the workload changes. Compared with the setup of original policies, the latency and throughput of workloads are improved by up to 81.6% and 231.5%, respectively.",
    "citationCount": 3,
    "referenceCount": 29
}