{
    "paperId": "07ad1497cb87da3978ce0cebf6c87806d2415c66",
    "title": "Online and Offline Fault Detection and Diagnostics in a Nuclear Power Plant Condenser",
    "year": 2024,
    "venue": "Annual Conference of the PHM Society",
    "authors": [
        "Ark O. Ifeanyi",
        "Jamie Coble"
    ],
    "doi": "10.36001/phmconf.2024.v16i1.3934",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/07ad1497cb87da3978ce0cebf6c87806d2415c66",
    "isOpenAccess": true,
    "openAccessPdf": "https://papers.phmsociety.org/index.php/phmconf/article/download/3934/phmc_24_3934",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nuclear power plants (NPPs) face significant financial pressures due to operational and maintenance costs. This research investigates Fault Detection and Diagnostics (FDD) techniques to optimize maintenance schedules and reduce expenses. The NPP condenser plays a critical role in converting turbine exhaust steam back into water for reuse. Condenser tube fouling, a prevalent fault mode, impedes heat transfer efficiency and can lead to decreased plant efficiency and safety risks. This study proposes an FDD framework that leverages raw signal analyses from temperature and pressure monitoring to detect and diagnose condenser tube fouling in both online and offline settings. The online approach facilitates close-to-real-time predictions, enabling proactive maintenance strategies. Additionally, the framework explores incorporating a condenser’s maintenance history for enhanced diagnostics. We employ a dataset obtained from a simulated nuclear power plant condenser using the Asherah Nuclear Power Plant Simulator (ANS). ANS replicates the operational dynamics of a pressurized water reactor (PWR) type NPP. The proposed methodology utilizes an encoder-decoder (E-D) structured 1DCNN model to analyze the raw signals. The research demonstrates consistent and accurate fault detection and diagnostics for condenser tube fouling in both online and offline scenarios. A high potential for generalization to unseen conditions was observed. However, online detection using small data windows necessitates caution due to potential false alarms around the transition points. Our findings pave the way for further exploration of robust diagnostics by accommodating a wider spectrum of fouling rates within degradation classes using ANS. This combined online and offline FDD approach offers a promising solution for promoting operational safety, efficiency, and cost-effectiveness in NPP condensers.",
    "citationCount": 1,
    "referenceCount": 39
}