{
    "paperId": "07cc897e6cb26b327fb6376a20600253a58a099c",
    "title": "Machine learning-driven optimization of culture conditions and media components to mitigate charge heterogeneity in monoclonal antibody production: current advances and future perspectives",
    "year": 2025,
    "venue": "mAbs",
    "authors": [
        "Hossein Kavoni",
        "Iman Shahidi Pour Savizi",
        "Saratram Gopalakrishnan",
        "Nathan E. Lewis",
        "S. Shojaosadati"
    ],
    "doi": "10.1080/19420862.2025.2547084",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/07cc897e6cb26b327fb6376a20600253a58a099c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Charge heterogeneity in monoclonal antibodies (mAbs), caused by post-translational modifications, remains a substantial obstacle to ensuring consistent, stable, and effective therapeutics. Conventional optimization techniques, such as one-factor-at-a-time and design of experiments, often fail to capture the complex, nonlinear interactions between culture parameters (e.g. pH, temperature, duration) and medium components (e.g. glucose, metal ions, amino acids). This review highlights machine learning (ML) as a powerful approach for modeling these relationships and forecasting charge variant profiles in CHO cell-based mAb process development. We summarize supervised learning and regression methods used to link process conditions with charge heterogeneity and present case studies showing ML’s role in reducing acidic and basic variants. We also discuss challenges related to data quality, model interpretability, scalability, and regulatory compliance. Finally, we propose a roadmap for adaptive, ML-driven optimization strategies for bioprocess development, aligned with Quality-by-Design principles.",
    "citationCount": 0,
    "referenceCount": 129
}