{
    "paperId": "07cd0a8253c97464184eb9d9e412e5d754a751b3",
    "title": "To pre-filter, or not to pre-filter, that is the query: A multi-campus big data study",
    "year": 2022,
    "venue": "Journal of Library and Information Sciences",
    "authors": [
        "Heather L. Cribbs",
        "Gabriel J. Gardner"
    ],
    "doi": "10.1177/09610006221124609",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/07cd0a8253c97464184eb9d9e412e5d754a751b3",
    "isOpenAccess": true,
    "openAccessPdf": "http://eprints.rclis.org/43595/1/Cribbs_Gardner_2022_JoLIS_postprint.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Library discovery platforms, which provide searchable user interfaces as their front-facing layer, aggregate tremendous amounts of metadata from multiple data streams describing a wide variety of print and electronic resources. Complicating the matter further, resources may differ in availability or delivery time depending not only on their media but also upon the source of the data stream describing them. How should libraries structure end users’ options for searching discovery platforms in light of the many options available? This study used a nonexperimental design and quantitative methods to analyze users’ revealed preferences for query type in twenty-four academic libraries in a data set containing metadata, sans queries, for over 64 million searches. Libraries studied were all located in California, used the same discovery layer software, and served similar user and faculty constituencies; however, the number of query types and pre-filtering options available differed between institutions. Results show that, when users were presented with the choice between search options, most conducted simple, more broad searches rather than complex and specific searches. When search options were highly constrained by the default choice architecture, but complex searches were possible, few users opted out of the default simple search. Implications for usability of discovery layers and the motivations of librarians in choice architecture are nontrivial and are discussed. The desires of librarians and “power user” faculty must be balanced with the fact that most users are novices and users of all abilities are largely habituated to commercial search products which emphasize post-search results filtering.",
    "citationCount": 1,
    "referenceCount": 48
}