{
    "paperId": "07cf031ea721e643b1bc9feb1e17a2297086acb6",
    "title": "Deep reinforcement learning-based active flow control of an elliptical cylinder: Transitioning from an elliptical cylinder to a circular cylinder and a flat plate",
    "year": 2024,
    "venue": "The Physics of Fluids",
    "authors": [
        "Wang Jia",
        "Hang Xu"
    ],
    "doi": "10.1063/5.0218408",
    "arxivId": "2404.13003",
    "url": "https://www.semanticscholar.org/paper/07cf031ea721e643b1bc9feb1e17a2297086acb6",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2404.13003",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study the adaptability of deep reinforcement learning (DRL)-based active flow control (AFC) technology for bluff body flows with complex geometries. It is extended from a cylinder with an aspect ratio Ar = 1 to a flat elliptical cylinder with Ar = 2, slender elliptical cylinders with Ar less than 1, and a flat plate with Ar = 0. We utilize the Proximal Policy Optimization (PPO) algorithm to precisely control the mass flow rates of synthetic jets located on the upper and lower surfaces of a cylinder to achieve reduction in drag, minimization of lift, and suppression of vortex shedding. Our research findings indicate that, for elliptical cylinders with Ar between 1.75 and 0.75, the reduction in drag coefficient ranges from 0.9% to 15.7%, and the reduction in lift coefficient ranges from 95.2% to 99.7%. The DRL-based control strategy not only significantly reduces lift and drag, but also completely suppresses vortex shedding while using less than 1% of external excitation energy, demonstrating its efficiency and energy-saving capabilities. Additionally, for Ar from 0.5 to 0, the reduction in drag coefficient ranges from 26.9% to 43.6%, and the reduction in lift coefficient from 50.2% to 68.0%. This reflects the control strategy's significant reduction in both drag and lift coefficients, while also alleviating vortex shedding. The interaction and nonlinear development of vortices in the wake of elliptical cylinders lead to complex flow instability, and DRL-based AFC technology shows adaptability and potential in addressing flow control problems for this type of bluff body flow.",
    "citationCount": 11,
    "referenceCount": 69
}