{
    "paperId": "07e2fffed7ddd953ab773fe13dd2a37ca440b386",
    "title": "Machine Learning for Predictive Database Caching Strategies: A state-of-the-art review",
    "year": 2024,
    "venue": "International Conferences on Computing Advancements",
    "authors": [
        "Sadia Afrin",
        "Md Abdullah All Mahmud",
        "Abdus Salam",
        "Md Abdullah Al Jubair",
        "M. F. Mridha"
    ],
    "doi": "10.1145/3723178.3723250",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/07e2fffed7ddd953ab773fe13dd2a37ca440b386",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growth in database management, the need for effective caching strategies that handle dynamic user requests and improve system performance has become crucial. Traditional methods struggle to meet the demands of modern applications, pushing a shift toward more adaptable Machine Learning (ML) and Deep Learning (DL) solutions. ML and DL algorithms are applied to predictively cache data by analyzing historical access patterns, significantly reducing latency and improving efficiency. The effectiveness of various ML and DL models is explored across different technological domains. Findings reveal that ML and DL algorithms can optimize data preloading, evaluate the effectiveness of different strategies, and review recent advancements in the field. Successes and areas needing improvement are highlighted, providing a comparative analysis of the tested models. This study offers valuable insights into the challenges and potential directions for future research in database management, serving as an essential resource for researchers and practitioners aiming to leverage ML and DL for predictive caching.",
    "citationCount": 0,
    "referenceCount": 57
}