{
    "paperId": "07fc1889eef3c2a36a8fa411ec70a677c37f23e0",
    "title": "An Efficient Named-Data-Networking-Based IoT Cloud Framework",
    "year": 2020,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Xiaonan Wang",
        "Shaohao Cai"
    ],
    "doi": "10.1109/JIOT.2020.2971009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/07fc1889eef3c2a36a8fa411ec70a677c37f23e0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet-of-Things Cloud (IoTC) is a new Internet-of-Things (IoT) system, which aims to achieve rapid data retrieval. IoT typically uses the Internet protocol (IP)-based data delivery methods to retrieve data, but it is hard to employ the IP-based methods to achieve IoTC. The named data networking (NDN) presents a new data-centric paradigm, and its advantages may help achieve IoTC. Based on this observation, we are motivated to utilize NDN to achieve IoTC. However, due to different architectures and working mechanisms, it is challenging to deploy NDN in IoT. For instance, NDN employs reverse paths and limited flooding to retrieve data, which might cause frequent data acquisition failures and considerable costs in mobile environments such as IoT. Moreover, NDN lacks effective mobility support strategies, which deteriorates the situation. Taking these challenges into account, we propose an efficient NDN-based IoT cloud framework and aim to improve data retrieval success rates and reduce costs. In this framework, consumers employ unicast to acquire data from the nearest IoTC member via one data retrieval process and node mobility is supported to ensure the successful reception of data. The framework is quantitatively evaluated, and the data results show that our framework enhances the data acquisition success rate by nearly 8.4% and reduces the cost by nearly 41.8% compared with the IoTC approach.",
    "citationCount": 28,
    "referenceCount": 40
}