{
    "paperId": "080ea2d4bf0f2b8792e33f273764f2c948a284fc",
    "title": "Enhancing Data Use Ontology (DUO) for health-data sharing by extending it with ODRL and DPV",
    "year": 2024,
    "venue": "Semantic Web",
    "authors": [
        "H. Pandit",
        "Beatriz Esteves"
    ],
    "doi": "10.3233/sw-243583",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/080ea2d4bf0f2b8792e33f273764f2c948a284fc",
    "isOpenAccess": true,
    "openAccessPdf": "https://content.iospress.com:443/download/semantic-web/sw243583?id=semantic-web%2Fsw243583",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Global Alliance for Genomics and Health is an international consortium that is developing the Data Use Ontology (DUO) as a standard providing machine-readable codes for automation in data discovery and responsible sharing of genomics data. DUO concepts, which are encoded using OWL, only contain the textual descriptions of the conditions for data use they represent, and do not specify the intended permissions, prohibitions, and obligations explicitly – which limits their usefulness. We present an exploration of how the Open Digital Rights Language (ODRL) can be used to explicitly represent the information inherent in DUO concepts to create policies that are then used to represent conditions under which datasets are available for use, conditions in requests to use them, and to generate agreements based on a compatibility matching between the two. We also address a current limitation of DUO regarding specifying information relevant to privacy and data protection law by using the Data Privacy Vocabulary (DPV) which supports expressing legal concepts in a jurisdiction-agnostic manner as well as for specific laws like the GDPR. Our work supports the existing socio-technical governance processes involving use of DUO by providing a complementary rather than replacement approach. To support this and improve DUO, we provide a description of how our system can be deployed with a proof of concept demonstration that uses ODRL rules for all DUO concepts, and uses them to generate agreements through matching of requests to data offers. All resources described in this article are available at: https://w3id.org/duodrl/repo.",
    "citationCount": 8,
    "referenceCount": 26
}