{
    "paperId": "08298577e56ad094cdbfa9d7ac4305db75ebb3c1",
    "title": "WavingSketch: An Unbiased and Generic Sketch for Finding Top-k Items in Data Streams",
    "year": 2020,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Zirui Liu",
        "Fenghao Dong",
        "Chengwu Liu",
        "Xiangwei Deng",
        "Tong Yang",
        "Yikai Zhao",
        "Jizhou Li",
        "B. Cui",
        "Gong Zhang"
    ],
    "doi": "10.1145/3394486.3403208",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/08298577e56ad094cdbfa9d7ac4305db75ebb3c1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Finding top-k items in data streams is a fundamental problem in data mining. Existing algorithms that can achieve unbiased estimation suffer from poor accuracy. In this paper, we propose a new sketch, WavingSketch, which is much more accurate than existing unbiased algorithms. WavingSketch is generic, and we show how it can be applied to four applications: finding top-k frequent items, finding top-k heavy changes, finding top-k persistent items, and finding top-k Super-Spreaders. We theoretically prove that WavingSketch can provide unbiased estimation, and then give an error bound of our algorithm. Our experimental results show that, compared with the state-of-the-art, WavingSketch has 4.50 times higher insertion speed and up to 9 x 106 times (2 x 104 times in average) lower error rate in finding frequent items when memory size is tight. For other applications, WavingSketch can also achieve up to 286 times lower error rate. All related codes are open-sourced and available at Github anonymously.",
    "citationCount": 95,
    "referenceCount": 58
}