{
    "paperId": "08528d734076c933917798ae248719b4c359a148",
    "title": "Ensemble Stacking Method of Classifying the Stages of Alzheimer's Disease by using MRI Dataset",
    "year": 2024,
    "venue": "International Journal of Artificial Intelligence",
    "authors": [
        "Nagarathna",
        "Kusuma",
        "Harsha Huliyappa"
    ],
    "doi": "10.36079/lamintang.ijai-01102.602",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/08528d734076c933917798ae248719b4c359a148",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Alzheimer's Disease (AD) is a progressive neurological disorder that gradually impairs an individual's memory, reasoning, and ability to perform daily tasks. Early and accurate diagnosis of AD is essential for effective intervention, yet remains challenging due to the complexity of its progression. This study explores the use of an ensemble stacking approach to evaluate the effectiveness of transfer learning techniques in classifying various stages of Alzheimer's disease. Unlike traditional methods that directly analyze raw brain images, this research implements a preprocessing technique using the Markov Random Field method to extract the brain tissues specifically affected by AD. These segmented brain tissues are then utilized to train base models, consisting of three convolutional neural networks (CNNs) with varying configurations. The predictions of these base models are ensembled and further refined through a second-level meta-model to enhance classification accuracy. The proposed ensemble stacking framework was evaluated using an MRI dataset obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI), which contains images categorized into Alzheimer’s disease (AD), Mild Cognitive Impairment (MCI), and Healthy Control (HC) groups. The meta-model demonstrated superior performance, achieving an average accuracy of 97%, along with high precision, recall, and F1 scores. This study highlights the potential of ensemble learning and transfer learning in advancing AD diagnosis, offering a robust and efficient approach for categorizing its various stages based on medical imaging data.",
    "citationCount": 0,
    "referenceCount": 15
}