{
    "paperId": "0874c0926d6165e2aba613aed0767b839a9759da",
    "title": "Practical and General-Purpose Flow-Level Inference With Random Forests in Programmable Switches",
    "year": 2025,
    "venue": "IEEE Transactions on Networking",
    "authors": [
        "Aristide T.-J. Akem",
        "Beyza Bütün",
        "Michele Gucciardo",
        "Marco Fiore"
    ],
    "doi": "10.1109/TON.2025.3564465",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0874c0926d6165e2aba613aed0767b839a9759da",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Integrating machine learning (ML) models directly in the network user plane enables inference on data traffic at line rate, and can dramatically reduce the latency and improve the scalability of key functionalities like traffic classification or intrusion detection. Yet, the hardware that can be used for this purpose, in particular programmable switches, present stringent constraints in terms of limited memory and little support for mathematical operations or data types that render ML model deployment a substantial technical challenge. In this paper, we make a step forward in user-plane ML by introducing <monospace>Flowrest</monospace>, a solution that redefines the state of the art in flow-level inference for programmable switches. <monospace>Flowrest</monospace> allows implementing general-purpose Random Forest (RF) models in industry-grade switches by (<inline-formula> <tex-math notation=\"LaTeX\">$\\boldsymbol {i}$ </tex-math></inline-formula>) suitably handling stateful flow-level (FL) features in the switch ASIC, (<inline-formula> <tex-math notation=\"LaTeX\">$\\boldsymbol {ii}$ </tex-math></inline-formula>) achieving low-collision flow management, and (<inline-formula> <tex-math notation=\"LaTeX\">$\\boldsymbol {iii}$ </tex-math></inline-formula>) customizing RF models right from the design phase for in-switch operation. We develop <monospace>Flowrest</monospace> as an open-source software using the P4 language and evaluate its performance in an experimental testbed with Intel Tofino switches. Experiments with inference tasks of varying complexity prove that our solution improves accuracy by over 10 percent points on average with respect to the second-best competitor out of five recent approaches for RF-based in-switch inference, while maintaining sub-microsecond latency.",
    "citationCount": 1,
    "referenceCount": 87
}