{
    "paperId": "0891d78fcda72b0ca79672b2c7c74f2e61bb6068",
    "title": "Refining tomato disease recognition: hyperparameter tuning on ResNet-101 architecture for precise leaf-based classification",
    "year": 2024,
    "venue": "Indonesian Journal of Electrical Engineering and Computer Science",
    "authors": [
        "Tegar Arifin Prasetyo",
        "Tiurma Lumban Gaol",
        "Nico Felix Sipahutar",
        "Tessalonika Siahaan",
        "Trito Exaudi Manik",
        "Rudy Chandra"
    ],
    "doi": "10.11591/ijeecs.v34.i2.pp1204-1213",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0891d78fcda72b0ca79672b2c7c74f2e61bb6068",
    "isOpenAccess": true,
    "openAccessPdf": "https://ijeecs.iaescore.com/index.php/IJEECS/article/download/35840/18267",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tomatoes plants are widely recognized as versatile vegetables globally. This study aims to develop a high-precision web interface for classifying various leaf diseases in tomatoes. Utilizing a convolutional neural network (CNN) algorithm using the residual network-101 (ResNet-101) architecture, this tool aids farmers in accurately identifying leaf diseases in tomatoes, thereby reducing the risk of crop failure. The dataset comprises 6,800 images, categorized into four classes: early blight, spider mites two spotted, tomato yellow leaf curl virus, and healthy tomatoes, each containing 1,700 images. Hyperparameter tuning was conducted as part of an experiment aimed at enhancing the performance of the model. Experiments involved varying epoch values (10, 25, 30, 50, 60, 75, 100, and 110), a fixed batch size of 4, different learning rates (0.1, 0.01, 0.001, 0.0001), and num workers (4, 8, 16). The results demonstrated an accuracy of 99% with 100 epochs, a batch size of 4, a learning rate of 0.001, and 16 num workers. Consequently, this research contributes to a deeper understanding of disease management in tomato plants, ensuring optimal quality and quantity of the harvest.",
    "citationCount": 1,
    "referenceCount": 30
}