{
    "paperId": "08ba4e88251e73f06555155f2f99e0bf8b66d3cc",
    "title": "Updating an Adaptive Spatial Index",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Fatemeh Zardbani",
        "Konstantinos Lampropoulos",
        "Nikos Mamoulis",
        "Panagiotis Karras"
    ],
    "doi": "10.1109/ICDE65448.2025.00094",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/08ba4e88251e73f06555155f2f99e0bf8b66d3cc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Adaptive indexing allows for the progressive and simultaneous query-driven exploration and indexing of memoryresident data, starting as soon as they become available without upfront indexing. This technique has been so far applied to onedimensional and multidimensional data, as well as to objects with spatial extent arising in geographic information systems. However, existing spatial adaptive indexing methods cater to static data made available in an one-off manner. To date, no spatial adaptive indexing method can ingest data updates interleaved with data exploration. In this paper we introduce GLIDE, a novel method that intertwines the adaptive indexing and incremental updating of a spatial-object data set. GLIDE builds a hierarchical spatial index incrementally in response to queries and also ingests updates judiciously into it. We examine several design choices and settle for a variant that combines gradual self-driven top-down insertions with query-driven indexing operations. In an extensive experimental comparison, we show that GLIDE achieves a lower cumulative cost than upfront-indexing methods and adaptiveindexing baselines.",
    "citationCount": 1,
    "referenceCount": 40
}