{
    "paperId": "08eddcb4c82bcc8b38c98ec98638507b4342e26c",
    "title": "Machine Learning Inference Pipeline Execution Using Pure SQL Based on Operator Fusion",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Qingfeng Pan",
        "Jiahe Zhi",
        "Chenyang Zhang",
        "Chen Xu",
        "Zhao Zhang",
        "Anita Shao",
        "Guanglei Bao",
        "Qiu Cui",
        "Xiaowei Chen",
        "Aoying Zhou"
    ],
    "doi": "10.1109/ICDE65448.2025.00254",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/08eddcb4c82bcc8b38c98ec98638507b4342e26c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deploying machine learning (ML) inference pipelines in databases become increasingly prevalent in many applications. In order to avoid data transfer between the database and ML runtimes, existing ML2SQL frameworks parse ML pipelines to a graph consisting of ML operators and then translate it into pure SQL. Nevertheless, they typically rewrite the graph without operator fusion or only consider the fusion between certain operators such as StandardScaler and tree inference. However, there are various operators in ML pipelines, which have rich fusion opportunities between each other. To fully exploit operator fusion for graph rewriting, we classify widely used ML operators and design fusion rules driven by their characteristics. Moreover, rewriting the original graph by fusion rules produces candidate graphs that generate SQLs with different execution time. We employ an enumeration-based strategy to search for the graph with the lowest cost. However, this strategy may suffer from the combination explosion on search space for complex ML pipelines. To reduce this space, we propose a greedy-based strategy by exploiting the independence among ML operators. We implement a novel ML2SQL framework as a portable plugin for databases, namely Craftsman. Our experimental evaluations show that, in comparison to the existing approaches, Craftsman generates efficient SQL queries which achieves an average speedup of 2.9x on popular databases such as DuckDB.",
    "citationCount": 0,
    "referenceCount": 52
}