{
    "paperId": "08f4fafedff16df5973a660c7e90eaae84060782",
    "title": "An Empirical Study on Decision-Making Aspects in Responsible Software Engineering for AI",
    "year": 2025,
    "venue": "2025 IEEE/ACM 47th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)",
    "authors": [
        "Lekshmi Murali Rani",
        "Faezeh Mohammadi",
        "R. Feldt",
        "Richard Berntsson-Svensson"
    ],
    "doi": "10.1109/ICSE-SEIP66354.2025.00056",
    "arxivId": "2501.15691",
    "url": "https://www.semanticscholar.org/paper/08f4fafedff16df5973a660c7e90eaae84060782",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Incorporating responsible practices into Software Engineering (SE) for Artificial Intelligence (AI) is essential to ensure ethical principles, societal impact, and accountability remain at the forefront of AI system design and deployment. This study investigates the ethical challenges and complexities inherent in Responsible Software Engineering (RSE) for AI, underscoring the need for practical, scenario-driven operational guidelines. Given the complexity of AI and the relative inexperience of professionals in this rapidly evolving field, continuous learning and market adaptation are crucial. Through qualitative interviews with seven practitioners (conducted until saturation), quantitative surveys of $\\mathbf{5 1}$ practitioners and static validation of results with four industry experts in AI, this study explores how personal values, emerging roles, and awareness of AI's societal impact influence responsible decision-making in RSE for AI. A key finding is the gap between the current state of the art and actual practice in RSE for AI, particularly in the failure to operationalize ethical and responsible decision-making within the Software Engineering Life Cycle (SELC) for AI. While ethical issues in RSE for AI largely mirror those found in broader SE process, the study highlights a distinct lack of operational frameworks and resources to guide RSE practices for AI effectively. The results reveal that current ethical guidelines are insufficiently implemented at the operational level, reinforcing the complexity of embedding ethics throughout the SELC. The study concludes that interdisciplinary collaboration, H-shaped competencies (Ethical-Technical dual competence), and a strong organizational culture of ethics are critical for fostering RSE practices for AI, with a particular focus on transparency and accountability.",
    "citationCount": 1,
    "referenceCount": 46
}