{
    "paperId": "0927b562ead4d0341c508a2e8028b60fac8ade49",
    "title": "Research on Blockchain Scaling Based on Smart Contracts: Using state channel technology to increase the transaction capacity of the blockchain, and proposing a trusted state channel to counter the capacity reduction caused by malicious node attacks",
    "year": 2024,
    "venue": "Proceedings of the International Conference on Digital Economy, Blockchain and Artificial Intelligence",
    "authors": [
        "Zhixing Zhang",
        "Jing Cheng",
        "Libo Feng",
        "Junhong Liu",
        "Zehui Yuan",
        "Peng Wu",
        "Jiale Xie",
        "Zhuxian Ma",
        "Jie Gong"
    ],
    "doi": "10.1145/3700058.3700102",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0927b562ead4d0341c508a2e8028b60fac8ade49",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the acceptance and usage rate of blockchain technology increasing year by year, various blockchain-based applications have been developed, and an increasing number of users have participated in the blockchain system. Therefore, it is of crucial importance to ensure the transaction requirements of participating users, especially to guarantee that the blockchain can provide services to users efficiently and reliably. Establishing a transaction solution that can operate in a distrustful environment and ensure transaction capacity is vital for the development and popularization of the blockchain. This paper addresses the shortcomings of the existing blockchain state channel expansion solutions, such as the low ability to prevent malicious nodes and the transaction speed being easily affected by malicious nodes, and proposes a trusted state channel solution that uses a reputation score mechanism to screen leading nodes. Through a large number of experiments and verifications, the proposed off-chain capacity expansion solution of the trusted state channel reduces the consensus overhead in blockchain transactions, increases the transaction capacity of the blockchain, and improves the transaction speed of the blockchain. By introducing a node credit system, this expansion solution has a strong resistance to attacks from malicious nodes and increases the stability of the system. The trusted state channel solution significantly improves the blockchain transaction speed and solves the blockchain capacity problem. The off-chain transaction speed is more than 15 times higher than that on the chain, and the on-chain capacity expansion method of increasing the transaction capacity by increasing the block size can also increase the capacity of the trusted state channel.",
    "citationCount": 0,
    "referenceCount": 14
}