{
    "paperId": "092feb293eed9fdd02d015f9e491634e94877d52",
    "title": "Evaluation Mechanism for Decentralized Collaborative Pattern Learning in Heterogeneous Vehicular Networks",
    "year": 2023,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Cheng Qiao",
        "Jing Qiu",
        "Zhiyuan Simon Tan",
        "G. Min",
        "A. Zomaya",
        "Zhihong Tian"
    ],
    "doi": "10.1109/TITS.2022.3186630",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/092feb293eed9fdd02d015f9e491634e94877d52",
    "isOpenAccess": true,
    "openAccessPdf": "https://napier-repository.worktribe.com/file/2884812/1/Evaluation%20Mechanism%20For%20Decentralised%20Collaborative%20Pattern%20Learning%20In%20Heterogeneous%20Vehicular%20Networks%20%28accepted%20version%29",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Collaborative machine learning, especially Federated Learning (FL), is widely used to build high-quality Machine Learning (ML) models in the Internet of Vehicles (IoV). In this paper, we study the performance evaluation problem in an inherently heterogeneous IoV, where the final models across the network are not identical and are computed on different standards. Previous studies assume that local agents are receiving data from the same phenomenon, and a same final model is fitted to them. However, this “one model fits all” approach leads to a biased performance evaluation of individual agents. We propose a general approach to measure the performance of individual agents, where the common knowledge and correlation between different agents are explored. Experimental results indicate that our evaluation scheme is efficient in these settings.",
    "citationCount": 5,
    "referenceCount": 45
}