{
    "paperId": "09b5328590423b408fdbbf13b566caeb8b26aa67",
    "title": "Galaxy Helm chart: a standardized method for deploying production Galaxy servers",
    "year": 2024,
    "venue": "Bioinform.",
    "authors": [
        "N. Goonasekera",
        "Alexandru Mahmoud",
        "Keith Suderman",
        "E. Afgan"
    ],
    "doi": "10.1093/bioinformatics/btae486",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/09b5328590423b408fdbbf13b566caeb8b26aa67",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/bioinformatics/advance-article-pdf/doi/10.1093/bioinformatics/btae486/58749467/btae486.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Motivation The Galaxy application is a popular open-source framework for data intensive sciences, counting thousands of monthly users across more than 100 public servers. To support a growing number of users and a greater variety of use cases, the complexity of a production-grade Galaxy installation has also grown, requiring more administration effort. There is a need for a rapid and reproducible Galaxy deployment method that can be maintained at high-availability with minimal maintenance. Results We describe the Galaxy Helm chart that codifies all elements of a production-grade Galaxy installation into a single package. Deployable on Kubernetes clusters, the chart encapsulates supporting software services and implements the best-practices model for running Galaxy. It is also the most rapid method available for deploying a scalable, production-grade Galaxy instance on one’s own infrastructure. The chart is highly configurable, allowing systems administrators to swap dependent services if desired. Notable uses of the chart include on-demand, fully-automated deployments on AnVIL, providing training infrastructure for the Bioconductor project, and as the AWS-recommended solution for running Galaxy on the Amazon cloud. Availability and implementation The source code for Galaxy Helm is available at https://github.com/galaxyproject/galaxy-helm, the corresponding Helm package at https://github.com/CloudVE/helm-charts, and the required Galaxy container image https://github.com/galaxyproject/galaxy-docker-k8s.",
    "citationCount": 1,
    "referenceCount": 13
}