{
    "paperId": "09f016a94cef14057da1ecf5ad88739321d46ff1",
    "title": "Development and validation of sex-linked molecular markers for rapid and accurate identification of male and female Hippophae tibetana plants",
    "year": 2024,
    "venue": "Scientific Reports",
    "authors": [
        "Zhefei Zeng",
        "Ruoqiu Wang",
        "Junwei Wang",
        "Yonghao Chen",
        "Yuguo Wang",
        "Zhiping Song",
        "Wenju Zhang",
        "L. Qiong"
    ],
    "doi": "10.1038/s41598-024-69918-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/09f016a94cef14057da1ecf5ad88739321d46ff1",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-024-69918-y",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hippophae tibetana, one of the highest-altitude woody plants endemic to the Qinghai-Tibet Plateau, primarily thrives on riverbanks formed by glacial meltwater. As a dioecious species, it demonstrates significant ecological and economic value in extreme alpine environments. However, the lack of sex identification techniques outside of the flowering period severely limits research on sex ratio, differentiation, and breeding. There is an urgent need to develop effective sex-linked molecular markers that are independent of developmental stages, but current research in this area remains limited. This study developed a set of accurate sex-linked molecular markers for the rapid identification of male and female individuals of H. tibetana. Through whole-genome resequencing of 32 sexually differentiated H. tibetana samples, this study offers strong evidence supporting chromosome 2 as the sex chromosome and successfully identified key loci related to sex determination on this chromosome. Utilizing these loci, we, for the first time, developed three reliable pairs of sex-specific molecular markers, which exhibited high accuracy during validation across various geographic populations, offering an effective tool for the sex identification of H. tibetana. Additionally, this study lays the groundwork for further research into the mechanisms of sex determination and the evolution of sex chromosomes in H. tibetana.",
    "citationCount": 6,
    "referenceCount": 34
}