{
    "paperId": "0a0909c4f3ac1c9732725af1dc480e947325db15",
    "title": "Differential susceptibility and role for senescence in CART cells based on costimulatory domains",
    "year": 2025,
    "venue": "Molecular Cancer",
    "authors": [
        "Ismail Can",
        "Elizabeth L. Siegler",
        "O. Sirpilla",
        "Claudia Manriquez-Roman",
        "Kun Yun",
        "C. Stewart",
        "Jennifer M Feigin",
        "Makena L Rodriguez",
        "Omar L Gutierrez-Ruiz",
        "E. Ogbodo",
        "T. Huynh",
        "Brooke L Kimball",
        "Long K Mai",
        "M. Hefazi",
        "L. Fonkoua",
        "Hong Xia",
        "I. Hamaidi",
        "Berke Alkan",
        "Fatih Sezer",
        "Huseyin Atakan Ekiz",
        "R. Sakemura",
        "S. Kenderian"
    ],
    "doi": "10.1186/s12943-025-02371-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0a0909c4f3ac1c9732725af1dc480e947325db15",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite the success of chimeric antigen receptor T (CART) cell therapy in hematological malignancies, durable remissions remain low. Here, we report CART senescence as a potential resistance mechanism in 41BB-costimulated CART cell therapy. To mimic cancer relapse, we utilized an in vitro model with repeated CART cell activation cycles followed by rest periods. Using CD19-targeted CART cells with costimulation via 4-1BB-CD3ζ (BBζ) or CD28-CD3ζ (28ζ), we showed that CART cells undergo functional, phenotypical, and transcriptomic changes of senescence, which is more prominent in BBζ. We then utilized two additional independent strategies to induce senescence through MYC activation and irradiation. Induction of senescence impaired BBζ activity but improved 28ζ activity in preclinical studies. These findings were supported by analyses of independent patient data sets; senescence signatures in CART cell products were associated with non-response to BBζ but with improved clinical outcomes in 28ζ treatment. In summary, our study identifies senescence as a potential mechanism of failure predominantly in 41BB-costimulated CART cells. Supplementary Information The online version contains supplementary material available at 10.1186/s12943-025-02371-1.",
    "citationCount": 0,
    "referenceCount": 73
}