{
    "paperId": "0a14c8c75710d6ea583799d8b0eeeb1b3c21d7d2",
    "title": "A Comprehensive State-of-the-Art Survey on Data Visualization Tools: Research Developments, Challenges and Future Domain Specific Visualization Framework",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "H. M. Shakeel",
        "S. Iram",
        "Hussain Al-Aqrabi",
        "Tariq A. A. Alsboui",
        "Richard Hill"
    ],
    "doi": "10.1109/ACCESS.2022.3205115",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0a14c8c75710d6ea583799d8b0eeeb1b3c21d7d2",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9668973/09881504.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data visualization is a powerful skill for the demonstration of meaningful data insights in an interactive and effective way. In this survey article, we collected 70 articles from last five years (2017-2022) to identify, classify, and investigate the various scopes, aspects and theories of data visualization. We also investigated the powerful applications of data visualization in various domains and fields such as visualization apps for health sector, Internet of things (IoTs), business dashboards, urban traffic management, smart buildings and environmental data visualization. However, after thorough investigation and classification, we conclude that, a comprehensive study is still missing about interactive, effective and efficient data visualization survey explaining basic current state-of-the-art best interactive visualization techniques, web-based tools and platforms, best performance theories, data structures and algorithms. In this survey article, we perform a thorough investigation to fill the gap on theoretical, analytical, statistical models and techniques for improving the performance of visualization. Current primary and domain specific future challenges are also reviewed, and related future research directions and opportunities are recommended.",
    "citationCount": 27,
    "referenceCount": 154
}