{
    "paperId": "0a1cd6f650aa731006415bc394a31ef2ce320032",
    "title": "Extracting TCPIP Headers at High Speed for the Anonymized Network Traffic Graph Challenge",
    "year": 2024,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Zhaoyang Han",
        "Andrew Briasco-Stewart",
        "Michael Zink",
        "Miriam Leeser"
    ],
    "doi": "10.1109/HPEC62836.2024.10938446",
    "arxivId": "2409.07374",
    "url": "https://www.semanticscholar.org/paper/0a1cd6f650aa731006415bc394a31ef2ce320032",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Field Programmable Gate Arrays (FPGAs) play a significant role in computationally intensive network processing due to their flexibility and efficiency. Particularly with the high-level abstraction of the P4 network programming model, FPGA shows a powerful potential for packet processing. By supporting the P4 language with FPGA processing, network researchers can create customized FPGA-based network functions and execute network tasks on accelerators directly connected to the network. A feature of the P4 language is that it is stateless; however, the FPGA implementation in this research requires state information. This is accomplished using P4 externs to describe the stateful portions of the design and to implement them on the FPGA using High-Level Synthesis (HLS). This paper demonstrates using an FPGA-based SmartNIC to efficiently extract source-destination IP address information from network packets and construct anonymized network traffic matrices for further analysis. The implementation is the first example of the combination of using P4 and HLS in developing network functions on the latest AMD FPGAs. Our design achieves a processing rate of approximately 95 Gbps with the combined use of P4 and High-level Synthesis and is able to keep up with 100 Gbps traffic received directly from the network.",
    "citationCount": 4,
    "referenceCount": 20
}