{
    "paperId": "0a2218df86bba102e7ef902fb18427b07d2542f5",
    "title": "Improving Machine Failure Prediction with Grey Wolf, Whale Optimization, and Optuna Techniques",
    "year": 2025,
    "venue": "Gazi university journal of science part a:engineering and innovation",
    "authors": [
        "Vahid Sinap"
    ],
    "doi": "10.54287/gujsa.1544942",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0a2218df86bba102e7ef902fb18427b07d2542f5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine failure prediction is crucial for minimizing downtime and optimizing maintenance strategies in industrial settings. This study aims to enhance the accuracy of machine failure prediction models by integrating advanced hyperparameter optimization techniques with feature selection methods. Various optimization techniques, including Optuna, Hyperopt, and Spearmint, were evaluated, along with feature selection methods utilizing Grey Wolf Optimization (GWO) and Whale Optimization Algorithm (WOA). The findings reveal that the CatBoost model optimized with GWO and Optuna achieved the highest performance, with an accuracy of 88.3%, an F1 score of 88.3%, and a Matthews Correlation Coefficient (MCC) of 76.7%. In comparison, WOA demonstrated competitive yet slightly lower results, with the best accuracy of 85.9% achieved using CatBoost and Optuna. The study also highlights that Linear Discriminant Analysis (LDA), optimized with Optuna, showed notable performance, with an accuracy of 86.0%, an F1 score of 85.8%, and an MCC of 74.6% without feature selection, which improved to 87.8%, 87.8%, and 76%, respectively, with GWO-based feature selection. The overall results indicate that GWO outperforms WOA in improving model performance, particularly when paired with advanced hyperparameter tuning techniques.",
    "citationCount": 0,
    "referenceCount": 35
}