{
    "paperId": "0a246e4b3cfd411fb3c48b92ab2e9af546da0a7b",
    "title": "QTL Mapping-Based Identification of Visceral White-Nodules Disease Resistance Genes in Larimichthys polyactis",
    "year": 2024,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "Qian Li",
        "Jiajie Zhu",
        "Sifang Liu",
        "Haowen Liu",
        "Tianle Zhang",
        "Ting Ye",
        "Bao Lou",
        "Feng Liu"
    ],
    "doi": "10.3390/ijms252010872",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0a246e4b3cfd411fb3c48b92ab2e9af546da0a7b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/ijms252010872",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Disease outbreaks in aquaculture have recently intensified. In particular, visceral white-nodules disease, caused by Pseudomonas plecoglossicida, has severely hindered the small yellow croaker (Larimichthys polyactis) aquaculture industry. However, research on this disease is limited. To address this gap, the present study employed a 100K SNP chip to genotype individuals from an F1 full-sib family, identify single nucleotide polymorphisms (SNPs), and construct a genetic linkage map for this species. A high-density genetic linkage map spanning a total length of 1395.72 cM with an average interval of 0.08 cM distributed across 24 linkage groups was obtained. Employing post-infection survival time as an indicator of disease resistance, 13 disease resistance-related quantitative trait loci (QTLs) were detected, and these regions included 169 genes. Functional enrichment analyses pinpointed 11 candidate disease resistance-related genes. RT-qPCR analysis revealed that the genes of chmp1a and arg1 are significantly differentially expressed in response to P. plecoglossicida infection in spleen and liver tissues, indicating their pivotal functions in disease resistance. In summary, in addition to successfully constructing a high-density genetic linkage map, this study reports the first QTL mapping for visceral white-nodules disease resistance. These results provide insight into the intricate molecular mechanisms underlying disease resistance in the small yellow croaker.",
    "citationCount": 2,
    "referenceCount": 92
}