{
    "paperId": "0a448b831e1331cbb73a54ebe0dfec415a5773c5",
    "title": "AI-coupled HPC Workflows",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "S. Jha",
        "V. Pascuzzi",
        "M. Turilli"
    ],
    "doi": "10.48550/arXiv.2208.11745",
    "arxivId": "2208.11745",
    "url": "https://www.semanticscholar.org/paper/0a448b831e1331cbb73a54ebe0dfec415a5773c5",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2208.11745",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Increasingly, scientific discovery requires sophisticated and scalable workflows. Workflows have become the ``new applications,'' wherein multi-scale computing campaigns comprise multiple and heterogeneous executable tasks. In particular, the introduction of AI/ML models into the traditional HPC workflows has been an enabler of highly accurate modeling, typically reducing computational needs compared to traditional methods. This chapter discusses various modes of integrating AI/ML models to HPC computations, resulting in diverse types of AI-coupled HPC workflows. The increasing need of coupling AI/ML and HPC across scientific domains is motivated, and then exemplified by a number of production-grade use cases for each mode. We additionally discuss the primary challenges of extreme-scale AI-coupled HPC campaigns -- task heterogeneity, adaptivity, performance -- and several framework and middleware solutions which aim to address them. While both HPC workflow and AI/ML computing paradigms are independently effective, we highlight how their integration, and ultimate convergence, is leading to significant improvements in scientific performance across a range of domains, ultimately resulting in scientific explorations otherwise unattainable.",
    "citationCount": 14,
    "referenceCount": 42
}