{
    "paperId": "0a7d928f311dca77e6d8bd80e8252c1c6d8da845",
    "title": "Experimental demonstration of highly reliable dynamic memristor for artificial neuron and neuromorphic computing",
    "year": 2022,
    "venue": "Nature Communications",
    "authors": [
        "See‐On Park",
        "Hakcheon Jeong",
        "Jongyong Park",
        "Jongmin Bae",
        "Shinhyun Choi"
    ],
    "doi": "10.1038/s41467-022-30539-6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0a7d928f311dca77e6d8bd80e8252c1c6d8da845",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41467-022-30539-6.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neuromorphic computing, a computing paradigm inspired by the human brain, enables energy-efficient and fast artificial neural networks. To process information, neuromorphic computing directly mimics the operation of biological neurons in a human brain. To effectively imitate biological neurons with electrical devices, memristor-based artificial neurons attract attention because of their simple structure, energy efficiency, and excellent scalability. However, memristor’s non-reliability issues have been one of the main obstacles for the development of memristor-based artificial neurons and neuromorphic computings. Here, we show a memristor 1R cross-bar array without transistor devices for individual memristor access with low variation, 100% yield, large dynamic range, and fast speed for artificial neuron and neuromorphic computing. Based on the developed memristor, we experimentally demonstrate a memristor-based neuron with leaky-integrate and fire property with excellent reliability. Furthermore, we develop a neuro-memristive computing system based on the short-term memory effect of the developed memristor for efficient processing of sequential data. Our neuro-memristive computing system successfully trains and generates bio-medical sequential data (antimicrobial peptides) while using a small number of training parameters. Our results open up the possibility of memristor-based artificial neurons and neuromorphic computing systems, which are essential for energy-efficient edge computing devices. Designing energy efficient, uniform and reliable memristive devices for neuromorphic computing remains a challenge. By leveraging the self-rectifying behavior of gradual oxygen concentration of titanium dioxide, Choi et al. develop a transistor-free 1R cross-bar array with good uniformity and high yield.",
    "citationCount": 215,
    "referenceCount": 52
}