{
    "paperId": "0ab84e93cc16bb11390638f67392e8bda15e0474",
    "title": "Sparse Adversarial Unrolling Network for Bearing Compound Fault Classification",
    "year": 2025,
    "venue": "IEEE Transactions on Instrumentation and Measurement",
    "authors": [
        "Chenxi Yang",
        "Saisai Chen",
        "Shuman Liu",
        "Wei Fan",
        "Chao Chen"
    ],
    "doi": "10.1109/TIM.2025.3561431",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0ab84e93cc16bb11390638f67392e8bda15e0474",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bearing compound fault classification is a key task for machinery maintenance. Label-consistent K-means singular value decomposition (LC-KSVD) has been widely applied for single-fault classification due to its strong interpretability. However, its efficiency is limited in compound fault classification due to the need for manually adjusted parameters and the complexities of fault coupling. To address these limitations, we propose a sparse adversarial unrolling network (SAU-Net), which incorporates a hard-threshold iterative sparse classification model based on traditional LC-KSVD, unrolled into an interpretable network. The parameter matrix is automatically optimized using a deep conditional generative adversarial network (DCGAN). Experimental results demonstrate that the proposed SAU-Net achieves higher classification accuracy and greater stability compared to state-of-art methods in compound fault classification, while maintaining strong interpretability.",
    "citationCount": 0,
    "referenceCount": 40
}