{
    "paperId": "0aca2086122a56daf3257c2deea314fba32f2daa",
    "title": "ARCH-COMP22 Category Report: Artificial Intelligence and Neural Network Control Systems (AINNCS) for Continuous and Hybrid Systems Plants",
    "year": 2022,
    "venue": "ARCH@SAFECOMP",
    "authors": [
        "Diego Manzanas Lopez",
        "Patrick Musau",
        "Hoang-Dung Tran",
        "Souradeep Dutta",
        "Taylor J. Carpenter",
        "Radoslav Ivanov",
        "Taylor T. Johnson"
    ],
    "doi": "10.29007/wfgr",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0aca2086122a56daf3257c2deea314fba32f2daa",
    "isOpenAccess": true,
    "openAccessPdf": "https://easychair.org/publications/open/C1J8",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with artificial intelligence (AI) components. Specifically, machine learning (ML) components in cyber-physical systems (CPS), such as feedforward neural networks used as feedback controllers in closed-loop systems are considered, which is a class of systems classically known as intelligent control systems, or in more modern and specific terms, neural network control systems (NNCS). We more broadly refer to this category as AI and NNCS (AINNCS). The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2022. In the fourth edition of this AINNCS category at ARCH-COMP, four tools have been applied to solve 10 different benchmark problems. There are two new participants: CORA and POLAR, and two previous participants: JuliaReach and NNV. The goal of this report is to be a snapshot of the current landscape of tools and the types of benchmarks for which these tools are suited. The results of this iteration significantly outperform those of any previous year, demonstrating the continuous advancement of this community in the past decade.",
    "citationCount": 32,
    "referenceCount": 62
}