{
    "paperId": "0adcafafa02344b1f5537b06e3d2a097543e6645",
    "title": "Online Minimum Spanning Trees with Weight Predictions",
    "year": 2023,
    "venue": "Workshop on Algorithms and Data Structures",
    "authors": [
        "Magnus Berg",
        "J. Boyar",
        "Lene M. Favrholdt",
        "Kim S. Larsen"
    ],
    "doi": "10.48550/arXiv.2302.12029",
    "arxivId": "2302.12029",
    "url": "https://www.semanticscholar.org/paper/0adcafafa02344b1f5537b06e3d2a097543e6645",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2302.12029",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We consider the minimum spanning tree problem with predictions, using the weight-arrival model, i.e., the graph is given, together with predictions for the weights of all edges. Then the actual weights arrive one at a time and an irrevocable decision must be made regarding whether or not the edge should be included into the spanning tree. In order to assess the quality of our algorithms, we define an appropriate error measure and analyze the performance of the algorithms as a function of the error. We prove that, according to competitive analysis, the simplest algorithm, Follow-the-Predictions, is optimal. However, intuitively, one should be able to do better, and we present a greedy variant of Follow-the-Predictions. In analyzing that algorithm, we believe we present the first random order analysis of a non-trivial online algorithm with predictions, by which we obtain an algorithmic separation. This may be useful for distinguishing between algorithms for other problems when Follow-the-Predictions is optimal according to competitive analysis.",
    "citationCount": 7,
    "referenceCount": 20
}