{
    "paperId": "0b6cc4397e1aff4e67486ad8412e70f08f9a60bc",
    "title": "Global Performance Guarantees for Neural Network Models of AC Power Flow",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Samuel C. Chevalier",
        "Spyros Chatzivasileiadis"
    ],
    "doi": "10.48550/arXiv.2211.07125",
    "arxivId": "2211.07125",
    "url": "https://www.semanticscholar.org/paper/0b6cc4397e1aff4e67486ad8412e70f08f9a60bc",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2211.07125",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning, which can generate extremely fast and highly accurate black-box surrogate models, is increasingly being applied to a variety of AC power flow problems. Rigorously verifying the accuracy of the resulting black-box models, however, is computationally challenging. This paper develops a tractable neural network verification procedure which incorporates the ground truth of the non-linear AC power flow equations to determine worst-case neural network prediction error. Our approach, termed Sequential Targeted Tightening (STT), leverages a loosely convexified reformulation of the original verification problem, which is an intractable mixed integer quadratic program (MIQP). Using the sequential addition of targeted cuts, we iteratively tighten our formulation until either the solution is sufficiently tight or a satisfactory performance guarantee has been generated. After learning neural network models of the 14, 57, 118, and 200-bus PGLib test cases, we compare the performance guarantees generated by our STT procedure with ones generated by a state-of-the-art MIQP solver, Gurobi 11.0. We show that STT often generates performance guarantees which are far tighter than the MIQP upper bound.",
    "citationCount": 8,
    "referenceCount": 42
}