{
    "paperId": "0b8c7f0f1bda34dc3350284681f43ccc770fbc99",
    "title": "Classification of Kitchen Utensils in Noisy Condition Using YOLOv5 with Multiple Deep Learning Backbones",
    "year": 2024,
    "venue": "2024 IEEE International Conference on Automatic Control and Intelligent Systems (I2CACIS)",
    "authors": [
        "Hashim Rosli",
        "Rozniza Ali",
        "A. M. Deris",
        "Muhammad Suzuri Hitam"
    ],
    "doi": "10.1109/I2CACIS61270.2024.10649881",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0b8c7f0f1bda34dc3350284681f43ccc770fbc99",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advancements in deep learning have greatly improved computer vision tasks, particularly in classifying kitchen utensils, which are essential for smart kitchen systems. Traditional methods struggle with real-world complexities, prompting the development of a new approach that combines YOLOv5 with multiple deep learning architectures like DenseNet, ResNet, and EfficientNet. This hybrid approach enhances accuracy and robustness by directly learning discriminative features from noisy images, utilizing YOLOv5's efficiency in real-time object detection while exploring various architectures for comprehensive feature extraction and representation learning. We aim to enhance classification performance in noisy kitchen settings by leveraging YOLOv5, renowned for its real-time object detection capabilities, and exploring various deep learning architectures. Kitchen utensil images are preprocessed, augmented, and trained using YOLOv5 with multiple backbones, then tested and evaluated for accuracy. Results reveal that EfficientNet-B0 as superior performers, achieving accuracy 93.10% over 50 epochs of training. This underscores the importance of selecting appropriate architectures, offering a promising solution for kitchen automation and smart systems while providing insights for similar real-world applications.",
    "citationCount": 1,
    "referenceCount": 22
}