{
    "paperId": "0b96f29119e92201d88f1b4faf8b564f18c0d54c",
    "title": "The Emerging Era Of Human-Ai Interaction: Keynote Address",
    "year": 2022,
    "venue": "International Conference on Information, Intelligence, Systems and Applications",
    "authors": [
        "M. Virvou"
    ],
    "doi": "10.1109/IISA56318.2022.9904422",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0b96f29119e92201d88f1b4faf8b564f18c0d54c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "At present, a major paradigm shift is taking place where computers are no longer solely executing human instructions but rather, they become agents with decision making capabilities through their AI empowered software. This leads to a whole emerging era of Human-AI Interaction which is increasingly affecting working and everyday lives of all people. The promise of AI is big in assisting humans through all sorts of interactive applications including smartphones, wearables, self-driving cars, smart homes, and offices, virtual assistants as well as contributing to the advancements of human achievements in science and arts. AI alleviates human cognitive overload both on the use of complex software and in difficult problem-solving situations, it provides orientation in the vast cyberspace navigation, it offers enlightening visions in huge accumulated human knowledge all through deep learning, machine learning, decision making methods, cognitive theories, fuzzy logic and more but with a degree of uncertainty and possible consequent errors in results. However, in this new kind of interaction, the human nature, capabilities, understanding, feelings, and needs remain unchanged and constitute the most important issue in the two-part dialogue, urging for more research on trustworthy and explainable AI.This paper aims to highlight important advantages and gains and discuss consequent challenges of the emerging human-AI interaction by presenting a critical overview of the state-of-the-art as well as the author’s personal point of view as to how this dialogue can acquire more explainability and trustworthiness while preserving usability.",
    "citationCount": 16,
    "referenceCount": 113
}