{
    "paperId": "0b9c166eccf33912f8dc36bd5cf31b49193481a8",
    "title": "A Geospatial Data and Model Hub for Online Geospatial Analysis",
    "year": 2023,
    "venue": "International Conference on Agro-Geoinformatics",
    "authors": [
        "Haipeng Deng",
        "P. Yue",
        "Dayu Yu",
        "Zhipeng Cao",
        "R. Liu",
        "Kaixuan Wang"
    ],
    "doi": "10.1109/Agro-Geoinformatics59224.2023.10233547",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0b9c166eccf33912f8dc36bd5cf31b49193481a8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, the availability of online geospatial analysis tools has increased, allowing users to access and manipulate large geospatial datasets and perform complex analyses through Web-based interfaces. It is still a challenge on how to manage geospatial resources including data and analysis functions in a distributed infrastructure. To address this issue, the study proposes a geospatial data and model hub approach for online geospatial analysis. Two core components, named the Data Center and the Model Center, are involved. The Data Center serves as a data hub for integrating, storing, and sharing geospatial datasets and metadata. It employs Cloud-optimized GeoTIFF (COG) and GeoCube for efficient handling of cloud-based data organization. The Model Center as a model hub focuses on the registration and sharing of geospatial analysis models, facilitating collaboration and interoperability among models. Both components are integrated into an online cloud-based geoprocessing platform, named the Open Geospatial Engine (OGE). The applicability is demonstrated through a case study involving the discovery, access, and manipulation of large datasets and models.",
    "citationCount": 3,
    "referenceCount": 15
}