{
    "paperId": "0ba0a6225f0241fa205a348a702e8294ce60efd0",
    "title": "ShaderTransformer: Predicting Shader Quality via One-shot Embedding for Fast Simplification",
    "year": 2022,
    "venue": "International Conference on Computer Graphics and Interactive Techniques",
    "authors": [
        "Yuchi Huo",
        "Shi Li",
        "Yazhen Yuan",
        "Xu Chen",
        "Rui Wang",
        "Wenting Zheng",
        "Hai Lin",
        "H. Bao"
    ],
    "doi": "10.1145/3528233.3530722",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0ba0a6225f0241fa205a348a702e8294ce60efd0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Given specific scene configurations and target functions, automatic shader simplification searches for the best simplified shader variant from an optimization space with many candidates. Although various speedup methods have been proposed, there is still a costly render-and-evaluate process to obtain variant’s performance and quality, especially when the scene changes. In this paper, we present a deep learning-based framework for predicting a shader’s simplification space, where the shader’s variants can be embedded into a metric space all at once for efficient quality evaluation. The novel framework allows the one-shot embedding of a space rather than a single instance. In addition, the simplification errors can be interpreted by mutual attention between shader fragments, presenting an informative focus-aware simplification framework that can assist experts in optimizing the codes. The results show that the new framework achieves significant speedup compared with existing search approaches. The focus-aware simplification framework reveals a new possibility of interpreting shaders for various applications.",
    "citationCount": 4,
    "referenceCount": 40
}