{
    "paperId": "0c41a5e00d4af36647ac39251471004782a3616f",
    "title": "Enhancing Robot Transparency in Human–Robot Prosthesis Interaction to Mitigate Terrain Misrecognition Error",
    "year": 2025,
    "venue": "IEEE Transactions on Medical Robotics and Bionics",
    "authors": [
        "I-Chieh Lee",
        "Ming Liu",
        "H. Huang"
    ],
    "doi": "10.1109/TMRB.2025.3552924",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0c41a5e00d4af36647ac39251471004782a3616f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Clear and effective communication between humans and robots is crucial when they work closely together. As wearable robots become more intelligent and automated, anticipatory control is limited for amputees because they lack prior knowledge of the timing and nature of changes in the robot’s motion, making human-machine collaboration more challenging. This study addresses the need for improved wearable robot transparency by enhancing a prosthetic controller to provide users with advanced notifications of locomotion mode changes. Five transfemoral amputees (TFA) wore our designed knee prosthesis and walked on a treadmill. We simulated a terrain misrecognition error by switching the locomotion mode from treadmill walking to stair ascent. Our study focused on three main questions: 1) What is the ideal timing that the TFAs need to mitigate for machine errors? 2) How do TFAs compensate for prosthetic knee errors? And 3) How does the robotic prosthetic leg respond to the TFAs’ corrective actions? We found that the enhanced transparency system helps TFAs anticipate changes and adjust their gait to compensate for the terrain misrecognition error. Specifically, providing notifications about 650 milliseconds before a locomotion mode change significantly reduced the effect of robot errors. Although the error compensation from TFAs resulted in a larger magnitude of error induced by the prosthetic knee, the TFAs were able to tolerate it and improve balance stability. According to questionnaires on user preferences, with notification of prosthetic knee motion, the TFAs could trust the device more even though the devices might have occasional errors. This study demonstrates that simple notifications of the robot’s movement intent enhance the predictability of prosthetic motion, facilitating anticipatory adjustments that improve safety and user trust.",
    "citationCount": 0,
    "referenceCount": 37
}