{
    "paperId": "0c606cdc1a9da71ee7ddaf46bfef2f7ce3db8323",
    "title": "ML on Chain: The Case and Taxonomy of Machine Learning on Blockchain",
    "year": 2023,
    "venue": "International Conference on Blockchain",
    "authors": [
        "Binbin Gu",
        "Abhishek A. Singh",
        "YINAN ZHOU",
        "Juncheng Fang",
        "Faisal Nawab"
    ],
    "doi": "10.1109/ICBC56567.2023.10174908",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0c606cdc1a9da71ee7ddaf46bfef2f7ce3db8323",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Blockchain has recently amassed a lot of interest from researchers and practitioners. This is due to its ability to manage data in a decentralized, transparent and accountable manner. However, blockchain applications are limited in terms of compute and cost effectiveness. These limits led to smart contracts—programs that are processed by the blockchain network—being relatively simple, not taking advantage of complex computation methods. In this paper, we shed light on the design space of using machine learning in blockchain applications (we call this ML on Chain for short). Although a lot of work discusses the intersection of blockchain and ML, there is little clarity in mapping, understanding, and evaluating the various approaches in this space. This paper contributes to this new area by the following: (1) we introduce a taxonomy of ML on Chain. This taxonomy considers existing and future potential methods in this area and groups them based on their design characteristics. We consider in the taxonomy five off-chain approaches and a baseline on-chain approach. (2) we perform an extensive experimental evaluation of ML on Chain methods. We compare the different 5 groups of solutions across different settings and three ML model types: logistic regression, k-nearest neighbors and neural networks. (3) Using the taxonomy and experimental study, we provide insights about the current state and challenges of the ML on Chain space; we use this newfound understanding to discuss potential future approaches and provide suggestions to address ML on Chain challenges.",
    "citationCount": 3,
    "referenceCount": 111
}