{
    "paperId": "0c9bd8ad08e3a250de78a423bfc2590d79701a16",
    "title": "Improving Data Entry Quality in Enterprise Applications With NLP Methods: A Model Proposal Based on BERT and Deep Learning",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Hikmet Canli"
    ],
    "doi": "10.1109/ACCESS.2025.3590983",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0c9bd8ad08e3a250de78a423bfc2590d79701a16",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In digital transformation, which is one of the most important keywords of our time, the completeness and accuracy of the data that users enter into applications directly affects the quality of the process, the accuracy of decision-making systems, and the speed at which data turns into information. Incorrect or incomplete data causes many problems such as prolonged approval processes, decreased trust in data, and negative impact on analysis capabilities. In this study, a data validation system was developed to improve the accuracy of risk management data collected from an ERP application and to minimize data entry errors. In order to prevent users from incorrectly entering or confusing important data such as Potential Risk, Internal Control, Control and Impact of the Risk during data entry, it is aimed to ensure accurate data entry by using NLP methods. Within the scope of the study, training was conducted on historical data and errors in user data entry were detected with various classification methods. Different methods such as BERT, RoBERTa, GPT-2, TFIDF+SVM, Word2Vec+SVM, Embedding GRU and Embedding LSTM were used to prevent these errors. The results show that the BERT model achieves the highest success rate with 94% accuracy. The strong language modelling capabilities of BERT gave it a significant advantage over other methods in detecting errors in data input.",
    "citationCount": 0,
    "referenceCount": 54
}