{
    "paperId": "0cb7ba4798e9bab7b18ed9fdc2a48e5a7bd014fc",
    "title": "Tighter Abstract Queries in Neural Network Verification",
    "year": 2022,
    "venue": "Logic Programming and Automated Reasoning",
    "authors": [
        "Elazar Cohen",
        "Y. Elboher",
        "Clark W. Barrett",
        "Guy Katz"
    ],
    "doi": "10.48550/arXiv.2210.12871",
    "arxivId": "2210.12871",
    "url": "https://www.semanticscholar.org/paper/0cb7ba4798e9bab7b18ed9fdc2a48e5a7bd014fc",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.12871",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks have become critical components of reactive systems in various do- mains within computer science. Despite their excellent performance, using neural networks entails numerous risks that stem from our lack of ability to understand and reason about their behavior. Due to these risks, various formal methods have been proposed for verify- ing neural networks; but unfortunately, these typically struggle with scalability barriers. Recent attempts have demonstrated that abstraction-refinement approaches could play a significant role in mitigating these limitations; but these approaches can often produce net- works that are so abstract, that they become unsuitable for verification. To deal with this issue, we present CEGARETTE, a novel verification mechanism where both the system and the property are abstracted and refined simultaneously. We observe that this approach allows us to produce abstract networks which are both small and sufficiently accurate, allowing for quick verification times while avoiding a large number of refinement steps. For evaluation purposes, we implemented CEGARETTE as an extension to the recently proposed CEGAR-NN framework. Our results are highly promising, and demonstrate a significant improvement in performance over multiple benchmarks.",
    "citationCount": 7,
    "referenceCount": 100
}