{
    "paperId": "0d0bc2930abe7d7180713864fb22b01c92f8836f",
    "title": "Multi - Direction Convolution for Semantic Segmentation",
    "year": 2021,
    "venue": "International Conference on Pattern Recognition",
    "authors": [
        "Dehui Li",
        "Z. Cao",
        "Ke Xian",
        "Xinyuan Qi",
        "Chao Zhang",
        "Hao Lu"
    ],
    "doi": "10.1109/ICPR48806.2021.9413174",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0d0bc2930abe7d7180713864fb22b01c92f8836f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Context is known to be one of crucial factors effecting the performance improvement of semantic segmentation. However, state-of-the-art segmentation models built upon fully convolutional networks are inherently weak in encoding contextual information because of stacked local operations such as convolution and pooling. Failing to capture context leads to inferior segmentation performance. Despite many context modules have been proposed to relieve this problem, they still operate in a local manner or use the same contextual information in different positions (due to upsampling). In this paper, we introduce the idea of Multi-Direction Convolution (MDC)-a novel operator capable of encoding rich contextual information. This operator is inspired by an observation that the standard convolution only slides along the spatial dimension $(x,y \\ \\text{direction})$ where the channel dimension $(z \\quad \\text{direction})$ is fixed, which renders slow growth of the receptive field (RF). If considering the channel-fixed convolution to be one-direction, MDC is multi-direction in the sense that MDC slides along both spatial and channel dimensions, i.e., it slides along $x,y$ when $z$ is fixed, along $x,z$ when $y$ is fixed, and along $y, z$ when $x$ is fixed. In this way, MDC is able to encode rich contextual information with the fast increase of the RF. Compared to existing context modules, the encoded context is position-sensitive because no upsampling is required. MDC is also efficient and easy to implement. It can be implemented with few standard convolution layers with permutation. We show through extensive experiments that MDC effectively and selectively enlarges the RF and outperforms existing contextual modules on two standard benchmarks, including Cityscapes and PASCAL VOC2012.",
    "citationCount": 0,
    "referenceCount": 28
}