{
    "paperId": "0d5be3ce511dede9902583bbfd3c393bfea786ae",
    "title": "Intelligent Load Balancing Systems using Reinforcement Learning System",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Raju Singh"
    ],
    "doi": "10.48550/arXiv.2505.07844",
    "arxivId": "2505.07844",
    "url": "https://www.semanticscholar.org/paper/0d5be3ce511dede9902583bbfd3c393bfea786ae",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Load Balancing is a fundamental technology for scaling cloud infrastructure. It enables systems to distribute incoming traffic across backend servers using predefined algorithms such as round robin, weighted round robin, least connections, weighted least connections, resource based, weighted response time, source IP hash, and URL hash. This approach has helped software developers, infrastructure engineers, and system administrators address many internet traffic related challenges across modern software architectures ranging from monolithic systems and traditional three tier models to microservices based applications. However, traditional traffic balancing techniques are increasingly becoming inadequate in optimizing distribution times. Existing algorithms are struggling to meet the rising demands of internet traffic, often resulting in degraded user experiences. To proactively address these issues particularly in areas like response time, distribution latency, and system uptime, we need to rethink how load balancing is implemented. Key challenges include traffic management, congestion control, intelligent scheduling, and the ability to determine when and when not to apply load balancing.",
    "citationCount": 0,
    "referenceCount": 5
}