{
    "paperId": "0d6b5d0410a0b0bee19e40b328fd937bb2c97d61",
    "title": "Text-Video Retrieval With Global-LocalSemantic Consistent Learning",
    "year": 2024,
    "venue": "IEEE Transactions on Image Processing",
    "authors": [
        "Haonan Zhang",
        "Pengpeng Zeng",
        "Lianli Gao",
        "Jingkuan Song",
        "Yihang Duan",
        "Xinyu Lyu",
        "Hengtao Shen"
    ],
    "doi": "10.1109/TIP.2025.3574925",
    "arxivId": "2405.12710",
    "url": "https://www.semanticscholar.org/paper/0d6b5d0410a0b0bee19e40b328fd937bb2c97d61",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Adapting large-scale image-text pre-training models, e.g., CLIP, to the video domain represents the current state-of-the-art for text-video retrieval. The primary approaches involve transferring text-video pairs to a common embedding space and leveraging cross-modal interactions on specific entities for semantic alignment. Though effective, these paradigms entail prohibitive computational costs, leading to inefficient retrieval. To address this, we propose a simple yet effective method, Global-Local Semantic Consistent Learning (GLSCL), which capitalizes on latent shared semantics across modalities for text-video retrieval. Specifically, we introduce a parameter-free global interaction module to explore coarse-grained alignment. Then, we devise a shared local interaction module that employs several learnable queries to capture latent semantic concepts for learning fine-grained alignment. Furthermore, an Inter-Consistency Loss (ICL) is devised to accomplish the concept alignment between the visual query and corresponding textual query, and an Intra-Diversity Loss (IDL) is developed to repulse the distribution within visual (textual) queries to generate more discriminative concepts. Extensive experiments on five widely used benchmarks (i.e., MSR-VTT, MSVD, DiDeMo, LSMDC, and ActivityNet) substantiate the superior effectiveness and efficiency of the proposed method. Remarkably, our method achieves comparable performance with SOTA as well as being nearly 220 times faster in terms of computational cost. Code is available at: https://github.com/zchoi/GLSCL",
    "citationCount": 5,
    "referenceCount": 50
}