{
    "paperId": "0d77adc1f9eda5f2462b86da0908b8654a75be41",
    "title": "Novel approaches on bulk‐loading of large scale spatial datasets",
    "year": 2021,
    "venue": "Concurrency and Computation",
    "authors": [
        "M. Kalay"
    ],
    "doi": "10.1002/cpe.6596",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0d77adc1f9eda5f2462b86da0908b8654a75be41",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index structures that are bulk‐loaded adaptively based on the query workload have been the subject of many database research, primarily in conventional databases holding one‐dimensional data. Similar problems are also valid for spatial databases, and novel approaches are needed in these systems. In this study, we first consider the adaptive indexing approaches in a broad sense and then specifically investigate some possible forms of adaptivity on bulk‐loading of large spatial datasets while retaining some core mechanics of well‐known spatial data structures. In our first design, we examined how the internal configuration of the R‐tree spatial index could be better for various workload properties, such as the workload's average aspect ratio. Our experiments observed that Adaptive Sort‐Tile‐Recursive (STR)‐tree performs better than the original STR‐tree. Our second design, the main contribution of this paper, focused on incremental indexing, another form of adaptivity. We concentrate on the data‐to‐insight latency and loaded spatial data faster within this multi‐stage process. We used the Partitioned B‐tree loaded with Morton codes of spatial objects to achieve this improvement by compromising spatial proximity. Finally, the response time of the first query in our design has been better than using the ordinary STR‐tree index by a factor of 34%.",
    "citationCount": 1,
    "referenceCount": 53
}