{
    "paperId": "0d7bdb6a591bd4329e4b8aecfb87875b4b6a1ebb",
    "title": "Synchronizing Disaggregated Data Structures with One-Sided RDMA: Pitfalls, Experiments and Design Guidelines",
    "year": 2025,
    "venue": "ACM Transactions on Database Systems",
    "authors": [
        "Matthias Jasny",
        "Tobias Ziegler",
        "J. Nelson-Slivon",
        "Viktor Leis",
        "Carsten Binnig"
    ],
    "doi": "10.1145/3716377",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0d7bdb6a591bd4329e4b8aecfb87875b4b6a1ebb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Remote data structures built with one-sided Remote Direct Memory Access (RDMA) are at the heart of many disaggregated database management systems today. Concurrent access to these data structures by thousands of remote workers necessitates a highly efficient synchronization scheme. Remarkably, our investigation reveals that existing synchronization schemes display substantial variations in performance and scalability. Even worse, some schemes do not correctly synchronize, resulting in rare and hard-to-detect data corruption. Motivated by these observations, we conduct the first comprehensive analysis of one-sided synchronization techniques and provide general principles for correct synchronization using one-sided RDMA. Our research demonstrates that adherence to these principles not only guarantees correctness but also results in substantial performance enhancements. This article is an extended version of [72] in which we investigate modern 400G NICs. Our findings reveal that the challenges persist even with new generations of NICs. Consequently, we turn our attention to alternative networking hardware, such as smart switches, to address some of the limitations associated with one-sided synchronization.",
    "citationCount": 1,
    "referenceCount": 71
}