{
    "paperId": "0ddd4007e0cb71e01ba30647577de0f448e33786",
    "title": "Subspace Dynamic Combined Sparsity-Based Hyper-Sharpening for Diverse Auxiliary Images",
    "year": 2024,
    "venue": "IEEE Transactions on Geoscience and Remote Sensing",
    "authors": [
        "Jingzhe Tao",
        "Yining Feng",
        "Liyang Song",
        "Chuanming Song",
        "Xianghai Wang"
    ],
    "doi": "10.1109/TGRS.2024.3382402",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0ddd4007e0cb71e01ba30647577de0f448e33786",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The hyper-sharpening technique fuses a high-resolution auxiliary image with a low spatial resolution hyperspectral (HS) image, aiming to enhance the spatial details of the HS image while preserving its spectral integrity. Although it extends from multispectral (MS) sharpening, the unique properties of HS data and the diversity of auxiliary images bring challenges to the application of MS sharpening methods. In this article, a subspace dynamic combined sparse hyper-sharpening method for diverse auxiliary images is proposed. First, based on the dynamic total variation (DTV) of MS sharpening, effective data reduction and spectral coordination are realized by seeking reasonable subspace transformation paths and adopting band-matching processing for auxiliary images. Second, by associating the derivation of the relevant a priori with the residual representation, an idea of generalized “subspace + dynamic” regularization term is proposed. On this basis, a combination of regularization terms corresponding to dynamic gradient-domain sparsity and dynamic nonlocal transform-domain sparsity in subspace is explored. Finally, the alternating direction method of multipliers (ADMM) and the improved closed-form solution are used for optimization. The general effectiveness of the proposed method is verified in three types of experiments (HS-PAN, HS-MS, HS-HS) on four public datasets. In the HS-HS class of experiments, where the inter-source correlation is low, the proposed method can overcome the spectral degradation assumption failure problem, with a PSNR improvement of 5.14% to 131.79% and an ERGAS improvement of 21.87% to 99.39% compared to the other nine methods. The code is at https://github.com/JZ-Tao/SDCS.",
    "citationCount": 1,
    "referenceCount": 49
}