{
    "paperId": "0de5522264a1b7edfb911059d00ed971285c4992",
    "title": "Empowering Visual Artists with Tokenized Digital Assets with NFTs",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Ruiqiang Li",
        "Brian Yecies",
        "Qin Wang",
        "Shiping Chen",
        "Jun Shen"
    ],
    "doi": "10.48550/arXiv.2409.11790",
    "arxivId": "2409.11790",
    "url": "https://www.semanticscholar.org/paper/0de5522264a1b7edfb911059d00ed971285c4992",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Art",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Non-Fungible Tokens (NFTs) has the transformative impact on the visual arts industry by examining the nexus between empowering art practices and leveraging blockchain technology. First, we establish the context for this study by introducing some basic but critical technological aspects and affordances of the blockchain domain. Second, we revisit the creative practices involved in producing traditional artwork, covering various types, production processes, trading, and monetization methods. Third, we introduce and define the key fundamentals of the blockchain ecosystem, including its structure, consensus algorithms, smart contracts, and digital wallets. Fourth, we narrow the focus to NFTs, detailing their history, mechanics, lifecycle, and standards, as well as their application in the art world. In particular, we outline the key processes for minting and trading NFTs in various marketplaces and discuss the relevant market dynamics and pricing. We also consider major security concerns, such as wash trading, to underscore some of the central cybersecurity issues facing this domain. Finally, we conclude by considering future research directions, emphasizing improvements in user experience, security, and privacy. Through this innovative research overview, which includes input from creative industry and cybersecurity sdomain expertise, we offer some new insights into how NFTs can empower visual artists and reshape the wider copyright industries.",
    "citationCount": 2,
    "referenceCount": 202
}