{
    "paperId": "0dece2c3da0ef4891d04c35b47eba1f97c6b6206",
    "title": "A Holistic Architecture for a Sales Enablement Sensing-as-a-Service Model in the IoT Environment",
    "year": 2022,
    "venue": "Inf.",
    "authors": [
        "R. F. Olanrewaju",
        "B. Khan",
        "K. Goh",
        "A. Hashim",
        "Khairul Azami Sidek",
        "Zuhani Ismail Khan",
        "H. Daniyal"
    ],
    "doi": "10.3390/info13110514",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0dece2c3da0ef4891d04c35b47eba1f97c6b6206",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2078-2489/13/11/514/pdf?version=1666941910",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sales enablement sensing-as-a-service (SESaaS) is an organisation’s future process management for any sales management operation. With an expanding base of dynamic customer demands and the adoption of multiple technological advancements, there is a high possibility that human-centric sales management will be transformed into a fully automated form aimed at increasing productivity and being able to cater to effectively a broader customer base. A review of the relevant literature demonstrates that machine learning is one of the most prevalent techniques in analytics for predicting sales behaviour. However, SESaaS includes many features beyond the sales component. Internet-of-Things (IoT) can additionally be used for networking and data analytics to enrich sales data. Therefore, the proposed scheme introduces a novel SESaaS model capable of balancing the sales team’s needs with those of the customers to maximise profits. The proposed model also presents a novel learning scheme in the IoT environment that aids in projecting the service quality score to the final customer, thereby positively influencing the customer to pay a service fee for a superior and desired quality of experience. Unlike any existing sales management scheme, the proposed scheme offers a novel research methodology for improving sales enablement practices, emphasising service scalability, and forecasting company profit. In contrast to any existing system for sales management, the proposed scheme provides greater accuracy, higher service quality, and faster response time in its predictive strategy for projecting the cost of the adoption of SESaaS, which is not reported in any existing studies. In an extensive testing environment, it is determined that the proposed scheme achieves accuracy and service quality of approximately 98.75% and 92.91%, respectively. In addition, the proposed SESaaS model has a significantly faster response time of 1.256 s. These quantifiable outcomes were validated after being compared with commonly adopted learning programs.",
    "citationCount": 3,
    "referenceCount": 25
}