{
    "paperId": "0dec70d9ebbfe042a72b7076a7bdffca44d57ed6",
    "title": "Latest breakthroughs, research results, and challenges in intelligent control of autonomous vehicles",
    "year": 2025,
    "venue": "Proceedings of the Institution of mechanical engineers. Part D, journal of automobile engineering",
    "authors": [
        "Tadele Bishaw Achenef",
        "Solomon Nigusu Abera",
        "Yibeltal Antehunegn Admas",
        "Sewagegn Zewudie Tegegne"
    ],
    "doi": "10.1177/09544070251327616",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0dec70d9ebbfe042a72b7076a7bdffca44d57ed6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Major companies like Google, Tesla, and Uber have invested heavily in autonomous technology, testing them in countries like the US, China, and Germany. Autonomous vehicle (AV) technology has advanced significantly, with deep learning algorithms, high-definition mapping systems, and vehicle-to-everything (V2X) communication. Sensor technology like lidar, radar, and cameras has also been developed for safe navigation. Recent advancements in intelligent control technology have improved performance and capabilities, with artificial intelligence (AI) and machine learning (ML) playing a crucial role in developing intelligent control systems. Researchers are developing algorithms for safe navigation, sensor fusion techniques, predictive modeling, and advanced planning algorithms to enhance navigation, lane changes, and intersection handling. Safety in AV control requires rigorous testing, cybersecurity, redundancy, and failsafe mechanisms. This review synthesizes a wide range of methodologies, such as statistical analysis, simulation-based approaches, deep learning models, reinforcement learning algorithms, and genetic algorithms, that have been used throughout many studies on Autonomous Vehicles (AVs). These techniques have greatly improved the performance of AVs, especially in terms of maximizing mixed traffic flow, strengthening sensor integration, and honing decision-making in challenging situations. Research findings show significant advancements; for instance, deep learning improves vehicle control and pedestrian recognition in difficult situations, while simulation-based models emphasize the benefits of autonomous vehicles on traffic efficiency. The optimization of AV routing and traffic management has been demonstrated by the successful combination of genetic algorithms and reinforcement learning. Despite these developments, a number of significant challenges still need to be overcome, including the requirement for flexible and scalable infrastructure as well as policy frameworks, sensor susceptibilities to inclement weather, and security and privacy concerns. The necessity for more reliable fixes for these vulnerabilities and the incorporation of AVs into the current transportation infrastructure are too prominent research needs. Numerous studies also stress how important it is to have sophisticated governance frameworks in place to handle the moral, legal, and security issues related to the use of AVs. The review identifies that AV research predominantly focuses on improving communication technologies, AI-enabled decision-making, and sensor integration. Future research directions should explore AV interactions with urban infrastructure, develop equitable policy adaptations, and implement advanced safety measures in the absence of connectivity. Overall, this review provides comprehensive insights into the current state, challenges, and future potential of AV technologies, guiding researchers and policymakers in addressing critical gaps to accelerate the global development and adoption of AV systems.",
    "citationCount": 1,
    "referenceCount": 161
}