{
    "paperId": "0e009abf8a6de7b0ad6c123bbc54e0b06cb6673a",
    "title": "Network models for temporal data reconstruction for dam health monitoring",
    "year": 2025,
    "venue": "Computer-Aided Civil and Infrastructure Engineering",
    "authors": [
        "Yongjiang Chen",
        "Kui Wang",
        "M. Zhao",
        "Jianfeng Liu"
    ],
    "doi": "10.1111/mice.13431",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0e009abf8a6de7b0ad6c123bbc54e0b06cb6673a",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1111/mice.13431",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The reconstruction of monitoring data reconstruction is an important step in the process of structural health monitoring. Monitoring data reconstruction involves generating values that are close to the true or expected values, and then using the generated values to replace the anomalous data or fill in the missing data. Deep learning models can be used to reconstruct dam monitoring data, but current models suffer from the inabilities to reconstruct data when the dataset is significantly incomplete, and the reconstruction accuracy and speed have needs for improvement. To this end, this paper proposes a dam temporal reconstruction nets (DTRN) based on generative adversarial nets, which is used to accurately reconstruct dam monitoring data for cases of incomplete datasets. To improve the accuracy of the reconstruction values, this paper embeds a gated recurrent unit network based on a sequence‐to‐sequence model into DTRN to extract the temporal features of the dam monitoring data. In addition, given that random matrices with different distributions lead to different reconstruction results, maximum probability reconstruction based on multiple filling is adopted. Finally, several experiments show that (1) DTRN is not only applicable to the reconstruction of various types of dam monitoring data (e.g., dam displacement monitoring data, dam seepage pressure monitoring data, seam gauge monitoring data, etc.) but also can be applied to other relatively smooth time series data. (2) The average root mean square error of DTRN (0.0618) indicates that its accuracy is 92.3%, 57.5%, and 71.99% higher than that of generative adversarial imputation nets (GAIN), timing GAIN (TGAIN), and dam monitoring data reconstruction network (DMDRN), respectively. (3) The average elapsed time of DTRN (522.6 s) is 68.45% and 48.10% shorter than that of TGAIN and DMDRN, respectively.",
    "citationCount": 1,
    "referenceCount": 51
}