{
    "paperId": "0e3a63fb24bf7d06288cb52aeb2143ce19c79329",
    "title": "Not in My Backyard! Temporal Voting Over Public Chores",
    "year": 2025,
    "venue": "International Joint Conference on Artificial Intelligence",
    "authors": [
        "Edith Elkind",
        "Tzeh Yuan Neoh",
        "Nicholas Teh"
    ],
    "doi": "10.48550/arXiv.2508.08810",
    "arxivId": "2508.08810",
    "url": "https://www.semanticscholar.org/paper/0e3a63fb24bf7d06288cb52aeb2143ce19c79329",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study a temporal voting model where voters have dynamic preferences over a set of public chores---projects that benefit society, but impose individual costs on those affected by their implementation. We investigate the computational complexity of optimizing utilitarian and egalitarian welfare. Our results show that while optimizing the former is computationally straightforward, minimizing the latter is computationally intractable, even in very restricted cases. Nevertheless, we identify several settings where this problem can be solved efficiently, either exactly or by an approximation algorithm. We also examine the effects of enforcing temporal fairness and its impact on social welfare, and analyze the competitive ratio of online algorithms. We then explore the strategic behavior of agents, providing insights into potential malfeasance in such decision-making environments. Finally, we discuss a range of fairness measures and their suitability for our setting.",
    "citationCount": 3,
    "referenceCount": 47
}