{
    "paperId": "0f1730ed205b2660fed9fb9710cc2031eb9a3f4f",
    "title": "A Review on the Advanced Strategies for Efficient Big Data Storage: REHDFS Implementation and DNA Storage Solutions",
    "year": 2024,
    "venue": "Journal of Software Engineering and Simulation",
    "authors": [
        "Thafzy V M Thafzy V M",
        "Hasna M Hasna M"
    ],
    "doi": "10.35629/3795-10123850",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0f1730ed205b2660fed9fb9710cc2031eb9a3f4f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.35629/3795-10123850",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Over the past few years, an unprecedented surge in data creation has been observed, resulting in colossal amounts of information generated on a daily basis. Projections indicate that by 2020, the volume of data to be stored could reach a staggering 44 trillion gigabytes. However, while data volumes continue to escalate rapidly, our conventional databases face limitations in effectively managing and processing such vast and intricate datasets. Compounded by the absence of a durable physical storage medium capable of enduring various environ- mental conditions, the challenge becomes more pronounced. Simultaneously, the concept of Big Data has evolved into a pivotal new resource, yet current analysis frameworks confront daunting hurdles related to scalability, swift data ingestion, performance optimization, and efficient storage management. To address the mounting and exponentially expanding volumes of diverse data being generated at an accelerated pace, numerous researchers have focused on two potential solutions. One avenue involves enhancing existing technologies with intelligent enhancements, as seen in the development of REHDFS. Alternatively, innovative breakthroughs in chemistry, such as leveraging DNA, have emerged as promising solutions.",
    "citationCount": 0,
    "referenceCount": 13
}