{
    "paperId": "0f21708a9ac0df42ed2566b1a2ce754ad45ee774",
    "title": "Surface Reconstruction and Volume Calculation of Grain Pile Based on Point Cloud Information from Multiple Viewpoints",
    "year": 2025,
    "venue": "Agriculture",
    "authors": [
        "Lingmin Yang",
        "Cheng Ran",
        "Ziqing Yu",
        "Feng Han",
        "Wenfu Wu"
    ],
    "doi": "10.3390/agriculture15111208",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0f21708a9ac0df42ed2566b1a2ce754ad45ee774",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate estimation of grain volume in storage silos is critical for intelligent monitoring and management. However, traditional image-based methods often struggle under complex lighting conditions, resulting in incomplete surface reconstruction and reduced measurement accuracy. To address these limitations, we propose a B-spline Interpolation and Clustered Means (BICM) method, which fuses multi-view point cloud data captured by RGB-D cameras to enable robust 3D surface reconstruction and precise volume estimation. By incorporating point cloud splicing, down-sampling, clustering, and 3D B-spline interpolation, the proposed method effectively mitigates issues such as surface notches and misalignment, significantly enhancing the accuracy of grain pile volume calculations across different viewpoints and sampling resolutions. The results of this study show that a volumetric measurement error of less than 5% can be achieved using an RGB-D camera located at two orthogonal viewpoints in combination with the BICM method, and the error can be further reduced to 1.25% when using four viewpoints. In addition to providing rapid inventory assessment of grain stocks, this approach also generates accurate local maps for the autonomous navigation of grain silo robots, thereby advancing the level of intelligent management within grain storage facilities.",
    "citationCount": 0,
    "referenceCount": 37
}