{
    "paperId": "0fa2c9df8d38169f8ee0e0329529907eb851ad19",
    "title": "Energy Efficiency in Blockchain Networks: Analyzing Power Consumption of Consensus Mechanisms and Hash Functions",
    "year": 2024,
    "venue": "International Conference on Blockchain Computing and Applications",
    "authors": [
        "Souvik Sengupta",
        "Banhirup Sengupta",
        "Amir Sinaeepourfard",
        "Shehenaz Shaik"
    ],
    "doi": "10.1109/BCCA62388.2024.10844441",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0fa2c9df8d38169f8ee0e0329529907eb851ad19",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Organizations worldwide are under pressure to reduce their use of non-renewable energy sources and carbon emissions due to their increasing negative impact on the ongoing climate crisis. Blockchain technology, popularized by its use in Bitcoin, has been adopted for various use cases but is criticized for its high energy consumption, depending on the consensus mechanism used. Consensus mechanisms are vital for securing blockchain networks by ensuring all nodes agree on the ledger’s state, but they often trade-off between low energy consumption and high security. This paper analyzes the critical factors contributing to power consumption in blockchain networks, focusing on consensus mechanisms and hashing techniques. Through a comprehensive State-of-the-Art (SOTA) review and algorithmic analysis, we examine how various consensus algorithms impact energy usage and detail the computational and space complexities of different hashing algorithms. We also investigate the energy profiles and reduction strategies of major blockchain platforms. Our findings highlight the potential to enhance blockchain energy efficiency without compromising security or performance, providing a foundation for future research in sustainable blockchain technologies.",
    "citationCount": 1,
    "referenceCount": 97
}