{
    "paperId": "0fa260d5b8926af237c675d8114c37c727929e17",
    "title": "Data‐driven approach for estimating longitudinal aerodynamic parameters using neural artificial bee colony fusion algorithm",
    "year": 2023,
    "venue": "Asian journal of control",
    "authors": [
        "Prashant Kumar",
        "S. Sonkar",
        "R. George",
        "Deepu Philip",
        "A. K. Ghosh"
    ],
    "doi": "10.1002/asjc.3164",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/0fa260d5b8926af237c675d8114c37c727929e17",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aerodynamic parameter estimation involves modeling both force and moment coefficients along with the computation of stability and control derivatives from recorded flight data. Classical methods like output, filter, and equation errors apply extensively to this problem. Machine learning approaches like artificial neural networks (ANNs) provide an alternative to model‐based methods. This work presents a novel aerodynamic parameters estimation technique involving the fusion of two of the most popular machine learning methods. The process uses biologically inspired optimization techniques, the artificial bee colony (ABC) optimization with the widely used ANN for simulated data contaminated with the noise of varying intensity (5%, 10%) and for real aircraft while considering system and measurement uncertainty. Combining ABC and ANN results in a novel and promising method that can address the sensor noise challenges of system identification and parameter estimation. Comparing the proposed approach's results with other benchmark estimation techniques like Least Square and Filter Error Methods established its efficacy. Furthermore, the feasibility of the proposed hybrid method in extracting the stability and control variables from the stable aircraft kinematics is shown even with insufficient information in its data history.",
    "citationCount": 4,
    "referenceCount": 60
}