{
    "paperId": "0fef60de86fe35530baa12395d479c88a43b1c45",
    "title": "ConZone+: Practical Zoned Flash Storage Emulation for Consumer Devices",
    "year": 2025,
    "venue": "",
    "authors": [
        "Dingcui Yu",
        "Zonghuan Yan",
        "Jialin Liu",
        "Yumiao Zhao",
        "Yanyun Wang",
        "Xinghui Duan",
        "Yina Lv",
        "Liang Shi"
    ],
    "doi": null,
    "arxivId": "2510.15885",
    "url": "https://www.semanticscholar.org/paper/0fef60de86fe35530baa12395d479c88a43b1c45",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To facilitate the understanding and efficient enhancement of software and hardware design for consumer-grade zoned flash storage, ConZone is proposed as the first emulator designed to model the resource constraints and architectural features typical of such systems. It incorporates essential components commonly deployed in consumer-grade devices, including limited logical to physical mapping caches, constrained write buffers, and hybrid flash media management. However, ConZone cannot be mounted with the file system due to the lack of in-place update capability, which is required by the metadata area of F2FS. To improve the usability of the emulator, ConZone+ extends ConZone with support for a block interface. We also provide a script to help the deployment and introduces several enhancements over the original version. Users can explore the internal architecture of consumer-grade zoned flash storage and integrate their optimizations with system software using ConZone+. We validate the accuracy of ConZone+ by comparing a hardware architecture representative of consumer-grade zoned flash storage and comparing it with the state-of-the-art. In addition, we conduct several case studies using ConZone+ to investigate the design of zoned storage and explore the inadequacies of the current file system.",
    "citationCount": 0,
    "referenceCount": 50
}