{
    "paperId": "0ff82cdb06c2b4a4055e8acb18bd4b4138ae68a3",
    "title": "Online Resource Allocation: Bandits feedback and Advice on Time-varying Demands",
    "year": 2023,
    "venue": "",
    "authors": [
        "Lixing Lyu",
        "Wang Chi Cheung"
    ],
    "doi": null,
    "arxivId": "2302.04182",
    "url": "https://www.semanticscholar.org/paper/0ff82cdb06c2b4a4055e8acb18bd4b4138ae68a3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We consider a general online resource allocation model with bandit feedback and time-varying demands. While online resource allocation has been well studied in the literature, most existing works make the strong assumption that the demand arrival process is stationary. In practical applications, such as online advertisement and revenue management, however, this process may be exogenous and non-stationary, like the constantly changing internet traffic. Motivated by the recent Online Algorithms with Advice framework [Mitazenmacher and Vassilvitskii, \\emph{Commun. ACM} 2022], we explore how online advice can inform policy design. We establish an impossibility result that any algorithm perform poorly in terms of regret without any advice in our setting. In contrast, we design an robust online algorithm that leverages the online predictions on the total demand volumes. Empowered with online advice, our proposed algorithm is shown to have both theoretical performance and promising numerical results compared with other algorithms in literature. We also provide two explicit examples for the time-varying demand scenarios and derive corresponding theoretical performance guarantees. Finally, we adapt our model to a network revenue management problem, and numerically demonstrate that our algorithm can still performs competitively compared to existing baselines.",
    "citationCount": 0,
    "referenceCount": 63
}