{
    "paperId": "101ebe94e575626f2b4861a281cac5127a0e6c77",
    "title": "Selectivity Estimation of Inequality Joins In Databases",
    "year": 2022,
    "venue": "Mathematics",
    "authors": [
        "Diogo Repas",
        "Zhicheng Luo",
        "Maxime Schoemans",
        "M. Sakr"
    ],
    "doi": "10.48550/arXiv.2206.07396",
    "arxivId": "2206.07396",
    "url": "https://www.semanticscholar.org/paper/101ebe94e575626f2b4861a281cac5127a0e6c77",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.07396",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Selectivity estimation refers to the ability of the SQL query optimizer to estimate the size of the results of a predicate in the query. It is the main calculation based on which the optimizer can select the least expensive plan to execute. While the problem has been known since the mid-1970s, we were surprised that there are no solutions in the literature for the selectivity estimation of inequality joins. By testing four common database systems: Oracle, SQL-Server, PostgreSQL, and MySQL, we found that the open-source systems PostgreSQL and MySQL lack this estimation. Oracle and SQL-Server make fairly accurate estimations, yet their algorithms are secret. This paper, thus, proposes an algorithm for inequality join selectivity estimation. The proposed algorithm was implemented in PostgreSQL and sent as a patch to be included in the next releases. We compared this implementation with the above DBMS for three different data distributions (uniform, normal, and Zipfian) and showed that our algorithm provides extremely accurate estimations (below 0.1% average error), outperforming the other systems by an order of magnitude.",
    "citationCount": 1,
    "referenceCount": 26
}