{
    "paperId": "101f3046a38037529dbf584d5255634b0a463568",
    "title": "BWA-MEM-SCALE: Accelerating Genome Sequence Mapping on Commodity Servers",
    "year": 2022,
    "venue": "International Conference on Parallel Processing",
    "authors": [
        "Changdae Kim",
        "Kwangwon Koh",
        "Taehoon Kim",
        "Daegyu Han",
        "Jiwon Seo"
    ],
    "doi": "10.1145/3545008.3545033",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/101f3046a38037529dbf584d5255634b0a463568",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3545008.3545033",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As advances in Next-Generation Sequencing have made genome sequence data generation faster and cheaper, the acceleration of genome sequence mapping to the reference genome becomes an increasingly important problem. Much effort has been made to improve the performance of the sequence mapping process. In this paper, we propose BWA-MEM-SCALE which offers software-based acceleration techniques that fully utilize system resources to speed up genome sequence mapping. BWA-MEM-SCALE has two optimization mechanisms that exploit the system memory resource; Exact Match Filter (EMF) finds the input reads that match in full-length to the reference genome so that the expensive mapping process is bypassed for those reads. FM-index Accelerator (FMA) skips the prefix of sequences in seed matching with pre-assembled data. Moreover, we fully utilize the CPU cores in the system by carefully pipelining the mapping process and using in-memory index store. We implement the proposed mechanisms on BWA-MEM2 which is the state-of-the-art sequence mapping software. The evaluation shows that BWA-MEM-SCALE achieves substantial speedup compared to BWA-MEM2 when the system has a sufficient amount of resources. For example, with additional 104GB of memory, BWA-MEM-SCALE gives up to 3.32X speedup over BWA-MEM2. Because we support partially deploying the acceleration techniques, BWA-MEM-SCALE speeds up the mapping performance in proportion to the available system resource. Source-code: https://github.com/etri/bwa-mem-scale",
    "citationCount": 3,
    "referenceCount": 45
}