{
    "paperId": "10614ef6d97fd8a565a70e5bfb4abaa3843fe0b1",
    "title": "Contrastive Disentangled Representation Learning for Debiasing Recommendation with Uniform Data",
    "year": 2024,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Xinxin Yang",
        "Zhen Liu",
        "Xiaoman Lu",
        "Yafan Yuan",
        "Sibo Lu",
        "Yibo Gao"
    ],
    "doi": "10.1145/3627673.3679889",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/10614ef6d97fd8a565a70e5bfb4abaa3843fe0b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recommender systems, learning high-quality user and item representations is crucial for predicting user preferences. However, there are various confounding factors in observational data, resulting in data bias, which hinders the learning of user and item representations. Recent work proposed to use uniform data to alleviate bias problem. However, these methods fail to learn pure representations for unbiased prediction, which are not affected by confounding factors. This paper introduces a novel disentangled framework, named CDLRec, for learning unbiased representations, leveraging uniform data as supervisory signal for disentangling. Furthermore, to address the scarcity problem of uniform data, the contrastive learning is utilized to implement disentanglement by providing augmented samples. Specifically, two contrastive strategies are designed based on different sampling ways for positives and negatives. Extensive experiments are conducted over two real-world datasets and the results demonstrate the superior performance of our proposed method.",
    "citationCount": 1,
    "referenceCount": 21
}