{
    "paperId": "1079b2a414cd6349fb26b60fab9ae96e84c65280",
    "title": "Skadi: Building a Distributed Runtime for Data Systems in Disaggregated Data Centers",
    "year": 2023,
    "venue": "USENIX Workshop on Hot Topics in Operating Systems",
    "authors": [
        "Cunchen Hu",
        "Chenxi Wang",
        "Sa Wang",
        "Ninghui Sun",
        "Yungang Bao",
        "Jieru Zhao",
        "Sanidhya Kashyap",
        "Pengfei Zuo",
        "Xusheng Chen",
        "Liangliang Xu",
        "Qin Zhang",
        "Hao Feng",
        "Yizhou Shan"
    ],
    "doi": "10.1145/3593856.3595897",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1079b2a414cd6349fb26b60fab9ae96e84c65280",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3593856.3595897",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data-intensive systems are the backbone of today's computing and are responsible for shaping data centers. Over the years, cloud providers have relied on three principles to maintain cost-effective data systems: use disaggregation to decouple scaling, use domain-specific computing to battle waning laws, and use serverless to lower costs. Although they work well individually, they fail to work in harmony: an issue amplified by emerging data system workloads. In this paper, we envision a distributed runtime to mitigate current shortcomings. The distributed runtime has a tiered access layer exposing declarative APIs, underpinned by a stateful serverless runtime with a distributed task execution model. It will be the narrow waist between data systems and hardware. Users are oblivious to data location, concurrency, disaggregation style, or even the hardware to do the computing. The underlying stateful serverless runtime transparently evolves with novel data-center architectures, such as disaggregation and tightly-coupled clusters. We prototype Skadi to showcase that the distributed runtime is practical.",
    "citationCount": 4,
    "referenceCount": 84
}