{
    "paperId": "10837365e18b854c8705e6ce14aac741e32aae19",
    "title": "A Comprehensive Review on Secure Biometric-Based Continuous Authentication and User Profiling",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "S. Ayeswarya",
        "Ieee K. JOHN SINGH Senior Member"
    ],
    "doi": "10.1109/ACCESS.2024.3411783",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/10837365e18b854c8705e6ce14aac741e32aae19",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3411783",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Authentication systems are pivotal in fortifying security measures against unauthorized access. Yet, they often fall short of effectively combating impersonation attacks, leaving systems susceptible to exploitation. Continuous Authentication Systems (CAS) have emerged as a promising solution, offering dynamic adaptability to evolving threats. However, the existing literature lacks a thorough critical evaluation of CAS progress, hindering practical advancements in the field. This comprehensive review addresses this gap by analyzing recent advancements, emerging trends, and critical challenges in CAS design and implementation. The review reveals that while supervised learning methods, particularly score-level fusion, dominate CAS classification techniques, there remains a dearth of comparative analysis regarding the efficacy of different biometric pairings (e.g., physiological, behavioral, or multimodal). While studies predominantly assess CAS accuracy using metrics like False Rejection Rate (FRR), False Acceptance Rate (FAR), and Equal Error Rate (EER), aspects crucial to practical success, such as usability, security, and scalability, often receive inadequate attention. Moreover, the practical viability of CAS demands comprehensive implementation and evaluation using real-world data. This survey paper explores various facets of CAS, including physiological and behavioral biometrics, multimodal biometrics, context-aware techniques, and other emerging methodologies. Additionally, open issues, challenges, and proposed future directions aim to inspire further research and development in secure biometric-based continuous authentication and user profiling.",
    "citationCount": 20,
    "referenceCount": 167
}