{
    "paperId": "10838026d0d658a159204da968cc67102ddd7938",
    "title": "Clinically Prioritized Data Visualization in Remote Patient Monitoring",
    "year": 2023,
    "venue": "2023 19th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob)",
    "authors": [
        "Teena Arora",
        "V. Balasubramanian",
        "A. Stranieri",
        "Arun Neupane"
    ],
    "doi": "10.1109/WiMob58348.2023.10187847",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/10838026d0d658a159204da968cc67102ddd7938",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Understanding and integrating physiological data collected from wearable sensors in remote patient monitoring (RPM) is challenging. Data streams may be interrupted due to the sensor’s sensitivity, movement, and electromagnetic interference leading to inconsistent, missing, and inaccurate data. Existing approaches to summarize data flows into a single score such as the traditional Modified early warning score (MEWS) is limited. Data visualization approaches have the potential to address this challenge, but few studies have focused on visualization of RPM streams. The study presents a transformation of observed raw RPM physiological data into parameters identified as trust, frequency, slope, and trend. This facilitated visualization and enabled automated assessments of prioritized alerts. Experimental results have shown that the transformations led to the prioritization of clinically significant conditions, and improved visualization has the potential to better support clinical decisions compared with traditional MEWS.",
    "citationCount": 0,
    "referenceCount": 65
}