{
    "paperId": "10a7f26c824c6cecfdf3501fdac622d1cc2f67ba",
    "title": "ШЛЯХИ ПІДВИЩЕННЯ ЕФЕКТИВНОСТІ Й ТЕРМІНУ ЕКСПЛУАТАЦІЇ ФОТОЕЛЕКТРИЧНИХ МОДУЛІВ І ФОТОЕЛЕКТРИЧНИХ СТАНЦІЙ",
    "year": 2021,
    "venue": "Vidnovluvana energetika",
    "authors": [
        "В.О. Пундєв",
        "В. Шевчук",
        "І.О. Шейко"
    ],
    "doi": "10.36296/1819-8058.2021.2(65).38-46",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/10a7f26c824c6cecfdf3501fdac622d1cc2f67ba",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.36296/1819-8058.2021.2(65).38-46",
    "publicationTypes": null,
    "s2FieldsOfStudy": [],
    "abstract": "Кожна складна енергетична система, до яких можна також віднести й фотоелектричні станції (ФЕС), впродовж всього терміну експлуатації, починаючи від будівництва і до його закінчення, піддаються дії різноманітних чинників, які впливають як на сам термін експлуатації станції, так і на ефективність її роботи. \nЗниження ефективності (ККД) та скорочення терміну експлуатації фотоелектричних станцій залежить від впливу кліматичних умов (коливань температури навколишнього середовища, атмосферних опадів тощо) в районі розташування станції, від незворотних фізичних процесів, що відбуваються в елементах конструкції ФЕС та її основних вузлах, від якості виготовлення окремих складових станції, від людського фактора – некваліфікованого обслугового персоналу. Деякі з вищеперерахованих факторів впливу на роботу ФЕС можна об’єднати в окрему групу під загальним терміном – старіння, або деградація. Найбільше часова деградація позначається на основній складовій кожної ФЕС – фотоелектричних модулях (ФЕМ). \nАвтори в цій публікації поставили собі за мету виявити, систематизувати за різними критеріями та дослідити найбільш масові й типові види деградації ФЕМ, які зазвичай мають місце. Проведено аналіз та теоретичне обґрунтування причин їх появи, наслідків та шляхів подолання, а також шляхів запобігання їм. \nКрім того, в роботі пропонуються варіанти розв’язання визначених проблем окремих видів виходу з ладу ФЕМ шляхом зміни й удосконалення схемних та конструктивно-технологічних рішень за умови проєктування ФЕС і також варіанти доопрацювання ФЕМ, що входять до складу ФЕС. \nРішення, що пропонуються, дозволять підвищити ефективність і надійність експлуатації ФЕМ та ФЕС в цілому. \nБібл. 10, рис. 5.",
    "citationCount": 0,
    "referenceCount": 44
}