{
    "paperId": "11101bb0c60101f51fa97f9c2eb2530e36e1e148",
    "title": "Hydropower Station Status Prediction Using RNN and LSTM Algorithms for Fault Detection",
    "year": 2024,
    "venue": "Energies",
    "authors": [
        "Omar Farhan Al-Hardanee",
        "Hüseyin Demirel"
    ],
    "doi": "10.3390/en17225599",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/11101bb0c60101f51fa97f9c2eb2530e36e1e148",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In 2019, more than 16% of the globe’s total production of electricity was provided by hydroelectric power plants. The core of a typical hydroelectric power plant is the turbine. Turbines are subjected to high levels of pressure, vibration, high temperatures, and air gaps as water passes through them. Turbine blades weighing several tons break due to this surge, a tragic accident because of the massive damage they cause. This research aims to develop predictive models to accurately predict the status of hydroelectric power plants based on real stored data for all factors affecting the status of these plants. The importance of having a typical predictive model for the future status of these plants lies in avoiding turbine blade breakage and catastrophic accidents in power plants and the resulting damages, increasing the life of these plants, avoiding sudden shutdowns, and ensuring stability in the generation of electrical energy. In this study, artificial neural network algorithms (RNN and LSTM) are used to predict the condition of the hydropower station, identify the fault before it occurs, and avoid it. After testing, the LSTM algorithm achieved the greatest results with regard to the highest accuracy and least error. According to the findings, the LSTM model attained an accuracy of 99.55%, a mean square error (MSE) of 0.0072, and a mean absolute error (MAE) of 0.0053.",
    "citationCount": 6,
    "referenceCount": 49
}