{
    "paperId": "1141fc40b65a494e252a4acaa97812a6fdf05af4",
    "title": "Deep learning–driven multi-omics analysis: enhancing cancer diagnostics and therapeutics",
    "year": 2025,
    "venue": "Briefings in Bioinformatics",
    "authors": [
        "Jiayang Zhang",
        "Yilin Che",
        "Rongrong Liu",
        "Zhicheng Wang",
        "Weiwu Liu"
    ],
    "doi": "10.1093/bib/bbaf440",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1141fc40b65a494e252a4acaa97812a6fdf05af4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Artificial intelligence (AI) excels at efficiently processing large volumes of data and extracting valuable insights. Deep Learning (DL), a subfield of AI, utilizes multi-layer neural network algorithms to analyze various types of data, mimicking the neural network architecture of the human brain. One of the most prominent features of DL is its end-to-end learning mechanism, which excels at automatic feature extraction and pattern recognition in data. As multi-omics technologies rapidly evolve, the volume of omics data from cancer samples has surged, presenting a significant challenge in managing this vast amount of information. Due to its strong data processing capabilities, DL is increasingly applied across a range of cancer research areas, such as early detection and screening, diagnosis, molecular subtype classification, discovery of biomarkers, and predicting patient prognosis and treatment responses. DL integrates high-dimensional data from fields such as genomics, epigenomics, transcriptomics, proteomics, radiomics, and single-cell omics, enhancing our understanding of cancer development and advancing personalized treatment approaches. This paper reviews various DL models and their roles in analyzing complex data patterns, providing a review of DL applications in cancer multi-omics analysis research and emphasizing its potential in early detection, diagnosis, classification, and prognosis prediction. As DL models are introduced continuously, we expect their application in cancer research to become more extensive, thus propelling the advancement of cancer medicine.",
    "citationCount": 0,
    "referenceCount": 234
}