{
    "paperId": "114d4531424e5c91df57fa1cd29c72b9047c605c",
    "title": "Phylogenetic analysis of SARSCoV- 2 strains from different countries: Insights into genetic variation",
    "year": 2024,
    "venue": "Medical Science",
    "authors": [
        "Muhammad Sajid Mustafa",
        "Farrakh Mehmood Alvi",
        "Nabeela Jabeen",
        "Nasir Ali",
        "Ansa Ijaz",
        "Sadia Arshad",
        "Ramsha Aamir",
        "Muhammad Abid Mustafa",
        "Namra Rasheed",
        "Muhammad Zahid Iqbal"
    ],
    "doi": "10.54905/disssi.v28i150.e117ms3427",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/114d4531424e5c91df57fa1cd29c72b9047c605c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction: Coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) was found in Wuhan, China, in November 2019. The World Health Organization proclaimed the illness a global pandemic. Aim and Objectives: This study determined mutations over a period of time in SARS-CoV-2 variants from different countries and the phylogenetic relationship between them. Material and Methods: Genomic sequences from Specified Countries Sequenced in 2020, 2021, and 2022 were downloaded from GenBank and NCBI and analyzed using specialized bioinformatics software such as BLAST. Variations within specific regions were examined with the aid of the reference genome (NC_045512.2). A phylogenetic tree was generated using the software MEGA 11. Results: A total of 659 variations were found, of which 582 (88.31%) were mismatches, 65 (9.86%) were gaps (deletions), and 12 (1.82%) were insertions. Most variations were found in ORF-1ab, which is 266 (45.70%), and the most common nucleotide variation found was C>T, commonly found in Australian isolates. Phylogeny showed that the reference genome and the South Africa 2020 isolate were homologous. Conclusion: It was concluded that SARS-CoV-2 mutates over time, changing its genomic sequence and leading to changes in its structure. This changes its affectivity, resulting in changes in its pathogenicity.",
    "citationCount": 0,
    "referenceCount": 21
}