{
    "paperId": "1155af60579b2d67da1de1f1f56a5a5771455654",
    "title": "Suggestive answers strategy in human-chatbot interaction: a route to engaged critical decision making",
    "year": 2024,
    "venue": "Frontiers in Psychology",
    "authors": [
        "Yusuke Yamamoto"
    ],
    "doi": "10.3389/fpsyg.2024.1382234",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1155af60579b2d67da1de1f1f56a5a5771455654",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2024.1382234/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this study, we proposed a novel chatbot interaction strategy based on the suggestive ending of answers. This strategy is inspired by the cliffhanger ending narrative technique, which ends a story without specifying conclusions to spark readers' curiosity as to what will happen next and is often used in television series. Common chatbots provide relevant and comprehensive answers to users' questions. In contrast, chatbots with our proposed strategy end their answers with hints potentially interest-triggering users. The suggestive ending strategy aims to stimulate users' inquisition for critical decision-making, relating to a psychological phenomenon where humans are often urged to finish the uncompleted tasks they have initiated. We demonstrated the implication of our strategy by conducting an online user study involving 300 participants, where they used chatbots to perform three decision-making tasks. We adopted a between-subjects factorial experimental design and compared between the following UIs: (1) plain chatbot—it provides a generated answer when participants issue a question; (2) expositive chatbot—it provides a generated answer for a question, adding short summaries of a positive and negative person's opinion for the answer; (3) suggestive chatbot—it provides a generated answer for a question, which ends with a suggestion of a positive and negative person for the answer. We found that users of the suggestive chatbot were inclined to ask more questions to the bot, engage in prolonged decision-making and information-seeking actions, and formulate their opinions from various perspectives. These findings vary with the users' experience with plain and expositive chatbots.",
    "citationCount": 4,
    "referenceCount": 74
}