{
    "paperId": "116d789c5240de651b4d455ed71d68c5eb4cecb5",
    "title": "TempoGRAPHer: Aggregation Based Temporal Graph Exploration",
    "year": 2023,
    "venue": "Information",
    "authors": [
        "Evangelia Tsoukanara",
        "Georgia Koloniari",
        "E. Pitoura"
    ],
    "doi": "10.48550/arXiv.2311.03932",
    "arxivId": "2311.03932",
    "url": "https://www.semanticscholar.org/paper/116d789c5240de651b4d455ed71d68c5eb4cecb5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graphs offer a generic abstraction for modeling entities and the interactions and relationships between them. Most real-world graphs, such as social and cooperation networks, evolve over time, and exploring their evolution may reveal important information. In this paper, we present TempoGRAPHer, a system for analyzing and visualizing the evolution of temporal attributed graphs. TempoGRAPHer supports both temporal and attribute aggregation. It also allows graph exploration by identifying periods of significant growth, shrinkage, or stability. Temporal exploration is supported by two complementary strategies, namely skyline- and interaction-based exploration. Skyline-based exploration provides insights into the overall trends in the evolution, while interaction-based exploration offers a closer look at specific parts of the graph evolution history where significant changes occurred. We present experimental results demonstrating the efficiency of TempoGRAPHer. Additionally, we showcase the usefulness of our system in understanding graph evolution by presenting detailed scenarios, including exploring the evolution of a real contact network between primary school students and analyzing the collaborations in a co-authorship network between authors of the same gender over time.",
    "citationCount": 0,
    "referenceCount": 36
}