{
    "paperId": "11747e306ec94c23348c0f1cd30e292cb94b1e9d",
    "title": "Fast and Accurate Silent Vulnerability Fix Retrieval",
    "year": 2025,
    "venue": "",
    "authors": [
        "Xueqing Liu",
        "Jiangrui Zheng",
        "Guanqun Yang",
        "Siyan Wen",
        "Qiushi Liu"
    ],
    "doi": null,
    "arxivId": "2503.22935",
    "url": "https://www.semanticscholar.org/paper/11747e306ec94c23348c0f1cd30e292cb94b1e9d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "An upstream task for software bill-of-materials (SBOMs) is the accurate localization of the patch that fixes a vulnerability. Nevertheless, existing work reveals a significant gap in the CVEs whose patches exist but are not traceable. Existing works have proposed several approaches to trace/retrieve the patching commit for fixing a CVE. However, they suffer from two major challenges: (1) They cannot effectively handle long diff code of a commit; (2) We are not aware of existing work that scales to the full repository with satisfactory accuracy. Upon identifying this gap, we propose SITPatchTracer, a scalable and effective retrieval system for tracing known vulnerability patches. To handle the context length challenge, SITPatchTracer proposes a novel hierarchical embedding technique which efficiently extends the context coverage to 6x that of existing work while covering all files in the commit. To handle the scalability challenge, SITPatchTracer utilizes a three-phase framework, balancing the effectiveness/efficiency in each phase. The evaluation of SITPatchTracer demonstrates it outperforms existing patch tracing methods (PatchFinder, PatchScout, VFCFinder) by a large margin. Furthermore, SITPatchTracer outperforms VoyageAI, the SOTA commercial code embedding LLM (\\$1.8 per 10K commits) on the MRR and Recall@10 by 18\\% and 28\\% on our two datasets. Using SITPatchTracer, we have successfully traced and merged the patch links for 35 new CVEs in the GitHub Advisory database Our ablation study reveals that hierarchical embedding is a practically effective way of handling long context for patch retrieval.",
    "citationCount": 0,
    "referenceCount": 61
}