{
    "paperId": "11a3c6c134fd8346ae51f6420a02ee926cb07723",
    "title": "Deep Learning-based Semantic Search Techniques for Enhancing Product Matching in E-commerce",
    "year": 2024,
    "venue": "International Conference on Multimodal Interaction",
    "authors": [
        "Fatima Aamir",
        "Raheimeen Sherafgan",
        "Tehreem Arbab",
        "Akhtar Jamil",
        "Fazeel Nadeem Bhatti",
        "A. A. Hameed"
    ],
    "doi": "10.1109/ICMI60790.2024.10586148",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/11a3c6c134fd8346ae51f6420a02ee926cb07723",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Searching is the process of information retrieval utilizing specific criteria or keywords. Integrating search function-alities on e-commerce platforms enables users to efficiently locate exactly what they are searching for through keyword matching. Beyond conventional keyword matching, semantic search involves aligning products with customer queries by capturing the essence of the queries, thereby retrieving semantically related products from the pertinent catalog. Semantic search enhances the e-commerce shopping experience by allowing platforms to tailor responses to user preferences through an in-depth understanding of search intents. Challenges such as morphological variations, spelling errors, and the interpretation of synonyms, antonyms, and hypernyms are addressed through deep learning models de-signed for semantic query-product matching. This study conducts a comparative analysis of various semantic search methodologies and assesses their efficacy, incorporating deep learning strate-gies for query auto-completion and spelling corrections. The evaluation employs sentence transformer models to determine the optimal approach for semantic searching, gauged by nDCG, MRR, and MAP metrics. LSTM, BART, and n-gram models are also examined for auto-completion capabilities. The research analyzes the Amazon Shopping Queries Dataset and the Upstart Commerce catalog datasets.",
    "citationCount": 2,
    "referenceCount": 23
}