{
    "paperId": "11aead34bac158d61eff1e78f23350f3e7ffb461",
    "title": "Evaluation of Neural Network Verification Methods for Air-to-Air Collision Avoidance",
    "year": 2022,
    "venue": "Journal of Air Transportation",
    "authors": [
        "Diego Manzanas Lopez",
        "Taylor T. Johnson",
        "Stanley Bak",
        "Hoang-Dung Tran",
        "Kerianne L. Hobbs"
    ],
    "doi": "10.2514/1.d0255",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/11aead34bac158d61eff1e78f23350f3e7ffb461",
    "isOpenAccess": true,
    "openAccessPdf": "https://arc.aiaa.org/doi/pdf/10.2514/1.D0255?download=true",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural network approximations have become attractive to compress data for automation and autonomy algorithms for use on storage-limited and processing-limited aerospace hardware. However, unless these neural network approximations can be exhaustively veriﬁed to be safe, they cannot be certiﬁed for use on aircraft. An example of such systems is the unmanned Airbone Collision Avoidance System (ACAS Xu), which is a very popular benchmark for open-loop neural network control system veriﬁcation tools. This paper proposes a new closed loop extension of this benchmark, which consists of a set of ten closed loop properties selected to evaluate the safety of an ownship aircraft in the presence of a co-altitude intruder aircraft. These closed loop safety properties are used to evaluate 5 of the 45 neural networks that comprise the ACAS Xu benchmark (corresponding to co-altitude cases) as well as the switching logic between the 5 neural networks. The combination of nonlinear dynamics and switching between ﬁve neural networks is a challenging veriﬁcation task accomplished with star set reachability methods in two veriﬁcation tools. The safety of the ownship aircraft under initial position uncertainty is guaranteed in every scenario proposed.",
    "citationCount": 11,
    "referenceCount": 51
}