{
    "paperId": "11c9cb144fe9b0abb75420caff25736ea3351e02",
    "title": "TasselNetV3: Explainable Plant Counting With Guided Upsampling and Background Suppression",
    "year": 2021,
    "venue": "IEEE Transactions on Geoscience and Remote Sensing",
    "authors": [
        "Hao Lu",
        "Liang Liu",
        "Yanan Li",
        "Xiaoming Zhao",
        "Xi-Qing Wang",
        "ZHIGUO CAO"
    ],
    "doi": "10.1109/TGRS.2021.3058962",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/11c9cb144fe9b0abb75420caff25736ea3351e02",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fast and accurate plant counting tools affect revolution in modern agriculture. Agricultural practitioners, however, expect the output of the tools to be not only accurate but also explainable. Such explainability often refers to the ability to infer which instance is counted. One intuitive way is to generate a bounding box for each instance. Nevertheless, compared with counting by detection, plant counts can be inferred more directly in the local count framework, while one thing reproaching this paradigm is its poor explainability of output visualization. In particular, we find that the poor explainability becomes a bottleneck limiting the counting performance. To address this, we explore the idea of guided upsampling and background suppression where a novel upsampling operator is proposed to allow count redistribution, and segmentation decoders with different fusion strategies are investigated to suppress background, respectively. By integrating them into our previous counting model TasselNetV2, we introduce TasselNetV3 series: TasselNetV3-Lite and TasselNetV3-Seg. We validate the TasselNetV3 series on three public plant counting data sets and a new unmanned aircraft vehicle (UAV)-based data set, covering maize tassels counting, wheat ears counting, and rice plants counting. Extensive results show that guided upsampling and background suppression not only improve counting performance but also enable explainable visualization. Aside from state-of-the-art performance, we have several interesting observations: 1) a limited-receptive-field counter in most cases outperforms a large-receptive-field one; 2) it is sufficient to generate empirical segmentation masks from dotted annotations; 3) middle fusion is a good choice to integrate foreground–background a priori knowledge; and 4) decoupling the learning of counting and segmentation matters.",
    "citationCount": 63,
    "referenceCount": 68
}