{
    "paperId": "11fb274bf7d843045704e221a1cdc5af80e11579",
    "title": "Towards natural object-based image recoloring",
    "year": 2021,
    "venue": "Computational Visual Media",
    "authors": [
        "Menglu Cui",
        "Zhe Zhu",
        "Yulu Yang",
        "Shao-Ping Lu"
    ],
    "doi": "10.1007/s41095-021-0245-5",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/11fb274bf7d843045704e221a1cdc5af80e11579",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s41095-021-0245-5.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing color editing algorithms enable users to edit the colors in an image according to their own aesthetics. Unlike artists who have an accurate grasp of color, ordinary users are inexperienced in color selection and matching, and allowing non-professional users to edit colors arbitrarily may lead to unrealistic editing results. To address this issue, we introduce a palette-based approach for realistic object-level image recoloring. Our data-driven approach consists of an offline learning part that learns the color distributions for different objects in the real world, and an online recoloring part that first recognizes the object category, and then recommends appropriate realistic candidate colors learned in the offline step for that category. We also provide an intuitive user interface for efficient color manipulation. After color selection, image matting is performed to ensure smoothness of the object boundary. Comprehensive evaluation on various color editing examples demonstrates that our approach outperforms existing state-of-the-art color editing algorithms.",
    "citationCount": 7,
    "referenceCount": 70
}