{
    "paperId": "1209285095713395ffafbfc0a776344164d5bde1",
    "title": "Breaking the Bottleneck: User-Specific Optimization and Real-Time Inference Integration for Sequential Recommendation",
    "year": 2025,
    "venue": "Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.2",
    "authors": [
        "Wenjia Xie",
        "Hao Wang",
        "Minghao Fang",
        "Ruize Yu",
        "Wei Guo",
        "Yong Liu",
        "Defu Lian",
        "Enhong Chen"
    ],
    "doi": "10.1145/3711896.3736865",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1209285095713395ffafbfc0a776344164d5bde1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sequential recommendation (SR), as an important branch of recommendation systems, has garnered significant attention due to its substantial commercial value. This has inspired some researchers to draw from the successful experiences of large language models to develop scaling laws for SR. However, the improvements brought by parameter expansion often reach a limit when the data scale is fixed. We have observed that existing deep learning sequence methods are typically seen as learning a unified pattern of user interactions, as they apply the same model for inference across different users, which often leads to the neglect of individual user behavior patterns. To address this, we propose conducting an independent analysis of each user's interaction sequence in SR. We initially developed the PCRec-simple, which uses KL divergence to perform a one-time optimization on each sequence after training, demonstrating that optimizing individual sequences can provide additional insights and overcome the performance bottleneck after scaling laws. Subsequently, we introduce PCRec, a sequential recommendation model that integrates real-time inference of hidden states into the model. It applies KL divergence optimization during the forward process, allowing for end-to-end optimization and addressing issues of robustness, parallelism, and optimization stability. Extensive experiments on real-world datasets show that PCRec significantly outperforms the current state-of-the-art methods. The code can be found at https://github.com/USTC-StarTeam/PCRec.",
    "citationCount": 0,
    "referenceCount": 63
}