{
    "paperId": "12132871b5b4b66c1d170edf9be5084993a23133",
    "title": "Explainable reinforcement learning (XRL): a systematic literature review and taxonomy",
    "year": 2023,
    "venue": "Machine-mediated learning",
    "authors": [
        "Yanzhe Bekkemoen"
    ],
    "doi": "10.1007/s10994-023-06479-7",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/12132871b5b4b66c1d170edf9be5084993a23133",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10994-023-06479-7.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, reinforcement learning (RL) systems have shown impressive performance and remarkable achievements. Many achievements can be attributed to combining RL with deep learning. However, those systems lack explainability, which refers to our understanding of the system’s decision-making process. In response to this challenge, the new explainable RL (XRL) field has emerged and grown rapidly to help us understand RL systems. This systematic literature review aims to give a unified view of the field by reviewing ten existing XRL literature reviews and 189 XRL studies from the past five years. Furthermore, we seek to organize these studies into a new taxonomy, discuss each area in detail, and draw connections between methods and stakeholder questions (e.g., “how can I get the agent to do _?”). Finally, we look at the research trends in XRL, recommend XRL methods, and present some exciting research directions for future research. We hope stakeholders, such as RL researchers and practitioners, will utilize this literature review as a comprehensive resource to overview existing state-of-the-art XRL methods. Additionally, we strive to help find research gaps and quickly identify methods that answer stakeholder questions.",
    "citationCount": 17,
    "referenceCount": 116
}