{
    "paperId": "121579cd92bcada8b2ac7c73e824db50456d9b2b",
    "title": "Operator Splitting for Learning to Predict Equilibria in Convex Games",
    "year": 2021,
    "venue": "",
    "authors": [
        "Daniel McKenzie",
        "Howard Heaton",
        "Qiuwei Li",
        "Samy Wu Fung",
        "S. Osher",
        "Wotao Yin"
    ],
    "doi": null,
    "arxivId": "2106.00906",
    "url": "https://www.semanticscholar.org/paper/121579cd92bcada8b2ac7c73e824db50456d9b2b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Systems of competing agents can often be modeled as games. Assuming rationality, the most likely outcomes are given by an equilibrium (e.g. a Nash equilibrium). In many practical settings, games are influenced by context, i.e. additional data beyond the control of any agent (e.g. weather for traffic and fiscal policy for market economies). Often the exact game mechanics are unknown, yet vast amounts of historical data consisting of (context, equilibrium) pairs are available, raising the possibility of learning a solver which predicts the equilibria given only the context. We introduce Nash Fixed Point Networks (N-FPNs), a class of neural networks that naturally output equilibria. Crucially, N- FPNs employ a constraint decoupling scheme to handle complicated agent action sets while avoiding expensive projections. Empirically, we find N-FPNs are compatible with the recently developed Jacobian-Free Backpropagation technique for training implicit networks, making them significantly faster and easier to train than prior models. Our experiments show N-FPNs are capable of scaling to problems orders of magnitude larger than existing learned game solvers.",
    "citationCount": 0,
    "referenceCount": 80
}