{
    "paperId": "123b7d5f3644cc19dedccd6a4ad8981f8c6da55f",
    "title": "Deployment of Real-Time Network Traffic Analysis Using GraphBLAS Hypersparse Matrices and D4M Associative Arrays",
    "year": 2023,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Michael Jones",
        "J. Kepner",
        "Andrew Prout",
        "Tim Davis",
        "W. Arcand",
        "David Bestor",
        "William Bergeron",
        "C. Byun",
        "V. Gadepally",
        "Micheal Houle",
        "M. Hubbell",
        "Hayden Jananthan",
        "Anna Klein",
        "Lauren Milechin",
        "Guillermo Morales",
        "J. Mullen",
        "Ritesh Patel",
        "Sandeep Pisharody",
        "A. Reuther",
        "Antonio Rosa",
        "S. Samsi",
        "Charles Yee",
        "P. Michaleas"
    ],
    "doi": "10.1109/HPEC58863.2023.10363581",
    "arxivId": "2309.02464",
    "url": "https://www.semanticscholar.org/paper/123b7d5f3644cc19dedccd6a4ad8981f8c6da55f",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.02464",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Matrix/array analysis of networks can provide significant insight into their behavior and aid in their operation and protection. Prior work has demonstrated the analytic, performance, and compression capabilities of GraphBLAS (graph-blas.org) hypersparse matrices and D4M (d4m.mit.edu) associative arrays (a mathematical superset of matrices). Obtaining the benefits of these capabilities requires integrating them into operational systems, which comes with its own unique challenges. This paper describes two examples of real-time operational implementations. First, is an operational GraphBLAS implementation that constructs anonymized hypersparse matrices on a high-bandwidth network tap. Second, is an operational D4M implementation that analyzes daily cloud gateway logs. The architectures of these implementations are presented. Detailed measurements of the resources and the performance are collected and analyzed. The implementations are capable of meeting their operational requirements using modest computational resources (a couple of processing cores). GraphBLAS is well-suited for low-level analysis of high-bandwidth connections with relatively structured network data. D4M is well-suited for higher-level analysis of more unstructured data. This work demonstrates that these technologies can be implemented in operational settings.",
    "citationCount": 9,
    "referenceCount": 70
}