{
    "paperId": "1244296d5d10604519637fb30c9e34a1976686ec",
    "title": "MobileNVC: Real-time 1080p Neural Video Compression on a Mobile Device",
    "year": 2023,
    "venue": "IEEE Workshop/Winter Conference on Applications of Computer Vision",
    "authors": [
        "T. V. Rozendaal",
        "Tushar Singhal",
        "Hoang Le",
        "Guillaume Sautière",
        "Amir Said",
        "Krishna Buska",
        "Anjuman Raha",
        "Dimitris Kalatzis",
        "Hitarth Mehta",
        "Frank Mayer",
        "Liang Zhang",
        "Markus Nagel",
        "A. Wiggers"
    ],
    "doi": "10.1109/WACV57701.2024.00427",
    "arxivId": "2310.01258",
    "url": "https://www.semanticscholar.org/paper/1244296d5d10604519637fb30c9e34a1976686ec",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.01258",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural video codecs have recently become competitive with standard codecs such as HEVC in the low-delay setting. However, most neural codecs are large floating-point networks that use pixel-dense warping operations for temporal modeling, making them too computationally expensive for deployment on mobile devices. Recent work has demonstrated that running a neural decoder in real time on mobile is feasible, but shows this only for 720p RGB video.This work presents the first neural video codec that decodes 1080p YUV420 video in real time on a mobile device. Our codec relies on two major contributions. First, we design an efficient codec that uses a block-based motion compensation algorithm available on the warping core of the mobile accelerator, and we show how to quantize this model to integer precision. Second, we implement a fast decoder pipeline that concurrently runs neural network components on the neural signal processor, parallel entropy coding on the mobile GPU, and warping on the warping core. Our codec outperforms the previous on-device codec by a large margin with up to 48 % BD-rate savings, while reducing the MAC count on the receiver side by 10×. We perform a careful ablation to demonstrate the effect of the introduced motion compensation scheme, and ablate the effect of model quantization.",
    "citationCount": 13,
    "referenceCount": 68
}