{
    "paperId": "1248877624d8fbe3d4d7891079952ed7e59eca7b",
    "title": "TrustVault: A privacy-first data wallet for the European Blockchain Services Infrastructure",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Sharif Jacobino",
        "J. Pouwelse"
    ],
    "doi": "10.48550/arXiv.2210.02987",
    "arxivId": "2210.02987",
    "url": "https://www.semanticscholar.org/paper/1248877624d8fbe3d4d7891079952ed7e59eca7b",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.02987",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The European Union is on course to introduce a European Digital Identity that will be available to all EU citizens and businesses. This will have a huge impact on how citizens and businesses interact online. Big Tech companies currently dictate how digital identities are used. As a result, they have amassed vast amounts of private user data. Movements like Self-Sovereign Identity aim to give users control over their online identity. TrustVault is the first data wallet that gives users back control of their identity and all their data. TrustVault allows users to store all their data on their smartphones and control with whom they share it. The user has fine-grained access control based on verifiable user attributes. EBSI connects TrustVault to the European Self-Sovereign Identity Framework allowing users to use Verifiable Credentials from public and private institutions in their access control policies. The system is serverless and has no Trusted Third Parties. TrustVault replaces the for-profit infrastructure of Big Tech with a public and transparent platform for innovation.",
    "citationCount": 0,
    "referenceCount": 34
}