{
    "paperId": "125a85996f62c0071c56488900f39c21944638bc",
    "title": "Enhancing Time Awareness in Generative Recommendation",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Sunkyung Lee",
        "Seongmin Park",
        "Jonghyo Kim",
        "Mincheol Yoon",
        "Jongwuk Lee"
    ],
    "doi": "10.48550/arXiv.2509.13957",
    "arxivId": "2509.13957",
    "url": "https://www.semanticscholar.org/paper/125a85996f62c0071c56488900f39c21944638bc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative recommendation has emerged as a promising paradigm that formulates the recommendations into a text-to-text generation task, harnessing the vast knowledge of large language models. However, existing studies focus on considering the sequential order of items and neglect to handle the temporal dynamics across items, which can imply evolving user preferences. To address this limitation, we propose a novel model, Generative Recommender Using Time awareness (GRUT), effectively capturing hidden user preferences via various temporal signals. We first introduce Time-aware Prompting, consisting of two key contexts. The user-level temporal context models personalized temporal patterns across timestamps and time intervals, while the item-level transition context provides transition patterns across users. We also devise Trend-aware Inference, a training-free method that enhances rankings by incorporating trend information about items with generation likelihood. Extensive experiments demonstrate that GRUT outperforms state-of-the-art models, with gains of up to 15.4% and 14.3% in Recall@5 and NDCG@5 across four benchmark datasets. The source code is available at https://github.com/skleee/GRUT.",
    "citationCount": 0,
    "referenceCount": 59
}