{
    "paperId": "127c308d00b8fa0c199879b40ff308ec7e0f93cf",
    "title": "Genetic Diversity Analysis and Comprehensive Evaluation of “M82” in EMS-Mutagenized Tomato",
    "year": 2025,
    "venue": "Genes",
    "authors": [
        "Yanchao Yang",
        "Zhanming Tan",
        "Shuang Liang",
        "Wei Cheng",
        "Yihuan Sun",
        "Yunxia Cheng",
        "Yu Song",
        "Yongming Wang",
        "Jialong Wu",
        "Qi Wang"
    ],
    "doi": "10.3390/genes16020179",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/127c308d00b8fa0c199879b40ff308ec7e0f93cf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Ethyl methyl sulfonate (EMS) mutagenesis is widely used because of its advantages of inducing point mutations and no need for genetic transformation. To identify germplasm resources of processed tomatoes with superior comprehensive traits suitable for cultivation in Xinjiang. Methods: In this study, tomato seeds were treated with 2% EMS reagent for 12 h, 21 quality traits and 20 quantitative traits of 33 processed tomatoes derived from EMS-mutagenized“M82”were evaluated. Results: The results indicated that for traits such as hypocotyl color, growth habit, plant type, leaf type, and leaf shape, the range of quantitative trait variation was 8.45–37.25%, with a genetic diversity index ranging from 1.25 to 2.07. Conclusions: Cluster analysis of quantitative traits categorized the 33 EMS-mutagenized “M82” processed tomato resources into five groups: Group I contained 22 robust germplasm samples; Group II consisted of a single potential high-quality germplasm; Group III comprised five germplasm with a small and extreme plant type; Group IV included four high-yield germplasm; and Group V represented one moderate, conventional germplasm. Raw data from 15 quantitative traits across the 33 accessions were standardized using the “extreme method” to extract six comprehensive factors. The top 10 germplasm resources based on the comprehensive score were 76, 137, 97, 102, 19, 104, 21, 108, 17, and 147. It provides some theoretical basis for realizing the high-yield and high-quality cultivation and variety breeding of processed tomatoes in Xinjiang.",
    "citationCount": 1,
    "referenceCount": 30
}