{
    "paperId": "1291397ed2ef6ea0c34402e2d892c4f5c3fc1400",
    "title": "Anomaly Identification and Classification of Network Traffic Using Optimized Machine Learning Approach",
    "year": 2024,
    "venue": "2024 IEEE Conference on Pervasive and Intelligent Computing (PICom)",
    "authors": [
        "Vishwanath Eswarakrishnan",
        "Priyanka Singla"
    ],
    "doi": "10.1109/PICom64201.2024.00022",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1291397ed2ef6ea0c34402e2d892c4f5c3fc1400",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid digital transformation and the exponential increase in network traffic have made the maintenance of the security and integrity of network systems a very urgent matter. Given the constant evolution of networks, detecting anomalies in network traffic becomes essential for network operations' stability and reliability. However, the dramatically changing complex environment of network traffic has made traditional classification methods inadequate. Most conventional methods focus on either the detection delay or the accuracy of detection, totally overlooking the interplay between the two metrics. This paper introduces an optimized machine-learning approach to bridge this gap. Equipped with advanced feature engineering in data cleaning and preprocessing, hyperparameter tuning through random search, and the four machine learning models of Gradient Boosting, K-Nearest Neighbors, Random Forest, and Naive Bayes, we strive to come up with a robust anomaly detection system. The results were brilliant, with the Random Forest model having an accuracy of 100%, F1-score, recall, and AUC. ROC curve analysis is not limited to basic model performance metrics like false-positive and false-negative rates. Also, our proposed approach was tested with real-world testing computation and returned a response time of less than 0.11 seconds, making this suitable for low-latency devices. This task will show the advantages of our optimized Random Forest model, beyond existing methods, with massive potential for real-world network traffic anomaly detection applications.",
    "citationCount": 1,
    "referenceCount": 5
}