{
    "paperId": "12931c91635ec074df6e1d55dfe1190233e834ed",
    "title": "A General Framework for Property-Driven Machine Learning",
    "year": 2025,
    "venue": "",
    "authors": [
        "Thomas Flinkow",
        "Marco Casadio",
        "Colin Kessler",
        "Rosemary Monahan",
        "Ekaterina Komendantskaya"
    ],
    "doi": null,
    "arxivId": "2505.00466",
    "url": "https://www.semanticscholar.org/paper/12931c91635ec074df6e1d55dfe1190233e834ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks have been shown to frequently fail to learn critical safety and correctness properties purely from data, highlighting the need for training methods that directly integrate logical specifications. While adversarial training can be used to improve robustness to small perturbations within $\\epsilon$-cubes, domains other than computer vision -- such as control systems and natural language processing -- may require more flexible input region specifications via generalised hyper-rectangles. Differentiable logics offer a way to encode arbitrary logical constraints as additional loss terms that guide the learning process towards satisfying these constraints. In this paper, we investigate how these two complementary approaches can be unified within a single framework for property-driven machine learning, as a step toward effective formal verification of neural networks. We show that well-known properties from the literature are subcases of this general approach, and we demonstrate its practical effectiveness on a case study involving a neural network controller for a drone system. Our framework is made publicly available at https://github.com/tflinkow/property-driven-ml.",
    "citationCount": 2,
    "referenceCount": 75
}