{
    "paperId": "12b7cbae71e340585594b1ab9f36da72393f977e",
    "title": "MixBERT for Image-Ad Relevance Scoring in Advertising",
    "year": 2021,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Tan Yu",
        "Xiaokang Li",
        "Jianwen Xie",
        "Ruiyang Yin",
        "Qing Xu",
        "Ping Li"
    ],
    "doi": "10.1145/3459637.3482143",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/12b7cbae71e340585594b1ab9f36da72393f977e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For a good advertising effect, images in the ad should be highly relevant with the ad title. The images in an ad are normally selected from the gallery based on their relevance scores with the ad's title. To ensure the selected images are relevant with the title, a reliable text-image matching model is necessary. The state-of-the-art text- image matching model, cross-modal BERT, only understands the visual content in the image, which is sub-optimal when the image description is available. In this work, we present MixBERT, an adimage relevance scoring model. It models the ad-image relevance by matching the ad title with the image description and visual content. MixBERT adopts a two-stream architecture. It adaptively selects the useful information from noisy image description and suppresses the noise impeding effective matching. To effectively describe the details in visual content of the image, a set of local convolutional features is used as the initial representation of the image. Moreover, to enhance the perceptual capability of our model in key entities which are important to advertising, we upgrade masked language modeling in vanilla BERT to masked key entity modeling. Offline and online experiments demonstrate its effectiveness.",
    "citationCount": 6,
    "referenceCount": 46
}