{
    "paperId": "12be2d22a138ae8dcf74fede32af9c5c1b0a16ab",
    "title": "FlashCheck: Exploration of Efficient Evidence Retrieval for Fast Fact-Checking",
    "year": 2025,
    "venue": "European Conference on Information Retrieval",
    "authors": [
        "Kevin Nanekhan",
        "V. Venktesh",
        "Erik Martin",
        "Henrik Vatndal",
        "Vinay Setty",
        "Avishek Anand"
    ],
    "doi": "10.48550/arXiv.2502.05803",
    "arxivId": "2502.05803",
    "url": "https://www.semanticscholar.org/paper/12be2d22a138ae8dcf74fede32af9c5c1b0a16ab",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The advances in digital tools have led to the rampant spread of misinformation. While fact-checking aims to combat this, manual fact-checking is cumbersome and not scalable. It is essential for automated fact-checking to be efficient for aiding in combating misinformation in real-time and at the source. Fact-checking pipelines primarily comprise a knowledge retrieval component which extracts relevant knowledge to fact-check a claim from large knowledge sources like Wikipedia and a verification component. The existing works primarily focus on the fact-verification part rather than evidence retrieval from large data collections, which often face scalability issues for practical applications such as live fact-checking. In this study, we address this gap by exploring various methods for indexing a succinct set of factual statements from large collections like Wikipedia to enhance the retrieval phase of the fact-checking pipeline. We also explore the impact of vector quantization to further improve the efficiency of pipelines that employ dense retrieval approaches for first-stage retrieval. We study the efficiency and effectiveness of the approaches on fact-checking datasets such as HoVer and WiCE, leveraging Wikipedia as the knowledge source. We also evaluate the real-world utility of the efficient retrieval approaches by fact-checking 2024 presidential debate and also open source the collection of claims with corresponding labels identified in the debate. Through a combination of indexed facts together with Dense retrieval and Index compression, we achieve up to a 10.0x speedup on CPUs and more than a 20.0x speedup on GPUs compared to the classical fact-checking pipelines over large collections.",
    "citationCount": 4,
    "referenceCount": 38
}