{
    "paperId": "12c7fc4db7300c5ef918127981f04d442dd60e62",
    "title": "User Response Prediction in Online Advertising",
    "year": 2021,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Zhabiz Gharibshah",
        "Xingquan Zhu"
    ],
    "doi": "10.1145/3446662",
    "arxivId": "2101.02342",
    "url": "https://www.semanticscholar.org/paper/12c7fc4db7300c5ef918127981f04d442dd60e62",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2101.02342",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online advertising, as a vast market, has gained significant attention in various platforms ranging from search engines, third-party websites, social media, and mobile apps. The prosperity of online campaigns is a challenge in online marketing and is usually evaluated by user response through different metrics, such as clicks on advertisement (ad) creatives, subscriptions to products, purchases of items, or explicit user feedback through online surveys. Recent years have witnessed a significant increase in the number of studies using computational approaches, including machine learning methods, for user response prediction. However, existing literature mainly focuses on algorithmic-driven designs to solve specific challenges, and no comprehensive review exists to answer many important questions. What are the parties involved in the online digital advertising eco-systems? What type of data are available for user response prediction? How do we predict user response in a reliable and/or transparent way? In this survey, we provide a comprehensive review of user response prediction in online advertising and related recommender applications. Our essential goal is to provide a thorough understanding of online advertising platforms, stakeholders, data availability, and typical ways of user response prediction. We propose a taxonomy to categorize state-of-the-art user response prediction methods, primarily focusing on the current progress of machine learning methods used in different online platforms. In addition, we also review applications of user response prediction, benchmark datasets, and open source codes in the field.",
    "citationCount": 57,
    "referenceCount": 205
}