{
    "paperId": "12e2bd6211b6c3c2be60a8c06676f712219410a5",
    "title": "Software smell detection techniques: A systematic literature review",
    "year": 2020,
    "venue": "J. Softw. Evol. Process.",
    "authors": [
        "Amjad AbuHassan",
        "M. Alshayeb",
        "L. Ghouti"
    ],
    "doi": "10.1002/smr.2320",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/12e2bd6211b6c3c2be60a8c06676f712219410a5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Software smells indicate design or code issues that might degrade the evolution and maintenance of software systems. Detecting and identifying these issues are challenging tasks. This paper explores, identifies, and analyzes the existing software smell detection techniques at design and code levels. We carried out a systematic literature review (SLR) to identify and collect 145 primary studies related to smell detection in software design and code. Based on these studies, we address several questions related to the analysis of the existing smell detection techniques in terms of abstraction level (design or code), targeted smells, used metrics, implementation, and validation. Our analysis identified several detection techniques categories. We observed that 57% of the studies did not use any performance measures, 41% of them omitted details on the targeted programing language, and the detection techniques were not validated in 14% of these studies. With respect to the abstraction level, only 18% of the studies addressed bad smell detection at the design level. This low coverage urges for more focus on bad smell detection at the design level to handle them at early stages. Finally, our SLR brings to the attention of the research community several opportunities for future research.",
    "citationCount": 47,
    "referenceCount": 211
}