{
    "paperId": "13000f5f8989197499190d9837fb7d6e8781b270",
    "title": "Positive-Unlabeled Learning with Adversarial Data Augmentation for Knowledge Graph Completion",
    "year": 2022,
    "venue": "International Joint Conference on Artificial Intelligence",
    "authors": [
        "Zhenwei Tang",
        "Shichao Pei",
        "Zhao Zhang",
        "Yongchun Zhu",
        "Fuzhen Zhuang",
        "R. Hoehndorf",
        "Xiangliang Zhang"
    ],
    "doi": "10.24963/ijcai.2022/312",
    "arxivId": "2205.00904",
    "url": "https://www.semanticscholar.org/paper/13000f5f8989197499190d9837fb7d6e8781b270",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ijcai.org/proceedings/2022/0312.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Most real-world knowledge graphs (KG) are far from complete and comprehensive. This problem has motivated efforts in predicting the most plausible missing facts to complete a given KG, i.e., knowledge graph completion (KGC). However, existing KGC methods suffer from two main issues, 1) the false negative issue, i.e., the sampled negative training instances may include potential true facts; and 2) the data sparsity issue, i.e., true facts account for only a tiny part of all possible facts. To this end, we propose positive-unlabeled learning with adversarial data augmentation (PUDA) for KGC. In particular, PUDA tailors positive-unlabeled risk estimator for the KGC task to deal with the false negative issue. Furthermore, to address the data sparsity issue, PUDA achieves a data augmentation strategy by unifying adversarial training and positive-unlabeled learning under the positive-unlabeled minimax game. Extensive experimental results on real-world benchmark datasets demonstrate the effectiveness and compatibility of our proposed method.",
    "citationCount": 35,
    "referenceCount": 38
}