{
    "paperId": "134c7410e1b58aa839de1c10c23a1c4934aad897",
    "title": "Generative artificial intelligence as a new context for management theories: analysis of ChatGPT",
    "year": 2023,
    "venue": "Central European Management Journal",
    "authors": [
        "P. Korzyński",
        "G. Mazurek",
        "Andreas Altmann",
        "J. Ejdys",
        "Rūta Kazlauskaitė",
        "J. Paliszkiewicz",
        "K. Wach",
        "E. Ziemba"
    ],
    "doi": "10.1108/cemj-02-2023-0091",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/134c7410e1b58aa839de1c10c23a1c4934aad897",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.emerald.com/insight/content/doi/10.1108/CEMJ-02-2023-0091/full/pdf?title=generative-artificial-intelligence-as-a-new-context-for-management-theories-analysis-of-chatgpt",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeThe primary purpose of this paper is to examine how generative Artificial Intelligence (AI) such as ChatGPT may serve as a new context for management theories and concepts.Design/methodology/approachThe paper presents the analyses of selected management theories on decision-making, knowledge management, customer service, human resource management and administrative tasks and explains what may change after generative AI adoption.FindingsThe paper indicates that some management theories and concepts need to be studied in the generative AI environment that may influence managerial work at the strategic, functional and administrative levels.Research limitations/implicationsThis paper is an opinion piece article and does not refer to empirical data. It formulates some conclusions to further empirical research studies.Originality/valueThe paper analyzes selected management theories in a new technological setting. The paper also provides information about the functions of generative AI that are useful in understanding and overcoming how new technology may change organizations and management.",
    "citationCount": 173,
    "referenceCount": 66
}