{
    "paperId": "13651f3e22dc1563ef48ffc405cd504b3ffc1f05",
    "title": "Green intelligent financial system construction paradigm based on deep learning and concurrency models",
    "year": 2020,
    "venue": "Concurrency and Computation",
    "authors": [
        "Xi Feng",
        "Huanping Shi",
        "Jian Wang",
        "Shaoguang Wang"
    ],
    "doi": "10.1002/cpe.5784",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/13651f3e22dc1563ef48ffc405cd504b3ffc1f05",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Green finance represents a new trend and new direction for future financial development, and it is an innovation and change in the financial field. The role of the financial market in environmental protection has gradually become the consensus of the financial community. Although the total amount of environmental protection investment in China shows a growing trend, the actual environmental protection investment still has a large gap compared with the increasing capital demand for environmental protection work. Financial resources play a key role in resource allocation. As long as funds are gradually withdrawn from polluting industries, they will be more invested in green and environmental industries, and resources such as land and labor will be optimally allocated. Faced with the complex international and domestic economic environment and increasing environmental pressures, this article proposes the green intelligent financial system construction paradigm based on deep learning and concurrency models. The deep learning model specialized on convolutional neural networks (CNN) is applied to preprocess the information, the data cleaning and vision models are integrated to extract the structure data. The concurrency model is applied to guarantee the efficiency of the system. The experimental results compared with the state‐of‐the‐art models have reflected the robustness of the proposed framework.",
    "citationCount": 8,
    "referenceCount": 34
}