{
    "paperId": "13c1a09ed284602d7c21e76c1c63460bb77a4568",
    "title": "Zero-th Order Algorithm for Softmax Attention Optimization",
    "year": 2023,
    "venue": "BigData Congress [Services Society]",
    "authors": [
        "Yichuan Deng",
        "Zhihang Li",
        "S. Mahadevan",
        "Zhao Song"
    ],
    "doi": "10.1109/BigData62323.2024.10825630",
    "arxivId": "2307.08352",
    "url": "https://www.semanticscholar.org/paper/13c1a09ed284602d7c21e76c1c63460bb77a4568",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2307.08352",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large language models (LLMs) have brought about significant transformations in human society. Among the crucial computations in LLMs, the softmax unit holds great importance. Its helps the model generating a probability distribution on potential subsequent words or phrases, considering a series of input words. By utilizing this distribution, the model selects the most probable next word or phrase, based on the assigned probabilities. The softmax unit assumes a vital function in LLM training as it facilitates learning from data through the adjustment of neural network weights and biases.With the development of the size of LLMs, computing the gradient becomes expensive. However, Zero-th Order method can approximately compute the gradient with only forward passes. In this paper, we present a Zero-th Order algorithm specifically tailored for Softmax optimization. We demonstrate the convergence of our algorithm, highlighting its effectiveness in efficiently computing gradients for large-scale LLMs. By leveraging the Zeroth-Order method, our work contributes to the advancement of optimization techniques in the context of complex language models.",
    "citationCount": 15,
    "referenceCount": 52
}