{
    "paperId": "13d33db103a0aeb24f441d6da361a3edec1c8fc4",
    "title": "Evaluation of electrical load demand forecasting using various machine learning algorithms",
    "year": 2024,
    "venue": "Frontiers in Energy Research",
    "authors": [
        "Akanksha Jain",
        "S. C. Gupta",
        "Jinran Wu",
        "Yanan Song",
        "Minh Quan Duong"
    ],
    "doi": "10.3389/fenrg.2024.1408119",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/13d33db103a0aeb24f441d6da361a3edec1c8fc4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fenrg.2024.1408119/pdf?isPublishedV2=False",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The energy sector heavily relies on a diverse array of machine learning algorithms for power load prediction, which plays a pivotal role in shaping policies for power generation and distribution. The precision of power load prediction depends on numerous factors that reflect nonlinear traits within the data. Notably, machine learning algorithms and artificial neural networks have emerged as indispensable components in contemporary power load forecasting. This study focuses specifically on machine learning algorithms, encompassing support vector machines (SVMs), long short-term memory (LSTM), ensemble classifiers, recurrent neural networks, and deep learning methods. The research meticulously examines short-term power load prediction by leveraging Chandigarh UT electricity utility data spanning the last 5 years. The assessment of prediction accuracy utilizes metrics such as normalized mean square error (NMSE), root mean squared error (RMSE), mean absolute error (MAE), and mutual information (MI). The prediction results demonstrate superior performance in LSTM compared to other algorithms, with the prediction error being the lowest in LSTM and 13.51% higher in SVMs. These findings provide valuable insights into the strengths and limitations of different machine learning algorithms. Validation experiments for the proposed method are conducted using MATLAB R2018 software.",
    "citationCount": 12,
    "referenceCount": 62
}