{
    "paperId": "143bac1d11911015d8dde5b57a91462fc6e776bb",
    "title": "PeakFS: An Ultra-High Performance Parallel File System via Computing-Network-Storage Co-Optimization for HPC Applications",
    "year": 2024,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "Yixiao Chen",
        "Haomai Yang",
        "Kai Lu",
        "Wenlve Huang",
        "Jibin Wang",
        "Jiguang Wan",
        "Jian Zhou",
        "Fei Wu",
        "Changsheng Xie"
    ],
    "doi": "10.1109/TPDS.2024.3485754",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/143bac1d11911015d8dde5b57a91462fc6e776bb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Emerging high-performance computing (HPC) applications with diverse workload characteristics impose greater demands on parallel file systems (PFSs). PFSs also require more efficient software designs to fully utilize the performance of modern hardware, such as multi-core CPUs, Remote Direct Memory Access (RDMA), and NVMe SSDs. However, existing PFSs expose great limitations under these requirements due to limited multi-core scalability, unaware of HPC workloads, and disjointed network-storage optimizations. In this article, we present PeakFS, an ultra-high performance parallel file system via computing-network-storage co-optimization for HPC applications. PeakFS designs a shared-nothing scheduling system based on link-reduced task dispatching with lock-free queues to reduce concurrency overhead. Besides, PeakFS improves I/O performance with flexible distribution strategies, memory-efficient indexing, and metadata caching according to HPC I/O characteristics. Finally, PeakFS shortens the critical path of request processing through network-storage co-optimizations. Experimental results show that the metadata and data performance of PeakFS reaches more than 90% of the hardware limits. For metadata throughput, PeakFS achieves a 3.5–19× improvement over GekkoFS and outperforms BeeGFS by three orders of magnitude.",
    "citationCount": 2,
    "referenceCount": 68
}