{
    "paperId": "1454504c1ec334dde0bdde18649c126f5e122f54",
    "title": "VolcanoML: speeding up end-to-end AutoML via scalable search space decomposition",
    "year": 2021,
    "venue": "The VLDB journal",
    "authors": [
        "Yang Li",
        "Yu Shen",
        "Wentao Zhang",
        "Jiawei Jiang",
        "Bolin Ding",
        "Yaliang Li",
        "Jingren Zhou",
        "Zhi Yang",
        "Wentao Wu",
        "Ce Zhang",
        "B. Cui"
    ],
    "doi": "10.1007/s00778-022-00752-2",
    "arxivId": "2107.08861",
    "url": "https://www.semanticscholar.org/paper/1454504c1ec334dde0bdde18649c126f5e122f54",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "End-to-end AutoML has attracted intensive interests from both academia and industry which automatically searches for ML pipelines in a space induced by feature engineering, algorithm/model selection, and hyper-parameter tuning. Existing AutoML systems, however, suffer from scalability issues when applying to application domains with large, high-dimensional search spaces. We present VolcanoML , a scalable and extensible framework that facilitates systematic exploration of large AutoML search spaces. VolcanoML introduces and implements basic building blocks, which decompose a large search space into smaller ones, and allows users to utilize these building blocks to compose an execution plan for the AutoML problem at hand. VolcanoML further supports a Volcano-style execution model —akin to the one supported by modern database systems—to execute the plan constructed. Our evaluation demonstrates that, not only does VolcanoML raise the level of expressiveness for search space decomposition in AutoML, it also leads to actual findings of decomposition strategies that are significantly more efficient than the ones employed by state-of-the-art AutoML systems such as auto-sklearn .",
    "citationCount": 52,
    "referenceCount": 108
}