{
    "paperId": "14c80658219a39fe1bd86a30606363137c5a3385",
    "title": "The impact of regular sauerkraut consumption on the human gut microbiota: a crossover intervention trial",
    "year": 2025,
    "venue": "Microbiome",
    "authors": [
        "Nelly Schropp",
        "Alexander Bauer",
        "Virginie Stanislas",
        "Kun D. Huang",
        "T. Lesker",
        "A. Bielecka",
        "Till Strowig",
        "Karin B. Michels"
    ],
    "doi": "10.1186/s40168-024-02016-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/14c80658219a39fe1bd86a30606363137c5a3385",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s40168-024-02016-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Sauerkraut is a fermented food that has been suspected to have a beneficial impact on the gut microbiome, but scientific evidence is sparse. In this crossover intervention trial with 87 participants (DRKS00027007), we investigated the impact of daily consumption of fresh or pasteurized sauerkraut for 4 weeks on gut microbial composition and the metabolome in a healthy study population. Results Using shotgun metagenomic sequencing, we observed changes in single bacterial species following fresh and pasteurized sauerkraut consumption. More pronounced changes were observed in the pasteurized sauerkraut intervention arm. Only pasteurized sauerkraut consumption increased serum short-chain fatty acids (SCFAs). Conclusions The gut microbiome of healthy individuals is rather resilient to short-term dietary interventions even though single species might be affected by sauerkraut consumption. Video Abstract Supplementary Information The online version contains supplementary material available at 10.1186/s40168-024-02016-3.",
    "citationCount": 7,
    "referenceCount": 68
}