{
    "paperId": "14fabc87caae8945d9a4881ee2b6ef21d2eaa0de",
    "title": "MQPHFM: A SQL Query Featurization Method Suitable for Cardinality Estimation Tasks",
    "year": 2024,
    "venue": "IEEE International Conference on e-Business Engineering",
    "authors": [
        "Hantao Ya",
        "Chong Sun",
        "Jun Tie",
        "Lifeng Wu",
        "Chongwei Ruan",
        "Yinglun Hu",
        "Bowen Zhang",
        "Shipeng Cao"
    ],
    "doi": "10.1109/ICEBE62490.2024.00020",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/14fabc87caae8945d9a4881ee2b6ef21d2eaa0de",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The deep learning-based cardinality estimation is a hot research topic in the field of database query optimization. The SQL query featurization has a direct impact on the quality of cardinality estimation models and has received widespread attention. There are significant shortcomings in the existing SQL query featurization method. (1) Existing methods typically only consider physical query plans and ignore the semantic information of logical query plans, thus leading to information loss. (2) Existing methods often use random sampling to estimate the data distribution, which can easily introduce bias, leading to cardinality estimation that does not match the actual data distribution, even facing the 0-tuple problem, which increases the challenge of model training. This paper proposes a novel SQL query featurization method, MQPHFM, to address the above problems. The method combines physical query plans and logical query plans to fully understand the semantic features of SQL, enabling the model to obtain both the execution details and semantic logic of the SQL query at the same time. Meanwhile, histograms are used as data distribution estimation tools to fully capture the possible logical relationships between columns, thereby improving the accuracy and robustness of cardinality estimation model. Experimental results on the IMDb dataset show that the proposed method can effectively improve the accuracy of cardinality estimation model.",
    "citationCount": 0,
    "referenceCount": 16
}