{
    "paperId": "155ab051396e5acd193efbc79fb6bc080137a636",
    "title": "Exploring the Potential of Offline LLMs in Data Science: A Study on Code Generation for Data Analysis",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Anastasios Nikolakopoulos",
        "A. Litke",
        "Alexandros Psychas",
        "Eleni Veroni",
        "Theodora A. Varvarigou"
    ],
    "doi": "10.1109/ACCESS.2025.3556973",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/155ab051396e5acd193efbc79fb6bc080137a636",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2025.3556973",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language Models (LLMs) have recently attracted considerable attention from the scientific community, due to their advanced capabilities and potential to serve as vital tools across various industries and academic fields. An important implementation domain for LLMs is Data Science, in which they could enhance the efficiency of Data Analysis and Profiling tasks. With the utilization of LLMs in Data Analytics tools, end-users could directly issue data analysis queries in natural language, bypassing the need for specialized user interfaces. However, due to the sensitive nature of certain data in some organizations, it is unwise to consider using established, cloud-based LLMs. This article explores the feasibility and effectiveness of a standalone, offline LLM in generating code for performing data analytics, given a set of natural language queries. A methodology tailored to a code-specific LLM is presented, evaluating its performance in generating Python Spark code and successfully producing the desired result. The model is assessed on its efficiency and ability to handle natural language queries of varying complexity, exploring the potential for wider adoption of offline LLMs in future data analysis frameworks and software solutions.",
    "citationCount": 2,
    "referenceCount": 88
}