{
    "paperId": "1586c70a2e39d67f2ac5928647c241809881376b",
    "title": "Spark-based Cloud Data Analytics using Multi-Objective Optimization",
    "year": 2021,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Fei Song",
        "Khaled Zaouk",
        "Chenghao Lyu",
        "Arnab Sinha",
        "Qi Fan",
        "Y. Diao",
        "Prashant J. Shenoy"
    ],
    "doi": "10.1109/ICDE51399.2021.00041",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1586c70a2e39d67f2ac5928647c241809881376b",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.inria.fr/hal-02549758/file/ICDE21_Boosting_Analytics.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data analytics in the cloud has become an integral part of enterprise businesses. Big data analytics systems, however, still lack the ability to take task objectives such as user performance goals and budgetary constraints and automatically configure an analytic job to achieve these objectives. This paper presents UDAO, a Spark-based Unified Data Analytics Optimizer that can automatically determine a cluster configuration with a suitable number of cores as well as other system parameters that best meet the task objectives. At a core of our work is a principled multi-objective optimization (MOO) approach that computes a Pareto optimal set of configurations to reveal tradeoffs between different objectives, recommends a new Spark configuration that best explores such tradeoffs, and employs novel optimizations to enable such recommendations within a few seconds. Detailed experiments using benchmark workloads show that our MOO techniques provide a 2-50x speedup over existing MOO methods, while offering good coverage of the Pareto frontier. Compared to Ottertune, a state-of-the-art performance tuning system, UDAO recommends Spark configurations that yield 26%-49% reduction of running time of the TPCx-BB benchmark while adapting to different user preferences on multiple objectives.",
    "citationCount": 13,
    "referenceCount": 38
}