{
    "paperId": "16170e125475227e9db14610d375c9438678344d",
    "title": "MLKV: Efficiently Scaling up Large Embedding Model Training with Disk-based Key-Value Storage",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Yongjun He",
        "R. Waleffe",
        "Zhichao Han",
        "Johnu George",
        "Binhang Yuan",
        "Zitao Zhang",
        "Yinan Shan",
        "Yang Zhao",
        "Debojyoti Dutta",
        "Theodoros Rekatsinas",
        "Ce Zhang"
    ],
    "doi": "10.1109/ICDE65448.2025.00308",
    "arxivId": "2504.01506",
    "url": "https://www.semanticscholar.org/paper/16170e125475227e9db14610d375c9438678344d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many modern machine learning (ML) methods rely on embedding models to learn vector representations (embeddings) for a set of entities (embedding tables). As increasingly diverse ML applications utilize embedding models and embedding tables continue to grow in size and number, there has been a surge in the ad-hoc development of specialized frameworks targeted to train large embedding models for specific tasks. Although the scalability issues that arise in different embedding model training tasks are similar, each of these frameworks independently reinvents and customizes storage components for specific tasks, leading to substantial duplicated engineering efforts in both development and deployment. This paper presents MLKV, an efficient, extensible, and reusable data storage framework designed to address the scalability challenges in embedding model training, specifically data stall and staleness. MLKV augments disk-based key-value storage by democratizing optimizations that were previously exclusive to individual specialized frameworks and provides easy-to-use interfaces for embedding model training tasks. Extensive experiments on open-source workloads, as well as applications in eBay's payment transaction risk detection and seller payment risk detection, show that MLKV outperforms offloading strategies built on top of industrial-strength key-value stores by 1.6-12.6 ×. MLKV is open-source at https://github.com/llm-db/MLKV.",
    "citationCount": 0,
    "referenceCount": 62
}