{
    "paperId": "161c7df79d84bb5b29a3f5aed06ec4c2f8688282",
    "title": "A Collaborative Process Parameter Recommender System for Fleets of Networked Manufacturing Machines - with Application to 3D Printing",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Weishi Wang",
        "Sicong Guo",
        "Chenhuan Jiang",
        "Mohamed Elidrisi",
        "Myungjin Lee",
        "H. Madhyastha",
        "R. Kontar",
        "C. Okwudire"
    ],
    "doi": "10.48550/arXiv.2506.12252",
    "arxivId": "2506.12252",
    "url": "https://www.semanticscholar.org/paper/161c7df79d84bb5b29a3f5aed06ec4c2f8688282",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fleets of networked manufacturing machines of the same type, that are collocated or geographically distributed, are growing in popularity. An excellent example is the rise of 3D printing farms, which consist of multiple networked 3D printers operating in parallel, enabling faster production and efficient mass customization. However, optimizing process parameters across a fleet of manufacturing machines, even of the same type, remains a challenge due to machine-to-machine variability. Traditional trial-and-error approaches are inefficient, requiring extensive testing to determine optimal process parameters for an entire fleet. In this work, we introduce a machine learning-based collaborative recommender system that optimizes process parameters for each machine in a fleet by modeling the problem as a sequential matrix completion task. Our approach leverages spectral clustering and alternating least squares to iteratively refine parameter predictions, enabling real-time collaboration among the machines in a fleet while minimizing the number of experimental trials. We validate our method using a mini 3D printing farm consisting of ten 3D printers for which we optimize acceleration and speed settings to maximize print quality and productivity. Our approach achieves significantly faster convergence to optimal process parameters compared to non-collaborative matrix completion.",
    "citationCount": 0,
    "referenceCount": 39
}