{
    "paperId": "163c1f9b37f2bc7284af01b0a9211588fa6605b3",
    "title": "Performance optimization of Learning Trees modules in the ECL repository",
    "year": 2024,
    "venue": "International Conference on Cloud Computing and Intelligence Systems",
    "authors": [
        "Shashank B",
        "Sudershan K S",
        "Shobha G",
        "S. Manonmani",
        "Roger Dev"
    ],
    "doi": "10.1109/CCIS63231.2024.10932096",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/163c1f9b37f2bc7284af01b0a9211588fa6605b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multi-Node computation, also known as distributed computing, is a paradigm that allows for the efficient utilization of multiple interconnected nodes or machines to perform complex computational tasks. By dividing the workload and distributing it across multiple nodes, multi-node computation enables parallel processing, scalability, and improved performance for a wide range of applications. HPCC Systems® from LexisNexis Risk Solutions is a proven, open source solution for big data insights that can be implemented by businesses of all sizes. HPCC Systems offers a consistent data-centric programming language, two processing platforms and a single, complete end-to-end architecture for efficient processing. ECL is the Enterprise Control Language designed specifically for huge data projects using the HPCC Systems platform. It is extremely scalable and a powerful declarative data-processing language with native multi-processing capabilities and used for HPCC systems. Some core ECL functions, like the ones handling Learning Tree algorithms of Machine Learning Bundle are recursive in nature and hence high computational time is needed. This paper thus presents a solution to achieve optimized processing of ML learning tree algorithms in ECL through embedding python libraries. The proposed approach was tested on standard datasets and a significant decrease in computation time. For Real Estate Valuation Regression dataset the computation time was reduced from 11.371 seconds to 0.886 seconds using the proposed method showing 1324% improvement with no impact on the accuracy. Random Forests are also implemented using the proposed Decision Tree method allowing the users to specify the number of decision trees to be used in the forest.",
    "citationCount": 0,
    "referenceCount": 16
}