{
    "paperId": "16529f7194bf7faee8a4e43fd54aefeb8730f236",
    "title": "Database reasoning over text",
    "year": 2021,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "James Thorne",
        "Majid Yazdani",
        "Marzieh Saeidi",
        "F. Silvestri",
        "Sebastian Riedel",
        "A. Halevy"
    ],
    "doi": "10.18653/v1/2021.acl-long.241",
    "arxivId": "2106.01074",
    "url": "https://www.semanticscholar.org/paper/16529f7194bf7faee8a4e43fd54aefeb8730f236",
    "isOpenAccess": true,
    "openAccessPdf": "https://aclanthology.org/2021.acl-long.241.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural models have shown impressive performance gains in answering queries from natural language text. However, existing works are unable to support database queries, such as “List/Count all female athletes who were born in 20th century”, which require reasoning over sets of relevant facts with operations such as join, filtering and aggregation. We show that while state-of-the-art transformer models perform very well for small databases, they exhibit limitations in processing noisy data, numerical operations, and queries that aggregate facts. We propose a modular architecture to answer these database-style queries over multiple spans from text and aggregating these at scale. We evaluate the architecture using WikiNLDB, a novel dataset for exploring such queries. Our architecture scales to databases containing thousands of facts whereas contemporary models are limited by how many facts can be encoded. In direct comparison on small databases, our approach increases overall answer accuracy from 85% to 90%. On larger databases, our approach retains its accuracy whereas transformer baselines could not encode the context.",
    "citationCount": 39,
    "referenceCount": 36
}