{
    "paperId": "16ca12f4cabaa4148777df98ce51a7386048698d",
    "title": "Self-supervised Representation Learning with Local Aggregation for Image-based Profiling",
    "year": 2025,
    "venue": "",
    "authors": [
        "Siran Dai",
        "Qianqian Xu",
        "Peisong Wen",
        "Yang Liu",
        "Qingming Huang"
    ],
    "doi": null,
    "arxivId": "2506.14265",
    "url": "https://www.semanticscholar.org/paper/16ca12f4cabaa4148777df98ce51a7386048698d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image-based cell profiling aims to create informative representations of cell images. This technique is critical in drug discovery and has greatly advanced with recent improvements in computer vision. Inspired by recent developments in non-contrastive Self-Supervised Learning (SSL), this paper provides an initial exploration into training a generalizable feature extractor for cell images using such methods. However, there are two major challenges: 1) Unlike typical scenarios where each representation is based on a single image, cell profiling often involves multiple input images, making it difficult to effectively fuse all available information; and 2) There is a large difference between the distributions of cell images and natural images, causing the view-generation process in existing SSL methods to fail. To address these issues, we propose a self-supervised framework with local aggregation to improve cross-site consistency of cell representations. We introduce specialized data augmentation and representation post-processing methods tailored to cell images, which effectively address the issues mentioned above and result in a robust feature extractor. With these improvements, the proposed framework won the Cell Line Transferability challenge at CVPR 2025.",
    "citationCount": 2,
    "referenceCount": 40
}