{
    "paperId": "171f333630e76727e2e6c3adbc324bb55e9cf0aa",
    "title": "LOFTune: A Low-Overhead and Flexible Approach for Spark SQL Configuration Tuning",
    "year": 2025,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Jiahui Li",
        "Junhao Ye",
        "Yuren Mao",
        "Yunjun Gao",
        "Lu Chen"
    ],
    "doi": "10.1109/TKDE.2025.3549232",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/171f333630e76727e2e6c3adbc324bb55e9cf0aa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The query efficiency of Spark SQL is significantly impacted by its configurations. Therefore, configuration tuning has drawn great attention, and various automatic configuration tuning methods have been proposed. However, existing methods suffer from two issues: (1) high tuning overhead: they need to repeatedly execute the workloads several times to obtain the training samples, which is time-consuming; and (2) low throughput: they need to occupy resources like CPU cores and memory for a long time, causing other Spark SQL workloads to wait, thereby reducing the overall system throughput. These issues impede the use of automatic configuration tuning methods in practical systems which have limited tuning budget and many concurrent workloads. To address these issues, this paper proposes a Low-Overhead and Flexible approach for Spark SQL configuration Tuning, dubbed LOFTune. LOFTune reduces the tuning overhead via a sample-efficient optimization framework, which is proposed based on multi-task SQL representation learning and multi-armed bandit. Furthermore, LOFTune solves the low throughput issue with a recommendation-sampling-decoupled tuning framework. Extensive experiments validate the effectiveness of LOFTune. In the sampling-allowed case, LOFTune can save up to 90% of the workload runs comparing with the state-of-the-art methods. Besides, in the zero-sampling case, LOFTune can reduce up to 41.26% of latency.",
    "citationCount": 4,
    "referenceCount": 53
}