{
    "paperId": "1734c6b420c48280b226237b5383da9d64006d8d",
    "title": "Attention-Guided Hierarchical Structure Aggregation for Image Matting",
    "year": 2020,
    "venue": "Computer Vision and Pattern Recognition",
    "authors": [
        "Y. Qiao",
        "Yuhao Liu",
        "Xin Yang",
        "D. Zhou",
        "Mingliang Xu",
        "Qiang Zhang",
        "Xiaopeng Wei"
    ],
    "doi": "10.1109/CVPR42600.2020.01369",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1734c6b420c48280b226237b5383da9d64006d8d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing deep learning based matting algorithms primarily resort to high-level semantic features to improve the overall structure of alpha mattes. However, we argue that advanced semantics extracted from CNNs contribute unequally for alpha perception and we are supposed to reconcile advanced semantic information with low-level appearance cues to refine the foreground details. In this paper, we propose an end-to-end Hierarchical Attention Matting Network (HAttMatting), which can predict the better structure of alpha mattes from single RGB images without additional input. Specifically, we employ spatial and channel-wise attention to integrate appearance cues and pyramidal features in a novel fashion. This blended attention mechanism can perceive alpha mattes from refined boundaries and adaptive semantics. We also introduce a hybrid loss function fusing Structural SIMilarity (SSIM), Mean Square Error (MSE) and Adversarial loss to guide the network to further improve the overall foreground structure. Besides, we construct a large-scale image matting dataset comprised of 59,600 training images and 1000 test images (total 646 distinct foreground alpha mattes), which can further improve the robustness of our hierarchical structure aggregation model. Extensive experiments demonstrate that the proposed HAttMatting can capture sophisticated foreground structure and achieve state-of-the-art performance with single RGB images as input.",
    "citationCount": 175,
    "referenceCount": 43
}