{
    "paperId": "176863c3552f56a1cc1c05f8c71c0cb88a46cd9f",
    "title": "DiffusionMat: Alpha Matting as Sequential Refinement Learning",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Yangyang Xu",
        "Shengfeng He",
        "Wenqi Shao",
        "Kwan-Yee K. Wong",
        "Yu Qiao",
        "Ping Luo"
    ],
    "doi": "10.48550/arXiv.2311.13535",
    "arxivId": "2311.13535",
    "url": "https://www.semanticscholar.org/paper/176863c3552f56a1cc1c05f8c71c0cb88a46cd9f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we introduce DiffusionMat, a novel image matting framework that employs a diffusion model for the transition from coarse to refined alpha mattes. Diverging from conventional methods that utilize trimaps merely as loose guidance for alpha matte prediction, our approach treats image matting as a sequential refinement learning process. This process begins with the addition of noise to trimaps and iteratively denoises them using a pre-trained diffusion model, which incrementally guides the prediction towards a clean alpha matte. The key innovation of our framework is a correction module that adjusts the output at each denoising step, ensuring that the final result is consistent with the input image's structures. We also introduce the Alpha Reliability Propagation, a novel technique designed to maximize the utility of available guidance by selectively enhancing the trimap regions with confident alpha information, thus simplifying the correction task. To train the correction module, we devise specialized loss functions that target the accuracy of the alpha matte's edges and the consistency of its opaque and transparent regions. We evaluate our model across several image matting benchmarks, and the results indicate that DiffusionMat consistently outperforms existing methods. Project page at~\\url{https://cnnlstm.github.io/DiffusionMat",
    "citationCount": 4,
    "referenceCount": 59
}