{
    "paperId": "17862903b27a530e38a3e8647159554637e9fd39",
    "title": "Improving Classification Accuracy For Diabetic Retinopathy With Deep Learning",
    "year": 2025,
    "venue": "2025 IEEE International Conference on Interdisciplinary Approaches in Technology and Management for Social Innovation (IATMSI)",
    "authors": [
        "Aparajita Vaish",
        "Vaibhav Chandrakar"
    ],
    "doi": "10.1109/IATMSI64286.2025.10985144",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/17862903b27a530e38a3e8647159554637e9fd39",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Diabetic retinopathy (DR) is one of the primary contributors to vision impairment worldwide, highlighting the utmost need for early detection and diagnosis to prevent irreversible damage. In the last decade, deep learning (DL) has had a game-changing impact on medical imaging towards the development of faster and more accurate softwares for disease classification problems like DR detection. Although this has led to several promising achievements, existing models related to DR classification have fundamental limitations such as weak generalization across various datasets and suboptimal performance with real-world data. In this work, the classification of DR is conducted using a new approach combining SqueezeNet with Squeeze-and-Excitation (SE) blocks. The aim of this architecture is to provide improved computational efficiency and better feature extraction compared to more traditional models. The proposed model attained a test accuracy of 90.9% which is substantially better than the previously established results of DR image classification, as evidenced by experiments. The results underscore the potential of leveraging advanced DL techniques to enhance diagnostic accuracy, that may allow for similar clinical uses in the early detection of diabetic retinopathy.",
    "citationCount": 0,
    "referenceCount": 30
}