{
    "paperId": "1791789670559f4a0f8e7284e26142fd221c793d",
    "title": "On Designing a Two-stage Auction for Online Advertising",
    "year": 2021,
    "venue": "The Web Conference",
    "authors": [
        "Yiqing Wang",
        "Xiangyu Liu",
        "Zhenzhe Zheng",
        "Zhilin Zhang",
        "Miao Xu",
        "Chuan Yu",
        "Fan Wu"
    ],
    "doi": "10.1145/3485447.3512054",
    "arxivId": "2111.05555",
    "url": "https://www.semanticscholar.org/paper/1791789670559f4a0f8e7284e26142fd221c793d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2111.05555",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For the scalability of industrial online advertising systems, a two-stage auction architecture is widely used to enable efficient ad allocation on a large set of corpus within a limited response time. The current deployed two-stage ad auction usually retrieves an ad subset by a coarse ad quality metric in a pre-auction stage, and then determines the auction outcome by a refined metric in the subsequent stage. However, this simple and greedy solution suffers from performance degradation, as it regards the decision in each stage separately, leading to an improper ad selection metric for the pre-auction stage. In this work, we explicitly investigate the relation between the coarse and refined ad quality metrics, and design a two-stage ad auction by taking the decision interaction between the two stages into account. We decouple the design of the two-stage auction by solving a stochastic subset selection problem in the pre-auction stage and conducting a general second price (GSP) auction in the second stage. We demonstrate that this decouple still preserves the incentive compatibility of the auction mechanism. As the proposed formulation of the pre-auction stage is an NP-hard problem, we propose a scalable approximation solution by defining a new subset selection metric, namely Pre-Auction Score (PAS). Experiment results on both public and industrial dataset demonstrate the improvement on social welfare and revenue of the proposed two-stage ad auction, than the intuitive greedy two-stage auction and other baselines.",
    "citationCount": 19,
    "referenceCount": 44
}