{
    "paperId": "17e3a3245957f0cfec5f122b2302750734112db4",
    "title": "Modeling Dual Period-Varying Preferences for Takeaway Recommendation",
    "year": 2023,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Yuting Zhang",
        "Yiqing Wu",
        "Ran Le",
        "Yongchun Zhu",
        "Fuzhen Zhuang",
        "Ruidong Han",
        "Xiang Li",
        "Wei Lin",
        "Zhulin An",
        "Yongjun Xu"
    ],
    "doi": "10.1145/3580305.3599866",
    "arxivId": "2306.04370",
    "url": "https://www.semanticscholar.org/paper/17e3a3245957f0cfec5f122b2302750734112db4",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3580305.3599866",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Takeaway recommender systems, which aim to accurately provide stores that offer foods meeting users' interests, have served billions of users in our daily life. Different from traditional recommendation, takeaway recommendation faces two main challenges: (1) Dual Interaction-Aware Preference Modeling. Traditional recommendation commonly focuses on users' single preferences for items while takeaway recommendation needs to comprehensively consider users' dual preferences for stores and foods. (2) Period-Varying Preference Modeling. Conventional recommendation generally models continuous changes in users' preferences from a session-level or day-level perspective. However, in practical takeaway systems, users' preferences vary significantly during the morning, noon, night, and late night periods of the day. To address these challenges, we propose a Dual Period-Varying Preference modeling (DPVP) for takeaway recommendation. Specifically, we design a dual interaction-aware module, aiming to capture users' dual preferences based on their interactions with stores and foods. Moreover, to model various preferences in different time periods of the day, we propose a time-based decomposition module as well as a time-aware gating mechanism. Extensive offline and online experiments demonstrate that our model outperforms state-of-the-art methods on real-world datasets and it is capable of modeling the dual period-varying preferences. Moreover, our model has been deployed online on Meituan Takeaway platform, leading to an average improvement in GMV (Gross Merchandise Value) of 0.70%.",
    "citationCount": 12,
    "referenceCount": 48
}