{
    "paperId": "17e96d5b4ca7ca261c3fe0aeeb48c964cc660786",
    "title": "Phishing Website Detection Using LGBM Classifier With URL-Based Lexical Features",
    "year": 2022,
    "venue": "2022 IEEE Silchar Subsection Conference (SILCON)",
    "authors": [
        "Thahira A",
        "Ansamma John"
    ],
    "doi": "10.1109/SILCON55242.2022.10028793",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/17e96d5b4ca7ca261c3fe0aeeb48c964cc660786",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "People have become increasingly reliant on the internet for their everyday activities, and the majority of internet users are uninformed of the phishing attack, which is caused by the careless or unaware nature of humans, resulting in financial loss as well identity theft. Phishing detection is not a new research area; multiple efforts from various perspectives have been conducted in this domain and machine learning-based approaches have gained popularity among existing works. Machine learning-based model used a large number of features including external service-based features for phishing website detection, but these features are time-consuming and not suitable for real-time detection. This research proposes a fast and lightweight phishing website detection model based on URL-based lexical features, as well as a novel dataset. The experimental result shows that the parameter-tuned light gradient boosting machine (LGBM) classifier outperforms the random forest classifier, and the Pearson correlation algorithm outranks the other feature selection methods. The proposed approach out performs most of the existing method interms of accuracy with newly created dataset as well as the other two benchmark datasets.",
    "citationCount": 3,
    "referenceCount": 18
}