{
    "paperId": "17f93df6c9c6f75fd3f518f686a607cd5ce513bf",
    "title": "A Deep Learning Approach to Adaptive Query Processing for LSH",
    "year": 2022,
    "venue": "Proceedings of the 3rd International Conference on Industrial Control Network and System Engineering Research",
    "authors": [
        "Hongya Wang",
        "Cihai Sun"
    ],
    "doi": "10.1145/3556055.3556068",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/17f93df6c9c6f75fd3f518f686a607cd5ce513bf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Approximate Nearest Neighbor(ANN) search has been attracting more attention in recent years. Locality-Sensitive Hashing (LSH) is one of the most promising methods to ANN problem because of its theoretical guarantees and nice empirical performance. It is important to select the appropriate number of hash functions m and collision filtering threshold l to get ANN of a query object. The appropriate parameters can reduce IO cost and improve query accuracy. However, the state-of-the-art LSH method, QALSH employs fixed with a given dataset D and an approximation ratio c. As for various query and different k for KNN problem, the does not change, which would lead to extra IO and decrease accuracy. Deep learning techniques have prominent capability to capture underlying data distributions including outliers. In this paper, we propose a novel method based on deep learning techniques, which can predict for different queries with given parameters including c, k and so on. Firstly, Variational auto-encoder(VAE) is used to transform the original query to a dense representation. Then the given parameters are also embeded to predict . In order to reflect the data distribution of the given dataset, we design a two-stage training strategy. Our experimental result shows the effectiveness and efficiency of our method.",
    "citationCount": 0,
    "referenceCount": 10
}