{
    "paperId": "18058567c18375e69b878ad32670ab336e0d289e",
    "title": "Multi-organ transcriptomic profiles and gene-regulation network underlying vibriosis resistance in tongue sole",
    "year": 2024,
    "venue": "Scientific Data",
    "authors": [
        "Quanchao Chen",
        "Xinran Ma",
        "Jie Wang",
        "Meng Shi",
        "Guobin Hu",
        "Songlin Chen",
        "Qian Zhou"
    ],
    "doi": "10.1038/s41597-024-03651-z",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/18058567c18375e69b878ad32670ab336e0d289e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41597-024-03651-z",
    "publicationTypes": [
        "Dataset",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Vibrio spp. are major pathogens responsible for mortality and disease in various marine aquaculture organisms. Effective disease control and genetic breeding strategies rely heavily on understanding host vibriosis resistance mechanisms. The Chinese tongue sole (Cynoglossus semilaevis) is economically vital but suffers from substantial mortalities due to vibriosis. Through continuous selective breeding, we have successfully obtained vibriosis-resistant families of this species. In this study, we conducted RNA-seq analysis on three organs, including liver, spleen and intestine from selected resistant and susceptible tongue soles. Additionally, we integrated these data with our previously published RNA-seq datasets of skin and gill, enabling the construction of organ-specific transcriptional profiles and a comprehensive gene co-expression network elucidating the differences in vibriosis resistance. Furthermore, we identified 12 modules with organ-specific functional implications. Overall, our findings provide a valuable resource for investigating the molecular basis of vibriosis resistance in fish, offering insights into target genes and pathways essential for molecular selection and genetic manipulation to enhance vibriosis resistance in fish breeding programs.",
    "citationCount": 1,
    "referenceCount": 25
}