{
    "paperId": "180ac05fe201e8d53e23273f2fed874fdd175297",
    "title": "$\\pi$-MPPI: A Projection-Based Model Predictive Path Integral Scheme for Smooth Optimal Control of Fixed-Wing Aerial Vehicles",
    "year": 2025,
    "venue": "IEEE Robotics and Automation Letters",
    "authors": [
        "Edvin Martin Andrejev",
        "Amith Manoharan",
        "Karl-Eerik Unt",
        "Arun Kumar Singh"
    ],
    "doi": "10.1109/LRA.2025.3568323",
    "arxivId": "2504.10962",
    "url": "https://www.semanticscholar.org/paper/180ac05fe201e8d53e23273f2fed874fdd175297",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Model Predictive Path Integral (MPPI) is a popular sampling-based Model Predictive Control (MPC) algorithm for nonlinear systems. It optimizes trajectories by sampling control sequences and averaging them. However, a key issue with MPPI is the non-smoothness of the optimal control sequence, leading to oscillations in systems like fixed-wing aerial vehicles (FWVs). Existing solutions use post-hoc smoothing, which fails to bound control derivatives. This letter introduces a new approach: we add a projection filter <inline-formula><tex-math notation=\"LaTeX\">$\\pi$</tex-math></inline-formula> to minimally correct control samples, ensuring bounds on control magnitude and higher-order derivatives. The filtered samples are then averaged using MPPI, leading to our <inline-formula><tex-math notation=\"LaTeX\">$\\pi$</tex-math></inline-formula>-MPPI approach. We minimize computational overhead by using a neural accelerated custom optimizer for the projection filter. <inline-formula><tex-math notation=\"LaTeX\">$\\pi$</tex-math></inline-formula>-MPPI offers a simple way to achieve arbitrary smoothness in control sequences. While we focus on FWVs, this projection filter can be integrated into any MPPI pipeline. Applied to FWVs, <inline-formula><tex-math notation=\"LaTeX\">$\\pi$</tex-math></inline-formula>-MPPI is easier to tune than the baseline, resulting in smoother, more robust performance.",
    "citationCount": 2,
    "referenceCount": 20
}