{
    "paperId": "1821b71c5889aa18cc72501a394eb57e352ca3f1",
    "title": "A Visual Analytics System for Profiling Urban Land Use Evolution",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "C. Santos",
        "Maryam Hosseini",
        "João Rulff",
        "Nivan Ferreira",
        "Luc Wilson",
        "Fábio Miranda",
        "Cláudio T. Silva",
        "Marcos Lage"
    ],
    "doi": null,
    "arxivId": "2112.06122",
    "url": "https://www.semanticscholar.org/paper/1821b71c5889aa18cc72501a394eb57e352ca3f1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growth of cities calls for regulations on how urban space is used and zoning resolutions define how and for what purpose each piece of land is going to be used. Tracking land use and zoning evolution can reveal a wealth of information about urban development. For that matter, cities have been releasing data sets describing the historical evolution of both the shape and the attributes of land units. The complex nature of zoning code and land-use data, however, makes the analysis of such data quite challenging and often time-consuming. We address these challenges by introducing Urban Chronicles, an open-source web-based visual analytics system that enables interactive exploration of changes in land use patterns. Using New York City's Primary Land Use Tax Lot Output (PLUTO) as an example, we show the capabilities of the system by exploring the data over several years at different scales. Urban Chronicles supports on-the-fly aggregation and filtering operations by using a tree-based data structure that leverages the hierarchical nature of the data set to index the shape and attributes of geographical regions that change over time. We demonstrate the utility of our system through a set of case studies that analyze the impact of Hurricane Sandy on land use attributes, as well as the effects of proposed rezoning plans in Downtown Brooklyn.",
    "citationCount": 2,
    "referenceCount": 77
}