{
    "paperId": "1836c28765828ce06c5e4bc41cad966f9f7b586c",
    "title": "SP-MoE: Speculative Decoding and Prefetching for Accelerating MoE-based Model Inference",
    "year": 2025,
    "venue": "",
    "authors": [
        "Liangkun Chen",
        "Zijian Wen",
        "Tian Wu",
        "Xiaoxi Zhang",
        "Chuan Wu"
    ],
    "doi": null,
    "arxivId": "2510.10302",
    "url": "https://www.semanticscholar.org/paper/1836c28765828ce06c5e4bc41cad966f9f7b586c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Mixture-of-Experts (MoE) architecture has been widely adopted in large language models (LLMs) to reduce computation cost through model sparsity. Employing speculative decoding (SD) can further accelerate MoE inference by drafting multiple tokens per step and verifying them in parallel. However, combining MoE with SD inflates GPU memory and aggravates CPU-GPU bandwidth contention during multi-token verification. Existing MoE offloading systems are SD-agnostic and do not address this bottleneck. We present SP-MoE, the first SD-aware expert-offloading and compute-communication pipelining framework. SP-MoE introduces: (1) speculative expert prefetching that exploits structural correspondence between the draft and target models to prefetch likely experts ahead of verification; (2) a cutoff-layer policy that bounds per-layer prefetch depth based on empirical profiles and an analytical latency model, guaranteeing just-in-time availability without overfetch; and (3) a pipelined runtime with asynchronous prefetch threads and batched I/O to hide loading latency. Extensive experiments demonstrate that SP-MoE achieves a 1.07-3.5 times TPOT speedup over state-of-the-art methods across diverse datasets, environments, and MoE-based models.",
    "citationCount": 0,
    "referenceCount": 44
}