{
    "paperId": "184fc8455466c2d6087ce55e7d472e74d9dec3ca",
    "title": "Efficient Secret Sharing for Large-Scale Applications",
    "year": 2024,
    "venue": "IACR Cryptology ePrint Archive",
    "authors": [
        "Sarvar Patel",
        "Giuseppe Persiano",
        "Joon Young Seo",
        "Kevin Yeo"
    ],
    "doi": "10.1145/3658644.3670379",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/184fc8455466c2d6087ce55e7d472e74d9dec3ca",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3658644.3670379",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Threshold secret sharing enables distributing a message to n parties such that no subset of fewer than t parties can learn the message, whereas any subset of at least t parties can recover the message. Despite being a fundamental primitive, secret sharing still suffers from one significant drawback, where its message reconstruction algorithm is computationally expensive for large privacy thresholds t. In this paper, we aim to address this significant drawback. We study general (t,c)-ramp secret sharing schemes where the number of parties c needed to reconstruct the secret may be larger than t. We present a ramp secret sharing scheme whose reconstruction time is 2-7.8x faster than prior constructions suitable against adversaries that adaptively corrupt parties. For t = 220, our new protocol has reconstruction time of 5 seconds whereas prior work requires nearly half a minute. We see improvements starting from as small as t = 256. Furthermore, we obtain correctness threshold as small as c ≥ 1.05t. To obtain our construction, we first improve the secret sharing frameworks by Cramer et al. (EUROCRYPT'15) and Applebaum et al. (CRYPTO'23) from erasure codes. Our new framework obtains secret sharing schemes that may be used against adversaries with adaptive corruptions while requiring only weaker correctness guarantees from the underlying erasure code with a distributed generation property. Furthermore, our new framework also maintains the linear homomorphism of the prior works. Afterwards, we present a concretely efficient erasure code from random band matrices that satisfies the distributed generation property. We show that our secret sharing scheme can improve many real-world applications. In secure aggregation protocols for federated learning, we obtain up to 22% reductions in computational cost by replacing Shamir's scheme with our construction. We extend our protocol to obtain a verifiable ramp secret sharing scheme where each party can verify the consistency of the shares. Our new verifiable ramp secret sharing has 8.2-25.2x faster sharing and 2.7-23.2x faster reconstruction time compared to prior works. Finally, we present an improved distributed verifiable random function that may be used for decentralized randomness beacons.",
    "citationCount": 2,
    "referenceCount": 78
}