{
    "paperId": "1881ec4b5610f549e905880ef3e91c7c175c847e",
    "title": "A Systematic Study on Early Stopping Metrics in HPO and the Implications of Uncertainty",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Jiawei Guan",
        "Feng Zhang",
        "Jiesong Liu",
        "Xiaoyong Du",
        "Xipeng Shen"
    ],
    "doi": "10.14778/3725688.3725689",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1881ec4b5610f549e905880ef3e91c7c175c847e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The development of hyperparameter optimization (HPO) algorithms is an important topic within both the machine learning and data management domains. While numerous strategies employing early stopping mechanisms have been proposed to bolster HPO efficiency, there remains a notable deficiency in understanding how the selection of early stopping metrics influences the reliability of early stopping decisions and, by extension, the broader HPO outcomes. This paper undertakes a systematic exploration of the impact of metric selection on the effectiveness of early stopping-based HPO. Specifically, we introduce a set of metrics that incorporate uncertainty and highlight their practical significance in enhancing the reliability of early stopping decisions. Our empirical experiments on HPO and NAS benchmarks show that using training loss as an early stopping metric in the early training stages improves HPO outcomes by up to 24.76% compared to the more widely accepted validation loss. Furthermore, integrating uncertainty into the metric yields an additional improvement of up to 4% under budget constraints, translating into meaningful resource savings and scalability benefits in large-scale HPO scenarios. These findings demonstrate the critical role of metric selection while shedding light on the potential implications of integrating uncertainty as a metric. This research provides empirical insights that serve as a compass for the selection and formulation of metrics, thereby contributing to a more profound comprehension of mechanisms underpinning early stopping-based HPO.",
    "citationCount": 0,
    "referenceCount": 65
}