{
    "paperId": "1887032db972cc2289713650ad9ae3548c2c3d83",
    "title": "Adaptive Merging on Phase Change Memory",
    "year": 2022,
    "venue": "Fundamenta Informaticae",
    "authors": [
        "Wojciech Macyna",
        "Michal Kukowski"
    ],
    "doi": "10.3233/FI-222144",
    "arxivId": "2204.01667",
    "url": "https://www.semanticscholar.org/paper/1887032db972cc2289713650ad9ae3548c2c3d83",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2204.01667",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Indexing is a well-known database technique used to facilitate data access and speed up query processing. Nevertheless, the construction and modification of indexes are very expensive. In traditional approaches, all records in the database table are equally covered by the index. It is not effective, since some records may be queried very often and some never. To avoid this problem, adaptive merging has been introduced. The key idea is to create an index adaptively and incrementally as a side-product of query processing. As a result, the database table is indexed partially depending on the query workload. This paper faces the problem of adaptive merging for phase change memory (PCM). The most important features of this memory type are limited write endurance and high write latency. As a consequence, adaptive merging should be investigated from the scratch. We solve this problem in two steps. First, we apply several PCM optimization techniques to the traditional adaptive merging approach. We prove that the proposed method (eAM) outperforms a traditional approach by 60%. After that, we invent the framework for adaptive merging (PAM) and propose a new variant of the PCM-optimized index. It further improves the system performance by 20% for databases where search queries interleave with data modifications.",
    "citationCount": 1,
    "referenceCount": 35
}