{
    "paperId": "18a5860ae7589af8216ce6c03c5ce52cf2469a8f",
    "title": "Survey of Disaggregated Memory: Cross-layer Technique Insights for Next-Generation Datacenters",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jing Wang",
        "Chao Li",
        "Taolei Wang",
        "Jinyang Guo",
        "Hanzhang Yang",
        "Yiming Zhuansun",
        "Minyi Guo"
    ],
    "doi": "10.48550/arXiv.2503.20275",
    "arxivId": "2503.20275",
    "url": "https://www.semanticscholar.org/paper/18a5860ae7589af8216ce6c03c5ce52cf2469a8f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing scale of data requires efficient memory subsystems with large memory capacity and high memory performance. Disaggregated architecture has become a promising solution for today's cloud and edge computing for its scalability and elasticity. As a critical part of disaggregation, disaggregated memory faces many design challenges in many dimensions, including hardware scalability, architecture structure, software system design, application programmability, resource allocation, power management, etc. These challenges inspire a number of novel solutions at different system levels to improve system efficiency. In this paper, we provide a comprehensive review of disaggregated memory, including the methodology and technologies of disaggregated memory system foundation, optimization, and management. We study the technical essentials of disaggregated memory systems and analyze them from the hardware, architecture, system, and application levels. Then, we compare the design details of typical cross-layer designs on disaggregated memory. Finally, we discuss the challenges and opportunities of future disaggregated memory works that serve better for next-generation elastic and efficient datacenters.",
    "citationCount": 1,
    "referenceCount": 150
}