{
    "paperId": "18a73fb1947aaf6d6d25ff16e6210c5d9483cbc5",
    "title": "Leveraging Core and Uncore Frequency Scaling for Power-Efficient Serverless Workflows",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Achilleas Tzenetopoulos",
        "Dimosthenis Masouros",
        "Sotirios Xydis",
        "Dimitrios Soudris"
    ],
    "doi": "10.48550/arXiv.2407.18386",
    "arxivId": "2407.18386",
    "url": "https://www.semanticscholar.org/paper/18a73fb1947aaf6d6d25ff16e6210c5d9483cbc5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Serverless workflows have emerged in Function-as-a-Service (FaaS) platforms to represent the operational structure of traditional applications. With latency propagation effects becoming increasingly prominent, step-wise resource tuning is required to address Service-Level-Objectives (SLOs). Modern processors' allowance for fine-grained Dynamic Voltage and Frequency Scaling (DVFS), coupled with serverless workflows' intermittent nature, presents a unique opportunity to reduce power while meeting SLOs. We introduce $\\Omega$kypous, an SLO-driven DVFS framework for serverless workflows. $\\Omega$kypous employs a grey-box model that predicts functions' execution latency and power under different Core and Uncore frequency combinations. Based on these predictions and the timing slacks between workflow functions, $\\Omega$kypous uses a closed-loop control mechanism to dynamically adjust Core and Uncore frequencies, thus minimizing power consumption without compromising predefined end-to-end latency constraints. Our evaluation on real-world traces from Azure, against state-of-the-art power management frameworks, demonstrates an average power consumption reduction of 16\\%, while consistently maintaining low SLO violation rates (1.8\\%), when operating under power caps.",
    "citationCount": 2,
    "referenceCount": 86
}