{
    "paperId": "18b868db67b84c1029b2596cfb0c2f9d0d8e9801",
    "title": "OLxPBench: Real-time, Semantically Consistent, and Domain-specific are Essential in Benchmarking, Designing, and Implementing HTAP Systems",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Guoxin Kang",
        "Lei Wang",
        "Wanling Gao",
        "Fei Tang",
        "Jianfeng Zhan"
    ],
    "doi": "10.1109/ICDE53745.2022.00182",
    "arxivId": "2203.16095",
    "url": "https://www.semanticscholar.org/paper/18b868db67b84c1029b2596cfb0c2f9d0d8e9801",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2203.16095",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As real-time analysis on the fresh data become in-creasingly compelling, more organizations deploy Hybrid Trans-actional/Analytical Processing (HTAP) systems to support real-time queries on data recently generated by online transaction processing. This paper argues that real-time queries, semantically consistent schema, and domain-specific workloads are essential in benchmarking, designing, and implementing HTAP systems. However, most state-of-the-art and state-of-the-practice bench-marks ignore those critical factors. Hence, at best, they are incommensurable and, at worst, misleading in benchmarking, designing, and implementing HTAP systems. This paper presents OLxPBench, a composite HTAP benchmark suite. OLxPBench proposes: (1) the abstraction of a hybrid transaction, performing a real-time query in-between an online transaction, to model widely-observed behavior pattern - making a quick decision while consulting real-time analysis; (2) a semantically consistent schema to express the relationships between OLTP and OLAP schema; (3) the combination of domain-specific and general benchmarks to characterize diverse application scenarios with varying resource demands. Our evaluations justify the three design decisions of OLxPBench and pinpoint the bottlenecks of two mainstream distributed HTAP DBMSs. International Open Benchmark Council (Bench Council) sets up the OLxP-Bench homepage at https://www.benchcouncil.org/olxpbench/. Its source code is available from https://github.com/BenchCouncil/olxpbench.git.",
    "citationCount": 11,
    "referenceCount": 45
}