{
    "paperId": "18e86623c02eb8fbde6e4311979a760a549b1256",
    "title": "Political Optimization Algorithm with a Hybrid Deep Learning Assisted Malicious URL Detection Model",
    "year": 2023,
    "venue": "Sustainability",
    "authors": [
        "Mohammed Aljebreen",
        "Fatma S. Alrayes",
        "Sumayh S. Aljameel",
        "Muhammad Kashif Saeed"
    ],
    "doi": "10.3390/su152416811",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/18e86623c02eb8fbde6e4311979a760a549b1256",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/15/24/16811/pdf?version=1702475811",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the enhancement of the Internet of Things (IoT), smart cities have developed the idea of conventional urbanization. IoT networks permit distributed smart devices to collect and process data in smart city structures utilizing an open channel, the Internet. Accordingly, challenges like security, centralization, privacy (i.e., execution data poisoning and inference attacks), scalability, transparency, and verifiability restrict faster variations of smart cities. Detecting malicious URLs in an IoT environment is crucial to protect devices and the network from potential security threats. Malicious URL detection is an essential element of cybersecurity. It is established that malicious URL attacks mean large risks in smart cities, comprising financial damages, losses of personal identifications, online banking, losing data, and loss of user confidentiality in online businesses, namely e-commerce and employment of social media. Therefore, this paper concentrates on the proposal of a Political Optimization Algorithm by a Hybrid Deep Learning Assisted Malicious URL Detection and Classification for Cybersecurity (POAHDL-MDC) technique. The presented POAHDL-MDC technique identifies whether malicious URLs occur. To accomplish this, the POAHDL-MDC technique performs pre-processing to transform the data to a compatible format, and a Fast Text word embedding process is involved. For malicious URL recognition, a Hybrid Deep Learning (HDL) model integrates the features of stacked autoencoder (SAE) and bi-directional long short-term memory (Bi-LSTM). Finally, POA is exploited for optimum hyperparameter tuning of the HDL technique. The simulation values of the POAHDL-MDC approach are tested on a Malicious URL database, and the outcome exhibits an improvement of the POAHDL-MDC technique with a maximal accuracy of 99.31%.",
    "citationCount": 7,
    "referenceCount": 13
}