{
    "paperId": "19196ed41dd72abc3d7d1d81e2dd0647ae91df87",
    "title": "Hybrid Querying Over Relational Databases and Large Language Models",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Fuheng Zhao",
        "D. Agrawal",
        "A. El Abbadi"
    ],
    "doi": "10.48550/arXiv.2408.00884",
    "arxivId": "2408.00884",
    "url": "https://www.semanticscholar.org/paper/19196ed41dd72abc3d7d1d81e2dd0647ae91df87",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database queries traditionally operate under the closed-world assumption, providing no answers to questions that require information beyond the data stored in the database. Hybrid querying using SQL offers an alternative by integrating relational databases with large language models (LLMs) to answer beyond-database questions. In this paper, we present the first cross-domain benchmark, SWAN, containing 120 beyond-database questions over four real-world databases. To leverage state-of-the-art language models in addressing these complex questions in SWAN, we present two solutions: one based on schema expansion and the other based on user defined functions. We also discuss optimization opportunities and potential future directions. Our evaluation demonstrates that using GPT-4 Turbo with few-shot prompts, one can achieves up to 40.0\\% in execution accuracy and 48.2\\% in data factuality. These results highlights both the potential and challenges for hybrid querying. We believe that our work will inspire further research in creating more efficient and accurate data systems that seamlessly integrate relational databases and large language models to address beyond-database questions.",
    "citationCount": 4,
    "referenceCount": 47
}