{
    "paperId": "192e873c9cad904c9db2daac3e1ec4f12a895ffa",
    "title": "Learned Query Optimization by Constraint-Based Query Plan Augmentation",
    "year": 2024,
    "venue": "Mathematics",
    "authors": [
        "Chen Ye",
        "Haoyang Duan",
        "Hua Zhang",
        "Yifan Wu",
        "Guojun Dai"
    ],
    "doi": "10.3390/math12193102",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/192e873c9cad904c9db2daac3e1ec4f12a895ffa",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/math12193102",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Over the last decades, various cost-based optimizers have been proposed to generate optimal plans for SQL queries. These optimizers are key to achieving good performance in database systems and can speed up query execution. Still, they may need enormous expert efforts and perform poorly on complicated queries. Learning-based optimizers have been shown to achieve high-quality plans by learning from past experiences. However, these solutions treat each query separately and neglect the semantic equivalence among different queries. Intuitively, a high-quality plan may be obtained for a complicated query by discovering a simple equivalent query. Motivated by this, in this paper, we present Celo, a novel constraint-enhanced learned optimizer to directly integrate the equivalent information of queries into the learning-based model. We apply denial constraints to identify equivalent queries by replacing equivalent predicates. Given a query, we augment the query plans generated by the learning-based model with the high-quality plans of its equivalent queries. Then, a more potentially well-performed plan will be predicted among the augmented query plans. Extensive experiments using real-world datasets demonstrated that Celo outperforms the previous state-of-the-art (SOTA) results even with few constraints.",
    "citationCount": 1,
    "referenceCount": 28
}