{
    "paperId": "195f1a34c53489676cb74cc3da66c15024e48400",
    "title": "Generalized Delayed Feedback Model with Post-Click Information in Recommender Systems",
    "year": 2022,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Jia-Qi Yang",
        "De-chuan Zhan"
    ],
    "doi": "10.48550/arXiv.2206.00407",
    "arxivId": "2206.00407",
    "url": "https://www.semanticscholar.org/paper/195f1a34c53489676cb74cc3da66c15024e48400",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.00407",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predicting conversion rate (e.g., the probability that a user will purchase an item) is a fundamental problem in machine learning based recommender systems. However, accurate conversion labels are revealed after a long delay, which harms the timeliness of recommender systems. Previous literature concentrates on utilizing early conversions to mitigate such a delayed feedback problem. In this paper, we show that post-click user behaviors are also informative to conversion rate prediction and can be used to improve timeliness. We propose a generalized delayed feedback model (GDFM) that unifies both post-click behaviors and early conversions as stochastic post-click information, which could be utilized to train GDFM in a streaming manner efficiently. Based on GDFM, we further establish a novel perspective that the performance gap introduced by delayed feedback can be attributed to a temporal gap and a sampling gap. Inspired by our analysis, we propose to measure the quality of post-click information with a combination of temporal distance and sample complexity. The training objective is re-weighted accordingly to highlight informative and timely signals. We validate our analysis on public datasets, and experimental performance confirms the effectiveness of our method.",
    "citationCount": 11,
    "referenceCount": 45
}