{
    "paperId": "197a8aaf87a3491c51dd6a7f1e5e088ee5959bdc",
    "title": "Motion Attitude Recognition and Behavior Prediction Algorithm Based on Wireless Sensor Network",
    "year": 2021,
    "venue": "Mobile Information Systems",
    "authors": [
        "Tianping Zhang",
        "Bo Zhang",
        "Lei Liu",
        "Yang Liu"
    ],
    "doi": "10.1155/2021/3994003",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/197a8aaf87a3491c51dd6a7f1e5e088ee5959bdc",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/misy/2021/3994003.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The wireless sensor network is an integral part of the physical information system. Disperse sensors through a set of special spaces track and record the natural state of the environment and manage the information collected in a central location. The sensors use wireless connections to create their own networks. Wireless sensor network technology has the advantages of flexible deployment and convenient use and has played an important role in the field of user behavior recognition. By deploying wireless sensor network technology, users can collect daily information, capture users’ behavior habits, and analyze users’ health status. In the deployment and application of this type of technology, it is very important to build an effective model of the logical sequence relationship of the monitored person’s behavior. The sensor data can be sent to the target user through wireless transmission. Action recognition is often based on a single feature for learning and judgment, so there are many difficulties in practical applications. This article aims to study motion shake awareness and action prediction algorithms based on wireless sensor networks. Aiming at the research of human pose recognition algorithm, to optimize the overall performance of the model, this article suggests the use of multimodal input, uses a 2D and 3D network structure, and finally, proposes two network weighted fusion strategies. Aiming at the research of pedestrian motion discrimination, this article offers a behavior prediction algorithm based on multifeature joint learning. The algorithm adds the feature vectors output by gesture recognition and mask prediction and uses a cross-entropy cost function to jointly learn and predict classification. The results of the survey show that the pedestrian gesture recognition and motion recognition algorithm based on the wireless sensor network proposed in this paper has good performance and can be widely used in real scenes such as video surveillance. The accuracy of the gesture recognition algorithm in the UCF101 dataset and the HMDB51 dataset was 96% and 72%, respectively.",
    "citationCount": 3,
    "referenceCount": 22
}