{
    "paperId": "19b72ee7974cc2c5b715ba14e73af3bbd0fbf368",
    "title": "Application of the Operational Research Method to Determine the Optimum Transport Collection Cycle of Municipal Waste in a Predesignated Urban Area",
    "year": 2019,
    "venue": "Sustainability",
    "authors": [
        "Ondrej Stopka",
        "Mária Stopková",
        "R. Kampf"
    ],
    "doi": "10.3390/SU11082275",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/19b72ee7974cc2c5b715ba14e73af3bbd0fbf368",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/11/8/2275/pdf?version=1555394321",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper deals with waste management. The aim is to find out whether the number of municipal mixed waste bins can be reduced due to the impact of waste separation and to determine the optimum municipal waste collection cycle within a predesignated area with an existing urban road network. The number of mixed waste bins depends on two factors—household waste volume and household waste composition. Both of these factors have a significant impact on the number of mixed waste bins required, with household waste composition being of particular importance when it comes to calculating the potential reduction in the number of mixed waste bins required due to waste separation. The calculations for the weight and volume of mixed household waste per person and the composition (types) thereof are presented accordingly. The results reveal which types of waste are the most useful in minimising the number of mixed waste bins by up to 30–50%. To determine the optimum waste collection cycle within the predesignated area with a real urban road network, the Nearest Neighbour Search method was applied. In the discussion, the focus is on whether other methods, including the Two-Phase Heuristic approach and the Bellman-Ford Algorithm, could be applied to solve the problem, whereby parameters such as application time and the capacity of the waste collection vehicle are compared.",
    "citationCount": 28,
    "referenceCount": 63
}