{
    "paperId": "19bb2768ae24d34747b76de66cdf9725b8fddc2f",
    "title": "Sole GNSS Sensor Extrinsic Calibration Methods for Mobile Mapping Systems",
    "year": 2022,
    "venue": "IEEE Robotics and Automation Letters",
    "authors": [
        "Sheng Bao",
        "W. Shi",
        "Pengxin Chen",
        "Haodong Xiang"
    ],
    "doi": "10.1109/LRA.2022.3193632",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/19bb2768ae24d34747b76de66cdf9725b8fddc2f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A mobile mapping system (MMS) is a widely-used moving platform for the acquisition of rich geospatial information and requires sensor calibration to guarantee data quality. Global navigation satellite system (GNSS) sensor and light detection and ranging (LiDAR) are important parts of an MMS, and the extrinsic calibration between them can markedly improve its performance. A sole GNSS sensor is generally used in a portable MMS, which is the current trend. However, existing extrinsic calibration methods of GNSS/inertial navigation system (INS) are not applicable for the sole GNSS sensor because the former requires relative six degrees of freedom (DoF) pose output for both sensors and the latter can only provide 3-DoF positions. Here, we propose two sole GNSS sensor extrinsic calibration methods: one is a target-based direct calculation method and the other is a non-target-based automatic iterative method. The experiment results show the two methods have good repeatability, the error of the target-based method is below 3 cm, and the error of the non-target-based method is below 2 cm.",
    "citationCount": 4,
    "referenceCount": 26
}