{
    "paperId": "19ef9758c5cc6ac6e1d768c0566d492fe54a10ad",
    "title": "Toward Computer Vision-based Machine Intelligent Hybrid Memory Management",
    "year": 2021,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "Thaleia Dimitra Doudali",
        "Ada Gavrilovska"
    ],
    "doi": "10.1145/3488423.3519325",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/19ef9758c5cc6ac6e1d768c0566d492fe54a10ad",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current state-of-the-art systems for hybrid memory management are enriched with machine intelligence. To enable the practical use of Machine Learning (ML), system-level page schedulers focus the ML model training over a small subset of the applications’ memory footprint. At the same time, they use existing lightweight historical information to predict the access behavior of majority of the pages. To maximize application performance improvements, the pages selected for machine learning-based management are identified with elaborate page selection methods. These methods involve the calculation of detailed performance estimates depending on the configuration of the hybrid memory platform. This paper explores the opportunities to reduce such operational overheads of machine learning-based hybrid memory page schedulers via use of visualization techniques to depict memory access patterns, and reveal spatial and temporal correlations among the selected pages, that current methods fail to leverage. We propose an initial version of a visualization pipeline for prioritizing pages for machine learning, that is independent of the hybrid memory configuration. Our approach selects pages whose ML-based management delivers, on average, performance levels within 5% of current solutions, while reducing by 75 × the page selection time. We discuss future directions and make a case that visualization and computer vision methods can unlock new insights and reduce the operational complexity of emerging systems solutions.",
    "citationCount": 2,
    "referenceCount": 14
}