{
    "paperId": "1a1ac6b4c0112c03fc4738e94c971151e3450b10",
    "title": "Streaming Machine Learning for Supporting Data Prefetching in Modern Data Storage Systems",
    "year": 2023,
    "venue": "Proceedings of the First Workshop on AI for Systems",
    "authors": [
        "Edson Ramiro Lucas Filho",
        "Lun Yang",
        "Kebo Fu",
        "H. Herodotou"
    ],
    "doi": "10.1145/3588982.3603608",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1a1ac6b4c0112c03fc4738e94c971151e3450b10",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3588982.3603608",
    "publicationTypes": [
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern data storage systems optimize data access by distributing data across multiple storage tiers and caches, based on numerous tiering and caching policies. The policies' decisions, and in particular the ones related to data prefetching, can severely impact the performance of the entire storage system. In recent years, various machine learning algorithms have been employed to model access patterns in complex data storage workloads. Even though data storage systems handle a constantly changing stream of file requests, current approaches continue to train their models offline in a batch-based approach. In this paper, we investigate the use of streaming machine learning to support data prefetching decisions in data storage systems as it introduces various advantages such as high training efficiency, high prediction accuracy, and high adaptability to changing workload patterns. After extracting a representative set of features in an online fashion, streaming machine learning models can be trained and tested while the system is running. To validate our methodology, we present one streaming classification model to predict the next file offset to be read in a file. We assess the model's performance using production traces provided by Huawei Technologies and demonstrate that streaming machine learning is a feasible approach with low memory consumption and minimal training delay, facilitating accurate predictions in real-time.",
    "citationCount": 2,
    "referenceCount": 35
}