{
    "paperId": "1a3bb6bc8f958a77f66adda694faca8fedd1df2d",
    "title": "Comprehensive Evaluation & Improvement of HEMO Routing for Green Smart-City Transport",
    "year": 2025,
    "venue": "Gamification and Augmented Reality",
    "authors": [
        "Amrita Prakash",
        "Md. Amir Khusru Akhtar"
    ],
    "doi": "10.56294/gr2025266",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1a3bb6bc8f958a77f66adda694faca8fedd1df2d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction; Smart cities want smart routing to saves fuel, cuts pollution and to handles traffic in real time. This work progresses the existing HEMO algorithm by incorporating eco-friendly parameters. Objective; In this paper, we propose two major enhancements to the HEMO-Routing algorithm. First, we add real-time traffic adjustment and a detailed energy-consumption model as new objectives. Second, we improve optimization by using an Adaptive Genetic Algorithm for broad search and Simultaneous Perturbation Stochastic Approximation for fine-tuning. Method; We test on the Extended Solomon Dataset (25 road segments with realistic distances, congestion, noise, emissions, and speed limits) in MATLAB 2021 on a Windows 11 PC (Intel i5-1135G7, 8 GB RAM). Compared to the original, our enhanced method boosts Pareto hypervolume to +12 %, cuts generational distance from by –18.8 %, lowers CO₂ from 152.4 g/km to 129.8 g/km (–14.8 %), and trims energy use from 8.75 kWh to 7.87 kWh (–10.1 %). It also converges in 200 instead of 250 iterations (–20 %), with only a 5.3 % runtime overhead. Result; These results show that our extensions deliver practical, eco-friendly routes with minimal extra compute, making the approach ideal for real-time smart-city applications.Conclusions; We made HEMO smarter by adding live traffic and energy-saving goals. With AGA and SPSA, it finds better, greener routes faster. Perfect for smart cities, and ready for EVs and bigger setups in future.",
    "citationCount": 0,
    "referenceCount": 10
}