{
    "paperId": "1a50bb2f28d05bc1234377120d4f95b161f6f3bd",
    "title": "Fostering Design for Sustainability through the Adoption of Computer-Aided Engineering Tools in the Development of Energy-Related Products",
    "year": 2024,
    "venue": "Sustainability",
    "authors": [
        "C. Favi",
        "Daniele Landi",
        "R. Garziera",
        "Marta Rossi"
    ],
    "doi": "10.3390/su16093516",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1a50bb2f28d05bc1234377120d4f95b161f6f3bd",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/16/9/3516/pdf?version=1713866674",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The main challenge to face in the development of energy-related products is represented by the adoption of effective design for sustainability strategies that encompasses the adoption of engineering design tools, knowledge collection, and reuse/sharing in technical departments. This present paper proposes an engineering design for sustainability methodology that assists engineers in developing energy-related products in compliance with ecodesign standards. The methodology uses virtual prototyping tools to assess energy consumption in compliance with energy labeling directives and analyze different use scenarios. The results obtained by numerical simulations (e.g., Finite Element Method—FEM, Computational Fluid Dynamics—CFD) are used to create specific design eco-knowledge in the field of energy-related products. Numerical results are linked with design configurations to understand the benefits introduced by engineering design choices. This knowledge is stored in a structured database with the aim of being reused when a new product is developed or improved/upgraded. The case study of an induction hob, belonging to the household appliance product family, is investigated to understand the potential and drawbacks of the presented approach in a real application. The results show that potential energy and environmental performance benefits are achieved (e.g., reduction of energy losses, achievement of A+ energy class, and overall life cycle environmental impact reduction). Additionally, a new set of ecodesign guidelines are defined for this product family and employed in developing new compliant products belonging to the same family.",
    "citationCount": 3,
    "referenceCount": 50
}