{
    "paperId": "1a5a99e7dabc40534b4cef67841f2dbcaf48c4aa",
    "title": "ElasticBLAST: Accelerating Sequence Search via Cloud Computing",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "Christiam Camacho",
        "G. Boratyn",
        "V. Joukov",
        "Roberto Vera Alvarez",
        "Thomas L. Madden"
    ],
    "doi": "10.1101/2023.01.04.522777",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1a5a99e7dabc40534b4cef67841f2dbcaf48c4aa",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcbioinformatics.biomedcentral.com/counter/pdf/10.1186/s12859-023-05245-9",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Biomedical researchers use alignments produced by BLAST (Basic Local Alignment Search Tool) to categorize their query sequences. Producing such alignments is an essential bioinformatics task that is well suited for the cloud. The cloud can perform many calculations quickly as well as store and access large volumes of data. Bioinformaticians can also use it to collaborate with other researchers, sharing their results, datasets and even their pipelines on a common platform. Results We present ElasticBLAST, a cloud native application to perform BLAST alignments in the cloud. ElasticBLAST can handle anywhere from a few to many thousands of queries and run the searches on thousands of virtual CPUs (if desired), deleting resources when it is done. It uses cloud native tools for orchestration and can request discounted instances, lowering cloud costs for users. It is supported on Amazon Web Services and Google Cloud Platform. It can search BLAST databases that are user provided or from the National Center for Biotechnology Information. Conclusion We show that ElasticBLAST is a useful application that can efficiently perform BLAST searches for the user in the cloud, demonstrating that with two examples. At the same time, it hides much of the complexity of working in the cloud, lowering the threshold to move work to the cloud.",
    "citationCount": 12,
    "referenceCount": 37
}