{
    "paperId": "1a740582ce136f73e40e9c82d00e9aeb5cac386a",
    "title": "DITune: A Reinforcement Learning Based Framework for Automated Database Index Selection",
    "year": 2024,
    "venue": "International Conference on Ubiquitous Information Management and Communication",
    "authors": [
        "Xiuqi Huang",
        "Xiaofeng Gao",
        "Guihai Chen"
    ],
    "doi": "10.1109/IMCOM60618.2024.10418292",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1a740582ce136f73e40e9c82d00e9aeb5cac386a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index selection is a crucial and essential aspect of database management systems (DBMS) aiming to optimize performance, and it is also one of the most time-consuming and laborious tasks for database administrators (DBAs). Therefore, automatic methods and tools are urgently needed to help DBAs choose a good index configuration for workloads. We propose a recommender system named DITune (Database Index Tuning) which can automatically analyze workloads, explore the potential benefits of indexes, and adjust the index configuration. We first implement a rule-based method to embed the database workload and data distribution feature. Then we utilize the Deep Deterministic Policy Gradient (DDPG) algorithm to generate index recommendations and construct index configuration. Moreover, we design a benchmark based on the standard TPC-C to validate the performance of our method under the varying workload patterns, query complexity, and running phase length. The experiment results show the effectiveness and robustness of DITune and indicate that the data-driven prediction outperforms those models based on cost estimation.",
    "citationCount": 0,
    "referenceCount": 26
}