{
    "paperId": "1adbae11ed164f4ee4c20c1093e3481bce5ece90",
    "title": "Cloudy with high chance of DBMS: a 10-year prediction for Enterprise-Grade ML",
    "year": 2019,
    "venue": "Conference on Innovative Data Systems Research",
    "authors": [
        "Ashvin Agrawal",
        "Rony Chatterjee",
        "C. Curino",
        "Avrilia Floratou",
        "Neha Godwal",
        "Matteo Interlandi",
        "Alekh Jindal",
        "Konstantinos Karanasos",
        "Subru Krishnan",
        "Brian Kroth",
        "Jyoti Leeka",
        "Kwanghyun Park",
        "Hiren Patel",
        "Olga Poppe",
        "Fotis Psallidas",
        "R. Ramakrishnan",
        "Abhishek Roy",
        "Karla Saur",
        "Rathijit Sen",
        "Markus Weimer",
        "Travis Wright",
        "Yiwen Zhu"
    ],
    "doi": null,
    "arxivId": "1909.00084",
    "url": "https://www.semanticscholar.org/paper/1adbae11ed164f4ee4c20c1093e3481bce5ece90",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) has proven itself in high-value web applications such as search ranking and is emerging as a powerful tool in a much broader range of enterprise scenarios including voice recognition and conversational understanding for customer support, autotuning for videoconferencing, intelligent feedback loops in large-scale sysops, manufacturing and autonomous vehicle management, complex financial predictions, just to name a few. Meanwhile, as the value of data is increasingly recognized and monetized, concerns about securing valuable data and risks to individual privacy have been growing. Consequently, rigorous data management has emerged as a key requirement in enterprise settings. How will these trends (ML growing popularity, and stricter data governance) intersect? What are the unmet requirements for applying ML in enterprise settings? What are the technical challenges for the DB community to solve? In this paper, we present our vision of how ML and database systems are likely to come together, and early steps we take towards making this vision a reality.",
    "citationCount": 41,
    "referenceCount": 42
}