{
    "paperId": "1ae7f92e78bc34e96e1eb33b3f1994dd70addf8e",
    "title": "Burger-tree: A Three-Layer Cache-Conscious Tree Index for Persistent Memory",
    "year": 2022,
    "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)",
    "authors": [
        "Penghao Fan",
        "Peiquan Jin",
        "Yongping Luo",
        "Xiaoliang Wang"
    ],
    "doi": "10.1109/HPCC-DSS-SmartCity-DependSys57074.2022.00152",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1ae7f92e78bc34e96e1eb33b3f1994dd70addf8e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Persistent memory (PMEM) has become a new alternative of future main memories. Building efficient index structures for persistent memory has received much attention in recent years. We note that different nodes in a tree index have various read/write tendencies. Motivated by such an observation, we propose a new three-layer tree index called Burger-tree, which includes a top layer, a middle layer, and a bottom layer. The top layer is read-friendly and read-only, which is to accelerate search operations on the index. The middle layer is read/write friendly, while the bottom layer is write-friendly with an unsorted node structure. We present efficient node structures for the three layers, together with a new slot-forwarding algorithm to improve the efficiency of Burger-tree. With the three-layer structure, we demonstrate that Burger-tree can deliver high performance for read and write operations. We conduct experiments on real Intel Optane Persistent Memory and compare Burger-tree with WB-tree, FAST&FAIR, and TLBtree on YCSB workloads. The results suggest the efficiency of Burger-tree.",
    "citationCount": 3,
    "referenceCount": 13
}