{
    "paperId": "1af1ce82670f34ba1492a5b2ddf429d5d4a4217e",
    "title": "Machine learning based design space exploration for hybrid main-memory design",
    "year": 2019,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "S. Sen",
        "N. Imam"
    ],
    "doi": "10.1145/3357526.3357544",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1af1ce82670f34ba1492a5b2ddf429d5d4a4217e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.osti.gov/biblio/1606980",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We develop a machine learning (ML) based design space exploration (DSE) method that builds predictive models for various responses of a hybrid main-memory system. To overcome the challenges associated with latency, capacity, and power of memory systems in future extreme-scale machines, the hybrid memory architectures are being considered in which novel non-volatile memory (NVM) systems augment the traditional DRAM. However, way before their actual design and implementation, these emerging hybrid memory systems need to be simulated and analyzed to fully understand their capabilities and limitations. As the conventional architectural-level memory simulators require significant amounts of computational costs and time, we propose to utilize ML techniques for developing various memory-response models that can instantly provide a predicted response corresponding to any new memory configuration. Specifically, in this work, we apply four supervised ML techniques to build regression models for memory latency, bandwidth, power, and total read/write responses. The training and validation data for the ML methods are generated using NVMain memory simulator for DRAM, NVM, and their hybrid combinations. We demonstrate the results of the ML based memory-DSE method in terms of the learning curve characteristics for hyperparameter tuning and the statistical error analyses of the designed predictive models.",
    "citationCount": 12,
    "referenceCount": 55
}