{
    "paperId": "1b080c6119c4515c42273f1907af00a9a08d459e",
    "title": "A Cost-Effective and Decompression-Transparent Compressor for OLTP-Oriented Databases",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Hao Hu",
        "Qiyang Zheng",
        "Xiangyu Zou",
        "Lisha Qin",
        "Chengwei Zhang",
        "Wanchuan Zhang",
        "Zhaoheng Jiang",
        "Dingwen Tao",
        "Hongpeng Wang",
        "Wen Xia"
    ],
    "doi": "10.1109/ICDE65448.2025.00037",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b080c6119c4515c42273f1907af00a9a08d459e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The row-oriented store model is the cornerstone component of modern online transaction processing (OLTP) database systems. In response to the massive increase in data within database systems, compression techniques are employed to enhance storage efficiency. Regrettably, current compression methods suffer from either the amplification issue due to coarse compression granularity or inefficient decompression operations, thus usually decreasing the speed of query processing. To this end, we present DPTC, a cost-effective and decompression-transparent approach designed to compress data pages, the basic storage unit of OLTP database systems. Specifically, (1) DPTC applies a row-wise decompression-oriented structure to track the first occurrence of redundant data in compressed data, which effectively supports the decompression of individual records from pages, thereby avoiding unwarranted decompression in record access. Moreover, (2) DPTC employs an in-page dynamic packing strategy, which determines the compression units based on the impact of each data reduction operation on the compression gains and eliminates gains-inefficient data reductions. Furthermore, (3) DPTC utilizes a SIMD-based mechanism that leverages the characteristics of operations within the decompression process to improve the decompression speed. Our evaluation results confirm that DPTC is efficient in terms of decompression speed and compression ratio. Within an OLTP database system, DPTC yields throughput improvements of up to 4.28 x in TPC-C and reduces latency by up to 33.3% for data point queries in a row-oriented storage engine.",
    "citationCount": 1,
    "referenceCount": 75
}