{
    "paperId": "1b18fe65d32de900c9ce2bba05d3ecfc9194d26d",
    "title": "A Method for Learning to Solve Parametric Bilevel Optimization with Coupling Constraints",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "James Kotary",
        "Himanshu Sharma",
        "Ethan King",
        "D. Vrabie",
        "Ferdinando Fioretto",
        "Ján Drgona"
    ],
    "doi": "10.48550/arXiv.2507.09050",
    "arxivId": "2507.09050",
    "url": "https://www.semanticscholar.org/paper/1b18fe65d32de900c9ce2bba05d3ecfc9194d26d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Learning to Optimize (L2O) is a subfield of machine learning (ML) in which ML models are trained to solve parametric optimization problems. The general goal is to learn a fast approximator of solutions to constrained optimization problems, as a function of their defining parameters. Prior L2O methods focus almost entirely on single-level programs, in contrast to the bilevel programs, whose constraints are themselves expressed in terms of optimization subproblems. Bilevel programs have numerous important use cases but are notoriously difficult to solve, particularly under stringent time demands. This paper proposes a framework for learning to solve a broad class of challenging bilevel optimization problems, by leveraging modern techniques for differentiation through optimization problems. The framework is illustrated on an array of synthetic bilevel programs, as well as challenging control system co-design problems, showing how neural networks can be trained as efficient approximators of parametric bilevel optimization.",
    "citationCount": 0,
    "referenceCount": 51
}