{
    "paperId": "1b5962d8a04ce69687ec2eeb63fef98c696be71b",
    "title": "Frequency-compensated PINNs for Fluid-dynamic Design Problems",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Tongtao Zhang",
        "Biswadip Dey",
        "P. Kakkar",
        "A. Dasgupta",
        "Amit Chakraborty"
    ],
    "doi": null,
    "arxivId": "2011.01456",
    "url": "https://www.semanticscholar.org/paper/1b5962d8a04ce69687ec2eeb63fef98c696be71b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Incompressible fluid flow around a cylinder is one of the classical problems in fluid-dynamics with strong relevance with many real-world engineering problems, for example, design of offshore structures or design of a pin-fin heat exchanger. Thus learning a high-accuracy surrogate for this problem can demonstrate the efficacy of a novel machine learning approach. In this work, we propose a physics-informed neural network (PINN) architecture for learning the relationship between simulation output and the underlying geometry and boundary conditions. In addition to using a physics-based regularization term, the proposed approach also exploits the underlying physics to learn a set of Fourier features, i.e. frequency and phase offset parameters, and then use them for predicting flow velocity and pressure over the spatio-temporal domain. We demonstrate this approach by predicting simulation results over out of range time interval and for novel design conditions. Our results show that incorporation of Fourier features improves the generalization performance over both temporal domain and design space.",
    "citationCount": 9,
    "referenceCount": 34
}