{
    "paperId": "1b6078414760078d61c4b6670a8431f66b93b904",
    "title": "Fundamental Components and Principles of Supervised Machine Learning Workflows with Numerical and Categorical Data",
    "year": 2024,
    "venue": "Engineer",
    "authors": [
        "Styliani I. Kampezidou",
        "Archana Tikayat Ray",
        "Anirudh Prabhakara Bhat",
        "Olivia J. Pinon Fischer",
        "D. Mavris"
    ],
    "doi": "10.3390/eng5010021",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b6078414760078d61c4b6670a8431f66b93b904",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2673-4117/5/1/21/pdf?version=1709198490",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper offers a comprehensive examination of the process involved in developing and automating supervised end-to-end machine learning workflows for forecasting and classification purposes. It offers a complete overview of the components (i.e., feature engineering and model selection), principles (i.e., bias–variance decomposition, model complexity, overfitting, model sensitivity to feature assumptions and scaling, and output interpretability), models (i.e., neural networks and regression models), methods (i.e., cross-validation and data augmentation), metrics (i.e., Mean Squared Error and F1-score) and tools that rule most supervised learning applications with numerical and categorical data, as well as their integration, automation, and deployment. The end goal and contribution of this paper is the education and guidance of the non-AI expert academic community regarding complete and rigorous machine learning workflows and data science practices, from problem scoping to design and state-of-the-art automation tools, including basic principles and reasoning in the choice of methods. The paper delves into the critical stages of supervised machine learning workflow development, many of which are often omitted by researchers, and covers foundational concepts essential for understanding and optimizing a functional machine learning workflow, thereby offering a holistic view of task-specific application development for applied researchers who are non-AI experts. This paper may be of significant value to academic researchers developing and prototyping machine learning workflows for their own research or as customer-tailored solutions for government and industry partners.",
    "citationCount": 10,
    "referenceCount": 145
}