{
    "paperId": "1b86e7fad97c9b1e9cc938018b44b8a8e98d6f89",
    "title": "Towards Data-Based Cache Optimization of B+-Trees",
    "year": 2023,
    "venue": "International Workshop on Data Management on New Hardware",
    "authors": [
        "Roland Kühn",
        "Daniel Biebert",
        "Christian Hakert",
        "Jian-Jia Chen",
        "J. Teubner"
    ],
    "doi": "10.1145/3592980.3595316",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b86e7fad97c9b1e9cc938018b44b8a8e98d6f89",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3592980.3595316",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rise of in-memory databases and systems with considerably large memories and cache sizes requires the rethinking of the proper implementation of index structures like B+-trees in such systems. While disk block-sized nodes and binary search were considered as good in the past, smaller node sizes and cache-friendly linear search within nodes can be noticeably more performant nowadays. Considering the probabilistic distribution of lookup values to the B+-tree as part of a memory-friendly and cache-aware layout is a consequent next step, which is studied in this paper. Favoring frequently visited nodes and paths in the regard of cache hits can improve the overall performance of the tree and, thus, of the entire database system. We provide such an optimized B+-tree layout, which takes the probabilistic distribution of the lookup values as a basis. Experimental evaluation shows that choosing rather small node sizes in combination with our optimization algorithm can improve the performance by up to in comparison to a default baseline.",
    "citationCount": 1,
    "referenceCount": 24
}