{
    "paperId": "1b8c2c740fb7e85b27f9d264aec449c3a0e83228",
    "title": "Research on Big Data Visualization Technology based on Multi-source Vibrational Data Acquisition",
    "year": 2025,
    "venue": "Scalable Computing : Practice and Experience",
    "authors": [
        "Haojie Ling",
        "Xiang Wan",
        "YiZheng Gou",
        "Yuan Huang"
    ],
    "doi": "10.12694/scpe.v26i2.4012",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b8c2c740fb7e85b27f9d264aec449c3a0e83228",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In order to scientifically and reasonably monitor the soil environment of green spaces in urban residential areas, the layout and sampling methods of soil monitoring points for green spaces in residential areas were studied, including the selection of representative residential areas, determination of monitoring point sampling positions, and determination of the number of points. The author proposed a research on the layout and sampling of soil monitoring points for green spaces in urban residential areas based on multi-source data collection and big data visualization. By using multi-source big data visualization methods, representative residential areas of a certain city were selected to monitor heavy metals (cadmium, mercury, arsenic, lead, copper, chromium, zinc, and nickel) in the green soil of their residential areas. The study reveals variations in heavy metal concentrations in the soil across residential areas of differing building ages. To ensure thorough monitoring of soil environmental conditions in residential areas, it's recommended to include neighborhoods of varying building ages as monitoring sites. Our findings indicate that the choice of sampling locations within these areas does not substantially affect the heavy metal content in soil samples. Therefore, it's preferable to prioritize sampling from residential areas rather than focusing solely on large green spaces within them, There are differences in samples from different monitoring points within the same residential area, and at least 3-4 monitoring points should be set up in each residential area to represent the soil environmental conditions of that residential area. The application of multi-source big data has a positive effect and advantage on the distribution of urban soil monitoring points.",
    "citationCount": 1,
    "referenceCount": 18
}