{
    "paperId": "1b8d601bc6e6ac4238e90c4bfdfd6ceb7414aac7",
    "title": "Data-driven spatial locality",
    "year": 2018,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "Svetozar Miucin",
        "Alexandra Fedorova"
    ],
    "doi": "10.1145/3240302.3240417",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b8d601bc6e6ac4238e90c4bfdfd6ceb7414aac7",
    "isOpenAccess": true,
    "openAccessPdf": "https://open.library.ubc.ca/media/download/pdf/24/1.0375881/3",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Researchers and practitioners dedicate a lot of effort to improving spatial locality in their programs. Hardware caches rely on spatial locality for efficient operation; when it is absent, they waste memory bandwidth and cache space by fetching data that is never used before it is evicted. Improving spatial locality is difficult. For the most part, these are manual efforts by expert programmers, requiring substantial insight into the program's data layout and data access pattern. This work introduces Access Graphs: a novel abstraction of memory access patterns that exposes spatial locality features and allows for automatic computation of better memory layouts. Using access graphs and a set of analysis algorithms and tools, we are able to significantly improve simulated cache miss rates by changing data layout. Further, we use random forest classifiers to automatically identify features of the data that correlate with how the data is actually used. We build a memory allocator that uses these features to guide data allocation at runtime and achieves a better spatial locality and improved performance as a result.",
    "citationCount": 11,
    "referenceCount": 35
}