{
    "paperId": "1b8ea57f0a5800813a4f3f54c3c5736b0c1dddb8",
    "title": "Mapping dominant AI schools to multiple accountability types",
    "year": 2025,
    "venue": "Transforming Government: People, Process and Policy",
    "authors": [
        "Marc T. J. Elliott",
        "D. P",
        "Muiris MacCarthaigh"
    ],
    "doi": "10.1108/tg-11-2024-0272",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b8ea57f0a5800813a4f3f54c3c5736b0c1dddb8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n\nAs artificial intelligence (AI) algorithms become central to public policy development and delivery, ensuring accountability in automated public services is crucial. This paper aims to extend algorithmic accountability research by proposing a framework to help AI designers and public practitioners understand AI’s impact on diverse accountability relationships and identifies how AI systems may be better designed for greater public benefit.\n\n\n\nThis study uses an inductive approach, combining established frameworks from accountability studies, computer science and public governance. By evaluating the conceptual and technical characteristics of the two most dominant AI paradigms (connectionist and symbolic), this study systematically maps their compatibility with four formal accountability forums across three phases of accountability. The resulting conceptual mapping framework highlights the trade-offs and alignment of AI design choices with diverse public accountability demands.\n\n\n\nFindings indicate that a singular AI paradigm cannot simultaneously provide effective accountability to multiple forums. Current public AI deployment practices appear to prioritise internal technocratic objectives over designing algorithmic systems towards effective transparent accountability processes, raising concerns about alignment with public accountability standards.\n\n\n\nThe proposed mapping framework provides a practical tool for public practitioners and AI system designers, offering insights into how AI systems might be tailored to enhance public sector accountability relationships.\n\n\n\nTo the best of the authors’ knowledge, this study is the first to directly explore the compatibility of AI paradigms with different accountability requirements, offering a novel perspective on aligning AI design with effective multi-forum accountability.\n",
    "citationCount": 1,
    "referenceCount": 75
}