{
    "paperId": "1b981ea7ae053079c96667fe995fb8cc9c6e1c5c",
    "title": "Breathing New Life into an Old Tree: Resolving Logging Dilemma of\n B\n +\n -tree on Modern Computational Storage Drives",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Kecheng Huang",
        "Zhaoyan Shen",
        "Zili Shao",
        "Tong Zhang",
        "Feng Chen"
    ],
    "doi": "10.14778/3626292.3626297",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1b981ea7ae053079c96667fe995fb8cc9c6e1c5c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Having dominated databases and various data management systems for decades,\n B\n +\n -tree is infamously subject to a logging dilemma: One could improve\n B\n +\n -tree speed performance by equipping it with a larger log, which nevertheless will degrade its crash recovery speed. Such a logging dilemma is particularly prominent in the presence of modern workloads that involve intensive small writes. In this paper, we propose a novel solution, called\n per-page logging\n based\n B\n +\n -tree, which leverages the emerging computational storage drive (CSD) with built-in transparent compression to fundamentally resolve the logging dilemma. Our key idea is to divide the large single log into many small (e.g., 4KB), highly compressible\n per-page logs\n , each being statically bounded with a\n B\n +\n -tree page. All per-page logs together form a very large over-provisioned log space for\n B\n +\n -tree to improve its operational speed performance. Meanwhile, during crash recovery,\n B\n +\n -tree does not need to scan any per-page logs, leading to a recovery latency independent from the total log size. We have developed and open-sourced a fully functional prototype. Our evaluation results show that, under small-write intensive workloads, our design solution can improve\n B\n +\n -tree operational throughput by up to 625.6% and maintain a crash recovery time of as low as 19.2 ms, while incurring a minimal storage overhead of only 0.5-1.6%.\n",
    "citationCount": 5,
    "referenceCount": 80
}