{
    "paperId": "1ba270b6d5f260fae8126e8471aa607b0733672a",
    "title": "Side effects of learning from low-dimensional data embedded in a Euclidean space",
    "year": 2022,
    "venue": "Research in the Mathematical Sciences",
    "authors": [
        "Juncai He",
        "R. Tsai",
        "Rachel A. Ward"
    ],
    "doi": "10.1007/s40687-023-00378-y",
    "arxivId": "2203.00614",
    "url": "https://www.semanticscholar.org/paper/1ba270b6d5f260fae8126e8471aa607b0733672a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The low-dimensional manifold hypothesis posits that the data found in many applications, such as those involving natural images, lie (approximately) on low-dimensional manifolds embedded in a high-dimensional Euclidean space. In this setting, a typical neural network defines a function that takes a finite number of vectors in the embedding space as input. However, one often needs to consider evaluating the optimized network at points outside the training distribution. This paper considers the case in which the training data are distributed in a linear subspace of $${\\mathbb {R}}^d$$ R d . We derive estimates on the variation of the learning function, defined by a neural network, in the direction transversal to the subspace. We study the potential regularization effects associated with the network’s depth and noise in the codimension of the data manifold. We also present additional side effects in training due to the presence of noise.",
    "citationCount": 9,
    "referenceCount": 64
}