{
    "paperId": "1bb15f9e879291182d46ab4d9c0da06c7397857a",
    "title": "Towards the Optimization of Hardware Efficiency through Machine Learning",
    "year": 2025,
    "venue": "IEEE Computer Society Annual Symposium on VLSI",
    "authors": [
        "Heba Khdr",
        "Mohammed Bakr Sikal",
        "Benedikt Dietrich",
        "Jörg Henkel"
    ],
    "doi": "10.1109/ISVLSI65124.2025.11130243",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1bb15f9e879291182d46ab4d9c0da06c7397857a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing complexity of applications combined with the need to execute them on resource-constrained platforms, demands highly efficient system-level optimization strategies. While advancements in hardware accelerators have improved performance, they remain insufficient without intelligent Resource Management (RM) that can dynamically adapt to the unique characteristics of both applications and hardware. Classical analytical models struggle to capture the intricate interactions in modern heterogeneous systems, prompting a shift toward machine learning (ML)-based RM approaches. This paper provides an in-depth analysis of the challenges and potential of applying ML to RM. We begin by presenting experimental examples that highlight the motivations for using ML and the challenges it presents. Two case studies - offline- and online-learning-based RM are discussed to illustrate the state-of-the-art approaches and their limitations. Finally, we outline the opportunities for future research directions to address open challenges and pave the way for efficient, adaptive, and reliable system-level optimization.",
    "citationCount": 0,
    "referenceCount": 35
}