{
    "paperId": "1bd3a17f2d6144c2d9844828cdd2268df008ab27",
    "title": "P3FA: Unified Unicast/Multicast Forwarding Algorithm for High-Performance Router/Switch",
    "year": 2022,
    "venue": "IEEE transactions on consumer electronics",
    "authors": [
        "Zhu Jin",
        "Wen-Kang Jia"
    ],
    "doi": "10.1109/TCE.2022.3200283",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1bd3a17f2d6144c2d9844828cdd2268df008ab27",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-performance multicast packet switching technologies are evolving to meet the growing demand for scalability on the Internet and datacenters, etc. Implementing a high-performance switch/router relies on a polynomial-time group membership query algorithm within the Packet Forwarding Engines (PFEs) to determine whether a packet is forwarded through an egress. Among these, Bloom filter (BF)-based and Residue Number System (RNS)-based are being considered as two representatives of the membership query algorithms. However, both approaches suffer from some fatal weaknesses such as false-positive probability and time inefficiencies, especially for a carrier-grade PFE with high port-density features. According to similar properties of the RNS, we propose a simplified forwarding algorithm in this paper, named Per-Port Prime Filter Array (P3FA). The simulation results indicate that the P3FA can significantly improve space efficiencies under specific lower egress-diversities conditions. Under the same space constraints, P3FA improves multicast and unicast time efficiency by 1 to 4 orders of magnitude in the port-density 16–1024 range compared to previous works. Although it comes at the expense of hardware cost, it is still acceptable compared to recently improved previous work.",
    "citationCount": 3,
    "referenceCount": 34
}