{
    "paperId": "1bf42cd7cd0065bbb06b84444e08e315b727936d",
    "title": "Towards a Benchmark for Shared Databases [Vision Paper]",
    "year": 2022,
    "venue": "Datenbank-Spektrum",
    "authors": [
        "Muhammad El-Hindi",
        "Ashwin Arora",
        "Simon Karrer",
        "Carsten Binnig"
    ],
    "doi": "10.1007/s13222-022-00429-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1bf42cd7cd0065bbb06b84444e08e315b727936d",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s13222-022-00429-8.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditionally, data has been held in silos and was rarely shared with other organizations. However, recently data sharing across organizations is becoming more and more important as evidenced by governmental and industrial initiatives such as the EU data strategy. As a result, both academia and industry have been proposing new systems for shared databases, that allow multiple organizations to collaboratively insert and manage data in a common database. Yet, each new system seems to come with its own architectural choices and custom guarantees that make it hard for users to navigate the plethora of shared database systems. While standard benchmarks like the TPC‑C database benchmark have been a well-established tool to compare and analyze traditional database systems, they seem to be unsuited to evaluate shared database systems. This is because these systems are built with fundamentally different assumptions in mind, such as a different threat/trust model since multiple (untrusted) parties access and modify the same data. In this paper, we present a vision and initial ideas for a new benchmark to evaluate shared databases and capture their unique characteristics.",
    "citationCount": 0,
    "referenceCount": 35
}