{
    "paperId": "1c116d23d4af99b569d7e778d80de636f296cda4",
    "title": "Accelerating Optimization via Differentiable Stopping Time",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zhonglin Xie",
        "Yiman Fong",
        "Haoran Yuan",
        "Zaiwen Wen"
    ],
    "doi": "10.48550/arXiv.2505.22509",
    "arxivId": "2505.22509",
    "url": "https://www.semanticscholar.org/paper/1c116d23d4af99b569d7e778d80de636f296cda4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimization is an important module of modern machine learning applications. Tremendous efforts have been made to accelerate optimization algorithms. A common formulation is achieving a lower loss at a given time. This enables a differentiable framework with respect to the algorithm hyperparameters. In contrast, its dual, minimizing the time to reach a target loss, is believed to be non-differentiable, as the time is not differentiable. As a result, it usually serves as a conceptual framework or is optimized using zeroth-order methods. To address this limitation, we propose a differentiable stopping time and theoretically justify it based on differential equations. An efficient algorithm is designed to backpropagate through it. As a result, the proposed differentiable stopping time enables a new differentiable formulation for accelerating algorithms. We further discuss its applications, such as online hyperparameter tuning and learning to optimize. Our proposed methods show superior performance in comprehensive experiments across various problems, which confirms their effectiveness.",
    "citationCount": 0,
    "referenceCount": 33
}