{
    "paperId": "1c17db839459b52afa5525174e7fca682817acb1",
    "title": "Object as a Service (OaaS): Enabling Object Abstraction in Serverless Clouds",
    "year": 2022,
    "venue": "IEEE International Conference on Cloud Computing",
    "authors": [
        "Pawissanutt Lertpongrujikorn",
        "M. Salehi"
    ],
    "doi": "10.1109/CLOUD60044.2023.00035",
    "arxivId": "2206.05361",
    "url": "https://www.semanticscholar.org/paper/1c17db839459b52afa5525174e7fca682817acb1",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.05361",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Function as a Service (FaaS) paradigm is becoming widespread and is envisioned as the next generation of cloud computing systems that mitigate the burden for programmers and cloud solution architects. However, the FaaS abstraction only makes the cloud resource management aspects transparent but does not deal with the application data aspects. As such, developers have to intervene and undergo the burden of managing the application data, often via separate cloud services (e.g., AWS S3). Similarly, the FaaS abstraction does not natively support function workflow, hence, the developers often have to work with workflow orchestration services (e.g., AWS Step Functions) to build workflows. Moreover, they have to explicitly navigate the data throughout the workflow. To overcome these inherent problems of FaaS, our hypothesis is to design a higher-level cloud programming abstraction that can hide the complexities and mitigate the burden of developing cloud-native application development. Accordingly, in this research, we borrow the notion of object from object-oriented programming and propose a new abstraction level atop the function abstraction, known as Object as a Service (OaaS). OaaS encapsulates the application data and function into the object abstraction and relieves the developers from resource and data management burdens. It also unlocks opportunities for built-in optimization features, such as software reusability, data locality, and caching. OaaS natively supports dataflow programming such that developers define a workflow of functions transparently without getting involved in data navigation, synchronization, and parallelism aspects. We implemented a prototype of the OaaS platform and evaluated it under real-world settings against state-of-the-art platforms regarding the imposed overhead, scalability, and ease of use. The results demonstrate that OaaS streamlines cloud programming and offers scalability with an insignificant overhead to the underlying cloud system.",
    "citationCount": 8,
    "referenceCount": 47
}