{
    "paperId": "1c2ec73df76d66a0b09b094c616ac6312435ffb4",
    "title": "Blockchain Cross-Chain Bridge Security: Challenges, Solutions, and Future Outlook",
    "year": 2024,
    "venue": "Distributed Ledger Technol. Res. Pract.",
    "authors": [
        "Ningran Li",
        "Minfeng Qi",
        "Zhiyu Xu",
        "Xiaogang Zhu",
        "Wei Zhou",
        "Sheng Wen",
        "Yang Xiang"
    ],
    "doi": "10.1145/3696429",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1c2ec73df76d66a0b09b094c616ac6312435ffb4",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3696429",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cross-chain bridges, one of the foundational infrastructures of blockchain, provide the infrastructure and solutions for inter-operability, asset liquidity, data transfer, decentralized finance, and cross-chain governance between blockchain networks. However, because cross-chain bridges often have to handle communication and asset transfers between multiple blockchains, they involve complex protocols and technologies. This complexity increases the likelihood of vulnerabilities and potential attacks. In order to ensure the security and reliability of cross-chain bridges, this article launches a thorough investigation of existing cross-chain bridge projects, clarifying bridging mechanisms, bridge types, and security features. The following part goes into the subject of security and sheds light on the considerable challenges faced by cross-chain bridges. It conducts a thorough analysis of security flaws, covering problems like smart contract vulnerabilities, centralization risks, liquidity issues, and oracle manipulations. Furthermore, this study promotes a compendium of security solutions and best practises, pointing the way toward a cross-chain bridge scenario that is more secure.",
    "citationCount": 13,
    "referenceCount": 109
}