{
    "paperId": "1c65a10819af09c81ad5b8a6ea0d716a4cf37c96",
    "title": "Training Autonomous Vehicles in Carla model using Augmented Random Search Algorithm",
    "year": 2021,
    "venue": "Journal of Applied Data Sciences",
    "authors": [
        "R. Riyanto",
        "Abdul Azis",
        "Tarwoto Tarwoto",
        "W. Deng"
    ],
    "doi": "10.47738/jads.v2i2.29",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1c65a10819af09c81ad5b8a6ea0d716a4cf37c96",
    "isOpenAccess": true,
    "openAccessPdf": "http://bright-journal.org/Journal/index.php/JADS/article/download/29/19",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "CARLA is an open source simulator for autonomous driving research. CARLA has been developed from scratch to support the development, training and validation of autonomous driving systems. In addition to open source code and protocols, CARLA provides open digital assets (urban layouts, buildings, vehicles) that are created for this purpose and can be used freely. We use CARLA to study the performance of Augmented Random Search (ARS) to autonomous driving: a classic modular pipeline, an end-to-end model trained via imitation learning, and an end-to-end model trained via reinforcement learning. Test the ability of the Augmented Random Search (ARS) algorithm to train driverless cars on data collected from the front cameras per car. In this study, a framework that can be used to train driverless car policy using ARS in Carla will be built. Although effective policies were not achieved after the first round of training, many insights on how to improve these outcomes in the future have been obtained.",
    "citationCount": 2,
    "referenceCount": 19
}