{
    "paperId": "1c664f4c11ef3d54426542232be5ad68d09601c5",
    "title": "Improving Ponzi Scheme Contract Detection Using Multi-Channel TextCNN and Transformer",
    "year": 2021,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Yizhou Chen",
        "Heng Dai",
        "Xiao Yu",
        "Wenhua Hu",
        "Zhiwen Xie",
        "Cheng Tan"
    ],
    "doi": "10.3390/s21196417",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1c664f4c11ef3d54426542232be5ad68d09601c5",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/21/19/6417/pdf?version=1632645205",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of blockchain technologies, many Ponzi schemes disguise themselves under the veil of smart contracts. The Ponzi scheme contracts cause serious financial losses, which has a bad effect on the blockchain. Existing Ponzi scheme contract detection studies have mainly focused on extracting hand-crafted features and training a machine learning classifier to detect Ponzi scheme contracts. However, the hand-crafted features cannot capture the structural and semantic feature of the source code. Therefore, in this study, we propose a Ponzi scheme contract detection method called MTCformer (Multi-channel Text Convolutional Neural Networks and Transofrmer). In order to reserve the structural information of the source code, the MTCformer first converts the Abstract Syntax Tree (AST) of the smart contract code to the specially formatted code token sequence via the Structure-Based Traversal (SBT) method. Then, the MTCformer uses multi-channel TextCNN (Text Convolutional Neural Networks) to learn local structural and semantic features from the code token sequence. Next, the MTCformer employs the Transformer to capture the long-range dependencies of code tokens. Finally, a fully connected neural network with a cost-sensitive loss function in the MTCformer is used for classification. The experimental results show that the MTCformer is superior to the state-of-the-art methods and its variants in Ponzi scheme contract detection.",
    "citationCount": 39,
    "referenceCount": 67
}