{
    "paperId": "1c8d1b157928351184d7156d8ed8f7b5a8b9394b",
    "title": "Face Recognition from Video using Deep Learning Models",
    "year": 2025,
    "venue": "International Conference on Innovative Mechanisms for Industry Applications",
    "authors": [
        "M. S. Yaswanth¹",
        "S. Venkata",
        "Koteswara Rao²",
        "B. Venkat",
        "Durga Sai³",
        "T. Venkatesh⁴",
        "A. Madhavi⁵",
        "Padmaja Chennapragada⁶"
    ],
    "doi": "10.1109/ICIMIA67127.2025.11200707",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1c8d1b157928351184d7156d8ed8f7b5a8b9394b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Face recognition in video streams poses persistent challenges compared to static images, as it must contend with camera shake, changing lighting, partial occlusions, and motion blur. In this study, we set out to develop and test advanced deep learning models capable of handling these real-world difficulties. Using a comprehensive dataset of videos featuring diverse individuals in varied scenarios, the aim was to build a system that works reliably in practical deployment, not just in controlled lab conditions. The results were encouraging the proposed approach achieved over 15% higher accuracy than traditional methods when tested in live environments. This has particular value in healthcare, where secure and accurate patient identification is essential. The system could help strengthen access control in medical facilities, support personalized care, and make telehealth consultations safer by ensuring patient–provider verification. Beyond healthcare, these improvements could benefit surveillance, building security, and authentication systems. This work shows how modern deep learning techniques can make video-based face recognition more dependable for real-world use.",
    "citationCount": 0,
    "referenceCount": 21
}