{
    "paperId": "1c9af88edca20227ff524780af71cf4e24eed3e8",
    "title": "Data Science and AI for Sustainable Futures: Opportunities and Challenges",
    "year": 2025,
    "venue": "Sustainability",
    "authors": [
        "Gavin Shaddick",
        "David Topping",
        "T. Hales",
        "U. Kadri",
        "Joanne Patterson",
        "John A Pickett",
        "Ioan Petri",
        "Stuart H. Taylor",
        "Peiyuan Li",
        "Ashish Sharma",
        "Venkat Venkatkrishnan",
        "Abhinav Wadhwa",
        "Jennifer Ding",
        "Ruth Bowyer",
        "Omer Rana"
    ],
    "doi": "10.3390/su17052019",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1c9af88edca20227ff524780af71cf4e24eed3e8",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/su17052019",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Advances in data science and artificial intelligence (AI) offer unprecedented opportunities to provide actionable insights, drive innovative solutions, and create long-term strategies for sustainable development in response to the triple existential crises facing humanity: climate change, pollution, and biodiversity loss. The rapid development of AI models has been the subject of extensive debate and is high on the political agenda, but at present the vast potential for AI to contribute positively to informed decision making, improved environmental risk management, and the development of technological solutions to sustainability challenges remains underdeveloped. In this paper, we consider four inter-dependent areas in which data science and AI can make a substantial contribution to developing sustainable future interactions with the environment: (i) quantification and tracking progress towards the United Nations Sustainable Development Goals; (ii) embedding AI technologies to reduce emissions at source; (iii) developing systems to increase our resilience to natural hazards; (iv) Net Zero and the built environment. We also consider the wider challenges associated with the widespread use of AI, including data access and discoverability, trust and regulation, inference and decision making, and the sustainable use of AI.",
    "citationCount": 1,
    "referenceCount": 88
}