{
    "paperId": "1cdc016694295436cda6f6f93e31456c90237d10",
    "title": "SQLfuse: Enhancing Text-to-SQL Performance through Comprehensive LLM Synergy",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Tingkai Zhang",
        "Chaoyu Chen",
        "Cong Liao",
        "Jun Wang",
        "Xudong Zhao",
        "Hang Yu",
        "Jianchao Wang",
        "Jianguo Li",
        "Wenhui Shi"
    ],
    "doi": "10.48550/arXiv.2407.14568",
    "arxivId": "2407.14568",
    "url": "https://www.semanticscholar.org/paper/1cdc016694295436cda6f6f93e31456c90237d10",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Text-to-SQL conversion is a critical innovation, simplifying the transition from complex SQL to intuitive natural language queries, especially significant given SQL's prevalence in the job market across various roles. The rise of Large Language Models (LLMs) like GPT-3.5 and GPT-4 has greatly advanced this field, offering improved natural language understanding and the ability to generate nuanced SQL statements. However, the potential of open-source LLMs in Text-to-SQL applications remains underexplored, with many frameworks failing to leverage their full capabilities, particularly in handling complex database queries and incorporating feedback for iterative refinement. Addressing these limitations, this paper introduces SQLfuse, a robust system integrating open-source LLMs with a suite of tools to enhance Text-to-SQL translation's accuracy and usability. SQLfuse features four modules: schema mining, schema linking, SQL generation, and a SQL critic module, to not only generate but also continuously enhance SQL query quality. Demonstrated by its leading performance on the Spider Leaderboard and deployment by Ant Group, SQLfuse showcases the practical merits of open-source LLMs in diverse business contexts.",
    "citationCount": 8,
    "referenceCount": 44
}