{
    "paperId": "1cf85e9f879b8fc747f8c30fc2e10ab532a81c2a",
    "title": "Generative Recommendation Models: Progress and Directions",
    "year": 2025,
    "venue": "The Web Conference",
    "authors": [
        "Yupeng Hou",
        "An Zhang",
        "Leheng Sheng",
        "Zhengyi Yang",
        "Xiang Wang",
        "Tat-seng Chua",
        "Julian Mcauley"
    ],
    "doi": "10.1145/3701716.3715856",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1cf85e9f879b8fc747f8c30fc2e10ab532a81c2a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommendation models typically follow a discriminative paradigm, predicting whether items should be retrieved. While effective, the expressive capabilities of these recommender systems are limited. Users can only passively browse the recommended items rather than actively express their needs and engage in an interactive experience. With recent advances in generative models such as large language models, a paradigm shift is happening in the study of recommender systems. Researchers propose building generative recommendation models either by aligning pre-trained generative models with user behaviors or designing recommendation models within a generative framework. These models enable the systems to receive and deliver more human-like content, such as natural language, images, and beyond. In this tutorial, we first provide an overview of the latest progress in generative recommendation models, covering approaches based on large language models, semantic IDs, diffusion models, and more. We then make an in-depth discussion on the challenges, open questions, and potential future directions in developing generative recommendation models.",
    "citationCount": 6,
    "referenceCount": 43
}