{
    "paperId": "1d08808ab1b246729ab280e5f9612027ed62df43",
    "title": "WSFE: Wasserstein Sub-graph Feature Encoder for Effective User Segmentation in Collaborative Filtering",
    "year": 2023,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Yankai Chen",
        "Yifei Zhang",
        "Menglin Yang",
        "Zixing Song",
        "Chenshuo Ma",
        "Irwin King"
    ],
    "doi": "10.1145/3539618.3592089",
    "arxivId": "2305.04410",
    "url": "https://www.semanticscholar.org/paper/1d08808ab1b246729ab280e5f9612027ed62df43",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2305.04410",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maximizing the user-item engagement based on vectorized embeddings is a standard procedure of recent recommender models. Despite the superior performance for item recommendations, these methods however implicitly deprioritize the modeling of user-wise similarity in the embedding space; consequently, identifying similar users is underperforming, and additional processing schemes are usually required otherwise. To avoid thorough model re-training, we propose WSFE, a model-agnostic and training-free representation encoder, to be flexibly employed on the fly for effective user segmentation. Underpinned by the optimal transport theory, the encoded representations from WSFE present a matched user-wise similarity/distance measurement between the realistic and embedding space. We incorporate WSFE into six state-of-the-art recommender models and conduct extensive experiments on six real-world datasets. The empirical analyses well demonstrate the superiority and generality of WSFE to fuel multiple downstream tasks with diverse underlying targets in recommendation.",
    "citationCount": 21,
    "referenceCount": 58
}