{
    "paperId": "1d268b9cca810882e631018d4d9d46ba1c9ad47e",
    "title": "Bridging Linguistic Typology and Multilingual Machine Translation with Multi-view Language Representations",
    "year": 2020,
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "authors": [
        "Arturo Oncevay",
        "B. Haddow",
        "Alexandra Birch"
    ],
    "doi": "10.18653/v1/2020.emnlp-main.187",
    "arxivId": "2004.14923",
    "url": "https://www.semanticscholar.org/paper/1d268b9cca810882e631018d4d9d46ba1c9ad47e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.aclweb.org/anthology/2020.emnlp-main.187.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sparse language vectors from linguistic typology databases and learned embeddings from tasks like multilingual machine translation have been investigated in isolation, without analysing how they could benefit from each other's language characterisation. We propose to fuse both views using singular vector canonical correlation analysis and study what kind of information is induced from each source. By inferring typological features and language phylogenies, we observe that our representations embed typology and strengthen correlations with language relationships. We then take advantage of our multi-view language vector space for multilingual machine translation, where we achieve competitive overall translation accuracy in tasks that require information about language similarities, such as language clustering and ranking candidates for multilingual transfer. With our method, we can easily project and assess new languages without expensive retraining of massive multilingual or ranking models, which are major disadvantages of related approaches.",
    "citationCount": 36,
    "referenceCount": 52
}