{
    "paperId": "1d641b2df81ed08d158b0170198025fca014d407",
    "title": "SHiFT: An Efficient, Flexible Search Engine for Transfer Learning",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Cédric Renggli",
        "Xiaozhe Yao",
        "Luka Kolar",
        "Luka Rimanic",
        "Ana Klimovic",
        "Ce Zhang"
    ],
    "doi": "10.14778/3565816.3565831",
    "arxivId": "2204.01457",
    "url": "https://www.semanticscholar.org/paper/1d641b2df81ed08d158b0170198025fca014d407",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.research-collection.ethz.ch/bitstream/20.500.11850/592608/2/3565816.3565831.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Transfer learning can be seen as a data- and compute-efficient alternative to training models from scratch. The emergence of rich model repositories, such as TensorFlow Hub, enables practitioners and researchers to unleash the potential of these models across a wide range of downstream tasks. As these repositories keep growing exponentially, efficiently selecting a good model for the task at hand becomes paramount. However, a single generic search strategy (e.g., taking the model with the highest linear classifier accuracy) does not lead to optimal model selection for diverse downstream tasks. In fact, using hybrid or mixed strategies can often be beneficial. Therefore, we propose SHiFT, the first downstream task-aware, flexible, and efficient model search engine for transfer learning. Users interface with SHiFT using the SHiFT-QL query language, which gives users the flexibility to customize their search criteria. We optimize SHiFT-QL queries using a cost-based decision maker and evaluate them on a wide rang of tasks. Motivated by the iterative nature of machine learning development, we further support efficient incremental executions of our queries, which requires a special implementation when jointly used with our optimizations.",
    "citationCount": 6,
    "referenceCount": 59
}