{
    "paperId": "1d8b30753dc3d762f7c197dc6febf95fc9de763b",
    "title": "Large Language Model Driven Recommendation",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "A. Korikov",
        "Scott Sanner",
        "Yashar Deldjoo",
        "Zhankui He",
        "Julian McAuley",
        "Arnau Ramisa",
        "René Vidal",
        "Mahesh Sathiamoorthy",
        "Atoosa Kasrizadeh",
        "Silvia Milano",
        "Francesco Ricci"
    ],
    "doi": "10.48550/arXiv.2408.10946",
    "arxivId": "2408.10946",
    "url": "https://www.semanticscholar.org/paper/1d8b30753dc3d762f7c197dc6febf95fc9de763b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While previous chapters focused on recommendation systems (RSs) based on standardized, non-verbal user feedback such as purchases, views, and clicks -- the advent of LLMs has unlocked the use of natural language (NL) interactions for recommendation. This chapter discusses how LLMs' abilities for general NL reasoning present novel opportunities to build highly personalized RSs -- which can effectively connect nuanced and diverse user preferences to items, potentially via interactive dialogues. To begin this discussion, we first present a taxonomy of the key data sources for language-driven recommendation, covering item descriptions, user-system interactions, and user profiles. We then proceed to fundamental techniques for LLM recommendation, reviewing the use of encoder-only and autoregressive LLM recommendation in both tuned and untuned settings. Afterwards, we move to multi-module recommendation architectures in which LLMs interact with components such as retrievers and RSs in multi-stage pipelines. This brings us to architectures for conversational recommender systems (CRSs), in which LLMs facilitate multi-turn dialogues where each turn presents an opportunity not only to make recommendations, but also to engage with the user in interactive preference elicitation, critiquing, and question-answering.",
    "citationCount": 0,
    "referenceCount": 92
}