{
    "paperId": "1d9865d92fb5648288219680e2c26cf1e1c02caf",
    "title": "Generative Retrieval with Semantic Tree-Structured Identifiers and Contrastive Learning",
    "year": 2023,
    "venue": "SIGIR-AP",
    "authors": [
        "Zihua Si",
        "ZhongXiang Sun",
        "Jiale Chen",
        "Guozhang Chen",
        "Xiaoxue Zang",
        "Kai Zheng",
        "Yang Song",
        "Xiao Zhang",
        "Jun Xu"
    ],
    "doi": "10.1145/3673791.3698408",
    "arxivId": "2309.13375",
    "url": "https://www.semanticscholar.org/paper/1d9865d92fb5648288219680e2c26cf1e1c02caf",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3673791.3698408",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recommender systems, the retrieval phase is at the first stage and of paramount importance, requiring both effectiveness and very high efficiency. Recently, generative retrieval methods such as DSI and NCI, offering the benefit of end-to-end differentiability, have become an emerging paradigm for document retrieval with notable performance improvement, suggesting their potential applicability in recommendation scenarios. A fundamental limitation of these methods is their approach of generating item identifiers as text inputs, which fails to capture the intrinsic semantics of item identifiers as indices. The structural aspects of identifiers are only considered in construction and ignored during training. In addition, generative retrieval methods often generate imbalanced tree structures and yield identifiers with inconsistent lengths, leading to increased item inference time and sub-optimal performance. We introduce a novel generative retrieval framework named SEATER, which learns SEmAntic Tree-structured item identifiERs using an encoder-decoder structure. To optimize the structure of item identifiers, SEATER incorporates two contrastive learning tasks to ensure the alignment of token embeddings and the ranking orders of similar identifiers. In addition, SEATER devises a balanced k-ary tree structure of item identifiers, thus ensuring consistent semantic granularity and inference efficiency. Extensive experiments on three public datasets and an industrial dataset have demonstrated that SEATER outperforms a number of state-of-the-art models significantly.",
    "citationCount": 5,
    "referenceCount": 31
}