{
    "paperId": "1d98362ecd2011b1a85f6011feefefddd2fc1d85",
    "title": "LoopStack: a Lightweight Tensor Algebra Compiler Stack",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Bram Wasti",
        "J. Cambronero",
        "Benoit Steiner",
        "Hugh Leather",
        "A. Zlateski"
    ],
    "doi": "10.48550/arXiv.2205.00618",
    "arxivId": "2205.00618",
    "url": "https://www.semanticscholar.org/paper/1d98362ecd2011b1a85f6011feefefddd2fc1d85",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2205.00618",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present LoopStack, a domain specific compiler stack for tensor operations, composed of a frontend, LoopTool, and an efficient optimizing code generator, LoopNest. This stack enables us to compile entire neural networks and generate code targeting the AVX2, AVX512, NEON, and NEONfp16 instruction sets while incorporating optimizations often missing from other machine learning compiler backends. We evaluate our stack on a collection of full neural networks and commonly used network blocks as well as individual operators, and show that LoopStack generates machine code that matches and frequently exceeds the performance of in state-of-the-art machine learning frameworks in both cases. We also show that for a large collection of schedules LoopNest's compilation is orders of magnitude faster than LLVM, while resulting in equal or improved run time performance. Additionally, LoopStack has a very small memory footprint - a binary size of 245KB, and under 30K lines of effective code makes it ideal for use on mobile and embedded devices.",
    "citationCount": 3,
    "referenceCount": 63
}