{
    "paperId": "1d9b99e1d9b595692cfca053fdaf0aecebc81188",
    "title": "An Adaptive Autonomic Framework for Optimizing Energy Consumption in the Cloud Data Centers",
    "year": 2019,
    "venue": "International Journal of Intelligent Engineering and Systems",
    "authors": [
        "S. Diouani",
        "H. Medromi"
    ],
    "doi": "10.22266/IJIES2019.0831.12",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1d9b99e1d9b595692cfca053fdaf0aecebc81188",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.22266/ijies2019.0831.12",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Given the development of the Cloud Computing recently, clients and customers using the Cloud for both individual and business needs have expanded to an uncommon scale. This has normally prompted the expanded deployments of Cloud data centers over the globe. As a result, Cloud data centers are seen to be monstrous energy consumers and natural polluters. They require an extraordinary measure of regular energy which has made an effect on the energy supply and natural conditions of the environment. This is the reason why the vulnerability of persistent energy supply, later on, is being referred to. In this way, there is a need of an energy-aware cloud-based system which automatically and efficiently manages and optimize cloud computing data center resources by considering energy consumption as an essential Quality of Service (QoS) parameter. This paper, focus on the energy utilization of the data centers and how this can be limited so as to make the cloud computing greener. Thus, a new autonomic resource optimization manager has been proposed to avail the most optimum level of resources with reduced server energy consumption. The proposed framework has been verified theoretically and tested experimentally. The experimental analysis has demonstrated that the effectiveness of the proposed solution is greater than the state-of-the-art methods in terms of the achieved results related to reducing energy consumption and response time in cloud computing data centers.",
    "citationCount": 3,
    "referenceCount": 38
}