{
    "paperId": "1da688eee405df1ab026a7906cbbfe89830e67ed",
    "title": "Automatic String Data Validation with Pattern Discovery",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Xinwei Lin",
        "Jing Zhao",
        "Peng Di",
        "Chuan Xiao",
        "Rui Mao",
        "Yan Ji",
        "Makoto Onizuka",
        "Zishuo Ding",
        "Weiyi Shang",
        "Jianbin Qin"
    ],
    "doi": "10.48550/arXiv.2408.03005",
    "arxivId": "2408.03005",
    "url": "https://www.semanticscholar.org/paper/1da688eee405df1ab026a7906cbbfe89830e67ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In enterprise data pipelines, data insertions occur periodically and may impact downstream services if data quality issues are not addressed. Typically, such problems can be investigated and fixed by on-call engineers, but locating the cause of such problems and fixing errors are often time-consuming. Therefore, automatic data validation is a better solution to defend the system and downstream services by enabling early detection of errors and providing detailed error messages for quick resolution. This paper proposes a self-validate data management system with automatic pattern discovery techniques to verify the correctness of semi-structural string data in enterprise data pipelines. Our solution extracts patterns from historical data and detects erroneous incoming data in a top-down fashion. High-level information of historical data is analyzed to discover the format skeleton of correct values. Fine-grained semantic patterns are then extracted to strike a balance between generalization and specification of the discovered pattern, thus covering as many correct values as possible while avoiding over-fitting. To tackle cold start and rapid data growth, we propose an incremental update strategy and example generalization strategy. Experiments on large-scale industrial and public datasets demonstrate the effectiveness and efficiency of our method compared to alternative solutions. Furthermore, a case study on an industrial platform (Ant Group Inc.) with thousands of applications shows that our system captures meaningful data patterns in daily operations and helps engineers quickly identify errors.",
    "citationCount": 0,
    "referenceCount": 45
}