{
    "paperId": "1da97ff5cc28f668fc6e3e51a190d092162fd3df",
    "title": "Robust Listwise Learning-to-Rank Approach for Database Query Optimizer",
    "year": 2023,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Xue Chen",
        "Rui Xi",
        "Yiheng Tang",
        "Mengshu Hou"
    ],
    "doi": "10.1109/ICPADS60453.2023.00170",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1da97ff5cc28f668fc6e3e51a190d092162fd3df",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Finding the optimal query plan within a large planning space plays a crucial role in determining the performance of an SQL statement. Since traditional cost model-based approaches rely on manual parameter adjustments and DBA experience, the learned query optimizer has been proposed as an alternative to automatically determine the optimal query plan. However, recent methods face challenges in capturing all candidate query plan relationships and adapting to dynamic environments. In this paper, we design an improved learned query optimizer, Li-Lero, that could plug into the existing DBMS with non-intrusive modification. Inspirations from learning to rank, we employ a listwise approach to train a ranker to obtain the optimal with minimal execution time. Rather than computing the real execution time, such a ranker only measures the relative relationship of candidate plans. Furthermore, a robustness enhancement method is proposed to improve the dynamic adaptability of the model by utilizing the masking technique. We implement Li-Lero and demonstrate its outstanding performance using PostgreSQL. Comparative evaluations are conducted using two data sets with different data distributions, and results show that our proposed method achieves high prediction accuracy and is robust to dynamic environments.",
    "citationCount": 2,
    "referenceCount": 23
}