{
    "paperId": "1dbba014f1e487fd71bd905ce7d8e0242cd32a89",
    "title": "OasisDB: An Oblivious and Scalable System for Relational Data",
    "year": 2025,
    "venue": "IACR Cryptology ePrint Archive",
    "authors": [
        "Haseeb Ahmed",
        "Nachiket Rao",
        "Abdelkarim Kati",
        "Florian Kerschbaum",
        "Sujaya Maiyya"
    ],
    "doi": "10.14778/3749646.3749707",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1dbba014f1e487fd71bd905ce7d8e0242cd32a89",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present OasisDB, an oblivious and scalable RDBMS framework designed to securely manage relational data while protecting against access and volume pattern attacks. Inspired by plaintext RDBMSs, OasisDB leverages existing oblivious key value stores (KV-stores) as storage engines and securely scales them to enhance performance. Its novel multi-tier architecture allows for independent scaling of each tier while supporting multi-user environments without compromising privacy. We demonstrate OasisDB's flexibility by deploying it with two distinct oblivious KV-stores, PathORAM and Waffle, and show its capability to execute a variety of SQL queries, including point and range queries, joins, aggregations, and (limited) updates. Experimental evaluations on the Epinions dataset show that OasisDB scales linearly with the number of machines. When deployed with a plaintext KV-store, OasisDB introduces negligible overhead in its multi-tier architecture compared to a plaintext database, CockroachDB. We also compare OasisDB with ObliDB and Obliviator, two oblivious RDBMSs, highlighting its advantages with scalability and multi-user support.",
    "citationCount": 0,
    "referenceCount": 67
}