{
    "paperId": "1df59177995fb7fb356847b9628226f017d962b1",
    "title": "Test-Time Scaling Strategies for Generative Retrieval in Multimodal Conversational Recommendations",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Hung-Chun Hsu",
        "Yuan-Ching Kuo",
        "C. Yang",
        "Szu-Wei Fu",
        "Hanrong Ye",
        "Hongxu Yin",
        "Yu-Chiang Frank Wang",
        "Ming-Feng Tsai",
        "Chuan-Ju Wang"
    ],
    "doi": "10.48550/arXiv.2508.18132",
    "arxivId": "2508.18132",
    "url": "https://www.semanticscholar.org/paper/1df59177995fb7fb356847b9628226f017d962b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid evolution of e-commerce has exposed the limitations of traditional product retrieval systems in managing complex, multi-turn user interactions. Recent advances in multimodal generative retrieval -- particularly those leveraging multimodal large language models (MLLMs) as retrievers -- have shown promise. However, most existing methods are tailored to single-turn scenarios and struggle to model the evolving intent and iterative nature of multi-turn dialogues when applied naively. Concurrently, test-time scaling has emerged as a powerful paradigm for improving large language model (LLM) performance through iterative inference-time refinement. Yet, its effectiveness typically relies on two conditions: (1) a well-defined problem space (e.g., mathematical reasoning), and (2) the model's ability to self-correct -- conditions that are rarely met in conversational product search. In this setting, user queries are often ambiguous and evolving, and MLLMs alone have difficulty grounding responses in a fixed product corpus. Motivated by these challenges, we propose a novel framework that introduces test-time scaling into conversational multimodal product retrieval. Our approach builds on a generative retriever, further augmented with a test-time reranking (TTR) mechanism that improves retrieval accuracy and better aligns results with evolving user intent throughout the dialogue. Experiments across multiple benchmarks show consistent improvements, with average gains of 14.5 points in MRR and 10.6 points in nDCG@1.",
    "citationCount": 0,
    "referenceCount": 59
}