{
    "paperId": "1df6fc10d1b9d21d9e964cc61105b19cb46cf9e1",
    "title": "Construction of a high-density genetic map and the soluble solid content gene BhSSC10.1 in wax gourd (Benincasa hispida)",
    "year": 2024,
    "venue": "Acta Societatis Botanicorum Poloniae",
    "authors": [
        "Ting Liu",
        "Peng Wang",
        "Wenrui Yang",
        "Lifeng Nong",
        "Z. Cheng",
        "Liwen Su",
        "Yan Deng",
        "Wenhui Bai",
        "Zhihao Chen",
        "Zhengguo Liu"
    ],
    "doi": "10.5586/asbp/190172",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1df6fc10d1b9d21d9e964cc61105b19cb46cf9e1",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.journalssystem.com/asbp/pdf-190172-113286?filename=Construction of a.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The soluble solids content (SSC) of wax gourd is a pivotal intrinsic fruit quality trait. However, limited studies concerning the associated genes have been documented. In this investigation, 105 recombinant inbred line (RIL) populations derived from GX-7 and MY-1 served as the research material. A high-density genetic map of wax gourd was constructed, incorporating 956 bin markers distributed across 12 linkage groups (LGs). These markers were obtained via whole-genome resequencing, yielding 1,256,985 high-quality SNPs and indels. The total map spanned 1,357.15 cM, with an average inter-marker distance of 1.53 cM. Utilizing this map in conjunction with wax gourd SSC phenotypic data, two quantitative trait loci (QTLs) were identified on Chr5 and Chr10. Notably, qSSC10 exhibited a high contribution and effect value, encompassing 31 annotated genes within this interval. Subsequently, we screened ten genes within qSSC10 based on biparental polymorphism analysis. Among these genes, one encoding Class III peroxidase, Bch10G006650 (BhSSC10.1), demonstrated highly significant expression differences between the parental lines. Consequently, BhSSC10.1 emerges as a promising candidate gene for regulating the SSC in wax gourd. The findings of this study established a theoretical foundation for elucidating the roles of SSC-related genes and the development of high-quality wax gourd varieties.",
    "citationCount": 0,
    "referenceCount": 35
}