{
    "paperId": "1e0917c22346cbd4ac38aa890b870f77620031b4",
    "title": "Urban Architectural Landscape Recognition Based on Deep Convolutional Neural Networks and LiDAR",
    "year": 2024,
    "venue": "Computer-Aided Design and Applications",
    "authors": [
        "Xiaoyong Zhang",
        "Shan Mi",
        "Xiuhuan Feng",
        "Weiying Ding"
    ],
    "doi": "10.14733/cadaps.2025.s3.259-271",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1e0917c22346cbd4ac38aa890b870f77620031b4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": For today's rapidly developing cities, identifying and managing urban architectural landscapes is an important task in urban planning, environmental monitoring, and disaster prevention. Traditional building identification methods mainly rely on manual surveying and on-site investigation, which is not only time-consuming and labor-intensive but also easily affected by human and environmental factors, resulting in inaccurate and incomplete identification results. This article introduced an urban architectural landscape recognition method that combined Deep Convolutional Neural Network (DCNN) and Light Detection and Ranging (LiDAR) technology. During the research process, by fusing multi-level features from images and LiDAR data, high-precision and efficient feature extraction was achieved, improving recognition precision and model generalization ability. Afterward, the ResNet (Residual Network) 50 model was combined with the extracted advanced features to form the model in this article. The model performance was improved through He parameter initialization, classification cross-entropy loss function, and Adam optimizer. The research results indicated that the model in this article could achieve good convergence in about 50 rounds during the training process, and the accuracy in testing also reached about 93%, which was a significant improvement compared to traditional model recognition. This research not only provides new ideas for the recognition of urban architectural landscapes and promotes their development but also offers reference methods and data support for studies in related fields.",
    "citationCount": 1,
    "referenceCount": 34
}