{
    "paperId": "1e2d4a71ba15572e23ba269884fe9eb9a78eec5c",
    "title": "Robust Benchmark for Propagandist Text Detection and Mining High-Quality Data",
    "year": 2023,
    "venue": "Mathematics",
    "authors": [
        "Pir Noman Ahmad",
        "Yuanchao Liu",
        "Gauhar Ali",
        "M. Wani",
        "Mohammed Elaffendi"
    ],
    "doi": "10.3390/math11122668",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1e2d4a71ba15572e23ba269884fe9eb9a78eec5c",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2227-7390/11/12/2668/pdf?version=1686566652",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Social media, fake news, and different propaganda strategies have all contributed to an increase in misinformation online during the past ten years. As a result of the scarcity of high-quality data, the present datasets cannot be used to train a deep-learning model, making it impossible to establish an identification. We used a natural language processing approach to the issue in order to create a system that uses deep learning to automatically identify propaganda in news items. To assist the scholarly community in identifying propaganda in text news, this study suggested the propaganda texts (ProText) library. Truthfulness labels are assigned to ProText repositories after being manually and automatically verified with fact-checking methods. Additionally, this study proposed using a fine-tuned Robustly Optimized BERT Pre-training Approach (RoBERTa) and word embedding using multi-label multi-class text classification. Through experimentation and comparative research analysis, we address critical issues and collaborate to discover answers. We achieved an evaluation performance accuracy of 90%, 75%, 68%, and 65% on ProText, PTC, TSHP-17, and Qprop, respectively. The big-data method, particularly with deep-learning models, can assist us in filling out unsatisfactory big data in a novel text classification strategy. We urge collaboration to inspire researchers to acquire, exchange datasets, and develop a standard aimed at organizing, labeling, and fact-checking.",
    "citationCount": 11,
    "referenceCount": 66
}