{
    "paperId": "1e538667c57bc8d9325c70515ba772527b35fad8",
    "title": "ESG: Elastic Graphs for Range-Filtering Approximate k-Nearest Neighbor Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Mingyu Yang",
        "Wentao Li",
        "Zhitao Shen",
        "Chuan Xiao",
        "Wei Wang"
    ],
    "doi": "10.48550/arXiv.2504.04018",
    "arxivId": "2504.04018",
    "url": "https://www.semanticscholar.org/paper/1e538667c57bc8d9325c70515ba772527b35fad8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Range-filtering approximate $k$-nearest neighbor (RFAKNN) search takes as input a vector and a numeric value, returning $k$ points from a database of $N$ high-dimensional points. The returned points must satisfy two criteria: their numeric values must lie within the specified query range, and they must be approximately the $k$ nearest points to the query vector. To strike a better balance between query accuracy and efficiency, we propose novel methods that relax the strict requirement for subranges to \\textit{exactly} match the query range. This elastic relaxation is based on a theoretical insight: allowing the controlled inclusion of out-of-range points during the search does not compromise the bounded complexity of the search process. Building on this insight, we prove that our methods reduce the number of required subranges to at most \\textit{two}, eliminating the $O(\\log N)$ query overhead inherent in existing methods. Extensive experiments on real-world datasets demonstrate that our proposed methods outperform state-of-the-art approaches, achieving performance improvements of 1.5x to 6x while maintaining high accuracy.",
    "citationCount": 0,
    "referenceCount": 48
}