{
    "paperId": "1e81916e659f0367d4281d89a0c81974f78072b6",
    "title": "Learning Augmented Methods for Matching: Improving Invasive Species Management and Urban Mobility",
    "year": 2021,
    "venue": "AAAI Conference on Artificial Intelligence",
    "authors": [
        "Johan Bjorck",
        "Qinru Shi",
        "Carrie Brown‐Lima",
        "Jennifer Dean",
        "Angela K. Fuller",
        "Carla P. Gomes"
    ],
    "doi": "10.1609/aaai.v35i17.17727",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1e81916e659f0367d4281d89a0c81974f78072b6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1609/aaai.v35i17.17727",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the success of machine learning, integrating learned models into real-world systems has become a critical challenge. Naively applying predictions to combinatorial optimization problems can incur high costs, which has motivated researchers to consider learning augmented algorithms that can make use of faulty or incomplete predictions. Inspired by two matching problems in computational sustainability where data is abundant, we consider the learning augmented min weight matching problem where some nodes are revealed online while others are known a priori, e.g., by being predicted by machine learning. We develop an algorithm that is able to make use of this extra information and provably improves upon pessimistic online algorithms. We evaluate our algorithm on two settings from computational sustainability -- the coordination of unreliable citizen scientists for invasive species management, and the matching between taxis and riders under uncertain trip duration predictions. In both cases, we perform extensive experiments on real-world datasets and find that our method outperforms baselines, showing how learning augmented algorithms can reliably improve solutions for problems in computational sustainability.",
    "citationCount": 0,
    "referenceCount": 43
}