{
    "paperId": "1e89e0f2b0681b5f52429192eef75d62e8a7c3a0",
    "title": "Analysis of Geospatial Data Loading",
    "year": 2024,
    "venue": "DBTest@SIGMOD",
    "authors": [
        "Aske Wachs",
        "Eleni Tzirita Zacharatou"
    ],
    "doi": "10.1145/3662165.3662761",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1e89e0f2b0681b5f52429192eef75d62e8a7c3a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rate at which applications gather geospatial data today has turned data loading into a critical component of data analysis pipelines. However, users are confronted with multiple file formats for storing geospatial data and an array of systems for processing it. To shed light on how the choice of file format and system affects performance, this paper explores the performance of loading geospatial data stored in diverse file formats using different libraries. It aims to study the impact of different file formats, compare loading throughput across spatial libraries, and examine the microarchitectural behavior of geospatial data loading. Our findings show that GeoParquet files provide the highest loading throughput across all benchmarked libraries. Furthermore, we note that the more spatial features per byte a file format can store, the higher the data loading throughput. Our micro-architectural analysis reveals high instructions per cycle (IPC) during spatial data loading for most libraries and formats. Additionally, our experiments show that instruction misses dominate L1 cache misses, except for GeoParquet files, where data misses take over.",
    "citationCount": 1,
    "referenceCount": 30
}