{
    "paperId": "1f06de91232f21cdf70fcea86d24027c17f32ad2",
    "title": "Efficient Approximate Temporal Triangle Counting in Streaming with Predictions",
    "year": 2025,
    "venue": "ECML/PKDD",
    "authors": [
        "Giorgio Venturin",
        "Ilie Sarpe",
        "Fabio Vandin"
    ],
    "doi": "10.48550/arXiv.2506.13173",
    "arxivId": "2506.13173",
    "url": "https://www.semanticscholar.org/paper/1f06de91232f21cdf70fcea86d24027c17f32ad2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Triangle counting is a fundamental and widely studied problem on static graphs, and recently on temporal graphs, where edges carry information on the timings of the associated events. Streaming processing and resource efficiency are crucial requirements for counting triangles in modern massive temporal graphs, with millions of nodes and up to billions of temporal edges. However, current exact and approximate algorithms are unable to handle large-scale temporal graphs. To fill such a gap, we introduce STEP, a scalable and efficient algorithm to approximate temporal triangle counts from a stream of temporal edges. STEP combines predictions to the number of triangles a temporal edge is involved in, with a simple sampling strategy, leading to scalability, efficiency, and accurate approximation of all eight temporal triangle types simultaneously. We analytically prove that, by using a sublinear amount of memory, STEP obtains unbiased and very accurate estimates. In fact, even noisy predictions can significantly reduce the variance of STEP's estimates. Our extensive experiments on massive temporal graphs with up to billions of edges demonstrate that STEP outputs high-quality estimates and is more efficient than state-of-the-art methods.",
    "citationCount": 0,
    "referenceCount": 60
}