{
    "paperId": "1f063ad663d02290200340cc7378b753fee091eb",
    "title": "UML Sequence Diagram Generation: A Multi-Model, Multi-Domain Evaluation",
    "year": 2025,
    "venue": "2025 IEEE/ACM 47th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)",
    "authors": [
        "Chi Xiao",
        "Daniel Ståhl",
        "Jan Bosch"
    ],
    "doi": "10.1109/ICSE-SEIP66354.2025.00030",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1f063ad663d02290200340cc7378b753fee091eb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The automation of Unified Modeling Language (UML) sequence diagram generation has posed a persistent challenge in software engineering, with existing approaches relying heavily on manual processes. Recent advancements in natural language processing (NLP), particularly through large language models (LLMs), offer promising solutions for automating this task. This paper investigates the use of LLMs in automating the generation of UML sequence diagrams from natural language requirements. We evaluate three state-of-the-art LLMs, GPT-4o, Mixtral 8x7B, and Llama 3.1 8B, across multiple datasets, including both public and proprietary requirements, to assess their performance in terms of correctness, completeness, clarity, and readability. The results indicate GPT-4o consistently outperforms the other models in most metrics. Our findings highlight the potential of LLMs to streamline requirements engineering by reducing manual effort, although further refinement is needed to enhance their performance in complex scenarios. This study provides key insights into the strengths and limitations of these models, and offers practical guidance for their application, advancing the understanding of how LLMs can support automation in software engineering tasks.",
    "citationCount": 0,
    "referenceCount": 44
}