{
    "paperId": "1f26cf19ae14268b78151f77a84e70a8534753df",
    "title": "Chromosome-level genome assembly of Hippophae salicifolia",
    "year": 2025,
    "venue": "Scientific Data",
    "authors": [
        "Zhefei Zeng",
        "Chunmin Mao",
        "Jiayin Zhang",
        "Zhongqiong Tian",
        "Min Xu",
        "Wei Li",
        "Junwei Wang",
        "Wenju Zhang",
        "L. Qiong"
    ],
    "doi": "10.1038/s41597-025-05844-6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1f26cf19ae14268b78151f77a84e70a8534753df",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hippophae salicifolia, a dioecious small tree species endemic to the Himalayan region, holds great potential in both ecological conservation and industrial applications. In this study, we employed PacBio HiFi long reads, Illumina short reads, and Hi-C technology to construct a high-quality, chromosome-level reference genome. The assembled genome is approximately 1.11 Gb in size, with a scaffold N50 of 95.29 Mb, and 99.94% of the sequences were successfully anchored to 12 pseudo-chromosomes. A total of 42,547 protein-coding genes were predicted, and approximately 85% of these genes obtained functional annotations. Repetitive elements constituted about 45.25% of the genome, with Long Terminal Repeat (LTR) being the most abundant (32.54%). BUSCO analysis indicated that both the assembly and annotation are highly complete. This high-quality genomic resource provides a valuable foundation for investigating sex determination mechanisms, adaptive evolution, and genomic diversity in H. salicifolia and related species, as well as for advancing genetic improvement, resource conservation, and utilization efforts.",
    "citationCount": 0,
    "referenceCount": 66
}