{
    "paperId": "1f297f9c1fdb74b8af026628f595b069c3e3bace",
    "title": "Near Neighbor Search for Constraint Queries",
    "year": 2023,
    "venue": "BigData Congress [Services Society]",
    "authors": [
        "Gaurav Gupta",
        "Anup Rao",
        "Tung Mai",
        "Ryan A. Rossi",
        "Xiang Chen",
        "Saayan Mitra",
        "Anshumali Shrivastava"
    ],
    "doi": "10.1109/BigData59044.2023.10386608",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1f297f9c1fdb74b8af026628f595b069c3e3bace",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There is increasing attention toward search indexes based on dense vector representations as they can encode latent semantic features and can be generated efficiently, thanks to the advances in representation learning. Building an index on vectors was addressed by methods like locality-sensitive hashing (LSH), Inverted File Index (IVF), and near-neighbor graphs and perfected for high performance. However, the current near-neighbor (NN) indexes cannot be directly used in a real recommendation engine where both learned dense features and the constraints-attributes are used. The existing methods are cascaded index with vector search followed by a naive matching or inverted index for filtering on attribute tokens. This filtering on post-vector search matched sets often limits the control on output size and adds latency due to repeated calls to the NN engine. We aim to make a single-stage retrieval model that can retrieve in a single pass and control the output size without compromising on latency. An NN index amenable to this should have a very similar structure to the attribute token-based inverted index. Hence, we develop an efficient constraint search engine based on the high dimensional sparse embeddings of semantic features added with attribute tokens. With this, we get an Inverted index-based Constraint Near Neighbor search-ICONN, where we retrieve search results with 100% match on query attributes and close to its semantic features. We achieve a better latency vs recall10@10 tradeoff compared to the standard NN search followed by attribute filtering.",
    "citationCount": 0,
    "referenceCount": 39
}