{
    "paperId": "1f2b0c7297030985326a5af21a57a7158ca28757",
    "title": "Graph Learning with Distributional Edge Layouts",
    "year": 2025,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Xinjian Zhao",
        "Chaolong Ying",
        "Yaoyao Xu",
        "Tianshu Yu"
    ],
    "doi": "10.1145/3690624.3709206",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1f2b0c7297030985326a5af21a57a7158ca28757",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph Neural Networks (GNNs) learn from graph-structured data by passing messages between neighboring nodes along edges on certain topological layouts. While layouts can be essential to GNNs' performance, extant methods generally consider obtaining layouts from limited perspectives. In this paper, we introduce Distributional Edge Layouts (DELs), a first-of-its-kind method to sample a collection of topological layouts from a Boltzmann distribution under physical energies. By integrating DELs into GNNs, a wide landscape of feasible graph layouts can be captured from a holistic perspective, overcoming the intrinsic drawbacks in existing GNN designs.In practice, DELs can complement various GNN architectures with high versatility. Our theoretical analysis proves that GNNs equipped with DELs maintain at least the same expressive as their original counterparts, with empirical potential offering extra expressivity. Extensive experiments demonstrate that DELs consistently and substantially improve the performance of a wide range of GNN baselines across multiple datasets, achieving state-of-the-art results. This improvement suggests that DELs capture important distributional information previously overlooked by traditional GNN approaches. DEL is open-sourced at https://github.com/LOGO-CUHKSZ/DEL.",
    "citationCount": 0,
    "referenceCount": 73
}