{
    "paperId": "1f465b77c7d774da1fa18827e197a6372bbaa63b",
    "title": "A Zero Attentive Relevance Matching Networkfor Review Modeling in Recommendation System",
    "year": 2021,
    "venue": "European Conference on Information Retrieval",
    "authors": [
        "Hansi Zeng",
        "Zhichao Xu",
        "Qingyao Ai"
    ],
    "doi": "10.1007/978-3-030-72113-8_48",
    "arxivId": "2101.06387",
    "url": "https://www.semanticscholar.org/paper/1f465b77c7d774da1fa18827e197a6372bbaa63b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "User and item reviews are valuable for the construction of recommender systems. In general, existing review-based methods for recommendation can be broadly categorized into two groups: the siamese models that build static user and item representations from their reviews respectively, and the interaction-based models that encode user and item dynamically according to the similarity or relationships of their reviews. Although the interaction-based models have more model capacity and fit human purchasing behavior better, several problematic model designs and assumptions of the existing interaction-based models lead to its suboptimal performance compared to existing siamese models. In this paper, we identify three problems of the existing interaction-based recommendation models and propose a couple of solutions as well as a new interaction-based model to incorporate review data for rating prediction. Our model implements a relevance matching model with regularized training losses to discover user relevant information from long item reviews, and it also adapts a zero attention strategy to dynamically balance the item-dependent and item-independent information extracted from user reviews. Empirical experiments and case studies on Amazon Product Benchmark datasets show that our model can extract effective and interpretable user/item representations from their reviews and outperforms multiple types of state-of-the-art review-based recommendation models.",
    "citationCount": 14,
    "referenceCount": 40
}