{
    "paperId": "1f9822022f586e375461660db792f23e891c7123",
    "title": "Self-Adaptive Large Language Model (LLM)-Based Multiagent Systems",
    "year": 2023,
    "venue": "2023 IEEE International Conference on Autonomic Computing and Self-Organizing Systems Companion (ACSOS-C)",
    "authors": [
        "N. Nascimento",
        "Paulo Alencar",
        "Donald D. Cowan"
    ],
    "doi": "10.1109/ACSOS-C58168.2023.00048",
    "arxivId": "2307.06187",
    "url": "https://www.semanticscholar.org/paper/1f9822022f586e375461660db792f23e891c7123",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2307.06187",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The complexity of managing multiagent systems (MASs) in autonomic computing can be mitigated using a self-adaptation approach, where systems are equipped to monitor and adjust themselves based on specific concerns. Communication in these systems is key given that in scenarios involving agent interaction, it enhances cooperation and reduces coordination challenges by enabling direct, clear information exchange. However, the tasks of boosting communication expressiveness within MASs and logically processing a multitude of variables in dynamic environments are still challenging. This paper presents a novel strategy: integrating large language models (LLMs) like GPT-based technologies into MASs to boost communication and agent autonomy. Our proposal encompasses the development of a novel LLM/GPT-based agent architecture, focusing not only on advanced conversation features but also on the reasoning and decision-making capacities of these models. This is grounded in the MAPE-K model, known for supporting system adaptability in dynamic environments. We illustrate our approach through a marketplace scenario. This work represents a paradigm shift in MAS self-adaptation, utilizing LLMs' capabilities and indicating further research opportunities to assess LLMs' applicability in more complex MAS scenarios. This could pave the way for more potent problem-solving capabilities and refined communication within MASs.",
    "citationCount": 59,
    "referenceCount": 25
}