{
    "paperId": "1fadf7ee4b05c5dd4ca67125b913cfec921c7a4b",
    "title": "Comparison Performance Analysis of HDD, SSD and NVME for OLTP Database Server",
    "year": 2024,
    "venue": "Jurnal Syntax Admiration",
    "authors": [
        "Ferdy Nirwansyah"
    ],
    "doi": "10.46799/jsa.v5i10.1730",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1fadf7ee4b05c5dd4ca67125b913cfec921c7a4b",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.jurnalsyntaxadmiration.com/index.php/jurnal/article/download/1730/1841",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Databases are an essential component of life in modern society. The database has become an online Transaction Processing (OLTP) operational support company. This study discusses the storage configuration in a virtual server database for OLTP Database with a benchmark against three storage configurations for four databases: SQL Server, MySQL, PostgreSQL, and MariaDB for Windows Server virtualization. Benchmarks using TPC-C to get the best performance from all three configurations have been tested. The results of this study show that the storage configuration of HDD as a virtual disk drive OS and NVME as a virtual disk drive database get better performance as online transaction processing (OLTP) compared to HDD as a virtual disk drive OS and HDD or SSD as a virtual disk drive database. Using the TPC-C benchmark, the study tested the performance of four databases (SQL Server, MySQL, PostgreSQL, and MariaDB) in various virtual storage configurations. The results of 36 experiments involving different numbers of virtual users (10, 50, and 100) showed that a hybrid configuration that used HDDs for the operating system and NVME for database storage provided the best performance. On SQL Server, SSD configurations show better results for smaller user loads. The results suggest that the combination of HDD and NVME is the optimal configuration for most databases in OLTP tasks, and it provides useful guidance in efficient storage investment decision-making. Further research is expected to be able to conduct tests.",
    "citationCount": 0,
    "referenceCount": 14
}