{
    "paperId": "1fb8ee25aba1892c12e696cecac7f1f088125244",
    "title": "Trust Modeling and Estimation in Human-Autonomy Interactions",
    "year": 2025,
    "venue": "",
    "authors": [
        "Daniel A. Williams",
        "Airlie Chapman",
        "Daniel R. Little",
        "Chris Manzie"
    ],
    "doi": null,
    "arxivId": "2510.09013",
    "url": "https://www.semanticscholar.org/paper/1fb8ee25aba1892c12e696cecac7f1f088125244",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Advances in the control of autonomous systems have accompanied an expansion in the potential applications for autonomous robotic systems. The success of applications involving humans depends on the quality of interaction between the autonomous system and the human supervisor, which is particularly affected by the degree of trust that the supervisor places in the autonomous system. Absent from the literature are models of supervisor trust dynamics that can accommodate asymmetric responses to autonomous system performance and the intermittent nature of supervisor-autonomous system communication. This paper focuses on formulating an estimated model of supervisor trust that incorporates both of these features by employing a switched linear system structure with event-triggered sampling of the model input and output. Trust response data collected in a user study with 51 participants were then used identify parameters for a switched linear model-based observer of supervisor trust.",
    "citationCount": 0,
    "referenceCount": 38
}