{
    "paperId": "1fd23af6484b2457538edd242c35c570ae128cdd",
    "title": "Utilizing Inverted Residual Blocks in Deep Learning Models for ALL Classification",
    "year": 2025,
    "venue": "2025 IEEE Applied Sensing Conference (APSCON)",
    "authors": [
        "Fitsum Getachew Tola",
        "Kokou Elvis Khorem Blitti",
        "Anjali Diwan",
        "Reshma Sunil",
        "Tete Winner Benissan-Adodjissi"
    ],
    "doi": "10.1109/APSCON63569.2025.11144054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/1fd23af6484b2457538edd242c35c570ae128cdd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Acute Lymphoblastic Leukemia(ALL), a rapidly progressing cancer primarily affecting children, is caused on by the aberrant growth of immature white blood cells in the bone marrow. Effective therapy for ALL depends on early discovery and precise classification, however hematologists frequently find this to be a labor-intensive task. By using deep learning techniques for the automated classification of leukemia in blood microscopic pictures, this study aims to lessen the workload for doctors. We compared our proposed deep neural network model, which uses Inverted Residual Blocks inspired by MobileNetV2, to other two transfer learning models: VGG16, which and Inception. Our model is optimized to minimize computing demands and capture complex information in an effective manner. Furthermore, overfitting was greatly reduced by the thoughtful application of dropout layers, producing a more broadly applicable model. On the test dataset, the suggested model yielded an accuracy of 98.55% and showed remarkable recall rates of 97%, 100%, and 100% for the early pre-B, preB, and pro-B stages, respectively. These results underscore the model’s potential as a reliable tool for assisting in the early detection and classification of ALL, ultimately contributing to more effective clinical decision-making.",
    "citationCount": 0,
    "referenceCount": 18
}