{
    "paperId": "1fef4ca1264f89e675b720545f50fa9a3c07b9b9",
    "title": "TpopT: Efficient Trainable Template Optimization on Low-Dimensional Manifolds",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Jingkai Yan",
        "Shiyu Wang",
        "Xinyu Rain Wei",
        "Jimmy Wang",
        "Z. M'arka",
        "S. M'arka",
        "John N. Wright"
    ],
    "doi": "10.48550/arXiv.2310.10039",
    "arxivId": "2310.10039",
    "url": "https://www.semanticscholar.org/paper/1fef4ca1264f89e675b720545f50fa9a3c07b9b9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In scientific and engineering scenarios, a recurring task is the detection of low-dimensional families of signals or patterns. A classic family of approaches, exemplified by template matching, aims to cover the search space with a dense template bank. While simple and highly interpretable, it suffers from poor computational efficiency due to unfavorable scaling in the signal space dimensionality. In this work, we study TpopT (TemPlate OPTimization) as an alternative scalable framework for detecting low-dimensional families of signals which maintains high interpretability. We provide a theoretical analysis of the convergence of Riemannian gradient descent for TpopT, and prove that it has a superior dimension scaling to covering. We also propose a practical TpopT framework for nonparametric signal sets, which incorporates techniques of embedding and kernel interpolation, and is further configurable into a trainable network architecture by unrolled optimization. The proposed trainable TpopT exhibits significantly improved efficiency-accuracy tradeoffs for gravitational wave detection, where matched filtering is currently a method of choice. We further illustrate the general applicability of this approach with experiments on handwritten digit data.",
    "citationCount": 2,
    "referenceCount": 57
}