{
    "paperId": "20381cd41140b547d54899b69424b69d0de567e0",
    "title": "Q4EDA: A Novel Strategy for Textual Information Retrieval Based on User Interactions with Visual Representations of Time Series",
    "year": 2021,
    "venue": "Inf.",
    "authors": [
        "L. Christino",
        "M. D. Ferreira",
        "F. Paulovich"
    ],
    "doi": "10.3390/info13080368",
    "arxivId": "2101.08655",
    "url": "https://www.semanticscholar.org/paper/20381cd41140b547d54899b69424b69d0de567e0",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2078-2489/13/8/368/pdf?version=1661314600",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Knowing how to construct text-based Search Queries (SQs) for use in Search Engines (SEs) such as Google or Wikipedia has become a fundamental skill. Though much data are available through such SEs, most structured datasets live outside their scope. Visualization tools aid in this limitation, but no such tools come close to the sheer amount of information available through general-purpose SEs. To fill this gap, this paper presents Q4EDA, a novel framework that converts users’ visual selection queries executed on top of time series visual representations, providing valid and stable SQs to be used in general-purpose SEs and suggestions of related information. The usefulness of Q4EDA is presented and validated by users through an application linking a Gapminder’s line-chart replica with a SE populated with Wikipedia documents, showing how Q4EDA supports and enhances exploratory analysis of United Nations world indicators. Despite some limitations, Q4EDA is unique in its proposal and represents a real advance towards providing solutions for querying textual information based on user interactions with visual representations.",
    "citationCount": 2,
    "referenceCount": 82
}