{
    "paperId": "208577b5827f019f765ec0b7bb83dd1f4d2facdf",
    "title": "Analog content-addressable memories with memristors",
    "year": 2019,
    "venue": "Nature Communications",
    "authors": [
        "Can Li",
        "Catherine E. Graves",
        "X. Sheng",
        "Darrin Miller",
        "M. Foltin",
        "G. Pedretti",
        "J. Strachan"
    ],
    "doi": "10.1038/s41467-020-15254-4",
    "arxivId": "1907.08177",
    "url": "https://www.semanticscholar.org/paper/208577b5827f019f765ec0b7bb83dd1f4d2facdf",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41467-020-15254-4.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A content-addressable memory compares an input search word against all rows of stored words in an array in a highly parallel manner. While supplying a very powerful functionality for many applications in pattern matching and search, it suffers from large area, cost and power consumption, limiting its use. Past improvements have been realized by using memristors to replace the static random-access memory cell in conventional designs, but employ similar schemes based only on binary or ternary states for storage and search. We propose a new analog content-addressable memory concept and circuit to overcome these limitations by utilizing the analog conductance tunability of memristors. Our analog content-addressable memory stores data within the programmable conductance and can take as input either analog or digital search values. Experimental demonstrations, scaled simulations and analysis show that our analog content-addressable memory can reduce area and power consumption, which enables the acceleration of existing applications, but also new computing application areas. Designing low power and high performance content-addressable memory remains a challenge. Here, the authors demonstrate a content-addressable memory concept and circuit which leverages the analog conductance tunability of memristors, reduces power consumption, and enables new functionalities and applications.",
    "citationCount": 151,
    "referenceCount": 44
}