{
    "paperId": "20dd13fe350bee749f8a1ed30e15c94e459ab1b8",
    "title": "DW vs OLTP Performance Optimization in the Cloud on PostgreSQL (A Case Study)",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Recent Advances in Systems Science and Engineering (RASSE)",
    "authors": [
        "Dakota Joiner",
        "Mathias Clement",
        "Shek Chan",
        "Keegan Pereira",
        "Albert Wong",
        "Y. Khmelevsky",
        "Joe Mahony",
        "Michael Ferri"
    ],
    "doi": "10.1109/RASSE54974.2022.9989603",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/20dd13fe350bee749f8a1ed30e15c94e459ab1b8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This case study shows the performance issues and solutions for a data warehouse (DW) performing well to serve industrial partners in improving customer data retrieval performance. An online transaction processing (OLTP) relational database and a DW were deployed in PostgreSQL and tested against each other. Several test cases were carried out with the DW, including indexing and creating pre-aggregated tables, all guided by in-depth analysis of EXPLAIN plans. Queries and DW design were continually improved throughout testing to ensure that the OLTP and DW were compared equally. Seven queries (requested by the industrial client) were used to thoroughly test different performance aspects concerning client feedback and the complexity of requests for all areas the DW might cover. On average, the data warehouse showed a one to three magnitudes increase in query execution performance, with the highest calibre results coming in at 2,493 times faster than the OLTP. All test cases showed an increase in performance over the OLTP. Additionally, the data contained in the DWtook up 24% less storage space than the OLTP. The results here indicate a promising direction to take business analytics with data warehousing, as customers will experience significant cost savings and a reduction in time to receive desired results from their data storage platforms in the cloud. The work in this case study is a continuation of previous work in a much larger project concerning integrating database technologies with machine learning to improve natural language processing solutions as a cost-saving measure for utilities consumers.",
    "citationCount": 5,
    "referenceCount": 41
}