{
    "paperId": "20fea2d159b48f049cbbb1ea282536fcb7b403fb",
    "title": "Neural Priming for Sample-Efficient Adaptation",
    "year": 2023,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Matthew Wallingford",
        "Vivek Ramanujan",
        "Alex Fang",
        "Aditya Kusupati",
        "Roozbeh Mottaghi",
        "Aniruddha Kembhavi",
        "Ludwig Schmidt",
        "Ali Farhadi"
    ],
    "doi": "10.48550/arXiv.2306.10191",
    "arxivId": "2306.10191",
    "url": "https://www.semanticscholar.org/paper/20fea2d159b48f049cbbb1ea282536fcb7b403fb",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2306.10191",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose Neural Priming, a technique for adapting large pretrained models to distribution shifts and downstream tasks given few or no labeled examples. Presented with class names or unlabeled test samples, Neural Priming enables the model to recall and conditions its parameters on relevant data seen throughout pretraining, thereby priming it for the test distribution. Neural Priming can be performed at test time, even for pretraining datasets as large as LAION-2B. Performing lightweight updates on the recalled data significantly improves accuracy across a variety of distribution shift and transfer learning benchmarks. Concretely, in the zero-shot setting, we see a 2.45% improvement in accuracy on ImageNet and 3.81% accuracy improvement on average across standard transfer learning benchmarks. Further, using Neural Priming at inference to adapt to distribution shift, we see a 1.41% accuracy improvement on ImageNetV2. These results demonstrate the effectiveness of Neural Priming in addressing the challenge of limited labeled data and changing distributions. Code is available at github.com/RAIVNLab/neural-priming.",
    "citationCount": 17,
    "referenceCount": 55
}