{
    "paperId": "210d15a7f63a4b43be02fd40d91242b8e4bbbe22",
    "title": "Model-Agnostic Machine Learning Model Updating – A Case Study on a real-world Application",
    "year": 2024,
    "venue": "Conference on Computer Science and Information Systems",
    "authors": [
        "Julia Poray",
        "Bogdan Franczyk",
        "Thomas Heller"
    ],
    "doi": "10.15439/2024F4426",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/210d15a7f63a4b43be02fd40d91242b8e4bbbe22",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The application of developments in the real world is the final aim of all scientific works. In the case of Data Science and Machine Learning, this means there are additional tasks to care about, compared to the rather academic part of \"just\" building a model based on the available data. In the well accepted Cross Industry Standard for Data Mining (CRISP-DM), one of these tasks is the maintenance of the deployed application. This task can be of extreme importance, since in real-world applications the model performance often decreases over time, usually due to Concept Drift. This directly leads to the need to adapt/update the used Machine Learning model. In this work, available model-agnostic model update methods are evaluated on a real-world industry application, here Virtual Metrology in semiconductor fabrication. The results show that for the real-world use case sliding window techniques performed best. The models used in the experiments were an XGBoost and Neural Network. For the Neural Network, Model-Agnostic Meta-Learning and Learning to learn by Gradient Descent by Gradient Descent were applied as update techniques (among others) and did not show any improvement compared to the baseline of not updating the Neural Network. The implementation of the update techniques was validated on an artificial use case for which they worked well.",
    "citationCount": 1,
    "referenceCount": 52
}