{
    "paperId": "213264fe49c8b6a53a44aa03461fab14be0b4eb8",
    "title": "Multi-Interest Recommendation: A Survey",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zihao Li",
        "Qiang Chen",
        "Lixin Zou",
        "Aixin Sun",
        "Chenliang Li"
    ],
    "doi": "10.48550/arXiv.2506.15284",
    "arxivId": "2506.15284",
    "url": "https://www.semanticscholar.org/paper/213264fe49c8b6a53a44aa03461fab14be0b4eb8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing recommendation methods often struggle to model users' multifaceted preferences due to the diversity and volatility of user behavior, as well as the inherent uncertainty and ambiguity of item attributes in practical scenarios. Multi-interest recommendation addresses this challenge by extracting multiple interest representations from users' historical interactions, enabling fine-grained preference modeling and more accurate recommendations. It has drawn broad interest in recommendation research. However, current recommendation surveys have either specialized in frontier recommendation methods or delved into specific tasks and downstream applications. In this work, we systematically review the progress, solutions, challenges, and future directions of multi-interest recommendation by answering the following three questions: (1) Why is multi-interest modeling significantly important for recommendation? (2) What aspects are focused on by multi-interest modeling in recommendation? and (3) How can multi-interest modeling be applied, along with the technical details of the representative modules? We hope that this survey establishes a fundamental framework and delivers a preliminary overview for researchers interested in this field and committed to further exploration. The implementation of multi-interest recommendation summarized in this survey is maintained at https://github.com/WHUIR/Multi-Interest-Recommendation-A-Survey.",
    "citationCount": 0,
    "referenceCount": 207
}