{
    "paperId": "21608e1f215c60a2f5c043df220852efbc291d6d",
    "title": "Automated Multidimensional Data Layouts in Amazon Redshift",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Jialin Ding",
        "Matt Abrams",
        "Sanghita Bandyopadhyay",
        "Luciano Di Palma",
        "Yanzhu Ji",
        "Davide Pagano",
        "Gopal Paliwal",
        "Panos Parchas",
        "Pascal Pfeil",
        "Orestis Polychroniou",
        "Gaurav Saxena",
        "Aamer Shah",
        "Amina Voloder",
        "Sherry Xiao",
        "Davis Zhang",
        "Tim Kraska"
    ],
    "doi": "10.1145/3626246.3653379",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/21608e1f215c60a2f5c043df220852efbc291d6d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analytic data systems typically use data layouts to improve the performance of scanning and filtering data. Common data layout techniques include single-column sort keys, compound sort keys, and more complex multidimensional data layouts such as the Z-order. An appropriately-selected data layout over a table, in combination with metadata such as zone maps, enables the system to skip irrelevant data blocks when scanning the table, which reduces the amount of data scanned and improves query performance. In this paper, we introduce Multidimensional Data Layouts (MDDL), a new data layout technique which outperforms existing data layout techniques for query workloads with repetitive scan filters. Unlike existing data layout approaches, which typically sort tables based on columns, MDDL sorts tables based on a collection of predicates, which enables a much higher degree of specialization to the user's workload. We additionally introduce an algorithm for automatically learning the best MDDL for each table based on telemetry collected from the historical workload. We implemented MDDL within Amazon Redshift. Benchmarks on internal datasets and workloads show that MDDL achieves up to 85% reduction in end-to-end workload runtime compared to using traditional column-based data layout techniques. MDDL is, to the best of our knowledge, the first data layout technique in a commercial product that sorts based on predicates and automatically learns the best predicates.",
    "citationCount": 5,
    "referenceCount": 34
}