{
    "paperId": "2186fe28187963a346b6179dc05b7674e037a8ef",
    "title": "BitCluster: Fine-Grained Weight Quantization for Load-Balanced Bit-Serial Neural Network Accelerators",
    "year": 2022,
    "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "authors": [
        "Ang Li",
        "Huiyu Mo",
        "Wenping Zhu",
        "Qiang Li",
        "Shouyi Yin",
        "Shaojun Wei",
        "Leibo Liu"
    ],
    "doi": "10.1109/TCAD.2022.3146202",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2186fe28187963a346b6179dc05b7674e037a8ef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Convolutional neural network (CNN) has demonstrated great success in pattern recognition scenarios at the cost of nearly billions of parameters and consequent convolution operations. Various dedicated hardware designs are proposed to accelerate the CNN computation in more energy-efficient manners. Especially, the bit-serial accelerator (BSA) is one of the most effective approaches on resource-limited platforms by eliminating zero-bit computations. However, the irregular distribution and varying number of effectual (nonzero) bits in weights significantly cause hardware underutilization, impeding further performance improvement of state-of-the-art BSAs. To address this issue, BitCluster, a hardware-friendly quantization method, is proposed to make each weight with the identical number of effectual bits for load-balanced computation. Considering distinct sensitivities to weight precision in different neural layers, layer-level BitCluster is proposed to design further for fine-grained weight quantization. It systematically determines the layerwise quantization configurations, which significantly improve the overall performance with <1% accuracy loss. BitCluster is comprehensively evaluated on a BitCluster-compatible BSA design by taking six mainstream CNN models as benchmarks. The experimental results show that the BitCluster-based BSA achieves <inline-formula> <tex-math notation=\"LaTeX\">$1.6\\times $ </tex-math></inline-formula> higher hardware utilization and <inline-formula> <tex-math notation=\"LaTeX\">$3.4\\times $ </tex-math></inline-formula> speedup on average than state-of-the-art BSAs, with <inline-formula> <tex-math notation=\"LaTeX\">$5\\times $ </tex-math></inline-formula> better energy efficiency on average.",
    "citationCount": 12,
    "referenceCount": 36
}