{
    "paperId": "21a7ec6e70ee0d88b450d468c4f1aeb4f9bc22de",
    "title": "A Real-time APT Attack Detection Scheme Based on Fusion Provenance Graph in Private Clouds",
    "year": 2024,
    "venue": "International Conference on Networking and Network Applications",
    "authors": [
        "Han Li",
        "Chuanwei Yang",
        "Baitong Zha",
        "Lifan Liu",
        "Zhiwei Zhang",
        "Shuo Zhong"
    ],
    "doi": "10.1109/NaNA63151.2024.00087",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/21a7ec6e70ee0d88b450d468c4f1aeb4f9bc22de",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, with the advancement of cyber space attack and defense technologies, advanced persistent threats have become one of the biggest threats to modern computing environments due to their unique high stealthiness and strong persistence. The characteristics of data redundancy in private clouds lead to the construction of provenance graphs from low-dimensional system logs being excessively large, making it difficult to model the system and focus on locating malicious behavior. Therefore, we propose a real-time APT attack detection method for private clouds, which aggregates low-dimensional information using high-dimensional semantic platform information. It extracts real-time provenance graphs through fast feature extraction methods for real-time detection. Then, by converting the causal relationships in the dynamic fusion prvenance graph into fixed-length feature vectors using a hash-based feature extraction method, it utilizes a time-series recurrent neural network to extract temporal relationships. By introducing a local attention mechanism with a window parameter, we simultaneously focus on global temporal relationships and behavioral connections within the window, achieving effective detection of APT attacks. Experimental results show that compared to existing real-time APT attack detection solutions, our method improves the accuracy of APT attack detection by 5.94%.",
    "citationCount": 0,
    "referenceCount": 17
}