{
    "paperId": "21ee18ec2860c70534b05b5dc350fb87f5be94e5",
    "title": "Physiotherapy in the digital age: A narrative review of the paradigm shift driven by the integration of artificial intelligence and machine learning",
    "year": 2024,
    "venue": "Physiotherapy - The Journal of Indian Association of Physiotherapists",
    "authors": [
        "Avilash Mohapatra",
        "P. Mohanty",
        "M. Pattnaik",
        "Srikanta Padhan"
    ],
    "doi": "10.4103/pjiap.pjiap_89_24",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/21ee18ec2860c70534b05b5dc350fb87f5be94e5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n A variety of physical impairments and functional restrictions are assessed and treated in the practice of physiotherapy. Subjective measures, rater variability, and restricted access to high-quality care are some of the unavoidable problems that contemporary physical therapy practice approaches must overcome. In light of these challenges, cutting-edge technologies such as artificial intelligence (AI) and machine learning (ML) are demonstrating remarkable efficacy in tackling these issues head-on. The focus of this review is to explore how the integration of AI and ML might change physical therapy practice and education in the age of digital communication. It delves into the challenges accompanying this integration and considers future prospects in this domain. A literature search was conducted using data base PubMed, Google Scholar, Web of Science, and Scopus with keywords such as ‘physiotherapy’, ‘artificial intelligence’, and ‘machine learning’, limited to English articles from 2014 to 2024. Results were imported into reference management software, duplicates removed, and relevant articles were screened and assessed for inclusion, with reasons for exclusion documented. Emerging technologies like AI and ML use algorithms to examine patient data and make automatic decisions, enhancing areas such as virtual reality therapy (VR), tele-rehabilitation, clinical decision support, individualized rehabilitation and physical function evaluation. These advance technologies optimize physical therapy and improve outcomes, but further research is needed to address obstacles like bias and data privacy to ensure responsible implementation. AI and ML can revolutionize physical therapy by improving therapy precision, patient monitoring, optimization and individualized therapy plan. However, it’s crucial for physiotherapists to balance technological advancements with compassionate, patient-centred approach.",
    "citationCount": 2,
    "referenceCount": 58
}