{
    "paperId": "2211dff495a3a40eb206a68dcbd18424874f308f",
    "title": "Predicting Methane Concentrations in Underground Coal Mining Using a Multi-Layer Perceptron Neural Network Based on Mine Gas Monitoring Data",
    "year": 2024,
    "venue": "Sustainability",
    "authors": [
        "M. Tutak",
        "T. Krenický",
        "R. Pirník",
        "Jarosław Brodny",
        "W. Grebski"
    ],
    "doi": "10.3390/su16198388",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2211dff495a3a40eb206a68dcbd18424874f308f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/su16198388",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "During energy transition, where sustainability and environmental protection are increasingly prioritized, ensuring safety in coal exploitation remains a critical issue, especially in the context of worker safety. This research focuses on predicting methane concentrations in underground mines, which is vital for both safety and operational efficiency. The article presents a methodology developed to predict methane concentrations at specific points in mine workings using artificial neural networks. The core of this methodology is a forecasting model that allows for the selection and adjustment of the neural network to the phenomenon being studied. This model, based on measurements of ventilation parameters, including methane concentrations in a given area, enables the prediction of gas concentrations at measurement points. The results indicate that with appropriate neural network selection and based on ventilation measurements, it is possible to forecast methane concentrations at acceptable levels in selected excavation points. The effectiveness of these forecasts depends on their timing and the input data to the model. The presented example of applying this methodology in a real mine working demonstrates its high efficiency. The best results were obtained for a 5 min forecast, with slightly less accuracy for longer times (10, 15, 30, and 60 min), though all results remained at an acceptable level. Therefore, it can be concluded that the developed methodology can be successfully applied in underground mining operations to forecast dangerous methane concentrations. Its implementation should improve mining efficiency by reducing instances of exceeding permissible methane concentrations and enhance occupational safety.",
    "citationCount": 9,
    "referenceCount": 50
}