{
    "paperId": "227a30719d90978181e8e194974301b89e18c131",
    "title": "Molecular Characterization of Pseudomonas aeruginosa Clinical Isolates Through Whole-Genome Sequencing: A Comprehensive Analysis of Biotypes, Sequence Types, and Antimicrobial and Virulence Genes",
    "year": 2024,
    "venue": "Cureus",
    "authors": [
        "Vallab Ganesh Bharadwaj",
        "T. Suvvari",
        "V. Kandi",
        "Chitra Rajalakshmi P",
        "Milankumar V Dharsandia"
    ],
    "doi": "10.7759/cureus.71118",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/227a30719d90978181e8e194974301b89e18c131",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7759/cureus.71118",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Pseudomonas aeruginosa (PA) is a bacterial species commonly isolated from human clinical specimens. Despite being present in the environment as a saprophyte, PA possesses the ability to cause human infections, especially among debilitated patients. It is therefore essential to understand the genomic imprints of antimicrobial resistance (AMR) and virulence genes associated with PA isolated from patient samples. Methods The study carried out next-generation sequencing (NGS) or whole-genome sequencing (WGS) of nine PA strains isolated from various human clinical specimens from patients at Prathima Institute of Medical Sciences, Karimnagar, India. All the isolates were identified by conventional microbiological methods and confirmed by automated systems. Antimicrobial susceptibility patterns of the isolates were carried out using the Kirby-Bauer disc diffusion method. Additionally, NGS/WGS was done to evaluate the carriage of AMR and virulence genes associated with each PA strain. Sequence type was identified through multi-locus sequence typing (MLST). Results The genotype and phenotypic antimicrobial susceptibility patterns revealed the same (11.11% resistance) results with carbapenems and fluoroquinolone antibiotics. However, discordant antimicrobial susceptibility patterns were noticed with trimethoprim-sulfamethoxazole (66.66% resistance phenotype vs. 100% sensitive genotype), aminoglycosides (100% sensitive phenotype vs. 100% resistant genotype), and beta-lactamase/extended-spectrum beta-lactamase (ESBL) (44.44% sensitive phenotype vs. 100% resistant genotype) antibiotics. All (100%, 9/9) the PA isolates included in the study demonstrated the presence of multiple antibiotic resistance and virulence genes. The antibiotic resistance genes identified included aph, aad, aac, blaPDC, blaOXA, blaVIM, catB7, fosA, qnrVC1, and crpP. All (100%, 9/9) isolates demonstrated the presence of class C beta-lactamase blaPDC and class B metallo-beta-lactamase blaOXA. Only one (11.11%, 1/9) isolate showed the presence of subclass B1 metallo-beta-lactamase blaVIM. Among the virulence genes identified were toxA, fih, xcp, wzz, pvc, pvd, and many others. This study showed the presence of ST244, a high-risk PA strain with global significance. Conclusions PA is an opportunistic pathogen, and its isolation among hospitalized patients should be carefully evaluated. Tracking PA for the presence of high-risk sequence types and the prevalence of resistance and virulence genes could improve the understanding of the organism. Molecular data obtained from this study demonstrated that the PA isolates carried multiple antibiotic-resistant and virulence genes that could potentially enable them to cause invasive infections and treatment failures. The data obtained from this study could be applied to devise treatment and management strategies favorable to the hospital or healthcare institution.",
    "citationCount": 2,
    "referenceCount": 29
}