{
    "paperId": "22a8dd48248437055d12297a75cb8a53c43fbc4f",
    "title": "A novel pairwise sequence alignment algorithm for similarity search in massive datasets",
    "year": 2025,
    "venue": "Briefings in Bioinformatics",
    "authors": [
        "Yosef Masoudi-Sobhanzadeh",
        "Y. Omidi"
    ],
    "doi": "10.1093/bib/bbaf512",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/22a8dd48248437055d12297a75cb8a53c43fbc4f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Advances in sequencing technologies have resulted in the production of a huge volume of data. Since the pairwise sequence alignment plays an essential role in comparing sequencing data, various algorithms have been developed. Among the previously suggested algorithms, the basic local alignment search tool (BLAST) is currently employed in a wide range of biological applications, largely due to its low time and memory complexity. However, not only BLAST but also other improved sequence alignment algorithms may fail to produce accurate results, therefore, more efficient algorithms can be highly advantageous. In the present study, we introduce a novel algorithm for sequence alignment (NASA) consisting of preprocessing and aligning steps. In the preprocessing step, the positions of residues are determined within a provided nucleotide or peptide sequence, resulting in seeking only informative regions. In the aligning step, based on a constant number of comparisons, the sequence similarity score is calculated between two sequences in a linear time and memory orders. To evaluate NASA, a large volume of sequencing data was analyzed and the outcomes were compared with other algorithms. The results showed that NASA outperforms other basic algorithms in terms of the elapsed time, required memory, system resource utilization, and alignment score precision. Collectively, NASA might be a promising method for retrieving similar sequences from large datasets.",
    "citationCount": 0,
    "referenceCount": 49
}