{
    "paperId": "22b50b8cc70f0c15bc9e27c90a4fed52c772118f",
    "title": "Volume-Adaptive Big Data Model for Relational Databases",
    "year": 2021,
    "venue": "International Journal of Advanced Trends in Computer Science and Engineering",
    "authors": [
        "P. Obilikwu",
        "K. D. Kwaghtyo",
        "E. Udo"
    ],
    "doi": "10.30534/ijatcse/2021/1131032021",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/22b50b8cc70f0c15bc9e27c90a4fed52c772118f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.30534/ijatcse/2021/1131032021",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Big data is traditionally associated with distributed systems and this is understandable given that the volume dimension of Big Data appears to be best accommodated by the continuous addition of resources over a distributed network rather than the continuous upgrade of a central storage resource. Based on this implementation context, non- distributed relational database models are considered volume-inefficient and a departure from their usage contemplated by the database community. Distributed systems depend on data partitioning to determine chunks of related data and where in storage they can be accommodated. In existing Database Management Systems (DBMS), data partitioning is automated which in the opinion of this paper does not give the best results since partitioning is an NP-hard problem in terms of algorithmic time complexity. The NP-hardness is shown to be reduced by a partitioning strategy that relies on the discretion of the programmer which is more effective and flexible though requires extra coding effort. NP-hard problems are solved more effectively by a combination of discretion rather than full automation. In this paper, the partitioning process is reviewed and a programmer-based partitioning strategy implemented for an application with a relational DBMS backend. By doing this, the relational DBMS is made adaptive in the volume dimension of big data. The ACID properties (atomicity, consistency, isolation, and durability) of the relational database model which constitutes a major attraction especially for applications that process transactions is thus harnessed. On a more general note, the results of this research suggest that databases can be made adaptive in the areas of their weaknesses as a one-size-fits- all database management system may no longer be feasible.",
    "citationCount": 2,
    "referenceCount": 31
}