{
    "paperId": "22c896d9eda80008921a2cc6d2642dd5db4fbccc",
    "title": "Mind the Gap in Kidney Care: Translating What We Know Into What We Do",
    "year": 2024,
    "venue": "Blood Purification",
    "authors": [
        "V. Luyckx",
        "Katherine R Tuttle",
        "Dina Abdellatif",
        "Ricardo Correa-Rotter",
        "W. Fung",
        "Agnès Haris",
        "Li-Li Hsiao",
        "Makram Khalife",
        "Latha A. Kumaraswami",
        "Fiona Loud",
        "Vasundhara Raghavan",
        "S. Roumeliotis",
        "Marianella Sierra",
        "I. Ulasi",
        "Bill Wang",
        "S. Lui",
        "V. Liakopoulos",
        "Alessandro Balducci"
    ],
    "doi": "10.1159/000539071",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/22c896d9eda80008921a2cc6d2642dd5db4fbccc",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1159/000539071",
    "publicationTypes": [
        "Editorial",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Historically, it takes an average of 17 years to move new treatments from clinical evidence to daily practice. Given the highly effective treatments now available to prevent or delay kidney disease onset and progression, this is far too long. The time is now to narrow the gap between what we know and what we do. Clear guidelines exist for the prevention and management of common risk factors for kidney disease, such as hypertension and diabetes, but only a fraction of people with these conditions worldwide are diagnosed, and even fewer are treated to target. Similarly, the vast majority of people living with kidney disease are unaware of their condition, because in the early stages it is often silent. Even among patients who have been diagnosed, many do not receive appropriate treatment for kidney disease. Considering the serious consequences of kidney disease progression, kidney failure, or death, it is imperative that treatments are initiated early and appropriately. Opportunities to diagnose and treat kidney disease early must be maximized beginning at the primary care level. Many systematic barriers exist, ranging from patient to clinician to health systems to societal factors. To preserve and improve kidney health for everyone everywhere, each of these barriers must be acknowledged so that sustainable solutions are developed and implemented without further delay.",
    "citationCount": 0,
    "referenceCount": 84
}