{
    "paperId": "23079bf7c47895ef0e47cd6b4369810b818bbf65",
    "title": "veDB-HTAP: a Highly Integrated, Efficient and Adaptive HTAP System",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Jianjun Chen",
        "Li Zhang",
        "Yu Xie",
        "Weizhe Ding",
        "Lixun Cao",
        "Ye Liu",
        "Yonghua Ding",
        "Fangshi Li",
        "Ke Wu",
        "Haibo Xiu",
        "Kui Wei",
        "Le Cai",
        "Rui Chang",
        "Yuxiang Chen",
        "Yuanjin Lin",
        "Shangyu Luo",
        "Jian-Guo Qian",
        "Xu Wang",
        "Zikang Wang",
        "Jian Zhang",
        "Mingyi Zhang",
        "Shicai Zeng",
        "Jason Sun",
        "Lei Zhang",
        "Rui Shi",
        "Pengwei Zhao"
    ],
    "doi": "10.14778/3750601.3750614",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/23079bf7c47895ef0e47cd6b4369810b818bbf65",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we describe veDB-HTAP, a highly integrated, efficient, and adaptive HTAP system recently built in ByteDance. veDB-HTAP adopts a highly integrated system architecture by leveraging the Secondary Engine mechanism provided by MySQL and provides a seamless query processing experience across OLTP and OLAP engines. In addition, we introduce a cost-based and machine-learning-based smart query router that significantly outperforms the rule-based query router used in ByteHTAP, a precursor of veDB-HTAP. A key design principle of veDB-HTAP is the collaboration and adaptability of major system components, including query planning, query execution, and unified storage. Our adaptive query execution can be classified into two categories: 1) adaptive execution that dynamically collects and utilizes runtime statistics for better query performance; 2) utilizing runtime resource information to achieve a high quality of service even under heavy workloads. The experiments show that veDB-HTAP can achieve more than 3× speedup for TPC-H while consuming only one-third of the resources compared to ByteHTAP.",
    "citationCount": 1,
    "referenceCount": 78
}