{
    "paperId": "2307fca83eb35d180b33e3a73800a18ff4b47ddb",
    "title": "Traffic control centre optimisation on South African freight corridors through intelligent weigh-in-motion",
    "year": 2023,
    "venue": "South African Computer Journal",
    "authors": [
        "A. D. Coning",
        "A. Hoffman",
        "Francois Mouton"
    ],
    "doi": "10.18489/sacj.v35i1.961",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2307fca83eb35d180b33e3a73800a18ff4b47ddb",
    "isOpenAccess": true,
    "openAccessPdf": "https://sacj.cs.uct.ac.za/index.php/sacj/article/download/961/475",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High quality road infrastructure is essential to support economic growth for any region. For South Africa’s landlocked economic hub 79% of goods are transported using roads infrastructure. Protection of the road infrastructure is implemented by means of overload control monitoring at traffic control centres (TCCs) on freight corridors. Statistics collected from TCC operations indicate that 75% to 85% of statically weighed vehicles are legally loaded, with the implication that unnecessary time was wasted for these vehicles. This paper therefore proposes an algorithm, called the intelligent weigh-in-motion (IWIM) algorithm, with the purpose to decrease static weighing of vehicles by implementing data sharing between TCCs on the freight corridor, combined with intelligent interpretation of this data. The selected algorithm was chosen after testing multiple artificial intelligence (AI) models (logistic regression, random forest tree, and artificial neural network) to achieve the best performance to decrease static weighing of vehicles while not increasing the number of overloaded vehicles allowed to proceed on the corridor. The best performing model to differentiate between overloaded and legal vehicles, random forest tree, achieved an average improvement of 65,83% in terms of vehicles to be statically weighed when compared to the current rule-based system employed at TCCs.",
    "citationCount": 1,
    "referenceCount": 51
}