{
    "paperId": "23537e8d6a0ca313a6d14cd7e5c3ea62c25e1f64",
    "title": "In-network real-time flow classification using hierarchical decision trees",
    "year": 2024,
    "venue": "Conference on Network and Service Management",
    "authors": [
        "Teodor Karkashina",
        "Awais Aziz Shah",
        "Dimitrios P. Pezaros"
    ],
    "doi": "10.23919/CNSM62983.2024.10814623",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/23537e8d6a0ca313a6d14cd7e5c3ea62c25e1f64",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In-network computing has emerged as a promising approach to offload ML-related functionality from servers to network devices, leveraging the advanced capabilities of programmable network devices and expressive data plane programming languages such as P4. By implementing ML models in the data plane, we can achieve high throughput and low latency inference, reducing server loads, and enhancing response times.This work proposes a novel hierarchical deployment for Decision Tree models (HDT) within the network data plane, designed for real-time flow classification of the network traffic. The hierarchical structure breaks down a complex classification into multiple levels each one refining the classification progressively.Our results demonstrate the feasibility and efficiency of executing Hierarchical Decision Tree models in the network data plane, achieving high performance in classifying a 12-class classification scenario. The HDT performs better in the data plane by 26% compared to a flat Decision Tree implementation and 12% compared to a flat Random Forest implementation.",
    "citationCount": 1,
    "referenceCount": 22
}