{
    "paperId": "237cbb05a508caa1a36d6fa487069187707a3517",
    "title": "An Information-Theoretic Approach to Reward Rate Optimization in the Tradeoff Between Controlled and Automatic Processing in Neural Network Architectures",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "Giovanni Petri",
        "Sebastian Musslick",
        "Jonathan D. Cohen"
    ],
    "doi": "10.1101/2023.09.18.558214",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/237cbb05a508caa1a36d6fa487069187707a3517",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2023/09/18/2023.09.18.558214.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article introduces a quantitative approach to modeling the cost of control in a neural network architecture when it is required to execute one or more simultaneous tasks, and its relationship to automaticity. We begin by formalizing two forms of cost associated with a given level of performance: an intensity cost that quantifies how much information must be added to the input to achieve the desired response for a given task, that we treat as the contribution of control ; and an interaction cost that quantifies the degree to which performance is degraded as a result of interference between processes responsible for performing two or more tasks, that we treat as inversely related to automaticity. We develop a formal expression of the relationship between these two costs, and use this to derive the optimal control policy for a desired level of performance. We use that, in turn, to quantify the tradeoff between control and automaticity, and suggest how this can be used as a normative framework for understanding how people adjudicate between the benefits of control and automaticity.",
    "citationCount": 1,
    "referenceCount": 124
}