{
    "paperId": "2390e6a352f0e79e6ecd19984f819a209d420830",
    "title": "Dehradun Vision 2025: Smart City Traffic Optimization Using YOLOv11, U-Net, and Deep SORT",
    "year": 2025,
    "venue": "2025 International Conference on Networks and Cryptology (NETCRYPT)",
    "authors": [
        "Sumit Saklani",
        "Mahesh Manchanda"
    ],
    "doi": "10.1109/NETCRYPT65877.2025.11102216",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2390e6a352f0e79e6ecd19984f819a209d420830",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research presents an AI-powered traffic management system developed to solve Dehradun's urban mobility issues in alignment with Dehradun Smart City Vision 2025. It implements YOLOv11 for vehicle detection, U-Net for lane segmentation, Deep SORT for multi object tracking, and IoT-based adaptive signal control. Unlike fixed-timer systems, it adjusts signals in real-time considering traffic density, pedestrian movement, and other environmental factors. Using 3000 images from eight vehicle classes, the system outperformed YOLOv5, YOLOv7, and YOLOv8 with a 96.4% detection accuracy at 125 FPS, which also decreased waiting time by 38 %. Detection accuracy nighttime for pedestrians boosted safety in low-visibility conditions to 92.5 %. The system also reduced $\\text{CO}_{2}$ emissions by 35 % while maintaining 15 ms latency with 5 G transmission, achieving real-time decision making, reinforcing sustainability goals. The system outperformed other models in high-density traffic regions, and served as a proof of concept to show deep learning, IoT, and real-time optimization can improve urban mobility, congestion, and smart sustainable city planning.",
    "citationCount": 0,
    "referenceCount": 25
}