{
    "paperId": "23987b289637814fe83ac5b78184300d2f24baf0",
    "title": "A Combined Finite State Machine and PlantUML Approach to Machine Learning Applications",
    "year": 2023,
    "venue": "International Symposium on Applied Computational Intelligence and Informatics",
    "authors": [
        "Mircea Trifan",
        "B. Ionescu",
        "D. Ionescu"
    ],
    "doi": "10.1109/SACI58269.2023.10158543",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/23987b289637814fe83ac5b78184300d2f24baf0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite recent progress made in the theory and practice of Artificial Intelligence (AI), there is still a lack of tools and algorithms for the design and implementation of Neural Networks (NN) capable of explaining how the processes producing decisions are made. Therefore there is a need for devising new algorithms for endowing NN to address the transparency and accountancy in the use of AI, especially in areas where AI decisions have a significant impact on people’s lives. This led to the research and investigation of algorithms for explainable AI (XAI), a field which is at the very beginning of its activities. In this paper, a Finite State Machine (FSM) approach is applied to the design and implementation of a blend of Machine Learning (ML) frameworks capable to auto-build, auto-train, and auto-deploy AI models using abstract representations. It is demonstrated, in this paper, that FSMs can be generated and applied at the design of engineering and AI automation tools such that platforms such as AutoML, AutoGluon and others can be controlled at their turn. The automation of AI models is achieved by parsing the FSM states, which results in the creation of Python artifacts that can be executed. The proposed FSM controls the Automated AI Platforms (AAIP) based on the decisions made by the FSM Controller (FSMC). The FSMC is the root of the FSM graph possessing in its structure the rules driving the NNs. The parsed diagrams are nodes of the diagrammatic reasoning (DR) algorithms. These algorithms are capable of selecting the proper FSM and PlantUML diagrams from a database of such diagrams. An implementation of the combination of FSM, FSMC and RNN is described in this paper plainly illustrating the advantages of the FSM approach to AI. The PlantUML diagrams used to generate the figures in this article can be found at the following URL 1.1https://github.com/mirceat/FSM2ML-diagrams",
    "citationCount": 2,
    "referenceCount": 39
}