{
    "paperId": "23c086e58e5af067835b84f88f4b22a13e5a822e",
    "title": "A Doctor Assistance Tool: Personalized Healthcare Treatment Recommendations Journey from Deep Reinforcement Learning to Generative AI",
    "year": 2024,
    "venue": "2024 3rd Edition of IEEE Delhi Section Flagship Conference (DELCON)",
    "authors": [
        "Gautam Kumar"
    ],
    "doi": "10.1109/DELCON64804.2024.10866814",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/23c086e58e5af067835b84f88f4b22a13e5a822e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In personalized patient healthcare treatment recommendation, the goal is to recommend the most suitable course of treatment for an individual patient based on patient-specific data, including prior medical history, electronic health records (EHR), genetic information, lifestyle factors, and treatment outcomes. This study aims to extend the paradigm of personalized treatment recommendations from Deep Reinforcement Learning (DRL) to Generative Artificial Intelligence (GenAI). A DRL algorithm is employed to derive the best policy for personalized treatment recommendations. At the same time, the Med-PaLM-2 large language model (LLM) is used to generate diagnosis reports tailored to the individual patient. I propose a Personalized Treatment Healthcare Recommendation System (PTHRS), using a fine-tuned Med-PaLM-2 model on the Intensive Care Unit (ICU) dataset and the Medical Information Mart for Intensive Care (MIMIC-III) dataset. The system is designed to formulate the best treatment policies and generate clinical documentation, including discharge summaries, progress notes, customer care notes, treatments, healthcare, medication, doctor consultations, nutrition, exercise, and medical reports. These documents capture essential information and generate personalized recommendations for diagnosis and treatment plans. Experimental results prove that the model achieves an accuracy of 66%, a BLEU score of 0.66, and a clinical validation success rate of 80%, outperforming baseline DRL techniques in generating the best policies for personalized treatment recommendations.",
    "citationCount": 0,
    "referenceCount": 35
}