{
    "paperId": "240628d21414f0b152e2044c47d62edc2c94b62d",
    "title": "D-Sketch: A Differentiated Sketch Strategy for Double-Stack Networks",
    "year": 2021,
    "venue": "IEEE Communications Letters",
    "authors": [
        "Shangsen Li",
        "Lailong Luo",
        "Deke Guo",
        "Pengtao Fu"
    ],
    "doi": "10.1109/LCOMM.2020.3036673",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/240628d21414f0b152e2044c47d62edc2c94b62d",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/4234/9374133/09252109.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Representing traffic with sketch data structures to provide flow statistics is a fundamental strategy in network measurement. In the current double-stack circumstance, we observe that IPv4 and IPv6 flows are inequivalent in terms of both flow cardinality and flow size in Internet. The existing sketches, however, represent IPv4 and IPv6 flows with no differentiation. As a consequence, the IPv4 flows, which can be massive and large, while the IPv6 flows, which are usually handful and small. Such an unbalance or asymmetry feature may lead to unnecessary hash collision errors, especially for IPv6 flows. To this end, in this letter, we present D-Sketch, a new sketch optimization strategy to represent IP flows. At its core, D-Sketch differentiates IPv4 flows from IPv6 ones, thereafter represents them with isolated sketches whose capacities are proportional to the corresponding flow cardinality. Given the same space overhead, trace-driven evaluations further commit that D-Sketch decreases the ARE of per-flow measurement up to 52.5%, with an average of 24.0%, compared with the existing one-sketch and large-small strategies.",
    "citationCount": 1,
    "referenceCount": 20
}