{
    "paperId": "2440293ccc89d31f0341b6a6d66102d07f0dd7f1",
    "title": "Curriculum Analysis for Data Systems Education",
    "year": 2024,
    "venue": "Annual Conference on Innovation and Technology in Computer Science Education",
    "authors": [
        "Daphne Miedema",
        "Toni Taipalus",
        "V. Ajanovski",
        "Abdussalam Alawini",
        "Martin Goodfellow",
        "Michael Liut",
        "Svetlana Peltsverger",
        "Tiffany Young"
    ],
    "doi": "10.1145/3649405.3659529",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2440293ccc89d31f0341b6a6d66102d07f0dd7f1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The field of data systems has seen quick advances due to the popularization of data science, machine learning, and real-time analytics. In industry contexts, system features such as recommendation systems, chatbots and reverse image search require efficient infrastructure and data management solutions. Due to recent advances, it remains unclear (i) which topics are recommended to be included in data systems studies in higher education, (ii) which topics are a part of data systems courses and how they are taught, and (iii) which data-related skills are valued for roles such as software developers, data engineers, and data scientists. This working group aims to answer these points to explain the state of data systems education today and to uncover knowledge gaps and possible discrepancies between recommendations, course implementations, and industry needs. We expect the results to be applicable in tailoring various data systems courses to better cater to the needs of industry, and for teachers to share best practices.",
    "citationCount": 1,
    "referenceCount": 15
}