{
    "paperId": "244279783ab15423992e446b9da855b363a367ef",
    "title": "A Survey on Spatio-temporal Data Analytics Systems",
    "year": 2021,
    "venue": "ACM Computing Surveys",
    "authors": [
        "M. Alam",
        "Luís Torgo",
        "A. Bifet"
    ],
    "doi": "10.1145/3507904",
    "arxivId": "2103.09883",
    "url": "https://www.semanticscholar.org/paper/244279783ab15423992e446b9da855b363a367ef",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2103.09883",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the surge of spatio-temporal data volume, the popularity of location-based services and applications, and the importance of extracted knowledge from spatio-temporal data to solve a wide range of real-world problems, a plethora of research and development work has been done in the area of spatial and spatio-temporal data analytics in the past decade. The main goal of existing works was to develop algorithms and technologies to capture, store, manage, analyze, and visualize spatial or spatio-temporal data. The researchers have contributed either by adding spatio-temporal support with existing systems, by developing a new system from scratch, or by implementing algorithms for processing spatio-temporal data. The existing ecosystem of spatial and spatio-temporal data analytics systems can be categorized into three groups, (1) spatial databases (SQL and NoSQL), (2) big spatial data processing infrastructures, and (3) programming languages and GIS software. Since existing surveys mostly investigated infrastructures for processing big spatial data, this survey has explored the whole ecosystem of spatial and spatio-temporal analytics. This survey also portrays the importance and future of spatial and spatio-temporal data analytics.",
    "citationCount": 70,
    "referenceCount": 282
}