{
    "paperId": "2449f1678675d35fa9a958954546b024a6292bbe",
    "title": "Spatiotemporal NLP Modeling and Machine Learning for Predictive Rice Yield Analysis in Precision Farming",
    "year": 2025,
    "venue": "2025 2nd International Conference on Next-Generation Computing, IoT and Machine Learning (NCIM)",
    "authors": [
        "Mohammed Ahsan Hossain",
        "Palash Chandra Dash",
        "Tasnim Niger",
        "Md. Mahmodul Hassen Khan Shadin",
        "Nur Fathiha Tahiat",
        "Md Mostafizur Rahman Mausd"
    ],
    "doi": "10.1109/NCIM65934.2025.11159900",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2449f1678675d35fa9a958954546b024a6292bbe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the global population steadily increasing and food insecurity intensifying, improving rice yield through precision agriculture has become a critical challenge. This paper proposes a novel framework that combines spatiotemporal natural language processing (NLP) and advanced machine learning (ML) techniques for predictive rice yield analysis. The proposed system integrates spatial and temporal data modeling with BERT-based NLP for climate-related text analysis, enabling the extraction of semantic features alongside structured agronomic data. Using a dataset comprising 3,870 training and 1,290 test samples with over 40 environmental and management features, multiple supervised learning models—including Random Forest, XGBoost, LightGBM, LSTM, and a Hybrid Ensemble—were evaluated. The Hybrid Ensemble model achieved the highest accuracy of 97.10%, outperforming conventional ML baselines. The use of SHAP values further enhances interpretability by identifying key predictive features. Boosting-based models (CatBoost, XGBoost, LightGBM) demonstrated strong performance, while deep learning approaches contributed to temporal insight and contextual awareness. This study highlights the importance of integrating spatiotemporal NLP with ML for actionable agricultural decision-making. Future work will focus on incorporating satellite data and developing adaptive AI models to generalize across diverse agroecological zones.",
    "citationCount": 0,
    "referenceCount": 21
}