{
    "paperId": "244d426df610d94a670ade7943b6dbace6c8373d",
    "title": "PolarDB Serverless: A Cloud Native Database for Disaggregated Data Centers",
    "year": 2021,
    "venue": "SIGMOD Conference",
    "authors": [
        "Wei Cao",
        "Yingqiang Zhang",
        "Xinjun Yang",
        "Feifei Li",
        "Sheng Wang",
        "Qingda Hu",
        "Xuntao Cheng",
        "Zongzhi Chen",
        "Zhenjun Liu",
        "Jing Fang",
        "Bo Wang",
        "Yuhui Wang",
        "Haiqing Sun",
        "Zezhong Yang",
        "Zhushi Cheng",
        "Sen Chen",
        "Jian Wu",
        "Wei Hu",
        "Jianwei Zhao",
        "Yusong Gao",
        "Songlu Cai",
        "Yunyang Zhang",
        "Jiawang Tong"
    ],
    "doi": "10.1145/3448016.3457560",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/244d426df610d94a670ade7943b6dbace6c8373d",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3448016.3457560",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\\beginabstract The trend in the DBMS market is to migrate to the cloud for elasticity, high availability, and lower costs. The traditional, monolithic database architecture is difficult to meet these requirements. With the development of high-speed network and new memory technologies, disaggregated data center has become a reality: it decouples various components from monolithic servers into separated resource pools (e.g., compute, memory, and storage) and connects them through a high-speed network. The next generation cloud native databases should be designed for disaggregated data centers. In this paper, we describe the novel architecture of \\name, which follows thedisaggregation design paradigm: the CPU resource on compute nodes is decoupled from remote memory pool and storage pool. Each resource pool grows or shrinks independently, providing \\revon-demand provisoning at multiple dimensions while improving reliability. We also design our system to mitigate the inherent penalty brought by resource disaggregation, and introduce optimizations such as optimistic locking and index awared prefetching. Compared to the architecture that uses local resources, \\name achieves better dynamic resource provisioning capabilities and 5.3 times faster failure recovery speed, while achieving comparable performance. \\endabstract",
    "citationCount": 108,
    "referenceCount": 51
}