{
    "paperId": "246082e4c92887d65894be4e01568b51892537c7",
    "title": "AI and Climate Protection: Research Gaps and Needs to Align Machine Learning with Greenhouse Gas Reductions",
    "year": 2024,
    "venue": "ICT for Sustainability",
    "authors": [
        "Jan C. T. Bieser"
    ],
    "doi": "10.1109/ICT4S64576.2024.00010",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/246082e4c92887d65894be4e01568b51892537c7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) promises to revolutionize our socio-economic landscape, yet its impacts on greenhouse gas (GHG) emissions and strategies to harness ML for climate protection are not well understood. This discussion paper reviews key research on ML's GHG effects, highlighting significant research gaps and needs for a climate-oriented ML transformation. The results show that research on GHG emissions caused during model development, training, and operation is progressing. However, there is no comprehensive overview of effective measures to reduce them along the entire ML software and hardware life cycle. (Industrial) research on the GHG effects of ML applications focuses mainly on GHG reduction potentials while neglecting the possibility that ML applications also increase emissions. Thus, research in at least three key areas is needed to align ML with GHG reductions. First, robust methods to assess and report the GHG impacts of ML models and applications are required to systematically compare them and identify best practices. Second, comprehensive GHG assessments at every effect level are essential to identify measures to increase the GHG efficiency of ML models and exploit their climate protection potential. Third, analysing ML business models is crucial to propose measures that incentivize ML providers and users to reduce GHG emissions. Addressing these issues is essential for mindfully steering ML toward GHG reductions. Otherwise, there is a risk that the GHG footprint of ML will skyrocket, that ML applications will primarily accelerate GHG-intensive activities, and that an opportunity for decoupling (economic) growth and GHG emissions will be missed.",
    "citationCount": 1,
    "referenceCount": 69
}