{
    "paperId": "246bbf1e8fe0c97dd7d07b7c5c5cb98bb500bfb8",
    "title": "A Review on Human–Robot Trust in Home Service Robots",
    "year": 2025,
    "venue": "ACM Transactions on Human-Robot Interaction",
    "authors": [
        "H. Balcha",
        "Philippe Rauffet",
        "G. Wegari",
        "Cédric Buche"
    ],
    "doi": "10.1145/3737893",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/246bbf1e8fe0c97dd7d07b7c5c5cb98bb500bfb8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As home service robots become increasingly integrated into domestic environments, trust in Human–Robot Interaction (HRI) emerges as a critical factor influencing their acceptance and effectiveness. This article presents survey review aiming to provide an understanding and insights into trust in HRI, particularly in home service robots. By analyzing existing studies, we explore the definition of trust and dimensions in different disciplinary perspectives, influencing factors, and assessment methodologies of trust in HRI. We also explore the dynamic nature of trust, highlighting the roles of robot reliability, transparency, predictability, and social interaction in shaping user perceptions. Furthermore, we present existing trust measurement approaches, including self-report questionnaires, behavioral and physiological metrics, and multimodal assessments, while identifying gaps in standardization and real-time evaluation. Ethical considerations, cultural influences, and the long-term evolution of trust in home service robots are also discussed. By synthesizing insights from interdisciplinary research, this article aims to provide insights that will benefit both the academic and research communities, as well as practical applications, and to inform future studies and guide the development of trustworthy, adaptive and user-centered home service robots that seamlessly integrate into daily life.",
    "citationCount": 0,
    "referenceCount": 137
}