{
    "paperId": "24a11f5f27f8499d3b62071e0608b1e3574da83d",
    "title": "pEBR: A Probabilistic Approach to Embedding Based Retrieval",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Han Zhang",
        "Yunjing Jiang",
        "Mingming Li",
        "Haowei Yuan",
        "Wen-Yun Yang"
    ],
    "doi": "10.48550/arXiv.2410.19349",
    "arxivId": "2410.19349",
    "url": "https://www.semanticscholar.org/paper/24a11f5f27f8499d3b62071e0608b1e3574da83d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Embedding-based retrieval aims to learn a shared semantic representation space for both queries and items, enabling efficient and effective item retrieval through approximate nearest neighbor (ANN) algorithms. In current industrial practice, retrieval systems typically retrieve a fixed number of items for each query. However, this fixed-size retrieval often results in insufficient recall for head queries and low precision for tail queries. This limitation largely stems from the dominance of frequentist approaches in loss function design, which fail to address this challenge in industry. In this paper, we propose a novel \\textbf{p}robabilistic \\textbf{E}mbedding-\\textbf{B}ased \\textbf{R}etrieval (\\textbf{pEBR}) framework. Our method models the item distribution conditioned on each query, enabling the use of a dynamic cosine similarity threshold derived from the cumulative distribution function (CDF) of the probabilistic model. Experimental results demonstrate that pEBR significantly improves both retrieval precision and recall. Furthermore, ablation studies reveal that the probabilistic formulation effectively captures the inherent differences between head-to-tail queries.",
    "citationCount": 1,
    "referenceCount": 77
}