{
    "paperId": "24f7adde287ae48d93593572ba25d34d035d11ee",
    "title": "How Does Population Aging Affect New Quality Productivity in Economic Sustainability? An Empirical Study Based on Mediating Mechanisms and Moderating Effects",
    "year": 2025,
    "venue": "Sustainability",
    "authors": [
        "Xiaowen Sha",
        "Boyang Li",
        "Ziyu Zhao",
        "Xiaosong Yin",
        "Jinyao Dong",
        "Yuhang Yang",
        "Zhihao Xu"
    ],
    "doi": "10.3390/su17188249",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/24f7adde287ae48d93593572ba25d34d035d11ee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Population aging is increasingly recognized as a challenge to sustainable economic development, raising concerns about its impact on innovation and productivity. This study examines how population aging affects “new quality productivity” in China, using a balanced panel dataset of 30 provinces from 2011 to 2022. The analysis employs panel regression models with fixed effects and incorporates mediation and moderation approaches to explore underlying pathways. Land productivity is identified as a significant channel through which aging influences productivity, while the level of urbanization is examined as a moderating factor in this relationship. The results indicate that population aging significantly inhibits new quality productivity. Specifically, an aging population leads to lower land productivity, which hinders the growth of new quality productivity. However, higher urbanization is found to mitigate the adverse effect of aging on productivity. These findings are robust under various model specifications and statistical checks. In conclusion, the study underscores the necessity for proactive measures to mitigate the adverse effects of demographic aging. The findings provide policy insights, suggesting that boosting technological innovation, improving agricultural efficiency, and leveraging urbanization can help sustain high-quality development in the face of an aging population.",
    "citationCount": 0,
    "referenceCount": 63
}