{
    "paperId": "2565c0150c0ad640c2cdb3af7b6b92bdf22d4d3b",
    "title": "Development of distance formulation for high-dimensional data visualization in multidimensional scaling",
    "year": 2025,
    "venue": "Bulletin of Electrical Engineering and Informatics",
    "authors": [
        "Paska Marto Hasugian",
        "H. Mawengkang",
        "Poltak Sihombing",
        "Syahril Efendi"
    ],
    "doi": "10.11591/eei.v14i2.8738",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2565c0150c0ad640c2cdb3af7b6b92bdf22d4d3b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research aims to produce a new method called pasca-multidimensional scaling (pasca-MDS) by modifying the multidimensional scaling (MDS) method, the developed model comes as a solution to overcome the problem of data complexity by reducing its description dimension without losing important information. This model, offers an innovative approach in dealing with these problems. Pasca-MDS not only focuses on reducing the dimensionality of data, but also retains the essence of relevant information from each data point. As such, it allows for easier and more efficient analysis without compromising the accuracy of the information conveyed. The main advantage of pasca-MDS lies in its ability to produce simpler visual representations while maintaining the original structure of complex data. This provides clarity and ease in understanding the patterns or relationships hidden within. By using adjustment techniques after the MDS process, this model can provide more optimized results. This process allows the adjustment of data points to achieve a better representation in a lower dimensional space, resulting in a more intuitive and easy-to-understand interpretation. The developed distance formula has the ability to minimize stress compared to other distance formulas in MDS space, with the aim of improving the accuracy of high-dimensional data visualization.",
    "citationCount": 1,
    "referenceCount": 25
}