{
    "paperId": "2582300cf8c4f39ef96a0025c0c056928c262272",
    "title": "A Survey of Text-to-SQL in the Era of LLMs: Where Are We, and Where Are We Going?",
    "year": 2024,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Xinyu Liu",
        "Shuyu Shen",
        "Boyan Li",
        "Peixian Ma",
        "Runzhi Jiang",
        "Yu-xin Zhang",
        "Ju Fan",
        "Guoliang Li",
        "Nan Tang",
        "Yuyu Luo"
    ],
    "doi": "10.1109/TKDE.2025.3592032",
    "arxivId": "2408.05109",
    "url": "https://www.semanticscholar.org/paper/2582300cf8c4f39ef96a0025c0c056928c262272",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Translating users’ natural language queries (NL) into SQL queries (i.e., Text-to-SQL, a.k.a. NL2SQL) can significantly reduce barriers to accessing relational databases and support various commercial applications. The performance of Text-to-SQL has been greatly enhanced with the emergence of Large Language Models (LLMs). In this survey, we provide a comprehensive review of Text-to-SQL techniques powered by LLMs, covering its entire lifecycle from the following four aspects: (1) Model: Text-to-SQL translation techniques that tackle not only NL ambiguity and under-specification, but also properly map NL with database schema and instances; (2) Data: From the collection of training data, data synthesis due to training data scarcity, to Text-to-SQL benchmarks; (3) Evaluation: Evaluating Text-to-SQL methods from multiple angles using different metrics and granularities; and (4) Error Analysis: analyzing Text-to-SQL errors to find the root cause and guiding Text-to-SQL models to evolve. Moreover, we offer a rule of thumb for developing Text-to-SQL solutions. Finally, we discuss the research challenges and open problems of Text-to-SQL in the LLMs era.",
    "citationCount": 39,
    "referenceCount": 161
}