{
    "paperId": "25b8152e784f0e023cb1795fd2a0bfaff6baa36f",
    "title": "minimap2-fpga: Integrating hardware-accelerated chaining for efficient end-to-end long-read sequence mapping",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "Kisaru Liyanage",
        "Hiruna Samarakoon",
        "S. Parameswaran",
        "Hasindu Gamaarachchi"
    ],
    "doi": "10.1101/2023.05.30.542681",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/25b8152e784f0e023cb1795fd2a0bfaff6baa36f",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2023/06/02/2023.05.30.542681.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "minimap2 is the gold-standard software for reference-based sequence mapping in third-generation long-read sequencing. While minimap2 is relatively fast, further speedup is desirable, especially when processing a multitude of large datasets. In this work, we present minimap2-fpga, a hardware-accelerated version of minimap2 that speeds up the mapping process by integrating an FPGA kernel optimised for chaining. We demonstrate speed-ups in end-to-end run-time for data from both Oxford Nanopore Technologies (ONT) and Pacific Biosciences (PacBio). minimap2-fpga is up to 79% and 53% faster than minimap2 for ∼ 30× ONT and ∼ 50× PacBio datasets respectively, when mapping without base-level alignment. When mapping with base-level alignment, minimap2-fpga is up to 62% and 10% faster than minimap2 for ∼ 30× ONT and ∼ 50× PacBio datasets respectively. The accuracy is near-identical to that of original minimap2 for both ONT and PacBio data, when mapping both with and without base-level alignment. minimap2-fpga is supported on Intel FPGA-based systems (evaluations performed on an on-premise system) and Xilinx FPGA-based systems (evaluations performed on a cloud system). We also provide a well-documented library for the FPGA-accelerated chaining kernel to be used by future researchers developing sequence alignment software with limited hardware background.",
    "citationCount": 0,
    "referenceCount": 31
}