{
    "paperId": "25c221c65971402dd9b900192aebd8f35ab60a19",
    "title": "ECP-IEM: Enhancing seasonal crop productivity with deep integrated models",
    "year": 2025,
    "venue": "PLoS ONE",
    "authors": [
        "Ghulam Mustafa",
        "Muhammad Ali Moazzam",
        "Asif Nawaz",
        "Tariq Ali",
        "D. Alsekait",
        "Ahmed Saleh Alattas",
        "D. Abdelminaam"
    ],
    "doi": "10.1371/journal.pone.0316682",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/25c221c65971402dd9b900192aebd8f35ab60a19",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1371/journal.pone.0316682",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate crop yield forecasting is vital for ensuring food security and making informed decisions. With the increasing population and global warming, addressing food security has become a priority, so accurate yield forecasting is very important. Artificial Intelligence (AI) has increased the yield accuracy significantly. The existing Machine Learning (ML) methods are using statistical measures as regression, correlation and chi square test for predicting crop yield, all such model’s leads to low accuracy when the number of factors (variables) such as the weather and soil conditions, the wind, fertilizer quantity, and the seed quality and climate are increased. The proposed methodology consists of different stages, like Data Collection, Preprocessing, Feature Extraction with Support Vector Machine (SVM), correlation with Normalized Google Distance (NGD), feature ranking with rising star. This study combines Bidirectional Gated Recurrent Unit (Bi-GRU) and Time Series CNN to predict crop yield and then recommendation for further improvement. The proposed model showed very good results in all datasets and showed significant improvement compared to baseline models. The ECP-IEM achieved an accuracy 96.34%, precision 94.56% and recall 95.23% on different datasets. Moreover, the proposed model was also evaluated based on MAE, MSE, and RMSE, which produced values of 0.191, 0.0674, and 0.238, respectively. This will help in improving production of crops by giving an early look about the yield of crops which will than help the farmer in improving the crops yield.",
    "citationCount": 3,
    "referenceCount": 32
}