{
    "paperId": "25cb9bd5ec2a4765b9a2cee314cc2a88197db8d8",
    "title": "Hallucination reduction with CASAL: Contrastive Activation Steering For Amortized Learning",
    "year": 2025,
    "venue": "",
    "authors": [
        "Wannan Yang",
        "Xinchi Qiu",
        "Lei Yu",
        "Yuchen Zhang",
        "Oliver Aobo Yang",
        "Narine Kokhlikyan",
        "Nicola Cancedda",
        "Diego Garcia-Olano"
    ],
    "doi": null,
    "arxivId": "2510.02324",
    "url": "https://www.semanticscholar.org/paper/25cb9bd5ec2a4765b9a2cee314cc2a88197db8d8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language Models (LLMs) exhibit impressive capabilities but often hallucinate, confidently providing incorrect answers instead of admitting ignorance. Prior work has shown that models encode linear representations of their own knowledge and that activation steering can reduce hallucinations. These approaches, however, require real-time monitoring and intervention during inference. We introduce Contrastive Activation Steering for Amortized Learning (CASAL), an efficient algorithm that connects interpretability with amortized optimization. CASAL directly bakes the benefits of activation steering into model's weights. Once trained, LLMs answer questions they know while abstaining from answering those they do not. CASAL's light-weight design requires training only a submodule of a single transformer layer and yet reduces hallucination by 30%-40% across multiple short-form QA benchmarks. CASAL is 30x more compute-efficient and 20x more data-efficient than strong LoRA-based baselines such as SFT and DPO, boosting its practical applicability in data scarce domains. Importantly, CASAL also generalizes effectively to out-of-distribution (OOD) domains. We showcase CASAL's flexibility in mitigating hallucinations in both text-only and vision-language models. To our knowledge, CASAL is the first steering-based training method that has been shown to be effective for both dense and Mixture-of-Experts (MoE) models. CASAL represents a promising step forward for applying interpretability-inspired method for practical deployment in production systems.",
    "citationCount": 0,
    "referenceCount": 64
}