{
    "paperId": "25d12dc62ae62812085384196dfe465c9cfbd6e0",
    "title": "Persia: An Open, Hybrid System Scaling Deep Learning-based Recommenders up to 100 Trillion Parameters",
    "year": 2021,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Xiangru Lian",
        "Binhang Yuan",
        "Xuefeng Zhu",
        "Yulong Wang",
        "Yongjun He",
        "Honghuan Wu",
        "Lei Sun",
        "H. Lyu",
        "Chengjun Liu",
        "Xing Dong",
        "Yiqiao Liao",
        "Mingnan Luo",
        "Congfei Zhang",
        "Jingru Xie",
        "Haonan Li",
        "Lei Chen",
        "Renjie Huang",
        "Jianying Lin",
        "Chengchun Shu",
        "Xue-Bo Qiu",
        "Zhishan Liu",
        "Dongying Kong",
        "Lei Yuan",
        "Hai-bo Yu",
        "Sen Yang",
        "Ce Zhang",
        "Ji Liu"
    ],
    "doi": "10.1145/3534678.3539070",
    "arxivId": "2111.05897",
    "url": "https://www.semanticscholar.org/paper/25d12dc62ae62812085384196dfe465c9cfbd6e0",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2111.05897",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent years have witnessed an exponential growth of model scale in deep learning-based recommender systems---from Google's 2016 model with 1 billion parameters to the latest Facebook's model with 12 trillion parameters. Significant quality boost has come with each jump of the model capacity, which makes us believe the era of 100 trillion parameters is around the corner. However, the training of such models is challenging even within industrial scale data centers. We resolve this challenge by careful co-design of both optimization algorithm and distributed system architecture. Specifically, to ensure both the training efficiency and the training accuracy, we design a novel hybrid training algorithm, where the embedding layer and the dense neural network are handled by different synchronization mechanisms; then we build a system called Persia (short for parallel recommendation training system with hybrid acceleration) to support this hybrid training algorithm. Both theoretical demonstrations and empirical studies with up to 100 trillion parameters have been conducted to justify the system design and implementation of Persia. We make Persia publicly available (at github.com/PersiaML/Persia) so that anyone can easily train a recommender model at the scale of 100 trillion parameters.",
    "citationCount": 38,
    "referenceCount": 124
}