{
    "paperId": "25da87a80bbcc5528531d480aa7e03fb3b6bcfdb",
    "title": "IDNet: A Novel Dataset for Identity Document Analysis and Fraud Detection",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Hong Guan",
        "Yancheng Wang",
        "Lulu Xie",
        "Soham Nag",
        "Rajeev Goel",
        "N. Swamy",
        "Yingzhen Yang",
        "Chaowei Xiao",
        "Jonathan Prisby",
        "Ross Maciejewski",
        "Jia Zou"
    ],
    "doi": "10.48550/arXiv.2408.01690",
    "arxivId": "2408.01690",
    "url": "https://www.semanticscholar.org/paper/25da87a80bbcc5528531d480aa7e03fb3b6bcfdb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Effective fraud detection and analysis of government-issued identity documents, such as passports, driver's licenses, and identity cards, are essential in thwarting identity theft and bolstering security on online platforms. The training of accurate fraud detection and analysis tools depends on the availability of extensive identity document datasets. However, current publicly available benchmark datasets for identity document analysis, including MIDV-500, MIDV-2020, and FMIDV, fall short in several respects: they offer a limited number of samples, cover insufficient varieties of fraud patterns, and seldom include alterations in critical personal identifying fields like portrait images, limiting their utility in training models capable of detecting realistic frauds while preserving privacy. In response to these shortcomings, our research introduces a new benchmark dataset, IDNet, designed to advance privacy-preserving fraud detection efforts. The IDNet dataset comprises 837,060 images of synthetically generated identity documents, totaling approximately 490 gigabytes, categorized into 20 types from $10$ U.S. states and 10 European countries. We evaluate the utility and present use cases of the dataset, illustrating how it can aid in training privacy-preserving fraud detection methods, facilitating the generation of camera and video capturing of identity documents, and testing schema unification and other identity document management functionalities.",
    "citationCount": 4,
    "referenceCount": 62
}