{
    "paperId": "25fb211f01048481299bb26fa271281adb422a8c",
    "title": "EdgeEcho: An Architecture for Echocardiology at the Edge",
    "year": 2021,
    "venue": "Conference on Network and Service Management",
    "authors": [
        "Aman Khalid",
        "F. Esposito",
        "Alessio Sacco",
        "S. Smart"
    ],
    "doi": "10.23919/CNSM52442.2021.9615595",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/25fb211f01048481299bb26fa271281adb422a8c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Edge computing technologies have improved delays and privacy of several applications, including in medical imaging and eHealth. In this paper, we consider ultrasound technology and echocardiology (echo) and empower it with edge computing. Despite the many advances that ultrasound technology has seen recently, e.g., it is possible to perform echo scans using wireless ultrasound probes, the use of Artificial Intelligence (AI) techniques is becoming a necessity, for faster and more accurate echo diagnosis (not limited to heart diseases). While a few proprietary solutions exist that embed AI within echo devices, none of them uses resource-intensive tasks on handheld devices, and none of them is open-source. To this end, we propose EdgeEcho, an architecture that captures ultrasound data originated from handheld ultrasound probes and tags it using semantic segmentation performed on edge cloud. Our prototype focuses on optimizing the management of edge resources to address the specific requirements of echocardiology and the challenges of serving AI algorithms responsively. As a use case, we focus on a ventricular volume detection operation. Our performance evaluation results show that EdgeEcho can support multiple parallel medical video processing streaming sessions for continuing medical education, demonstrating a promising edge computing application with life-saving potential.",
    "citationCount": 0,
    "referenceCount": 18
}