{
    "paperId": "2619c1b64e4f7314682c2f152c50a3ad489e643a",
    "title": "SCompression: Enhancing Database Knob Tuning Efficiency Through Slice-Based OLTP Workload Compression",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Baoqing Cai",
        "Yu Liu",
        "Lin Ma",
        "Pingqi Huang",
        "Bingcheng Lian",
        "Ke Zhou",
        "Jia-Qi Yuan",
        "Jie Yang",
        "Xiaofan Cai",
        "Peijun Wu"
    ],
    "doi": "10.14778/3725688.3725712",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2619c1b64e4f7314682c2f152c50a3ad489e643a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Workload execution can account for 90% of the total database knob tuning time, which is often the bottleneck for efficient knob tuning in practice. Reducing the tuning time by using a compressed workload is a natural solution. However, many existing workload compression methods are designed for OLAP workloads, which reduce the number of queries needed for analysis tasks by sampling a small subset of queries. These methods are less effective for OLTP workloads in knob-tuning tasks, as they often disregard essential contextual details, including query sequence and concurrency. As a result, configurations that perform well on the compressed OLTP workload may not deliver similar competitive performance on the original workload. To address these challenges, we first define the objective of OLTP workload compression for knob tuning. We then propose a slice-based compression method,\n SCompression\n , which compresses workloads by slicing based on time intervals while preserving concurrency.\n SCompression\n achieves the objective by focusing on generating a compressed workload that (1) executes faster than the original workload and (2) produces performance variations similar to the source workload under different configurations.\n SCompression\n works in three steps: (1) dividing the workload into segments to capture regular performance fluctuations, (2) slicing each segment to preserve concurrency and transaction context, and (3) sampling slices under execution time constraints using a cluster-based approach to ensure representativeness. Finally,\n SCompression\n replays the compressed workload to produce the performance that mirrors the source workload. Extensive experiments on real-world and benchmark OLTP workloads show that\n SCompression\n is a cost-effective solution for knob tuning, accelerating tuning by up to 40× with only a 5% performance reduction.\n",
    "citationCount": 0,
    "referenceCount": 46
}