{
    "paperId": "26246fc955fc82fae5fffd994cad5049c2da0c3a",
    "title": "Identifying and Predicting the States of Complex Search Tasks",
    "year": 2020,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Jiqun Liu",
        "Shawon Sarkar",
        "C. Shah"
    ],
    "doi": "10.1145/3343413.3377976",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/26246fc955fc82fae5fffd994cad5049c2da0c3a",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3343413.3377976",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Complex search tasks that involve uncertain solution space and multi-round search iterations are integral to everyday life and information-intensive workplace practices, affecting how people learn, work, and resolve problematic situations. However, current search systems still face plenty of challenges when applied in supporting users engaging in complex search tasks. To address this issue, we seek to explore the dynamic nature of complex search tasks from process-oriented perspective by identifying and predicting implicit task states. Specifically, based upon the Web search logs and user annotation data (regarding information seeking intentions in local search steps, in-situ search problems, and help needed) collected from 132 search sessions in two controlled lab studies, we developed two task state frameworks based on intention state and problem-help state respectively and examined the connection between task states and search behaviors. We report that (1) complex search tasks of different types can be deconstructed and disambiguated based on the associated nonlinear state transition patterns; and (2) the identified task states that cover multiple subtle factors of user cognition can be predicted from search behavioral signals using supervised learning algorithms. This study reveals the way in which complex search tasks are unfolded and manifested in users' search interactions and paves the way for developing state-aware adaptive search supports and system evaluation frameworks.",
    "citationCount": 40,
    "referenceCount": 61
}