{
    "paperId": "2675fab607d264e0a32ee332f7c6d96870ff17a2",
    "title": "Presto's History-based Query Optimizer",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Pranjal Shankhdhar",
        "Feilong Liu",
        "Jay Narale",
        "James Sun",
        "Rebecca Schlussel",
        "Lyublena Antova"
    ],
    "doi": "10.14778/3685800.3685828",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2675fab607d264e0a32ee332f7c6d96870ff17a2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "An important feature of modern query optimizers is the ability to produce a query plan that is optimal for the underlying data set. This requires the ability to estimate cardinalities and computational costs of intermediate query plan nodes, which is highly dependent on both the query shape and the underlying data distribution. Traditional methods include collecting statistics on base tables and implementing cardinality and computational cost derivation inside the optimizer, which is error-prone for complex query shapes. This paper presents Presto's novel history-based optimization framework (HBO), which collects execution histories and uses them to optimize similar queries in the future. The framework produces accurate estimates for complex query shapes in a lightweight, automated manner, and adapts automatically to changes in underlying data distributions. We present the design and implementation of the HBO framework and provide details on its use in various optimization rules, as well as details on implementing the statistics store on top of a Redis key-value store. We also present the results of running HBO in production in two large data infrastructure organizations (Meta and Uber).",
    "citationCount": 1,
    "referenceCount": 21
}