{
    "paperId": "26b66018967d38dc3ed2f4f271da39d604122850",
    "title": "Breaking free from references: a consensus-based approach for community profiling with long amplicon nanopore data",
    "year": 2024,
    "venue": "bioRxiv",
    "authors": [
        "Willem Stock",
        "Coralie Rousseau",
        "Glen Dierickx",
        "S. D’hondt",
        "Luz Amadei Martínez",
        "S. Dittami",
        "Luna M. van der Loos",
        "O. Clerck"
    ],
    "doi": "10.1093/bib/bbae642",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/26b66018967d38dc3ed2f4f271da39d604122850",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1093/bib/bbae642",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Third-generation sequencing platforms, such as Oxford Nanopore Technology (ONT), have made it possible to characterise communities through the sequencing of long amplicons. Whilst this theoretically allows for an increased taxonomic resolution compared to short-read sequencing platforms such as Illumina, the high error rate remains problematic to accurately identify the community members present within a sample. Here we present and validate CONCOMPRA, a tool that allows the detection of closely related strains within a community by drafting and mapping to consensus sequences. We show that CONCOMPRA outperforms several other tools for profiling bacterial communities using full-length 16S rRNA gene sequencing. Since CONCOMPRA does not rely on a sequence database for profiling communities, it is applicable to systems and amplicons for which a reference framework is poorly developed. Our validation test shows that the amplification of long PCR products is likely to produce chimeric byproducts that inflate alpha diversity and skew community structure, stressing the importance of chimera detection. CONCOMPRA is available on GitHub (https://github.com/willem-stock/CONCOMPRA). Key points - We introduce a reference free tool for (long) amplicon Oxford Nanopore sequencing data - We show that it is capable of outperforming achieving a higher accuracy than preexisting tools - Chimera detection and removal is an essential step in the processing of long amplicon Oxford Nanopore sequencing data",
    "citationCount": 2,
    "referenceCount": 53
}