{
    "paperId": "26c9fcc6e4bfc110f050da098ab8fca2229d9c0e",
    "title": "A framework of genealogy knowledge reasoning and visualization based on a knowledge graph",
    "year": 2023,
    "venue": "Library hi tech",
    "authors": [
        "Ruan Wang",
        "J. Deng",
        "Xinhui Guan",
        "Yuming He"
    ],
    "doi": "10.1108/lht-05-2022-0265",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/26c9fcc6e4bfc110f050da098ab8fca2229d9c0e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeWith the development of data mining technology, diverse and broader domain knowledge can be extracted automatically. However, the research on applying knowledge mapping and data visualization techniques to genealogical data is limited. This paper aims to fill this research gap by providing a systematic framework and process guidance for practitioners seeking to uncover hidden knowledge from genealogy.Design/methodology/approachBased on a literature review of genealogy's current knowledge reasoning research, the authors constructed an integrated framework for knowledge inference and visualization application using a knowledge graph. Additionally, the authors applied this framework in a case study using “Manchu Clan Genealogy” as the data source.FindingsThe case study shows that the proposed framework can effectively decompose and reconstruct genealogy. It demonstrates the reasoning, discovery, and web visualization application process of implicit information in genealogy. It enhances the effective utilization of Manchu genealogy resources by highlighting the intricate relationships among people, places, and time entities.Originality/valueThis study proposed a framework for genealogy knowledge reasoning and visual analysis utilizing a knowledge graph, including five dimensions: the target layer, the resource layer, the data layer, the inference layer, and the application layer. It helps to gather the scattered genealogy information and establish a data network with semantic correlations while establishing reasoning rules to enable inference discovery and visualization of hidden relationships.",
    "citationCount": 7,
    "referenceCount": 59
}