{
    "paperId": "26e722eb0ea01f1674ae980fa35d33ca647da836",
    "title": "Scheduling distributed multiway spatial join queries: optimization models and algorithms",
    "year": 2023,
    "venue": "International Journal of Geographical Information Science",
    "authors": [
        "Thiago Borges de Oliveira",
        "F. Costa",
        "L. Foulds",
        "Humberto J. Longo"
    ],
    "doi": "10.1080/13658816.2023.2170380",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/26e722eb0ea01f1674ae980fa35d33ca647da836",
    "isOpenAccess": true,
    "openAccessPdf": "https://figshare.com/articles/journal_contribution/Scheduling_distributed_multiway_spatial_join_queries_optimization_models_and_algorithms/22032144/1/files/39102213.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Multiway spatial joins are a commonly occurring and fundamental type of query for spatial data processing. This article presents models and algorithms to schedule this type of query in distributed database systems while attempting to strike a balance between makespan and communication costs. We propose three algorithms based on combinatorial optimization methods: the well-known linear relaxation technique of rounding a solution generated by linear programming (LP), a more sophisticated Lagrangian Relaxation method (LR), as well as a greedy heuristic (GR) for baseline comparison. Our evaluation shows that a schedule built using GR consumes, on average, 22% more processing and communication resources than a more elaborate schedule constructed via the LR method, when scheduling a query for 64 machines. The schedule provided by LR is also, on average, an order of magnitude closer to the optimal schedule for a query compared to GR. We show that scheduling Gigabyte-size multiway queries before execution can reduce its processing time by an order of magnitude compared to state-of-the-art frameworks for spatial data processing that do not have this capability, and can significantly reduce the amount of shuffled data in the network.",
    "citationCount": 0,
    "referenceCount": 72
}