{
    "paperId": "270b015093073d3ba254928b6d736a59870d3fb1",
    "title": "Chatbots As Fluent Polyglots: Revisiting Breakthrough Code Snippets",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "David A. Noever",
        "Kevin Williams"
    ],
    "doi": "10.48550/arXiv.2301.03373",
    "arxivId": "2301.03373",
    "url": "https://www.semanticscholar.org/paper/270b015093073d3ba254928b6d736a59870d3fb1",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2301.03373",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The research applies AI-driven code assistants to analyze a selection of influential computer code that has shaped modern technology, including email, internet browsing, robotics, and malicious software. The original contribution of this study was to examine half of the most significant code advances in the last 50 years and, in some cases, to provide notable improvements in clarity or performance. The AI-driven code assistant could provide insights into obfuscated code or software lacking explanatory commentary in all cases examined. We generated additional sample problems based on bug corrections and code optimizations requiring much deeper reasoning than a traditional Google search might provide. Future work focuses on adding automated documentation and code commentary and translating select large code bases into more modern versions with multiple new application programming interfaces (APIs) and chained multi-tasks. The AI-driven code assistant offers a valuable tool for software engineering, particularly in its ability to provide human-level expertise and assist in refactoring legacy code or simplifying the explanation or functionality of high-value repositories.",
    "citationCount": 12,
    "referenceCount": 19
}