{
    "paperId": "271940d961b21e374f5f44e2311edb5983f7fed7",
    "title": "Advancing Sustainable Learning Environments: A Literature Review on Data Encoding Techniques for Student Performance Prediction using Deep Learning Models in Education",
    "year": 2024,
    "venue": "E3S Web of Conferences",
    "authors": [
        "Mariame Ouahi",
        "Samira Khoulji",
        "Mohammed Laarbi Kerkeb"
    ],
    "doi": "10.1051/e3sconf/202447700074",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/271940d961b21e374f5f44e2311edb5983f7fed7",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.e3s-conferences.org/articles/e3sconf/pdf/2024/07/e3sconf_star2024_00074.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The utilization of neural model techniques for predicting learner performance has exhibited success across various technical domains, including natural language processing. In recent times, researchers have progressively directed their attention towards employing these methods to contribute to socioeconomic sustainability, particularly in the context of forecasting student academic performance. Additionally, educational data frequently encompass numerous categorical variables, and the efficacy of prediction models becomes intricately tied to sustainable encoding techniques applied to manage and interpret this data. This approach aligns with the broader goal of fostering sustainable development in education, emphasizing responsible and equitable practices in leveraging advanced technologies for enhanced learning outcomes. Building on this insight, this paper presents a literature review that delves into the use of machine learning techniques for predicting learner outcomes in online training courses. The objective is to offer a summary of the most recent models designed for forecasting student performance, categorical coding methodologies, and the datasets employed. The research conducts experiments to assess the suggested models both against each other and in comparison to certain prediction techniques utilizing alternative machine learning algorithms concurrently. The findings suggest that employing the encoding technique for transforming categorical data enhances the effectiveness of deep learning architectures. Notably, when integrated with long short-term memory networks, this strategy yields exceptional results for the examined issue.",
    "citationCount": 3,
    "referenceCount": 58
}