{
    "paperId": "278e8f3d58259bee60767241b44938b7fbfb2156",
    "title": "A Survey on the Integration of Blockchains and Databases",
    "year": 2023,
    "venue": "Data Science and Engineering",
    "authors": [
        "Changhao Zhu",
        "Junzhe Li",
        "Ziyue Zhong",
        "Cong Yue",
        "Meihui Zhang"
    ],
    "doi": "10.1007/s41019-023-00212-z",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/278e8f3d58259bee60767241b44938b7fbfb2156",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s41019-023-00212-z.pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The success of blockchain technology in cryptocurrencies reveals its potential in the data management field. Recently, there is a trend in the database community to integrate blockchains and traditional databases to obtain security, efficiency, and privacy from the two distinctive but related systems. In this survey, we discuss the use of blockchain technology in the data management field and focus on the fusion system of blockchains and databases. We first classify existing blockchain-related data management technologies by their locations on the blockchain-database spectrum. Based on the taxonomy, we discuss three types of fusion systems and analyze their design spaces and trade-offs. Then, by further investigating the typical systems and techniques of each type of fusion system and comparing the solutions, we provide insights of each fusion model. Finally, we outline the unsolved challenges and promising directions in this field and believe that fusion systems will take a more important role in data management tasks. We hope this survey can help both academia and industry to better understand the advantages and limitations of blockchain-related data management systems and develop fusion systems that meet various requirements in practice.",
    "citationCount": 15,
    "referenceCount": 124
}