{
    "paperId": "27a645164fcf486dca99434a2734ef36e9fed531",
    "title": "Deep Reinforcement Learning for Adaptive Learning Systems",
    "year": 2020,
    "venue": "Journal of educational and behavioral statistics",
    "authors": [
        "Xiao Li",
        "Hanchen Xu",
        "Jinming Zhang",
        "Hua-Hua Chang"
    ],
    "doi": "10.3102/10769986221129847",
    "arxivId": "2004.08410",
    "url": "https://www.semanticscholar.org/paper/27a645164fcf486dca99434a2734ef36e9fed531",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2004.08410",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The adaptive learning problem concerns how to create an individualized learning plan (also referred to as a learning policy) that chooses the most appropriate learning materials based on a learner’s latent traits. In this article, we study an important yet less-addressed adaptive learning problem—one that assumes continuous latent traits. Specifically, we formulate the adaptive learning problem as a Markov decision process. We assume latent traits to be continuous with an unknown transition model and apply a model-free deep reinforcement learning algorithm—the deep Q-learning algorithm—that can effectively find the optimal learning policy from data on learners’ learning process without knowing the actual transition model of the learners’ continuous latent traits. To efficiently utilize available data, we also develop a transition model estimator that emulates the learner’s learning process using neural networks. The transition model estimator can be used in the deep Q-learning algorithm so that it can more efficiently discover the optimal learning policy for a learner. Numerical simulation studies verify that the proposed algorithm is very efficient in finding a good learning policy. Especially with the aid of a transition model estimator, it can find the optimal learning policy after training using a small number of learners.",
    "citationCount": 35,
    "referenceCount": 44
}