{
    "paperId": "27c12b8d9cfe4e88e513a53e620094e3a87a6ab2",
    "title": "Measuring the relative importance of full text sections for information retrieval from scientific literature.",
    "year": 2021,
    "venue": "Workshop on Biomedical Natural Language Processing",
    "authors": [
        "Lana Yeganova",
        "Won Kim",
        "Donald C. Comeau",
        "W. Wilbur",
        "Zhiyong Lu"
    ],
    "doi": "10.18653/v1/2021.bionlp-1.27",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/27c12b8d9cfe4e88e513a53e620094e3a87a6ab2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.18653/v1/2021.bionlp-1.27",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growing availability of full-text articles, integrating abstracts and full texts of documents into a unified representation is essential for comprehensive search of scientific literature. However, previous studies have shown that naïvely merging abstracts with full texts of articles does not consistently yield better performance. Balancing the contribution of query terms appearing in the abstract and in sections of different importance in full text articles remains a challenge both with traditional bag-of-words IR approaches and for neural retrieval methods. In this work we establish the connection between the BM25 score of a query term appearing in a section of a full text document and the probability of that document being clicked or identified as relevant. Probability is computed using Pool Adjacent Violators (PAV), an isotonic regression algorithm, providing a maximum likelihood estimate based on the observed data. Using this probabilistic transformation of BM25 scores we show an improved performance on the PubMed Click dataset developed and presented in this study, as well as the 2007 TREC Genomics collection.",
    "citationCount": 3,
    "referenceCount": 26
}