{
    "paperId": "27efd80e61c7a0af3a6b42550647e56b40b42f76",
    "title": "Integrating Machine Learning in Digital Twins by utilizing SysML System Models",
    "year": 2022,
    "venue": "International Symposium on Service Oriented Software Engineering",
    "authors": [
        "Fabian Wilking",
        "C. Sauer",
        "B. Schleich",
        "S. Wartzack"
    ],
    "doi": "10.1109/SOSE55472.2022.9812700",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/27efd80e61c7a0af3a6b42550647e56b40b42f76",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fueled by the opportunities for supporting many design and production activities and for establishing new business models, Digital Twins have become a popular topic within research and industrial application during the last years. However, many enterprises still struggle with an efficient integration of Digital Twins into their products or production. Notably, smaller enterprises are facing a tremendous amount of effort required for the modelling and operation of Digital Twins. While less feature-rich informational Digital Twins may be viable, autonomous Digital Twins using methods of Machine Learning (ML) are unattainable for these companies due to the high complexity. With Model-Based Systems Engineering (MBSE), an approach was introduced to grasp this complexity using system models e.g., SysML-diagrams. The main purpose of these diagrams is an improvement of stakeholder communication. This paper presents a novel approach to further utilize these diagrams and derive a framework for ML in the context of Digital Twins. For this purpose, system elements and data origins are directly combined with the necessary components of ML algorithms.",
    "citationCount": 10,
    "referenceCount": 29
}