{
    "paperId": "27f5d54b4507f048229ac221bdb7ec58cb73637f",
    "title": "Horae: A Graph Stream Summarization Structure for Efficient Temporal Range Query",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Ming Chen",
        "Renxiang Zhou",
        "Hanhua Chen",
        "Jiang Xiao",
        "Hai Jin",
        "Bo Li"
    ],
    "doi": "10.1109/icde53745.2022.00254",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/27f5d54b4507f048229ac221bdb7ec58cb73637f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph stream, referred to as an evolving graph with a timing sequence of updated edges through a continuous stream, is an emerging data format widely used in big data applications. Coping with a graph stream is challenging because: 1) fully storing the continuously produced and extremely large-scale datasets is difficult if not impossible; 2) supporting queries relevant to both graph topology and temporal information is nontrivial. Recently, graph stream summarization techniques have attracted much attention in providing approximate storage and query processing for a graph stream. Existing designs largely utilize hash functions to reduce the graph scale and leverage a compressive matrix to represent the graph stream. However, such designs are unable to store the time dimension information of graph streams, and thus fail to support temporal queries. In this paper, we propose Horae, a novel graph stream summarization structure for efficient temporal range query, which presents a time prefix embedded multi-layer summarization structure. Our design is based on the insight that an arbitrary temporal range of length $L$ can be decomposed to at most $2\\log L$ sub-ranges, where all the time points in each sub-range have the same binary code prefix. We further design an efficient Binary Range Decomposition (BRD) algorithm, which achieves a logarithmic scale query processing time. Experimental results show that Horae significantly reduces the latency of various temporal range queries by two to three orders of magnitude compared to the state-of-the-art designs.",
    "citationCount": 6,
    "referenceCount": 32
}