{
    "paperId": "2800caff9067b5dec7350087dd503787f6d0ff05",
    "title": "AI Enabled Chat-Driven Database Management for NLP to SQL Conversion",
    "year": 2025,
    "venue": "2025 Seventh International Conference on Computational Intelligence andCommunication Technologies (CCICT)",
    "authors": [
        "Mahagave Somnath",
        "G. Sathwika",
        "K.L. Sai Saranya",
        "Rajkumar. B. Patil",
        "Karthikeyan R"
    ],
    "doi": "10.1109/CCICT65753.2025.00108",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2800caff9067b5dec7350087dd503787f6d0ff05",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a method for automatically converting natural language queries to SQL queries and displaying the database’s response. Chat-driven database management, which has become more and more popular in recent years, is an innovative approach that enables users to interact with databases using natural language using chat interfaces. By using conversational AI, this approach optimizes database queries, updates, and handling administrative duties for those without knowledge in SQL or database management systems. By translating natural language inputs into structured database commands, chat-driven management systems improve procedures, do away with the need to create complicated queries, and provide more user-friendly data access. This can benefit various businesses, such as data analysis, customer service, and corporate intelligence, by enhancing productivity and facilitating speedy data retrieval. Additionally, the user can communicate their question to this system. The system will convert speech into text. This query will be converted into a SQL query. The query will be executed by the system, and the user will see the results.",
    "citationCount": 0,
    "referenceCount": 16
}