{
    "paperId": "28496f75fc696ae5a88aae0610674dffcb433d50",
    "title": "Histological interpretation of spitzoid tumours: an extensive machine learning‐based concordance analysis for improving decision making",
    "year": 2024,
    "venue": "Histopathology",
    "authors": [
        "Andrés Mosquera-Zamudio",
        "Laetitia Launet",
        "Adrián Colomer",
        "K. Wiedemeyer",
        "Juan C López-Takegami",
        "Luis F Palma",
        "E. Undersrud",
        "E. Janssen",
        "T. Brenn",
        "Valery Naranjo",
        "Carlos Monteagudo"
    ],
    "doi": "10.1111/his.15187",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/28496f75fc696ae5a88aae0610674dffcb433d50",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/his.15187",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The histopathological classification of melanocytic tumours with spitzoid features remains a challenging task. We confront the complexities involved in the histological classification of these tumours by proposing machine learning (ML) algorithms that objectively categorise the most relevant features in order of importance. The data set comprises 122 tumours (39 benign, 44 atypical and 39 malignant) from four different countries. BRAF and NRAS mutation status was evaluated in 51. Analysis of variance score was performed to rank 22 clinicopathological variables. The Gaussian naive Bayes algorithm achieved in distinguishing Spitz naevus from malignant spitzoid tumours with an accuracy of 0.95 and kappa score of 0.87, utilising the 12 most important variables. For benign versus non‐benign Spitz tumours, the test reached a kappa score of 0.88 using the 13 highest‐scored features. Furthermore, for the atypical Spitz tumours (AST) versus Spitz melanoma comparison, the logistic regression algorithm achieved a kappa value of 0.66 and an accuracy rate of 0.85. When the three categories were compared most AST were classified as melanoma, because of the similarities on histological features between the two groups. Our results show promise in supporting the histological classification of these tumours in clinical practice, and provide valuable insight into the use of ML to improve the accuracy and objectivity of this process while minimising interobserver variability. These proposed algorithms represent a potential solution to the lack of a clear threshold for the Spitz/spitzoid tumour classification, and its high accuracy supports its usefulness as a helpful tool to improve diagnostic decision‐making.",
    "citationCount": 4,
    "referenceCount": 25
}