{
    "paperId": "28606496d180954f2704e591138d1c8d360014c2",
    "title": "Occurrence and Characterization of Sclerotinia sclerotiorum Causing Fruit Rot on Sweet Cherry in Southern China",
    "year": 2023,
    "venue": "Plants",
    "authors": [
        "Ruoxin Ruan",
        "Kangkang Huang",
        "Huifeng Luo",
        "Chen Zhang",
        "Dujun Xi",
        "Jiabo Pei",
        "Hui Liu"
    ],
    "doi": "10.3390/plants12244165",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/28606496d180954f2704e591138d1c8d360014c2",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2223-7747/12/24/4165/pdf?version=1702612048",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sweet cherry (Prunus avium L.) is widely planted in northern China due to its high economic value, and its cultivation has gradually spread south to warm regions. However, fruit rot, observed on the young fruits, poses a considerable threat to the development of sweet cherry. To determine the causal agent, morphological observation, molecular identification, and pathogenicity tests were performed on isolates obtained from diseased fruits. As a result, Sclerotinia sclerotiorum was identified as the pathogen. Pathogenicity tests on different sweet cherry cultivars indicated that ‘Summit’ was highly sensitive to S. sclerotiorum, whereas ‘Hongmi’ showed significant resistance. Besides sweet cherry, S. sclerotiorum could also infect other vegetable crops we tested, such as cowpea, soybean, tomato, and chili. Fungicide sensitivity and efficacy assays showed that both fludioxonil and pyraclostrobin can effectively inhibit the mycelial growth of S. sclerotiorum and decrease disease incidences on the young fruits of sweet cherry. Furthermore, genome sequencing resulted in a 37.8 Mb assembly of S. sclerotiorum strain ScSs1, showing abundant SNPs, InDels, and SVs with the genome of S. sclerotiorum reference strain 1980 UF-70. The above results provide an important basis for controlling the fruit rot of sweet cherry caused by S. sclerotiorum in China.",
    "citationCount": 3,
    "referenceCount": 68
}