{
    "paperId": "288782f4cd97f73af114bdec83ca2c92acd3e4a8",
    "title": "An Inquiry into Machine Learning-based Automatic Configuration Tuning Services on Real-World Database Management Systems",
    "year": 2021,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Dana Van Aken",
        "Dongsheng Yang",
        "Sebastien Brillard",
        "Ari Fiorino",
        "Bohan Zhang",
        "Christian Billian",
        "Andrew Pavlo"
    ],
    "doi": "10.14778/3450980.3450992",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/288782f4cd97f73af114bdec83ca2c92acd3e4a8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern database management systems (DBMS) expose dozens of configurable knobs that control their runtime behavior. Setting these knobs correctly for an application's workload can improve the performance and efficiency of the DBMS. But because of their complexity, tuning a DBMS often requires considerable effort from experienced database administrators (DBAs). Recent work on automated tuning methods using machine learning (ML) have shown to achieve better performance compared with expert DBAs. These ML-based methods, however, were evaluated on synthetic workloads with limited tuning opportunities, and thus it is unknown whether they provide the same benefit in a production environment.\n To better understand ML-based tuning, we conducted a thorough evaluation of ML-based DBMS knob tuning methods on an enterprise database application. We use the OtterTune tuning service to compare three state-of-the-art ML algorithms on an Oracle installation with a real workload trace. Our results with OtterTune show that these algorithms generate knob configurations that improve performance by 45% over enterprise-grade configurations. We also identify deployment and measurement issues that were overlooked by previous research in automated DBMS tuning services.",
    "citationCount": 90,
    "referenceCount": 36
}