{
    "paperId": "28977dc718a2b68414ac7abc571fda41f6920d4f",
    "title": "An overview of remote monitoring methods in biodiversity conservation",
    "year": 2022,
    "venue": "Environmental science and pollution research international",
    "authors": [
        "Rout George Kerry",
        "Francis Jesmar Montalbo",
        "R. Das",
        "Sushmita Patra",
        "Gyana Prakash Mahapatra",
        "Ganesh Kumar Maurya",
        "Vinayak Nayak",
        "A. B. Jena",
        "K. Ukhurebor",
        "R. Jena",
        "S. Gouda",
        "Sanatan Majhi",
        "J. Rout"
    ],
    "doi": "10.1007/s11356-022-23242-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/28977dc718a2b68414ac7abc571fda41f6920d4f",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s11356-022-23242-y.pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Conservation of biodiversity is critical for the coexistence of humans and the sustenance of other living organisms within the ecosystem. Identification and prioritization of specific regions to be conserved are impossible without proper information about the sites. Advanced monitoring agencies like the Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) had accredited that the sum total of species that are now threatened with extinction is higher than ever before in the past and are progressing toward extinct at an alarming rate. Besides this, the conceptualized global responses to these crises are still inadequate and entail drastic changes. Therefore, more sophisticated monitoring and conservation techniques are required which can simultaneously cover a larger surface area within a stipulated time frame and gather a large pool of data. Hence, this study is an overview of remote monitoring methods in biodiversity conservation via a survey of evidence-based reviews and related studies, wherein the description of the application of some technology for biodiversity conservation and monitoring is highlighted. Finally, the paper also describes various transformative smart technologies like artificial intelligence (AI) and/or machine learning algorithms for enhanced working efficiency of currently available techniques that will aid remote monitoring methods in biodiversity conservation.",
    "citationCount": 31,
    "referenceCount": 292
}