{
    "paperId": "28f76175ecafaf312640ae2270b138a5f7fd3dc6",
    "title": "PE/PPE mutations in the transmission of Mycobacterium tuberculosis in China revealed by whole genome sequencing",
    "year": 2024,
    "venue": "BMC Microbiology",
    "authors": [
        "Wei-wei Fang",
        "Xiang-long Kong",
        "Jie-yu Yang",
        "Ningning Tao",
        "Ya-meng Li",
        "Ting-ting Wang",
        "Yingying Li",
        "Qi-lin Han",
        "Yu-zhen Zhang",
        "Jin-jiang Hu",
        "Huaichen Li",
        "Yao Liu"
    ],
    "doi": "10.1186/s12866-024-03352-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/28f76175ecafaf312640ae2270b138a5f7fd3dc6",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcmicrobiol.biomedcentral.com/counter/pdf/10.1186/s12866-024-03352-y",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Objective This study aims to examine the impact of PE/PPE gene mutations on the transmission of Mycobacterium tuberculosis ( M. tuberculosis ) in China. Methods We collected the whole genome sequencing (WGS) data of 3202 M. tuberculosis isolates in China from 2007 to 2018 and investigated the clustering of strains from different lineages. To evaluate the potential role of PE/PPE gene mutations in the dissemination of the pathogen, we employed homoplastic analysis to detect homoplastic single nucleotide polymorphisms (SNPs) within these gene regions. Subsequently, logistic regression analysis was conducted to analyze the statistical association. Results Based on nationwide M. tuberculosis WGS data, it has been observed that the majority of the M. tuberculosis burden in China is caused by lineage 2 strains, followed by lineage 4. Lineage 2 exhibited a higher number of transmission clusters, totaling 446 clusters, of which 77 were cross-regional clusters. Conversely, there were only 52 transmission clusters in lineage 4, of which 9 were cross-regional clusters. In the analysis of lineage 2 isolates, regression results showed that 4 specific gene mutations, PE4 (position 190,394; c.46G > A ), PE_PGRS10 (839,194; c.744 A > G ), PE16 (1,607,005; c.620T > G ) and PE_PGRS44 (2,921,883; c.333 C > A ), were significantly associated with the transmission of M. tuberculosis . Mutations of PE_PGRS10 (839,334; c.884 A > G ), PE_PGRS11 (847,613; c.1455G > C ), PE_PGRS47 (3,054,724; c.811 A > G ) and PPE66 (4,189,930; c.303G > C ) exhibited significant associations with the cross-regional clusters. A total of 13 mutation positions showed a positive correlation with clustering size, indicating a positive association. For lineage 4 strains, no mutations were found to enhance transmission, but 2 mutation sites were identified as risk factors for cross-regional clusters. These included PE_PGRS4 (338,100; c.974 A > G ) and PPE13 (976,897; c.1307 A > C ). Conclusion Our results indicate that some PE/PPE gene mutations can increase the risk of M. tuberculosis transmission, which might provide a basis for controlling the spread of tuberculosis.",
    "citationCount": 3,
    "referenceCount": 51
}