{
    "paperId": "28f8ac5fedd09594d4c28d2038bda46e44330cd4",
    "title": "DashBot: Insight-Driven Dashboard Generation Based on Deep Reinforcement Learning",
    "year": 2022,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Dazhen Deng",
        "Aoyu Wu",
        "Huamin Qu",
        "Yingcai Wu"
    ],
    "doi": "10.1109/TVCG.2022.3209468",
    "arxivId": "2208.01232",
    "url": "https://www.semanticscholar.org/paper/28f8ac5fedd09594d4c28d2038bda46e44330cd4",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2208.01232",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analytical dashboards are popular in business intelligence to facilitate insight discovery with multiple charts. However, creating an effective dashboard is highly demanding, which requires users to have adequate data analysis background and be familiar with professional tools, such as Power BI. To create a dashboard, users have to configure charts by selecting data columns and exploring different chart combinations to optimize the communication of insights, which is trial-and-error. Recent research has started to use deep learning methods for dashboard generation to lower the burden of visualization creation. However, such efforts are greatly hindered by the lack of large-scale and high-quality datasets of dashboards. In this work, we propose using deep reinforcement learning to generate analytical dashboards that can use well-established visualization knowledge and the estimation capacity of reinforcement learning. Specifically, we use visualization knowledge to construct a training environment and rewards for agents to explore and imitate human exploration behavior with a well-designed agent network. The usefulness of the deep reinforcement learning model is demonstrated through ablation studies and user studies. In conclusion, our work opens up new opportunities to develop effective ML-based visualization recommenders without beforehand training datasets.",
    "citationCount": 42,
    "referenceCount": 90
}