{
    "paperId": "29013857ff901726d6099bda9595c796a8660084",
    "title": "The Doctrine of MEAN: Realizing Deduplication Storage at Unreliable Edge",
    "year": 2023,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "Junxu Xia",
        "Geyao Cheng",
        "Lailong Luo",
        "Deke Guo",
        "Pin Lv",
        "Bowen Sun"
    ],
    "doi": "10.1109/TPDS.2023.3305460",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/29013857ff901726d6099bda9595c796a8660084",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/71/4359390/10219047.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Placing popular data at the network edge helps reduce the retrieval latency, but it also brings challenges to the limited edge storage space. Currently, using available yet not necessarily reliable edge resources is common sense for edge space expansion, while deploying deduplication storage strategies is a general method for better space utilization. However, a contradiction arises when jointly implementing data deduplication with unreliable edge resources. On the one hand, the deduplication policy stipulates that any data chunk can be stored exactly once; on the other hand, the use of unreliable resources imposes that data should be backed up for the seek of file availability. To resolve such contradiction, we propose MEAN, a deduplication-enabled storage system using unreliable resources at the network edge. The core idea of MEAN is to place similar files together for better deduplication and maintain replicas of popular files for higher reliability. We first formulate this problem and prove its NP-hardness, then provide efficient heuristics based on similarity-aware hierarchical clustering. Three different reliability scenarios are comprehensively considered to develop our algorithms. We also implement a prototype system and evaluate the performance of MEAN with a real-world dataset. The results show that MEAN can fortify the file hit ratio under unreliable environments by 77% while reducing the file retrieval delay up to 71%, compared with the state-of-the-art approach.",
    "citationCount": 5,
    "referenceCount": 51
}