{
    "paperId": "29164580e619568a1aa475be688a33d8c858a933",
    "title": "Environmental Constraints for Intelligent Internet of Deep-Sea/Underwater Things Relying on Enterprise Architecture Approach",
    "year": 2024,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "C. Aoun",
        "Noura Mansour",
        "Fadi Dornaika",
        "Loïc Lagadec"
    ],
    "doi": "10.3390/s24082433",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/29164580e619568a1aa475be688a33d8c858a933",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/24/8/2433/pdf?version=1712762820",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Through the use of Underwater Smart Sensor Networks (USSNs), Marine Observatories (MOs) provide continuous ocean monitoring. Deployed sensors may not perform as intended due to the heterogeneity of USSN devices’ hardware and software when combined with the Internet. Hence, USSNs are regarded as complex distributed systems. As such, USSN designers will encounter challenges throughout the design phase related to time, complexity, sharing diverse domain experiences (viewpoints), and ensuring optimal performance for the deployed USSNs. Accordingly, during the USSN development and deployment phases, a few Underwater Environmental Constraints (UECs) should be taken into account. These constraints may include the salinity level and the operational depth of every physical component (sensor, server, etc.) that will be utilized throughout the duration of the USSN information systems’ development and implementation. To this end, in this article we present how we integrated an Artificial Intelligence (AI) Database, an extended ArchiMO meta-model, and a design tool into our previously proposed Enterprise Architecture Framework. This addition proposes adding new Underwater Environmental Constraints (UECs) to the AI Database, which is accessed by USSN designers when they define models, with the goal of simplifying the USSN design activity. This serves as the basis for generating a new version of our ArchiMO design tool that includes the UECs. To illustrate our proposal, we use the newly generated ArchiMO to create a model in the MO domain. Furthermore, we use our self-developed domain-specific model compiler to produce the relevant simulation code. Throughout the design phase, our approach contributes to the handling and controling of the uncertainties and variances of the provided quality of service that may occur during the performance of the USSNs, as well as reducing the design activity’s complexity and time. It provides a way to share the different viewpoints of the designers in the domain of USSNs.",
    "citationCount": 3,
    "referenceCount": 53
}