{
    "paperId": "291771186c551bd6ffd1a9dd7e481b3198162bef",
    "title": "Elevating Temporal Prefetching Through Instruction Correlation",
    "year": 2025,
    "venue": "Proceedings of the 2025 58th IEEE/ACM International Symposium on Microarchitecture",
    "authors": [
        "Shuiyi He",
        "Zicong Wang",
        "Xuan Tang",
        "Hao Tang",
        "Dezun Dong",
        "Liquan Xiao"
    ],
    "doi": "10.1145/3725843.3756133",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/291771186c551bd6ffd1a9dd7e481b3198162bef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Temporal prefetchers can learn from irregular memory accesses and hide access latencies. As the on-chip storage technology for temporal prefetchers’ metadata advances, enabling the development of viable commercial prefetchers, it becomes evident that the precious on-chip storage resources highlight a significant deficiency in the existing temporal prefetchers’ utilization of metadata. This paper introduces Kairos, which actively prefetches address with repetitive characteristics by detecting critical memory access instructions and tracking the prefetch coverage of corresponding metadata. Kairos operates on two principles: Temporal prefetchers are designed based on a program’s repetitive memory access behaviors, (1) allowing for the filtering out of instructions with low access probability to eliminate interference from corresponding temporal metadata; (2) retaining metadata with high prefetch potential while discarding low-utility entries. Kairos achieves a 25.2% overall speedup compared to a baseline system with an IP-stride prefetcher, and outperforms state-of-the-art Triangel by 10.1%, while reducing storage overhead by two orders of magnitude, demonstrating substantially higher performance at significantly lower cost.",
    "citationCount": 0,
    "referenceCount": 49
}