{
    "paperId": "29397adfb0acd0438c8e8b744cdca10e99341909",
    "title": "Exploring interoperability of distributed Ledger and Decentralized Technology adoption in virtual enterprises",
    "year": 2022,
    "venue": "Information Systems and E-Business Management",
    "authors": [
        "Anthony Jnr. Bokolo"
    ],
    "doi": "10.1007/s10257-022-00561-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/29397adfb0acd0438c8e8b744cdca10e99341909",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10257-022-00561-8.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The breakthrough of Distributed Ledger Technologies (DLT) has enabled the emergence and implementation of a wide range of digital platforms in Virtual Enterprises (VE) which collaborate to provide digital services. DLT has the potential to revolutionize VE by offering transparent, decentralized, trustworthy, data provenance, reliable, and auditable features. Yet, the full deployment of DLT systems and digital platforms is still limited since some systems are operating in isolation. Hence, DLT interoperability is one of the challenges inhibiting widespread adoption of DLT platforms. DLT interoperability represents the ability for one distributed ledger platform to interact and share data with other legacy digital applications. It is inevitable to orchestrate these digital platforms fragments by introducing a cross-DLT platform integration to govern data usage within VE. Presently, already proposed approaches for DLT interoperability such as naive relay, sidechain, oracle solutions notary scheme, or relay chain are mostly not employed as they are either resource-intensive or too expensive to operate. Therefore, this paper presents a layered architecture that aids interoperability of DLT, and digital platforms based on IOTA Tangle. Design science method is adopted, and case demonstration is carried out to show how IOTA Tangle enable VE to provide an innovative virtual asset payment platform for seamless electric mobility as a service to clients. IOTA was employed as the DLT platform due to its data traceability, immutability, and tamper-proof features which allow for verification of integrity of data. IOTA offers flexibility and performance to support a reliable digital solution. Findings from this study presents a layered architecture that aids IOTA Tangle to make requests, inter-communicate, and share data via RESTful application programming interface as gateway with other external digital platforms deployed by VE to achieve an interoperable eco-system.",
    "citationCount": 29,
    "referenceCount": 68
}