{
    "paperId": "297accacdd5d4f7d0b8db80138d8a984049aede7",
    "title": "Detecting Code Smells with AI: a Prototype Study",
    "year": 2022,
    "venue": "International Convention on Information and Communication Technology, Electronics and Microelectronics",
    "authors": [
        "Joonas Virmajoki",
        "Antti Knutas",
        "Jussi Kasurinen"
    ],
    "doi": "10.23919/MIPRO55190.2022.9803727",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/297accacdd5d4f7d0b8db80138d8a984049aede7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence is one of the key advances in computing. AI has applications in improving the quality of software, supporting software development tools, and providing smartness to the systems we develop. In this paper, we study the adaptability of AI in a simple software engineering-related problem, a code smell analysis. Code smells are characteristics in the source code that indicate that there is a deeper problem, and they are a long-term nuisance for the developers. The code smells are not syntax or semantics errors, they simply are a product of too many fixes, changes and additions grinding down the code coherence. While it might be easy to refactor to get rid of code smells, first they need to be discovered. In this paper, our research group demonstrates a prototype for detecting these code smells. The prototype was implemented in Python, using machine learning, neural networks, and deep learning as a basis. Training and testing data were taken from external data storages. As a result, the prototype was able to detect two different code smells successfully, with a relatively small amount of training data. In addition, we identified issues that need to be addressed when the line of research and prototype development is pursued further.",
    "citationCount": 4,
    "referenceCount": 28
}