{
    "paperId": "29bfd21a80e2dc34e59d15851ea9107f69aeb03a",
    "title": "Chrono: Meticulous Hotness Measurement and Flexible Page Migration for Memory Tiering",
    "year": 2025,
    "venue": "European Conference on Computer Systems",
    "authors": [
        "Zhenlin Qi",
        "Shengan Zheng",
        "Ying Huang",
        "Yifeng Hui",
        "Bowen Zhang",
        "Linpeng Huang",
        "Hong Mei"
    ],
    "doi": "10.1145/3689031.3717462",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/29bfd21a80e2dc34e59d15851ea9107f69aeb03a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the memory demand continues to surge, the limitations of DRAM scalability have spurred the development of various new memory technologies in today's data centers. In order to harness the benefits of the heterogeneous memory architecture, tiering has become a widely adopted memory management paradigm. The effectiveness of a tiered memory management system primarily relies on its ability to accurately identify frequently accessed (\"hot\") pages and infrequently accessed (\"cold\") pages, and efficiently relocate them between tiers. However, existing systems rely on coarse-grained frequency measurement schemes that do not align with the performance characteristics of modern memory devices and memory-intensive applications. Additionally, these systems often incorporate rigid rules or manually configured parameters for page classification, resulting in inflexible migration strategies. This paper introduces Chrono, a novel OS-level tiering system that offers precise characterization of page access frequencies in different tiers and enables efficient migration of hot and cold pages. By leveraging timers instead of counters, Chrono achieves meticulous measurement of hot page access frequency with low overhead. This approach allows Chrono to automatically tune its page classification parameters, leading to flexible migration strategies that adapt to various workloads. Furthermore, Chrono includes a dynamic cold page identification subsystem, which balances the utilization and availability of tiered memory. We have implemented and evaluated Chrono on existing tiered memory platforms, and experimental results demonstrate that Chrono outperforms state-of-the-art tiering systems by a large margin.",
    "citationCount": 1,
    "referenceCount": 89
}