{
    "paperId": "29da4b9720e0f67982f06183ab71696a6c6a047d",
    "title": "TrajSplit: Scalable and Accurate Trip Extraction from Raw GPS Trajectories",
    "year": 2025,
    "venue": "International Conference on Mobile Data Management",
    "authors": [
        "Areeg Mostafa",
        "Mohamed F. Mokbel",
        "Ana Elena Uribe"
    ],
    "doi": "10.1109/MDM65600.2025.00039",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/29da4b9720e0f67982f06183ab71696a6c6a047d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The evolution of data-driven algorithms for trajectory analysis operations relies heavily on the availability of trajectory data. Unfortunately, most of the available trajectory datasets are not suitable for use by analysis operations. A main reason is that such trajectories are released in their raw form: A sequence of locations coming from the same device over a time period (e.g.: hours or years), whereas trajectory analysis operations need trip trajectories. Hence, existing trajectory analysis techniques preprocess the raw trajectories by applying simple rules to extract trips out of each trajectory. However, such basic rules miss too many realistic scenarios and result in low accuracy which negatively affects down-stream trajectory applications. This paper presents TrajSplit: an accurate and scalable algorithm for trip extraction from raw GPS trajectories. TrajSplit goes beyond the basic simple rules to introduce a realistic definition of a trip, which can be realized through a computationally expensive brute force approach. Therefore, TrajSplit offers two scalable heuristic approaches, that still achieve a very similar accuracy to its brute force. Experimental results, based on two real datasets, show that TrajSplit: (a) is far more accurate than the basic rules, and (b) is highly scalable when employing either of the heuristics.",
    "citationCount": 0,
    "referenceCount": 78
}