{
    "paperId": "29dd0a541ad4c2f4d2e19eb2bdc4ece5d71cb1f1",
    "title": "UNIFY: Unified Index for Range Filtered Approximate Nearest Neighbors Search",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Anqi Liang",
        "Pengcheng Zhang",
        "Bin Yao",
        "Zhongpu Chen",
        "Yitong Song",
        "Guangxu Cheng"
    ],
    "doi": "10.48550/arXiv.2412.02448",
    "arxivId": "2412.02448",
    "url": "https://www.semanticscholar.org/paper/29dd0a541ad4c2f4d2e19eb2bdc4ece5d71cb1f1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n This paper presents an efficient and scalable framework for Range Filtered Approximate Nearest Neighbors Search (RF-ANNS) over high-dimensional vectors associated with attribute values. Given a query vector\n q\n and a range [\n l, h\n ], RF-ANNS aims to find the approximate\n k\n nearest neighbors of\n q\n among data whose attribute values fall within [\n l, h\n ]. Existing methods including pre-, post-, and hybrid filtering strategies that perform attribute range filtering before, after, or during the ANNS process, all suffer from significant performance degradation when query ranges shift. Though building dedicated indexes for each strategy and selecting the best one based on the query range can address this problem, it leads to index consistency and maintenance issues.\n \n \n Our framework, called UNIFY, constructs a unified Proximity Graph-based (PG-based) index that seamlessly supports all three strategies. In UNIFY, we introduce SIG, a novel\n S\n egmented\n I\n nclusive\n G\n raph, which segments the dataset by attribute values. It ensures the PG of objects from any segment combinations is a sub-graph of SIG, thereby enabling efficient hybrid filtering by reconstructing and searching a PG from relevant segments. Moreover, we present\n H\n ierarchical\n S\n egmented\n I\n nclusive\n G\n raph (HSIG), a variant of SIG which incorporates a hierarchical structure inspired by HNSW to achieve logarithmic hybrid filtering complexity. We also implement pre- and post-filtering for HSIG by fusing skip list connections and compressed HNSW edges into the hierarchical graph. Experimental results show that UNIFY delivers state-of-the-art RF-ANNS performance across small, mid, and large query ranges.\n",
    "citationCount": 6,
    "referenceCount": 48
}