{
    "paperId": "2a12a63d6f96ab390f8a50eb16e05c6c80514946",
    "title": "Design and Performance Analysis of Electro Optic ToR(EO-ToR) for Low Latency Data Center Network",
    "year": 2023,
    "venue": "International Conference on Energy, Power and Environment",
    "authors": [
        "Souvik Roy",
        "C. Pani",
        "Sougata Bera"
    ],
    "doi": "10.1109/ICEPE57949.2023.10201600",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2a12a63d6f96ab390f8a50eb16e05c6c80514946",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Since last couple of decades, modern high-performance data center network (DCN) is liable for transporting most emerging cloud-centric application like big data, IoT, etc. to end users. To cope with the demand, futuristic DCN must be scalable, flexible, and reconfigurable with high bandwidth, low latency, less power requirement and less cabling complexity. Integration of electric packet switching and optical circuit switching is now an evolving research area in DCN architecture to get the best features of faster forwarding in packet switching and high bandwidth support in circuit switching. In DCN top of rack (ToR) switch acts as a bridge between servers and external switching circuit. To support packet switching and circuit switching parallel ToR is need to be designed in such a way, so that it can classify the packets as per the respective switching domains. In this paper we have proposed and modelled an Electro-Optic ToR (EO-ToR) that will classify the data compatible for packet switching and circuit switching domains respectively. To reduce the repetitive, look up and update of flow table of EO-ToR, M/MI1 queue with feedback is used to model the EO-ToR. The performance is measured in terms of latency and sojourn time in MATLAB platform and is compared with the traditional ToR. Observation of 18%-46% improved latency while 12%-35% decrement in sojourn time ensures the scalability and performance of integrated futuristic DCN architecture.",
    "citationCount": 1,
    "referenceCount": 21
}