{
    "paperId": "2a3f4bccc3f6d444a705ad4cb70c38779b0aa9b1",
    "title": "A multi-algorithm approach for phishing uniform resource locator’s detection",
    "year": 2025,
    "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)",
    "authors": [
        "Devi Sree Guddanti",
        "Rupa Chiramdasu",
        "Mahalakshmi Gayathri Uppuluri"
    ],
    "doi": "10.11591/ijai.v14.i1.pp358-367",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2a3f4bccc3f6d444a705ad4cb70c38779b0aa9b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nowadays, the internet is used to organise a wide range of cybersecurity risks. Threats to cybersecurity include a broad spectrum of malevolent actions and possible hazards that affect data, networks, and digital systems. Cybersecurity dangers that are commonly encountered are distributed denial-of-service (DDoS) attacks, phishing, and malware. Phishing attempts frequently use text messages, email, and uniform resource locators (URLs) to target specific people while impersonating trustworthy sourcesin an effort to trick the victim. Consequently, machine learning plays a critical role in stopping cybercrimes, especially those that involve phishing assaults. The suggested model is based on a well constructed dataset that has been enhanced with 32 features. By combining the features of several machine learning methods, such as random forest, CatBoost, AdaBoost, and multilayer perceptron, the suggested model greatly increases the precision of phishing URL detection. Evaluation indicators that highlight the model's effectiveness in defending against cyber threats include precision, recall, accuracy, and F1-score. These metrics also highlight the urgent need for proactive cybersecurity measures.",
    "citationCount": 1,
    "referenceCount": 26
}