{
    "paperId": "2a692b820f0d546c0f57cc5b28951e2baaa1d81c",
    "title": "SET: Searching Effective Supervised Learning Augmentations in Large Tabular Data Repositories",
    "year": 2024,
    "venue": "GUIDE-AI@SIGMOD",
    "authors": [
        "Jiaxiang Liu",
        "Zezhou Huang",
        "Eugene Wu"
    ],
    "doi": "10.1145/3665601.3669847",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2a692b820f0d546c0f57cc5b28951e2baaa1d81c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Successful supervised learning models rely on predictive features, which rarely come from a single dataset. As a result, relevant datasets need to be integrated before training the actual model. This raises one natural question: “how can one efficiently search for predictive features from relevant datasets for integration with responsible AI guarantees?\". This paper formalizes the question as the data augmentation search problem with an objective of minimizing the search latency. We propose SET, an interactive system that intakes a supervised learning task and searches for a set of join-compatible datasets that optimally improve the performance of the task. Specifically, SET manages a corpus of relational datasets, uses linear regression as a proxy model to evaluate augmentation candidates, and applies factorized machine learning to accelerate model training and evaluation algorithmically. Furthermore, SET leverages system and hardware optimizations to maximize parallelism across augmentation searches. These allow SET to search for a good augmentation plan over 1 million datasets with a latency of 1.4 seconds.",
    "citationCount": 1,
    "referenceCount": 15
}