{
    "paperId": "2a7c842d60fee3b9098a582e4c788ae4edd42ff9",
    "title": "ZIM: Zero-Shot Image Matting for Anything",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Beomyoung Kim",
        "Chanyong Shin",
        "Joonhyun Jeong",
        "Hyungsik Jung",
        "Se-Yun Lee",
        "Sewhan Chun",
        "Dong-Hyun Hwang",
        "Joonsang Yu"
    ],
    "doi": "10.48550/arXiv.2411.00626",
    "arxivId": "2411.00626",
    "url": "https://www.semanticscholar.org/paper/2a7c842d60fee3b9098a582e4c788ae4edd42ff9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The recent segmentation foundation model, Segment Anything Model (SAM), exhibits strong zero-shot segmentation capabilities, but it falls short in generating fine-grained precise masks. To address this limitation, we propose a novel zero-shot image matting model, called ZIM, with two key contributions: First, we develop a label converter that transforms segmentation labels into detailed matte labels, constructing the new SA1B-Matte dataset without costly manual annotations. Training SAM with this dataset enables it to generate precise matte masks while maintaining its zero-shot capability. Second, we design the zero-shot matting model equipped with a hierarchical pixel decoder to enhance mask representation, along with a prompt-aware masked attention mechanism to improve performance by enabling the model to focus on regions specified by visual prompts. We evaluate ZIM using the newly introduced MicroMat-3K test set, which contains high-quality micro-level matte labels. Experimental results show that ZIM outperforms existing methods in fine-grained mask generation and zero-shot generalization. Furthermore, we demonstrate the versatility of ZIM in various downstream tasks requiring precise masks, such as image inpainting and 3D NeRF. Our contributions provide a robust foundation for advancing zero-shot matting and its downstream applications across a wide range of computer vision tasks. The code is available at https://github.com/naver-ai/ZIM.",
    "citationCount": 6,
    "referenceCount": 89
}