{
    "paperId": "2ac46722c1be819b7d9969c880e0c0c451939ce8",
    "title": "SQLForge: Synthesizing Reliable and Diverse Data to Enhance Text-to-SQL Reasoning in LLMs",
    "year": 2025,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Yu Guo",
        "Dong Jin",
        "Shenghao Ye",
        "Shuangwu Chen",
        "Jian Yang",
        "Xiaobin Tan"
    ],
    "doi": "10.18653/v1/2025.findings-acl.443",
    "arxivId": "2505.13725",
    "url": "https://www.semanticscholar.org/paper/2ac46722c1be819b7d9969c880e0c0c451939ce8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language models (LLMs) have demonstrated significant potential in text-to-SQL reasoning tasks, yet a substantial performance gap persists between existing open-source models and their closed-source counterparts. In this paper, we introduce SQLForge, a novel approach for synthesizing reliable and diverse data to enhance text-to-SQL reasoning in LLMs. We improve data reliability through SQL syntax constraints and SQL-to-question reverse translation, ensuring data logic at both structural and semantic levels. We also propose an SQL template enrichment and iterative data domain exploration mechanism to boost data diversity. Building on the augmented data, we fine-tune a variety of open-source models with different architectures and parameter sizes, resulting in a family of models termed SQLForge-LM. SQLForge-LM achieves the state-of-the-art performance on the widely recognized Spider and BIRD benchmarks among the open-source models. Specifically, SQLForge-LM achieves EX accuracy of 85.7% on Spider Dev and 59.8% on BIRD Dev, significantly narrowing the performance gap with closed-source methods.",
    "citationCount": 1,
    "referenceCount": 30
}