{
    "paperId": "2ad13329d44c74041626a60898ccf921b0bdacd3",
    "title": "SystemDS: A Declarative Machine Learning System for the End-to-End Data Science Lifecycle",
    "year": 2019,
    "venue": "Conference on Innovative Data Systems Research",
    "authors": [
        "Matthias Boehm",
        "I. Antonov",
        "Mark Dokter",
        "Robert Ginthoer",
        "Kevin Innerebner",
        "Florijan Klezin",
        "Stefanie N. Lindstaedt",
        "Arnab Phani",
        "Benjamin Rath"
    ],
    "doi": null,
    "arxivId": "1909.02976",
    "url": "https://www.semanticscholar.org/paper/2ad13329d44c74041626a60898ccf921b0bdacd3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) applications become increasingly common in many domains. ML systems to execute these workloads include numerical computing frameworks and libraries, ML algorithm libraries, and specialized systems for deep neural networks and distributed ML. These systems focus primarily on efficient model training and scoring. However, the data science process is exploratory, and deals with underspecified objectives and a wide variety of heterogeneous data sources. Therefore, additional tools are employed for data engineering and debugging, which requires boundary crossing, unnecessary manual effort, and lacks optimization across the lifecycle. In this paper, we introduce SystemDS, an open source ML system for the end-to-end data science lifecycle from data integration, cleaning, and preparation, over local, distributed, and federated ML model training, to debugging and serving. To this end, we aim to provide a stack of declarative languages with R-like syntax for the different lifecycle tasks, and users with different expertise. We describe the overall system architecture, explain major design decisions (motivated by lessons learned from Apache SystemML), and discuss key features and research directions. Finally, we provide preliminary results that show the potential of end-to-end lifecycle optimization.",
    "citationCount": 71,
    "referenceCount": 83
}