{
    "paperId": "2ade8e71be9d51844d9ec3a21d05aa7c57149998",
    "title": "Inferring Insertion Times and Optimizing Error Penalties in Time-decaying Bloom Filters",
    "year": 2019,
    "venue": "ACM Transactions on Database Systems",
    "authors": [
        "Jonathan L. Dautrich",
        "C. Ravishankar"
    ],
    "doi": "10.1145/3284552",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2ade8e71be9d51844d9ec3a21d05aa7c57149998",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1145/3284552",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current Bloom Filters tend to ignore Bayesian priors as well as a great deal of useful information they hold, compromising the accuracy of their responses. Incorrect responses cause users to incur penalties that are both application- and item-specific, but current Bloom Filters are typically tuned only for static penalties. Such shortcomings are problematic for all Bloom Filter variants, but especially so for Time-decaying Bloom Filters, in which the memory of older items decays over time, causing both false positives and false negatives. We address these issues by introducing inferential filters, which integrate Bayesian priors and information latent in filters to make penalty-optimal, query-specific decisions. We also show how to properly infer insertion times in such filters. Our methods are general, but here we illustrate their application to inferential time-decaying filters to support novel query types and sliding window queries with dynamic error penalties. We present inferential versions of the Timing Bloom Filter and Generalized Bloom Filter. Our experiments on real and synthetic datasets show that our methods reduce penalties for incorrect responses to sliding-window queries in these filters by up to 70% when penalties are dynamic.",
    "citationCount": 2,
    "referenceCount": 40
}