{
    "paperId": "2ae422c1dfc170626143ca629a84633bf9dffe0b",
    "title": "Generative Retrieval with Preference Optimization for E-commerce Search",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Mingming Li",
        "Huimu Wang",
        "Zuxu Chen",
        "Guangtao Nie",
        "Yiming Qiu",
        "Binbin Wang",
        "Guoyu Tang",
        "Lin Liu",
        "Jingwei Zhuo"
    ],
    "doi": "10.48550/arXiv.2407.19829",
    "arxivId": "2407.19829",
    "url": "https://www.semanticscholar.org/paper/2ae422c1dfc170626143ca629a84633bf9dffe0b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval introduces a groundbreaking paradigm to document retrieval by directly generating the identifier of a pertinent document in response to a specific query. This paradigm has demonstrated considerable benefits and potential, particularly in representation and generalization capabilities, within the context of large language models. However, it faces significant challenges in E-commerce search scenarios, including the complexity of generating detailed item titles from brief queries, the presence of noise in item titles with weak language order, issues with long-tail queries, and the interpretability of results. To address these challenges, we have developed an innovative framework for E-commerce search, called generative retrieval with preference optimization. This framework is designed to effectively learn and align an autoregressive model with target data, subsequently generating the final item through constraint-based beam search. By employing multi-span identifiers to represent raw item titles and transforming the task of generating titles from queries into the task of generating multi-span identifiers from queries, we aim to simplify the generation process. The framework further aligns with human preferences using click data and employs a constrained search method to identify key spans for retrieving the final item, thereby enhancing result interpretability. Our extensive experiments show that this framework achieves competitive performance on a real-world dataset, and online A/B tests demonstrate the superiority and effectiveness in improving conversion gains.",
    "citationCount": 7,
    "referenceCount": 20
}