{
    "paperId": "2b1bbf87639b445041a73ca47b5dc575e3805dfb",
    "title": "Learning Bit Allocations for Z-Order Layouts in Analytic Data Systems",
    "year": 2024,
    "venue": "aiDM@SIGMOD",
    "authors": [
        "Jenny Gao",
        "Jialin Ding",
        "Sivaprasad Sudhir",
        "Samuel Madden"
    ],
    "doi": "10.1145/3663742.3663975",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2b1bbf87639b445041a73ca47b5dc575e3805dfb",
    "isOpenAccess": true,
    "openAccessPdf": "https://dspace.mit.edu/bitstream/1721.1/155538/1/3663742.3663975.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To improve the performance of scanning and filtering, modern analytic data systems such as Amazon Redshift and Databricks Delta Lake give users the ability to sort a table using a Z-order, which maps each row to a \"Z-value\" by interleaving the binary representations of the row's attributes, then sorts rows by their Z-values. These Z-order layouts essentially sort the table by multiple columns simultaneously and can achieve superior performance to single-column sort orders when the user's queries filter over multiple columns. However, the user shoulders the burden of manually selecting the columns to include in the Z-order, and a poor choice of columns can significantly degrade performance. Furthermore, these systems treat all columns included in the Z-order as equally important, which often does not result in the best performance due to the unequal impact that different columns have on query performance. In this work, we investigate the performance impact of using Z-orders that place unequal importance on columns: instead of using an equal number of bits from each column in the Z-value interleaving, we allow unequal bit allocation. We introduce a technique that uses Bayesian optimization to automatically learn the best bit allocation for a Z-order layout on a given dataset and query workload. Z-order layouts using our learned bit allocations outperform equal-bit Z-orders by up to 1.6× in query runtime and up to 2× in rows scanned.",
    "citationCount": 0,
    "referenceCount": 18
}