{
    "paperId": "2b9d7cdd29838aed3feddbb6ee3d4b854c4bfce9",
    "title": "From IOTA Tangle 2.0 to Rebased: A Comparative Analysis of Decentralization, Scalability, and Suitability for IoT Applications",
    "year": 2025,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Pierre Sedi Nzakuna",
        "Vincenzo Paciello",
        "A. Lay-Ekuakille",
        "Angelo Kuti Lusala",
        "Salvatore Dello Iacono",
        "A. Pietrosanto"
    ],
    "doi": "10.3390/s25113408",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2b9d7cdd29838aed3feddbb6ee3d4b854c4bfce9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet of Things (IoT) demands scalable, secure, and feeless distributed ledger technologies (DLTs) to enable seamless machine-to-machine transactions. The IOTA DLT was developed to fulfill this vision through its feeless Directed Acyclic Graph (DAG) named the Tangle, whose announced upgrade to IOTA 2.0 promised feeless microtransactions and coordinator-free (Coordicide) decentralization via a Nakamoto Consensus mechanism and a Mana anti-spam system. However, its delayed decentralization and scalability limitations hindered ecosystem growth and practical IoT adoption, leading to a new ledger architecture named IOTA Rebased. This paper critically analyzes this architectural pivot and its implications for IoT applications, contrasting the abandoned IOTA 2.0 protocol—a leaderless, feeless DAG designed for the IoT—with the adoption of a Move Virtual Machine-based, object-oriented ledger secured by a Delegated Proof-of-Stake consensus via the Mysticeti protocol in IOTA Rebased. We evaluate IOTA Rebased trade-offs: enhanced programmability and speed versus compromised IoT suitability due to fees, and explore mitigation strategies such as sponsored transactions, lightweight clients, and hierarchical tiered transaction architecture to align IOTA Rebased with IoT environments where microtransactions are prevalent. A use case analysis is provided for the integration of IOTA Rebased in IoT scenarios. This study underscores the tension between technological innovation and decentralization, offering insights for balancing scalability with the unique demands of the IoT.",
    "citationCount": 2,
    "referenceCount": 59
}