{
    "paperId": "2bb2b4a72af161b9fbb0b937634f0ce318e52dcb",
    "title": "Unveiling Glitches: A Deep Dive into Image Encoding Bugs within CLIP",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Ayush Ranjan",
        "Daniel Wen",
        "Karthik Bhat"
    ],
    "doi": "10.48550/arXiv.2407.00592",
    "arxivId": "2407.00592",
    "url": "https://www.semanticscholar.org/paper/2bb2b4a72af161b9fbb0b937634f0ce318e52dcb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Understanding the limitations and weaknesses of state-of-the-art models in artificial intelligence is crucial for their improvement and responsible application. In this research, we focus on CLIP, a model renowned for its integration of vision and language processing. Our objective is to uncover recurring problems and blind spots in CLIP's image comprehension. By delving into both the commonalities and disparities between CLIP and human image understanding, we augment our comprehension of these models' capabilities. Through our analysis, we reveal significant discrepancies in CLIP's interpretation of images compared to human perception, shedding light on areas requiring improvement. Our methodologies, the Discrepancy Analysis Framework (DAF) and the Transformative Caption Analysis for CLIP (TCAC), enable a comprehensive evaluation of CLIP's performance. We identify 14 systemic faults, including Action vs. Stillness confusion, Failure to identify the direction of movement or positioning of objects in the image, Hallucination of Water-like Features, Misattribution of Geographic Context, among others. By addressing these limitations, we lay the groundwork for the development of more accurate and nuanced image embedding models, contributing to advancements in artificial intelligence.",
    "citationCount": 1,
    "referenceCount": 12
}