{
    "paperId": "2bcfcd4a81c9701ca4d9870f0dad2a572f61c2c6",
    "title": "Integrating tabular data through image conversion for enhanced diagnosis: A novel intelligent decision support system for stratifying obstructive sleep apnoea patients using convolutional neural networks",
    "year": 2024,
    "venue": "Digital Health",
    "authors": [
        "Manuel Casal-Guisande",
        "Alberto Fernández-Villar",
        "Mar Mosteiro-Añón",
        "A. Comesaña-Campos",
        "Jorge Cerqueiro-Pequeño",
        "M. Torres-Durán"
    ],
    "doi": "10.1177/20552076241272632",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2bcfcd4a81c9701ca4d9870f0dad2a572f61c2c6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1177/20552076241272632",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Objective High-dimensional databases make it difficult to apply traditional learning algorithms to biomedical applications. Recent developments in computer technology have introduced deep learning (DL) as a potential solution to these difficulties. This study presents a novel intelligent decision support system based on a novel interpretation of data formalisation from tabular data in DL techniques. Once defined, it is used to diagnose the severity of obstructive sleep apnoea, distinguishing between moderate to severe and mild/no cases. Methods The study uses a complete database extract from electronic health records of 2472 patients, including anthropometric data, habits, medications, comorbidities, and patient-reported symptoms. The novelty of this methodology lies in the initial processing of the patients’ data, which is formalised into images. These images are then used as input to train a convolutional neural network (CNN), which acts as the inference engine of the system. Results The initial tests of the system were performed on a set of 247 samples from the Pulmonary Department of the Álvaro Cunqueiro Hospital in Vigo (Galicia, Spain), with an AUC value of ≈ 0.8. Conclusions This study demonstrates the benefits of an intelligent decision support system based on a novel data formalisation approach that allows the use of advanced DL techniques starting from tabular data. In this way, the ability of CNNs to recognise complex patterns using visual elements such as gradients and contrasts can be exploited. This approach effectively addresses the challenges of analysing large amounts of tabular data and reduces common problems such as bias and variance, resulting in improved diagnostic accuracy.",
    "citationCount": 5,
    "referenceCount": 61
}