{
    "paperId": "2be145fb1843b11ea137483bd56f9ed0955ebaeb",
    "title": "AutoMode-ASR: Learning to Select ASR Systems for Better Quality and Cost",
    "year": 2024,
    "venue": "International Conference on Speech and Computer",
    "authors": [
        "Ahmet Gunduz",
        "Yunsu Kim",
        "K. Yuksel",
        "Mohamed Al-Badrashiny",
        "Thiago Castro Ferreira",
        "H. Sawaf"
    ],
    "doi": "10.48550/arXiv.2409.12476",
    "arxivId": "2409.12476",
    "url": "https://www.semanticscholar.org/paper/2be145fb1843b11ea137483bd56f9ed0955ebaeb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present AutoMode-ASR, a novel framework that effectively integrates multiple ASR systems to enhance the overall transcription quality while optimizing cost. The idea is to train a decision model to select the optimal ASR system for each segment based solely on the audio input before running the systems. We achieve this by ensembling binary classifiers determining the preference between two systems. These classifiers are equipped with various features, such as audio embeddings, quality estimation, and signal properties. Additionally, we demonstrate how using a quality estimator can further improve performance with minimal cost increase. Experimental results show a relative reduction in WER of 16.2%, a cost saving of 65%, and a speed improvement of 75%, compared to using a single-best model for all segments. Our framework is compatible with commercial and open-source black-box ASR systems as it does not require changes in model codes.",
    "citationCount": 0,
    "referenceCount": 37
}