{
    "paperId": "2beaf981b60361510912f29a71baaacc9d44cb43",
    "title": "Evaluating the Advantage of an AI-Native IDE Cursor on Programmer Performance",
    "year": 2025,
    "venue": "International Symposium on Electronic Commerce",
    "authors": [
        "Yulia Kumar",
        "Israel Akinwunmi",
        "Dov Kruger"
    ],
    "doi": "10.1109/ISEC64801.2025.11147402",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2beaf981b60361510912f29a71baaacc9d44cb43",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The emergence of Artificial Intelligence (AI)-powered coding tools is fundamentally transforming both the software development landscape and Computer Science (CS) education by making programming accessible for all. This can be a double-edged sword. Students can use AI to avoid work and, therefore, learn less. However, leveraging AI to allow novice programmers to achieve far more and with less frustration is also possible. Large Language Models (LLMs) help accelerate progress. However, there is still a lot of effort in copying/pasting back and forth between the LLM and the Integrated Development Environment (IDE). We demonstrate in this study that AI Native IDE can dramatically accelerate the completion of tasks provided the AI has correct examples of context. AIs are still immature and unable to apply all knowledge correctly, but Cursor enables the programmer to rapidly pass error messages to the AI, allowing it to correct mistakes. The research is guided by two primary questions: (1) How effectively can Cursor assist a novice in overcoming the challenges of constructing a complex app from scratch? and (2) How does Cursor’s performance compare with other AI pair programming approaches, such as coding with ChatGPT? We demonstrate that an AI-Native IDE can accelerate performance by a large factor, assisting novice programmers and experts, getting students past the initial frustration of cognitive overload, and allowing them to succeed. This should help with retention.",
    "citationCount": 0,
    "referenceCount": 35
}