{
    "paperId": "2bf4dd6db2b19f312bba51543ed6d3a51647ec5d",
    "title": "Deep Text Retrieval Models based on DNN, CNN, RNN and Transformer: A review",
    "year": 2022,
    "venue": "International Conference on Cloud Computing and Intelligence Systems",
    "authors": [
        "Jianping Liu",
        "Xintao Chu",
        "Yingfei Wang",
        "Meng Wang"
    ],
    "doi": "10.1109/ccis57298.2022.10016379",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2bf4dd6db2b19f312bba51543ed6d3a51647ec5d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The development of deep learning technology provides a new development direction for text retrieval. Researchers have applied deep learning techniques to different information retrieval objects and carried out rich studies on them, such as web pages, scientific literature, and scientific data. This paper selects 40 research papers on related topics in the past 10 years through a step-by-step selection and conducts a review on the dimensions of model input, model structure, and its performance. Firstly, according to the differences in methods, we divided the deep learning text retrieval model into four categories: DNN-based, CNN-based, RNN-based, and Transformer-based, and analyzed the classical model structure and retrieval effect of each category. Secondly, we analyzed and compared the application scenarios of different types of models, and summarized some classic retrieval datasets. Finally, we discussed the main challenges and future research trends of deep text retrieval. This review is expected to provide basic knowledge and effective research entry points for scholars engaged in deep learning text retrieval.",
    "citationCount": 7,
    "referenceCount": 37
}