{
    "paperId": "2c046e533c0528a50a0e8f8615518115ceb0f054",
    "title": "RBDQ: A Reliable LLM-based Text-to-SQL System for Business Data Queries",
    "year": 2025,
    "venue": "The Web Conference",
    "authors": [
        "Fenglin Bi",
        "Dongdong Cao",
        "Zhiyu Wang",
        "Yang Chen",
        "Fangliang Zhao",
        "Tao Hu",
        "Zhi Li",
        "Yanbin Zhang",
        "Wei Wang"
    ],
    "doi": "10.1145/3701716.3715257",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c046e533c0528a50a0e8f8615518115ceb0f054",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Using large language models (LLMs) to convert natural language (NL) into SQL simplifies data access for users by allowing them to use everyday language. However, business departments often distrust LLM-based text-to-SQL systems due to the probabilistic nature of SQL generation, which can result in incorrect but executable SQL queries caused by model hallucinations. This leads to significant concerns regarding the accuracy and reliability of the queried data. In this paper, we present RBDQ, a novel LLM-based text-to-SQL system designed to address the unique challenges of business data queries. RBDQ innovatively introduces the Hierarchical Metrics Query Method and integrates advanced Retrieval-Augmented Generation (RAG) methods along with a self-reflection mechanism to tackle these challenges. RBDQ effectively meets the requirements of business metric queries in real-world scenarios. Currently implemented in the Quality Assurance department at ByteDance, RBDQ has significantly improved operational efficiency and query flexibility. Our experiments demonstrate the system's effectiveness, achieving an Execution Accuracy of 96.20%.",
    "citationCount": 0,
    "referenceCount": 30
}