{
    "paperId": "2c505a2cc9bd6130bd2cc2a8b57aab44e803cae5",
    "title": "A method for missing values imputation of machine learning datasets",
    "year": 2024,
    "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)",
    "authors": [
        "Y. Hanyf",
        "H. Silkan"
    ],
    "doi": "10.11591/ijai.v13.i1.pp888-898",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c505a2cc9bd6130bd2cc2a8b57aab44e803cae5",
    "isOpenAccess": true,
    "openAccessPdf": "https://ijai.iaescore.com/index.php/IJAI/article/download/23332/13891",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In machine learning applications, handling missing data is often required in the pre-processing phase of datasets to train and test models. The class center missing value imputation (CCMVI) is among the best imputation literature methods in terms of prediction accuracy and computing cost. The main drawback of this method is that it is inadequate for test datasets as long as it uses class centers to impute incomplete instances because their classes should be assumed as unknown in real-world classification situations. This work aims to extend the CCMVI method to handle missing values of test datasets. To this end, we propose three techniques: the first technique combines the CCMVI with other literature methods, the second technique imputes incomplete test instances based on their nearest class center, and the third technique uses the mean of centers of classes. The comparison of classification accuracies shows that the second and third proposed techniques ensure accuracy close to that of the combination of CCMVI with literature imputation methods, namely k-nearest neighbors (KNN) and mean methods. Moreover, they significantly decrease the time and memory space required for imputing test datasets.",
    "citationCount": 2,
    "referenceCount": 34
}