{
    "paperId": "2c62d497c7b696144c6b8c101e2a768b306a9c90",
    "title": "Random Data Distribution for Efficient Parallel Point Cloud Processing",
    "year": 2024,
    "venue": "AGILE Conf.",
    "authors": [
        "Balthasar Teuscher",
        "Martin Werner"
    ],
    "doi": "10.5194/agile-giss-5-15-2024",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c62d497c7b696144c6b8c101e2a768b306a9c90",
    "isOpenAccess": true,
    "openAccessPdf": "https://agile-giss.copernicus.org/articles/5/15/2024/agile-giss-5-15-2024.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract. Current point cloud data management systems and formats are heavily specialized and targeted solely towards visualization purposes and fail to address the diverse needs of progressive point cloud workflows like for example semantic segmentation using machine learning. We therefore propose a distributed data infrastructure for dynamic point cloud data management that can support interactive real-time visualization at scale while simultaneously serving as a platform for analytical tasks. By introducing random data distribution, we show that simple query fragmentation and efficient and effective parallelism at scale are possible. At the same time, arbitrary queries in space and time can be efficiently run over the infrastructure including query semantics which returns only a random sample of the query results or preferred points based on an importance dimension calculated, for example, from a local point density information as commonly done in point cloud visualization. To cope with the unknown amount of user-specific attributes and to support even multiple ways of deciding the importance of a given point (ground point removal, coverage of space, random subset) the system is designed to support all of them transparently as multidimensional range queries backed by spatial indices. \n",
    "citationCount": 2,
    "referenceCount": 19
}