{
    "paperId": "2c82ef446bfa44e245443058dd289fceae039eab",
    "title": "Leveraging Towards Big Data Indexing for Industry Automation",
    "year": 2024,
    "venue": "2024 International Conference on Advancements in Smart, Secure and Intelligent Computing (ASSIC)",
    "authors": [
        "Anil Kumar Meher",
        "Deepti Mishra",
        "Abhava Kumar Sahoo"
    ],
    "doi": "10.1109/ASSIC60049.2024.10507930",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c82ef446bfa44e245443058dd289fceae039eab",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Big data is a term which is nowaday's mostly used in almost all sectors like healthcare, social media, agriculture etc. Just like that one of the areas is medical health care where we always require the help of big data analytics to Predictive modelling and clinical decision support, disease or safety assessment, public health and research. Medical big data analysis is plagued by missing values, curse of dimensionality, bias control, and observation study's inability to verify causality due to residual confounding and reverse causation. We have different types of big data indexing techniques like apache lucene, apache solr, elastic search, splunk, sphinx etc. to process very huge number of datasets to increase speed, efficiency and performance. The purpose of this work is to investigate and analyze the various indexing systems in order to determine which one is superior for the processing of large amounts of data. Elasticsearch is a RESTful, distributed, and analytical engine that has the potential to tackle a wide variety of issues. It is currently being utilized by a growing number of businesses, and many of them are beginning to incorporate it into their rescue gear in the field of industrial sector.",
    "citationCount": 0,
    "referenceCount": 23
}