{
    "paperId": "2c86db5eb629014b98b57a5929e6f183fe94083a",
    "title": "Adaptation in Information Search and Decision-Making under Time Constraints",
    "year": 2021,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Anita Crescenzi",
        "Robert G. Capra",
        "Bogeum Choi",
        "Yuan Li"
    ],
    "doi": "10.1145/3406522.3446030",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c86db5eb629014b98b57a5929e6f183fe94083a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Prior work in IR has found that searchers under time constraints may adapt their search processes and perceive their task or their performance differently. In many of these prior studies, the task descriptions implicitly or explicitly conveyed an expectation of the amount of information needed to satisfy the task requirements in terms of number of pages (e.g., find N webpages on topic X) or the time to spend on the task (e.g., search until time is up) rather than allowing the participant to determine how much information was needed. In this lab-based study, we investigated the effects of time constraints on information search and decision-making. Participants completed a series of decision-making tasks with half of the participants receiving a 5-minute time constraint and half given no time guidance. They were asked to make good, specific recommendations for a friend, and they had considerable latitude in deciding how much information they needed. Results showed that participants in the time constraint condition made their decisions faster but there were few significant differences in measures of search behaviors between the time constraint conditions (RQ1). Qualitative analysis indicated that participants adapted their decision task by varying their recommendations in their specificity, justification strength, and contents in both time conditions (RQ2). Finally, we found evidence that the impact of the time constraint on time- and task-related perceptions was moderated by the extent to which participants adapted their decision task (RQ3).",
    "citationCount": 17,
    "referenceCount": 55
}