{
    "paperId": "2c8ca771c613e17f8a6a12b686deaa24d75f63af",
    "title": "Phenotypic adaptation and genomic variation of Kandelia obovata associated with its northern introduction along southeastern coast of China",
    "year": 2025,
    "venue": "Frontiers in Plant Science",
    "authors": [
        "Jiaqi Zhang",
        "Ouyang Sheng",
        "Xingxing Cai",
        "Sheng Yang",
        "Qiuxia Chen",
        "Ji Yang",
        "Zhiping Song",
        "Wenju Zhang",
        "Yuguo Wang",
        "Yan Zhu",
        "Peng Nan"
    ],
    "doi": "10.3389/fpls.2025.1512620",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2c8ca771c613e17f8a6a12b686deaa24d75f63af",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3389/fpls.2025.1512620",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Mangroves play a crucial role within coastal wetland ecosystems, with Kandelia obovata frequently utilized for introduction studies and cultivation research. Investigating the rapid adaptability of K. obovata across diverse environmental conditions offers valuable insights into how mangroves can effectively acclimate to global climate fluctuations. Methods In this study, following a common gardenexperiment, we investigated variations in morphological traits between twodistinct populations of K. obovata, Quanzhou (QZ) and Wenzhou (WZ),originating from the same introduction site Zhangzhou (ZZ). Then we performed the whole-genome resequencing on multiple populations along the southern coast of China to assess genetic divergence and diversity patterns in response to environmental factors. Results Our findings have uncovered divergent growth-defense trade-off mechanisms employed by these two populations when exposed to varying minimal temperatures in the coldest month within their respective habitats. Moreover, our observations have revealed discernible genetic divergence during the process of environmental acclimatization. Subsequent whole-genome re-sequencing have unveiled a significant decrease in genetic diversity within the northernmost population, suggesting that temperature plays a primary role in shaping genetic variability within the K. obovata species. Discussion These findings present new evidence for the rapid adaptation of K. obovata and contributes to our understanding of environmental adaptation characteristics during its introduction to northern regions, which holds significant implications for the conservation and sustainable development of mangroves.",
    "citationCount": 0,
    "referenceCount": 56
}