{
    "paperId": "2cc00406b30cdbb1330c056b4c6cd7ddd3da8c77",
    "title": "Artificial Intelligence Model Predicts Sudden Cardiac Arrest Manifesting With Pulseless Electric Activity Versus Ventricular Fibrillation",
    "year": 2024,
    "venue": "Circulation: Arrhythmia and Electrophysiology",
    "authors": [
        "L. Holmstrom",
        "B. Bednarski",
        "H. Chugh",
        "Habiba Aziz",
        "Hoang Nhat Pham",
        "A. Sargsyan",
        "A. Uy-Evanado",
        "D. Dey",
        "A. Salvucci",
        "J. Jui",
        "K. Reinier",
        "Piotr J. Slomka",
        "S. Chugh"
    ],
    "doi": "10.1161/CIRCEP.123.012338",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2cc00406b30cdbb1330c056b4c6cd7ddd3da8c77",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ahajournals.org/doi/pdf/10.1161/CIRCEP.123.012338",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "BACKGROUND: There is no specific treatment for sudden cardiac arrest (SCA) manifesting as pulseless electric activity (PEA) and survival rates are low; unlike ventricular fibrillation (VF), which is treatable by defibrillation. Development of novel treatments requires fundamental clinical studies, but access to the true initial rhythm has been a limiting factor. METHODS: Using demographics and detailed clinical variables, we trained and tested an AI model (extreme gradient boosting) to differentiate PEA-SCA versus VF-SCA in a novel setting that provided the true initial rhythm. A subgroup of SCAs are witnessed by emergency medical services personnel, and because the response time is zero, the true SCA initial rhythm is recorded. The internal cohort consisted of 421 emergency medical services-witnessed out-of-hospital SCAs with PEA or VF as the initial rhythm in the Portland, Oregon metropolitan area. External validation was performed in 220 emergency medical services-witnessed SCAs from Ventura, CA. RESULTS: In the internal cohort, the artificial intelligence model achieved an area under the receiver operating characteristic curve of 0.68 (95% CI, 0.61–0.76). Model performance was similar in the external cohort, achieving an area under the receiver operating characteristic curve of 0.72 (95% CI, 0.59–0.84). Anemia, older age, increased weight, and dyspnea as a warning symptom were the most important features of PEA-SCA; younger age, chest pain as a warning symptom and established coronary artery disease were important features associated with VF. CONCLUSIONS: The artificial intelligence model identified novel features of PEA-SCA, differentiated from VF-SCA and was successfully replicated in an external cohort. These findings enhance the mechanistic understanding of PEA-SCA with potential implications for developing novel management strategies.",
    "citationCount": 16,
    "referenceCount": 37
}