{
    "paperId": "2cc2e84cc5e82eb13a013aba1f62247948619f9c",
    "title": "The ENCODE Uniform Analysis Pipelines",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "B. Hitz",
        "Jin-Wook Lee",
        "Otto Jolanki",
        "Meenakshi S. Kagda",
        "Keenan Graham",
        "Paul Sud",
        "I. Gabdank",
        "J. Seth Strattan",
        "C. A. Sloan",
        "T. Dreszer",
        "Laurence D. Rowe",
        "Nikhil R. Podduturi",
        "V. Malladi",
        "Esther T. Chan",
        "Jean M. Davidson",
        "Marcus Ho",
        "S. Miyasato",
        "Matt Simison",
        "Forrest Tanaka",
        "Yunhai Luo",
        "Ian Whaling",
        "Eurie L. Hong",
        "Brian T. Lee",
        "R. Sandstrom",
        "Eric Rynes",
        "Jemma Nelson",
        "Andrew Nishida",
        "A. Ingersoll",
        "Michael Buckley",
        "M. Frerker",
        "Daniel S. Kim",
        "Nathan Boley",
        "Diane Trout",
        "A. Dobin",
        "Sorena Rahmanian",
        "D. Wyman",
        "Gabriela Balderrama-Gutierrez",
        "Fairlie Reese",
        "Neva C. Durand",
        "O. Dudchenko",
        "D. Weisz",
        "Suhas S. P. Rao",
        "Alyssa Blackburn",
        "Dimos Gkountaroulis",
        "Mahdi Sadr",
        "M. Olshansky",
        "Yossi Eliaz",
        "D. Nguyen",
        "Ivan D. Bochkov",
        "M. Shamim",
        "Ragini Mahajan",
        "Erez Lieberman Aiden",
        "T. Gingeras",
        "S. Heath",
        "M. Hirst",
        "W. James Kent",
        "Anshul B Kundaje",
        "A. Mortazavi",
        "B. Wold",
        "J. Cherry"
    ],
    "doi": "10.1101/2023.04.04.535623",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2cc2e84cc5e82eb13a013aba1f62247948619f9c",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10104020",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Encyclopedia of DNA elements (ENCODE) project is a collaborative effort to create a comprehensive catalog of functional elements in the human genome. The current database comprises more than 19000 functional genomics experiments across more than 1000 cell lines and tissues using a wide array of experimental techniques to study the chromatin structure, regulatory and transcriptional landscape of the Homo sapiens and Mus musculus genomes. All experimental data, metadata, and associated computational analyses created by the ENCODE consortium are submitted to the Data Coordination Center (DCC) for validation, tracking, storage, and distribution to community resources and the scientific community. The ENCODE project has engineered and distributed uniform processing pipelines in order to promote data provenance and reproducibility as well as allow interoperability between genomic resources and other consortia. All data files, reference genome versions, software versions, and parameters used by the pipelines are captured and available via the ENCODE Portal. The pipeline code, developed using Docker and Workflow Description Language (WDL; https://openwdl.org/) is publicly available in GitHub, with images available on Dockerhub (https://hub.docker.com), enabling access to a diverse range of biomedical researchers. ENCODE pipelines maintained and used by the DCC can be installed to run on personal computers, local HPC clusters, or in cloud computing environments via Cromwell. Access to the pipelines and data via the cloud allows small labs the ability to use the data or software without access to institutional compute clusters. Standardization of the computational methodologies for analysis and quality control leads to comparable results from different ENCODE collections - a prerequisite for successful integrative analyses. Database URL: https://www.encodeproject.org/",
    "citationCount": 74,
    "referenceCount": 50
}