{
    "paperId": "2ce145b1b500eaa51c9a1bec524ab1d36a25bb9f",
    "title": "Ship Anomalous Behavior Detection in Port Waterways Based on Text Similarity and Kernel Density Estimation",
    "year": 2024,
    "venue": "Journal of Marine Science and Engineering",
    "authors": [
        "Gaocai Li",
        "Xinyu Zhang",
        "Yaqing Shu",
        "Chengbo Wang",
        "Wenqiang Guo",
        "Jiawei Wang"
    ],
    "doi": "10.3390/jmse12060968",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2ce145b1b500eaa51c9a1bec524ab1d36a25bb9f",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2077-1312/12/6/968/pdf?version=1717839550",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The navigational safety of ships on waterways plays a crucial role in ensuring the operational efficiency of ports. Ship anomalous behavior detection is an important method of water traffic surveillance that can effectively identify abnormal ship behavior, such as sudden acceleration or deceleration. In order to detect potential anomalous ship behavior in real time, a method for ship anomalous behavior detection in waterways is proposed based on text similarity and kernel density estimation. Under the assumption of known traffic patterns entering and leaving the port, this method can identify ship behaviors that violate traffic patterns in real time. Firstly, kernel density estimation is applied to construct a traffic pattern density model for ship trajectories entering and leaving the port, used to estimate the density values of ship motion states. Simultaneously, a semantic transformation method is used to convert traffic pattern trajectory into pattern trajectory text, which is used to identify the ship’s traffic pattern. Subsequently, the historical trajectory data of the target ship are transformed into textual trajectories, and text similarity is used to identify ship inbound and outbound traffic patterns. Furthermore, the constructed traffic pattern density model is used to estimate real-time density values of the state of ship motion, and the trajectory points that exceed the threshold of the anomaly factor are marked as anomalies. Finally, the effectiveness of the proposed method is validated using simulation data, and the results indicate an accuracy of more than 90% for the comprehensive detection of anomalous behavior. This study, approaching the detection of potential ship anomalous behavior from the perspective of port traffic patterns, enriches the methods of ship anomalous behavior detection in port waterways.",
    "citationCount": 2,
    "referenceCount": 35
}