{
    "paperId": "2cecb08d34f23f102cf562e4e4365fe3c337c110",
    "title": "Using Signals of Opportunity to Establish Trust in Distributed Spectrum Monitoring Systems",
    "year": 2024,
    "venue": "International Symposium on Dynamic Spectrum Access Networks",
    "authors": [
        "Ali Abedi",
        "Joshua Sanz",
        "Anant Sahai"
    ],
    "doi": "10.1109/DySPAN60163.2024.10632745",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2cecb08d34f23f102cf562e4e4365fe3c337c110",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present an automated approach for generating or verifying metadata associated with an RF sensor, such as the sensor location, using signals of opportunity (SoOp) in the environment. As an illustration of the approach, we demonstrate how existing signals from low-earth-orbit satellites can be employed to verify the location of a radio sensor. One application that can significantly benefit from SoOp-derived metadata labeling is distributed spectrum sensing, given that the sensors already cover a wide frequency range. Distributed spectrum monitoring is crucial for comprehensive coverage of large geographical areas over an extended period, and crowdsourcing emerges as a promising solution for establishing large distributed sensor networks. However, a persistent challenge in realizing these systems is the lack of trust in the data provided by each spectrum sensor. The compromise of a radio sensor due to incorrect metadata, such as its location, poses a significant challenge. Our proposed methods offer a solution to mitigate this problem.",
    "citationCount": 0,
    "referenceCount": 36
}