{
    "paperId": "2cef604804908876e445d4c33dc925fd57d3b37d",
    "title": "Real-time prediction method of bridge technical status in complex environment based on dynamic Bayesian network",
    "year": 2025,
    "venue": "International Journal of Intelligent Decision Technologies",
    "authors": [
        "Enmao Quan",
        "Guangjun Li"
    ],
    "doi": "10.1177/18724981251334507",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2cef604804908876e445d4c33dc925fd57d3b37d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper aims to solve the problem of dynamic changes in bridges in complex environments. Based on the DBN modeling method, real-time classification prediction of bridge technical status is realized to timely discover potential risks. The Dynamic Bayesian Network (DBN) model is introduced, and a bridge technical status prediction method based on real-time data is proposed. By modeling time series data and multivariate relationships, the changes in the bridge technical status are predicted, and the bridge health status is updated in real time, thereby achieving early warning of potential risks. The experimental results show that by using bridge data over a 6-month period for prediction and identification, the analysis and prediction accuracy rate reached 96.7%. This indicates that the DBN model has high reliability and stability in prediction and classification tasks, and can accurately identify samples of different categories, especially in dealing with complex bridge damage detection scenarios, showing strong performance, and its effect is greatly improved compared with other traditional models. Similarly, this paper also conducted experiments in multiple occasions to test the model in different complex environments, and its accuracy rates were 92.5%, 91.8%, 90.2%, and 91% respectively. Bridge detection through the DBN model can efficiently process complex time series data, predict the health status of the bridge in real time, improve the accuracy of monitoring and early warning capabilities, and provide more reliable bridge safety protection.",
    "citationCount": 0,
    "referenceCount": 31
}