{
    "paperId": "2d0e1974886274c5378d5e90cf9e17bb9449ba31",
    "title": "MIMO Based Uncertainty-aware Learning-to-Rank Query Optimizer",
    "year": 2024,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Jincan Xiong",
        "Rui Xi",
        "Xue Chen",
        "Zihan Yan",
        "Junxin Zhu",
        "Mengshu Hou"
    ],
    "doi": "10.1109/ICPADS63350.2024.00067",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2d0e1974886274c5378d5e90cf9e17bb9449ba31",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The query optimizer is a critical component within the database management system(DBMS), tasked with translating user-input SQL queries into efficient execution plans. Traditional query optimizers rely on statistical data that may become outdated, resulting in inaccuracies leading to suboptimal execution plans and consequent declines in query performance. In response, learning-based optimizers have emerged, utilizing historical data to improve plan selection quality. However, these approaches often struggle to handle dynamic workloads and fail to consistently achieve robust optimization outcomes. This paper introduces MIMO-Lero, an uncertainty-aware learning-based query optimizer designed for seamless integration into existing DBMS platforms without requiring extensive modifications. Inspired by neural network uncertainty principles, we design a Multi-in Multi-out (MIMO) architecture-based plan ranker. This ranker predicts both the relative ranking order of plans and their associated uncertainty levels, signifying the confidence in the order prediction. Furthermore, we propose two novel selection strategies that incorporate uncertainty to enhance the robustness of query optimization. By implementing MIMO-Lero and evaluating its performance using PostgreSQL, experimental results on diverse datasets showcase significant improvements in robust query optimization while maintaining high prediction accuracy.",
    "citationCount": 0,
    "referenceCount": 25
}