{
    "paperId": "2d528650de6d54c949045b7ae03b97d20044ba8e",
    "title": "Rational Design and Organoid‐Based Evaluation of a Cocktail CAR‐γδ T Cell Therapy for Heterogeneous Glioblastoma",
    "year": 2025,
    "venue": "Advancement of science",
    "authors": [
        "Guidong Zhu",
        "Zhongzheng Sun",
        "Yingchao Liu",
        "Jiang Liu",
        "Linpei Guo",
        "Guojing Pei",
        "Ying Jiang",
        "Baowang Miao",
        "Zhen Li",
        "Ping Zhang",
        "Dongqi Tang",
        "Wen Zhang",
        "Chengwei Wang"
    ],
    "doi": "10.1002/advs.202501772",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2d528650de6d54c949045b7ae03b97d20044ba8e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1002/advs.202501772",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Various challenges, including tumor heterogeneity and inadequate T cell infiltration, impede the progress of chimeric antigen receptor T cell (CAR‐T) therapy for glioblastoma (GBM). To address these obstacles, a multiple step strategy is designed. Initially, literature review and bioinformatics analysis to screen a set of antigens that are heterogeneously expressed in GBM, which are designated as the target‐bank, are leveraged. Then, according to the multiplex immunohistochemistry results of each patient's tumor sample, a personalized panel of antigens based on the principle that most cancer cells in tumor tissues can be covered from the target‐bank is selected. To target these antigens, Vδ1 T cells are chosen as CAR vehicles because of its high tissue infiltration and off‐the‐shelf properties, and an optimized protocol for engineering CAR‐Vδ1 T cells with high purity and cytotoxicity, low exhaustion, and cytokine release is developed. Next, the specific panel of cocktail CAR‐Vδ1 T cells in the GBM organoids that are directly derived from the same patient's tumor is tested. The term “prof” cocktail therapy is coined to describe the approach using precise and rational combination of tumor antigens, organoid‐based evaluation, and fitness of Vδ1 T cells. It may accelerate development of effective CAR‐T drugs for heterogeneous solid tumors.",
    "citationCount": 2,
    "referenceCount": 69
}