{
    "paperId": "2d995cfa418362c53ee5c50892a8d48a5d385e4a",
    "title": "Meta-Learning for One-Class Classification with Few Examples using Order-Equivariant Network",
    "year": 2020,
    "venue": "",
    "authors": [
        "Ademola Oladosu",
        "Tony Xu",
        "Philip Ekfeldt",
        "Brian A. Kelly",
        "Miles Cranmer",
        "S. Ho",
        "A. Price-Whelan",
        "Gabriella Contardo"
    ],
    "doi": null,
    "arxivId": "2007.04459",
    "url": "https://www.semanticscholar.org/paper/2d995cfa418362c53ee5c50892a8d48a5d385e4a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a meta-learning framework for few-shots One-Class Classiﬁcation (OCC) at test-time, a setting where labeled examples are only available for the positive class, and no supervision is given for the negative example. We consider that we have a set of ‘one-class classiﬁcation’ objective-tasks with only a small set of positive examples available for each task, and a set of training tasks with full supervision (i.e. highly imbalanced classiﬁcation). We propose an approach using order-equivariant networks to learn a ’meta’ binary-classiﬁer. The model will take as input an example to classify from a given task, as well as the corresponding supervised set of positive examples for this OCC task. Thus, the output of the model will be ’conditioned’ on the available positive example of a given task, allowing to predict on new tasks and new examples without labeled negative examples. In this paper, we are motivated by an astronomy application. Our goal is to identify if stars belong to a speciﬁc stellar group (the ’one-class’ for a given task), called stellar streams , where each stellar stream is a different OCC-task. We show that our method transfers well on unseen (test) synthetic streams, and outperforms the baselines even though it is not retrained and accesses a much smaller part of the data per task to predict (only positive supervision). We see however that it doesn’t transfer as well on the real stream GD-1. This could come from intrinsic differences from the synthetic and real stream, highlighting the need for consistency in the ’nature’ of the task for this method. However, light ﬁne-tuning improve performances and outperform our baselines. Our experiments show encouraging results to further explore meta-learning methods for OCC tasks.",
    "citationCount": 1,
    "referenceCount": 46
}