{
    "paperId": "2db1af84a6a6f09874722b88c6a7dd3b5aef94a9",
    "title": "Epigenetic Patterns in a Complete Human Genome",
    "year": 2021,
    "venue": "bioRxiv",
    "authors": [
        "Ariel Gershman",
        "M. Sauria",
        "P. Hook",
        "Savannah J. Hoyt",
        "Roham Razaghi",
        "S. Koren",
        "Nicolas Altemose",
        "G. V. Caldas",
        "Mitchell R. Vollger",
        "Glennis A. Logsdon",
        "A. Rhie",
        "E. Eichler",
        "M. Schatz",
        "R. O’Neill",
        "A. Phillippy",
        "K. Miga",
        "W. Timp"
    ],
    "doi": "10.1126/science.abj5089",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2db1af84a6a6f09874722b88c6a7dd3b5aef94a9",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9170183",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The completion of the first telomere-to-telomere human genome, T2T-CHM13, enables exploration of the full epigenome, removing limitations previously imposed by the missing reference sequence. Existing epigenetic studies omit unassembled and unmappable genomic regions (e.g. centromeres, pericentromeres, acrocentric chromosome arms, subtelomeres, segmental duplications, tandem repeats). Leveraging the new assembly, we were able to measure enrichment of epigenetic marks with short reads using k-mer assisted mapping methods. This granted array-level enrichment information to characterize the epigenetic regulation of these satellite repeats. Using nanopore sequencing data, we generated base level maps of the most complete human methylome ever produced. We examined methylation patterns in satellite DNA and revealed organized patterns of methylation along individual molecules. When exploring the centromeric epigenome, we discovered a distinctive dip in centromere methylation consistent with active sites of kinetochore assembly. Through long-read chromatin accessibility measurements (nanoNOMe) paired to CUT&RUN data, we found the hypomethylated region was extremely inaccessible and paired to CENP-A/B binding. With long-reads we interrogated allele-specific, longrange epigenetic patterns in complex macro-satellite arrays such as those involved in X chromosome inactivation. Using the single molecule measurements we can clustered reads based on methylation status alone distinguishing epigenetically heterogeneous and homogeneous areas. The analysis provides a framework to investigate the most elusive regions of the human genome, applying both long and short-read technology to grant new insights into epigenetic regulation.",
    "citationCount": 199,
    "referenceCount": 158
}