{
    "paperId": "2db57fcdb9c2b3258138e6477099c12e13d37163",
    "title": "CXL Memory Performance for In-Memory Data Processing",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Marcel Weisgut",
        "Daniel Ritter",
        "Pınar Tözün",
        "Lawrence Benson",
        "T. Rabl"
    ],
    "doi": "10.14778/3746405.3746432",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2db57fcdb9c2b3258138e6477099c12e13d37163",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Compute Express Link (CXL) standard enables new forms of memory management and access across devices and servers. Based on PCIe, it enables cache-coherent access to remote memory. This widens the design space for database systems by expanding the available memory beyond memory local to the CPU. Efficiently utilizing CXL-attached memory requires conscious decisions by data systems about data placement and management. In this paper, we provide an in-depth analysis of database operation performance with data interleaved across multiple CXL memory devices. We experimentally evaluate the memory access performance for basic access patterns, the performance impact of placing data across multiple CXL memory devices for in-memory column scans and in-memory B+tree operations, and the performance impact of placing data in CXL memory for an in-memory database system when running the analytical TPC-H workload. Our experiments show that access to CXL-attached memory does not have to penalize performance over local access, but careful workload-aware data management is required. Our TPC-H evaluation shows that placing table columns based on access frequencies allows storing over 80% of the table data in CXL memory with a performance of 85% of a local-memory-only solution.",
    "citationCount": 0,
    "referenceCount": 88
}