{
    "paperId": "2db5a31aa74580a53607cfe2ee9cf54d6d1fbd3d",
    "title": "YOLO-DFAM-Based Onboard Intelligent Sorting System for Portunus trituberculatus",
    "year": 2025,
    "venue": "Fishes",
    "authors": [
        "Penglong Li",
        "Shengmao Zhang",
        "Hanfeng Zheng",
        "Xiumei Fan",
        "Yonchuang Shi",
        "Zuli Wu",
        "Heng Zhang"
    ],
    "doi": "10.3390/fishes10080364",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2db5a31aa74580a53607cfe2ee9cf54d6d1fbd3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study addresses the challenges of manual measurement bias and low robustness in detecting small, occluded targets in complex marine environments during real-time onboard sorting of Portunus trituberculatus. We propose YOLO-DFAM, an enhanced YOLOv11n-based model that replaces the global average pooling in the Focal Modulation module with a spatial–channel dual-attention mechanism and incorporates the ASF-YOLO cross-scale fusion strategy to improve feature representation across varying target sizes. These enhancements significantly boost detection, achieving an mAP@50 of 98.0% and precision of 94.6%, outperforming RetinaNet-CSL and Rotated Faster R-CNN by up to 6.3% while maintaining real-time inference at 180.3 FPS with only 7.2 GFLOPs. Unlike prior static-scene approaches, our unified framework integrates attention-guided detection, scale-adaptive tracking, and lightweight weight estimation for dynamic marine conditions. A ByteTrack-based tracking module with dynamic scale calibration, EMA filtering, and optical flow compensation ensures stable multi-frame tracking. Additionally, a region-specific allometric weight estimation model (R2 = 0.9856) reduces dimensional errors by 85.7% and maintains prediction errors below 4.7% using only 12 spline-interpolated calibration sets. YOLO-DFAM provides an accurate, efficient solution for intelligent onboard fishery monitoring.",
    "citationCount": 0,
    "referenceCount": 37
}