{
    "paperId": "2db68f7321399e0a7a500b356a982ca62109544d",
    "title": "LoGE: an unsupervised local-global document extension generation in information retrieval for long documents",
    "year": 2023,
    "venue": "International Journal of Web Information Systems",
    "authors": [
        "Oussama Ayoub",
        "Christophe Rodrigues",
        "Nicolas Travers"
    ],
    "doi": "10.1108/ijwis-07-2023-0109",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2db68f7321399e0a7a500b356a982ca62109544d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\nPurpose\nThis paper aims to manage the word gap in information retrieval (IR) especially for long documents belonging to specific domains. In fact, with the continuous growth of text data that modern IR systems have to manage, existing solutions are needed to efficiently find the best set of documents for a given request. The words used to describe a query can differ from those used in related documents. Despite meaning closeness, nonoverlapping words are challenging for IR systems. This word gap becomes significant for long documents from specific domains.\n\n\nDesign/methodology/approach\nTo generate new words for a document, a deep learning (DL) masked language model is used to infer related words. Used DL models are pretrained on massive text data and carry common or specific domain knowledge to propose a better document representation.\n\n\nFindings\nThe authors evaluate the approach of this study on specific IR domains with long documents to show the genericity of the proposed model and achieve encouraging results.\n\n\nOriginality/value\nIn this paper, to the best of the authors’ knowledge, an original unsupervised and modular IR system based on recent DL methods is introduced.\n",
    "citationCount": 0,
    "referenceCount": 42
}