{
    "paperId": "2dbcc5a062a0058a6dcc5caff96cbbf36e44111f",
    "title": "Noninvasive Deep Learning Analysis for Smith–Magenis Syndrome Classification",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Esther Núñez-Vidal",
        "Raúl Fernández-Ruiz",
        "A. Álvarez-Marquina",
        "Irene Hidalgo-delaGuía",
        "Elena Garayzábal-Heinze",
        "Nikola Hristov-Kalamov",
        "Francisco Domínguez-Mateos",
        "Cristina Conde",
        "Rafael Martínez-Olalla"
    ],
    "doi": "10.3390/app14219747",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2dbcc5a062a0058a6dcc5caff96cbbf36e44111f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/app14219747",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Smith–Magenis syndrome (SMS) is a rare, underdiagnosed condition due to limited public awareness of genetic testing and a lengthy diagnostic process. Voice analysis can be a noninvasive tool for monitoring and detecting SMS. In this paper, the cepstral peak prominence and mel-frequency cepstral coefficients are used as disease monitoring and detection metrics. In addition, an efficient neural network, incorporating synthetic data processes, was used to detect SMS in a cohort of individuals with the disease. Three study cases were conducted with a set of 19 SMS patients and 292 controls. The three study cases employed various oversampling and undersampling techniques, including SMOTE, random oversampling, NearMiss, random undersampling, and 16 additional methods, resulting in balanced accuracies ranging from 69% to 92%. This is the first study using a neural network model to focus on a rare genetic syndrome using phonation analysis data. By using synthetic data (oversampling and undersampling) and a CNN, it was possible to detect SMS with high levels of accuracy. Voice analysis and deep learning techniques have proven to be a useful and noninvasive method. This is a finding that may help in the complex identification of this syndrome as well as other rare diseases.",
    "citationCount": 1,
    "referenceCount": 78
}