{
    "paperId": "2df532e0deb54b8351af2a1b75c5b9643325bc23",
    "title": "An EWS-LSTM-Based Deep Learning Early Warning System for Industrial Machine Fault Prediction",
    "year": 2025,
    "venue": "Applied Sciences",
    "authors": [
        "Fabio Cassano",
        "Anna Maria Crespino",
        "M. Lazoi",
        "Giorgia Specchia",
        "A. Spennato"
    ],
    "doi": "10.3390/app15074013",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2df532e0deb54b8351af2a1b75c5b9643325bc23",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Early warning systems (EWSs) are crucial for optimising predictive maintenance strategies, especially in the industrial sector, where machine failures often cause significant downtime and economic losses. This research details the creation and evaluation of an EWS that incorporates deep learning methods, particularly using Long Short-Term Memory (LSTM) networks enhanced with attention layers to predict critical machine faults. The proposed system is designed to process time-series data collected from an industrial printing machine’s embosser component, identifying error patterns that could lead to operational disruptions. The dataset was preprocessed through feature selection, normalisation, and time-series transformation. A multi-model classification strategy was adopted, with each LSTM-based model trained to detect a specific class of frequent errors. Experimental results show that the system can predict failure events up to 10 time units in advance, with the best-performing model achieving an AUROC of 0.93 and recall above 90%. Results indicate that the proposed approach successfully predicts failure events, demonstrating the potential of EWSs powered by deep learning for enhancing predictive maintenance strategies. By integrating artificial intelligence with real-time monitoring, this study highlights how intelligent EWSs can improve industrial efficiency, reduce unplanned downtime, and optimise maintenance operations.",
    "citationCount": 2,
    "referenceCount": 49
}