{
    "paperId": "2e08fd20c239cdf3cea610e77752a6f3061e4b42",
    "title": "Systematic evaluation of genome sequencing for the assessment of fetal structural anomalies",
    "year": 2020,
    "venue": "bioRxiv",
    "authors": [
        "Chelsea Lowther",
        "E. Valkanas",
        "J. Giordano",
        "Harold Wang",
        "Benjamin Currall",
        "Kathryn O’Keefe",
        "Ryan L. Collins",
        "Xuefang Zhao",
        "C. Austin-Tse",
        "Emily Evangelista",
        "V. Aggarwal",
        "D. Lucente",
        "L. Gauthier",
        "C. Tolonen",
        "N. Sahakian",
        "Joon-Yong An",
        "Shan Dong",
        "M. Norton",
        "T. Mackenzie",
        "B. Devlin",
        "K. Gilmore",
        "B. Powell",
        "A. Brandt",
        "Francesco Vetrini",
        "M. Divito",
        "D. Goldstein",
        "Stephan J Sanders",
        "D. MacArthur",
        "Jennelle C Hodge",
        "A. O’Donnell-Luria",
        "H. Rehm",
        "N. Vora",
        "B. Levy",
        "H. Brand",
        "R. Wapner",
        "M. Talkowski"
    ],
    "doi": "10.1101/2020.08.12.248526",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e08fd20c239cdf3cea610e77752a6f3061e4b42",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2020/08/13/2020.08.12.248526.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current clinical guidelines recommend three genetic tests for the assessment of fetal structural anomalies: karyotype to detect microscopically-visible balanced and unbalanced chromosomal rearrangements, chromosomal microarray (CMA) to detect sub-microscopic copy number variants (CNVs), and exome sequencing (ES) to identify individual nucleotide changes in coding sequence. Advances in genome sequencing (GS) analysis suggest that it is poised to displace the sequential application of all three conventional tests to become a single diagnostic approach for the assessment of fetal structural anomalies. However, systematic benchmarking is required to assure that GS can capture the full mutational spectrum associated with fetal structural anomalies and to accurately quantify the added diagnostic yield of GS. We applied a novel GS analytic framework that included the discovery, filtration, and interpretation of nine classes of genomic variation to 7,195 individuals. We assessed the sensitivity of GS to detect diagnostic variants (pathogenic or likely pathogenic) from three standard-of-care tests using 1,612 autism spectrum disorder quartet families (ASD; n=6,448) with matched GS, ES, and CMA data, and validated these findings in 46 fetuses with a clinically reportable variant originally identified by karyotype, CMA, or ES. We then assessed the added diagnostic yield of GS in 249 trios (n=747) comprising a fetus with a structural anomaly detected by ultrasound and two unaffected parents that were pre-screened with a combination of all three standard-of-care tests. Across both cohorts, our GS analytic framework identified 98.2% of all diagnostic variants detected by standard-of-care tests, including 100% of those originally detected by CMA (n=88) and ES (n=61), as well as 78.6% (n=11/14) of the chromosomal rearrangements identified by karyotype. The diagnostic yield from GS was 7.8% across all 1,612 ASD probands, almost two-fold more than CMA (4.4%) and three-fold more than ES (3.0%). We also demonstrated that the yield of ES can approach that of GS when CNVs are captured with high sensitivity from exome data (7.4% vs. 7.8%, respectively). In 249 pre-screened fetuses with structural anomalies, GS provided an additional diagnostic yield of 0.4% beyond the combination of all three tests (karyotype, CMA, and ES). Applying our benchmarking results to existing data indicates that GS can achieve an overall diagnostic yield of 46.1% in unselected fetuses with fetal structural anomalies, providing an estimated 17.2% increase in diagnostic yield over karyotype, 14.1% over CMA, and 36.1% over ES when sequence variants are assessed, and 4.1% when CNVs are also identified from exome data. In this study we demonstrate that GS is sensitive to the detection of almost all pathogenic variation captured by karyotype, CMA, and ES, provides a superior diagnostic yield than any individual test by a wide margin, and contributes a modest increase in diagnostic yield beyond the combination of all three tests. We also outline several strategies to aid the interpretation of GS variants that are cryptic to conventional technologies, which we anticipate will be increasingly encountered as comprehensive variant identification from GS is performed. Taken together, these data suggest GS warrants consideration as a first-tier diagnostic approach for fetal structural anomalies.",
    "citationCount": 12,
    "referenceCount": 137
}