{
    "paperId": "2e12cb4ec3c062d29f19e5449b707671e61f6446",
    "title": "Latency-Aware Cache Mechanism for Resolver Service of Domain Name Systems",
    "year": 2024,
    "venue": "IEEE/IFIP Network Operations and Management Symposium",
    "authors": [
        "Ibirisol Fontes Ferreira",
        "Eiji Oki"
    ],
    "doi": "10.1109/NOMS59830.2024.10575387",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e12cb4ec3c062d29f19e5449b707671e61f6446",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The domain name system (DNS) is essential to access Internet services. However, although DNS has become a vital part of Internet users in the network and facilitates the process, it is still a critical part of the service chain. This is principally due to its resolver component, which can negatively impact the final user experience of consuming services. Furthermore, to improve service quality and increase user experience, this study intends to mitigate the latency effect of the resolution element of domain name systems in the network. Some studies have developed strategies to reduce response time to resolution. Still, they needed some integrated module in the user’s devices or a more complex and expensive service architecture that was not scalable for edge deployments. This study proposes integrating prediction techniques and a user-oriented resolution name approach to improve the overall quality of access to the Internet for users, even when there are limited computing resources in the edge infrastructure.",
    "citationCount": 0,
    "referenceCount": 63
}