{
    "paperId": "2e1c76c76b722d42f876ed0b58f9ad29ae61eba0",
    "title": "GlassDB: An Efficient Verifiable Ledger Database System Through Transparency",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Cong Yue",
        "Tien Tuan Anh Dinh",
        "Zhongle Xie",
        "Meihui Zhang",
        "Gang Chen",
        "B. Ooi",
        "X. Xiao"
    ],
    "doi": "10.14778/3583140.3583152",
    "arxivId": "2207.00944",
    "url": "https://www.semanticscholar.org/paper/2e1c76c76b722d42f876ed0b58f9ad29ae61eba0",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2207.00944",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Verifiable ledger databases protect data history against malicious tampering. Existing systems, such as blockchains and certificate transparency, are based on transparency logs --- a simple abstraction allowing users to verify that a log maintained by an untrusted server is append-only. They expose a simple key-value interface without transactions. Building a practical database from transparency logs, on the other hand, remains a challenge.\n In this paper, we explore the design space of verifiable ledger databases along three dimensions: abstraction, threat model, and performance. We survey existing systems and identify their two limitations, namely, the lack of transaction support and the inferior efficiency. We then present GlassDB, a distributed database system that addresses these limitations under a practical threat model. GlassDB inherits the verifiability of transparency logs, but supports transactions and offers high performance. It extends a ledgerlike key-value store with a data structure for efficient proofs, and adds a concurrency control mechanism for transactions. GlassDB batches independent operations from concurrent transactions when updating the core data structures. In addition, we design a new benchmark for evaluating verifiable ledger databases, by extending YCSB and TPC-C benchmarks. Using this benchmark, we compare GlassDB against four baselines: reimplemented versions of three verifiable databases, and a verifiable map backed by a transparency log. Experimental results demonstrate that GlassDB is an efficient, transactional, and verifiable ledger database system.",
    "citationCount": 21,
    "referenceCount": 50
}