{
    "paperId": "2e27641dab08f12be674fddcc1b0e85481f3f6ad",
    "title": "Robust PCL Discovery of Data-Driven Mean-Field Game Systems and Control Problems",
    "year": 2021,
    "venue": "IEEE Transactions on Circuits and Systems Part 1: Regular Papers",
    "authors": [
        "Chun Li",
        "Yunyun Yang",
        "Hui Liang",
        "Boying Wu"
    ],
    "doi": "10.1109/TCSI.2021.3065561",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e27641dab08f12be674fddcc1b0e85481f3f6ad",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Under the background of the wanton spread of the coronavirus disease (COVID-19), the pandemic is changing and hitting lives all over the world. Fortunately, Spatio-temporal processes bear essential importance in many applied scientific fields. And the disease pandemic can be viewed as Spatio-temporal dynamics processes. Generally, partial differential equations (PDEs) have been widely used to investigate interfacial dynamic processes. In this work, we use a physical-constraint neural network learning the Spatio-temporal mean-field dynamics to control the propagation of epidemics. Also, we use the AI-based algorithm physical-constraint learning (PCL) to solve the minimization problems of the mean-field game (MFG) and control (MFC) problems instead of the traditional computational method. In PCL, the PDEs are encoded into the loss function, where partial derivatives can be obtained through automatic differentiation (AD). We demonstrate how they can be applied in practice by considering the problem of controlling the propagation of epidemics. Numerical experiments on different input data are implemented to demonstrate the effectiveness and superiority of the proposed models compared to the state-of-the-art approach and illustrate how to separate the infected patients in a spatial domain effectively.",
    "citationCount": 11,
    "referenceCount": 60
}