{
    "paperId": "2e312a36f8e6f7fdad8739db20c56c042f2f9230",
    "title": "Molecular Characterization of Klebsiella pneumoniae Clinical Isolates Through Whole-Genome Sequencing: A Comprehensive Analysis of Serotypes, Sequence Types, and Antimicrobial and Virulence Genes",
    "year": 2024,
    "venue": "Cureus",
    "authors": [
        "Vinay Kumar Moses",
        "Venkataramana Kandi",
        "Vallab Ganesh Bharadwaj",
        "T. Suvvari",
        "Eswar Podaralla"
    ],
    "doi": "10.7759/cureus.58449",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e312a36f8e6f7fdad8739db20c56c042f2f9230",
    "isOpenAccess": true,
    "openAccessPdf": "https://assets.cureus.com/uploads/original_article/pdf/244561/20240417-26518-7sgxm4.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Antimicrobial resistance (AMR) has become a menace, spreading among bacterial species globally. AMR is now recognized as a silent pandemic responsible for treatment failures. Therefore, an effective surveillance mechanism is warranted to understand the bacterial species isolated from human clinical specimens. The present study employed next-generation sequencing (NGS) or whole-genome sequencing (WGS) to identify the resistance and virulence genes, sequence type, and serotypes. Methods This study included 18 multidrug-resistant (MDR) Klebsiella pneumoniae (K. pneumoniae) isolates obtained from patients suffering from different infections attending the Prathima Institute of Medical Sciences, Karimnagar, India. All isolates were identified, and antimicrobial susceptibility profiles were determined through conventional microbiological techniques and confirmed by automated systems. All the isolates were investigated using NGS or WGS to identify the genes coding for resistance, such as extended-spectrum beta-lactamases (ESBLs), metallo-beta-lactamases, and virulence genes. Multilocus sequence typing (MLST) was conducted to identify the sequence types, and Kleborate analysis was performed to confirm the species, genes for AMR, and virulence and evaluate the capsular polysaccharide (KL) and cell wall/lipopolysaccharide (O) serotypes carried by the isolates. Results The mean age of the patients was 46.11±20.35 years. Among the patients included, 12 (66.66%) were males and 6 (33.33%) were females. A high percentage (>50%) of hypervirulent K. pneumoniae (hvKp) strains that had genes coding for AMR and plasmids having the potential to carry blaNDM and resistance genes were observed. Among the isolates, 16 (88.88%) revealed the presence of multiple antibiotic-resistant genes with evidence of at least one gene coding for beta-lactamase resistance. There was a high prevalence of blaSHV (17/18; 94.44%) and blaCTX-M-15 (16/18; 88.88%) AMR genes. Other AMR genes identified included blaTEM (83.33%; 15/18) and blaOXA (14/18; 77.77%). Two (11.11%) strains each showed the presence of blaNDM-1 and blaNDM-5 genes. The virulence genes identified included gapA, infB, mdh, pgi, phoE, rpoB, tonB, and ybt. The most frequent K. pneumoniae serotypes found were KL51:O1v2 (3/18, 16.66%), KL17:O1v1 (3/18, 16.66%), and KL64:O2v1 (3/18, 16.66%). KL64 (4/18; 22.22%) was the most common capsular serotype identified among the isolates. The most frequent MLST-based sequence type (ST) identified included ST-147 (5/18, 27.77%), followed by ST-231 (3/18, 16.66%) and ST-101 (2/18, 11.11%). Conclusions The molecular analysis of K. pneumoniae isolates revealed multiple AMR, plasmid, and virulence genes. Additionally, many global STs were noticed by MLST. The results noted a high prevalence of hvKp strains. Molecular characterization of bacterial strains using NGS/WGS is important to understand the epidemiology of bacterial strains and the antibiotic resistance and virulence genes they are potentially carrying. The data obtained from this study may be utilized to devise careful antibiotic-prescribing approaches and improve patient management practices.",
    "citationCount": 2,
    "referenceCount": 30
}