{
    "paperId": "2e3b787ed2ab4427a097ae807322cf6d09129c03",
    "title": "Schur's Positive-Definite Network: Deep Learning in the SPD cone with structure",
    "year": 2024,
    "venue": "International Conference on Learning Representations",
    "authors": [
        "Can Pouliquen",
        "Mathurin Massias",
        "Titouan Vayer"
    ],
    "doi": "10.48550/arXiv.2406.09023",
    "arxivId": "2406.09023",
    "url": "https://www.semanticscholar.org/paper/2e3b787ed2ab4427a097ae807322cf6d09129c03",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Estimating matrices in the symmetric positive-definite (SPD) cone is of interest for many applications ranging from computer vision to graph learning. While there exist various convex optimization-based estimators, they remain limited in expressivity due to their model-based approach. The success of deep learning motivates the use of learning-based approaches to estimate SPD matrices with neural networks in a data-driven fashion. However, designing effective neural architectures for SPD learning is challenging, particularly when the task requires additional structural constraints, such as element-wise sparsity. Current approaches either do not ensure that the output meets all desired properties or lack expressivity. In this paper, we introduce SpodNet, a novel and generic learning module that guarantees SPD outputs and supports additional structural constraints. Notably, it solves the challenging task of learning jointly SPD and sparse matrices. Our experiments illustrate the versatility and relevance of SpodNet layers for such applications.",
    "citationCount": 0,
    "referenceCount": 51
}