{
    "paperId": "2e5b97bd6013715ad85e965445af700858525f7a",
    "title": "Effective Performance Modeling and Domain-Specific Compiler Optimization of CNNs for GPUs",
    "year": 2022,
    "venue": "International Conference on Parallel Architectures and Compilation Techniques",
    "authors": [
        "Yufan Xu",
        "Qiwei Yuan",
        "E. Barton",
        "Rui Li",
        "P. Sadayappan",
        "Aravind Sukumaran-Rajam"
    ],
    "doi": "10.1145/3559009.3569674",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e5b97bd6013715ad85e965445af700858525f7a",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3559009.3569674",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Convolutional Neural Network (CNN) kernel is a fundamental building block for deep learning, which dominates the computational cost of deep learning pipelines for image analysis. The synthesis of high-performance GPU kernels for CNNs is thus of considerable interest. The current state-of-the-art in optimizing CNN kernels is auto-tuning search using AutoTVM/Ansor, which has been shown to achieve higher performance than vendor libraries as well as polyhedral compilers. A primary reason for the failure of general-purpose optimizing compilers to deliver high-performance code for key kernels like CNN is the challenge of accurate performance modeling to enable effective choice among alternative transformations and/or parameter values such as tile sizes. In this paper we ask if a domain-specific compiler that is customized for the important CNN kernel can be more effective. Our results show that it can be very effective, enabling even higher performance of the generated GPU code for CNNs than auto-tuning with TVM/Ansor. Further, we demonstrate the effectiveness of a performance modeling approach that integrates analytical modeling of data movement volume with machine learning for offline training, enabling much more rapid code optimization than the approach of TVM/Ansor that is based on online construction of a machine learning model to guide auto-tuning search.",
    "citationCount": 5,
    "referenceCount": 23
}