{
    "paperId": "2e6076f752c5b90cc32d5c1192555d36c1b2e5f6",
    "title": "Joint Use of Vital Signs and Cough Sounds for Pandemic Detection",
    "year": 2024,
    "venue": "2024 International Telecommunications Conference (ITC-Egypt)",
    "authors": [
        "Ayah Abdel-Ghani",
        "Zaineh Abughazzah",
        "Mahnoor Akhund",
        "Amira Abdalla",
        "Khalid Abualsaud",
        "Elias Yaacoub"
    ],
    "doi": "10.1109/ITC-Egypt61547.2024.10620464",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e6076f752c5b90cc32d5c1192555d36c1b2e5f6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to the challenges once posed by the COVID-19 pandemic, this paper presents a comprehensive solution that integrates advanced techniques to enhance the detection of infections remotely, using sensors on a wearable bracelet. Building on our previous work, we introduce a Machine Learning model that can classify COVID-19 and Healthy patients from their cough sounds and vital signs. Health data like Body Temperature, Heart Rate, and SpO2 levels are collected by a sensor in the wristband and are sent to the mobile application for diagnosis. The system is connected to a local backend server that performs the classification process. The results from the Cough Classification and Vital Signs classification contribute to a robust assessment of infection probability. Our results show a significant improvement in detection accuracy, indicating the potential of this solution to serve as an adaptable tool in future pandemics with respiratory symptoms.",
    "citationCount": 0,
    "referenceCount": 10
}