{
    "paperId": "2e6fa3095df1d1ed041dfb4f5a18e31d4b7bd7bb",
    "title": "In-Context Learning with Many Demonstration Examples",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Mukai Li",
        "Shansan Gong",
        "Jiangtao Feng",
        "Yiheng Xu",
        "Jinchao Zhang",
        "Zhiyong Wu",
        "Lingpeng Kong"
    ],
    "doi": "10.48550/arXiv.2302.04931",
    "arxivId": "2302.04931",
    "url": "https://www.semanticscholar.org/paper/2e6fa3095df1d1ed041dfb4f5a18e31d4b7bd7bb",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2302.04931",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large pre-training language models (PLMs) have shown promising in-context learning abilities. However, due to the backbone transformer architecture, existing PLMs are bottlenecked by the memory and computational cost when scaling up to a large context size, leaving instruction tuning and in-context learning of many demonstration examples, as well as long-range language modeling under-explored. In this study, we propose a long-range language model EVALM based on an efficient transformer mechanism. EVALM is trained with 8k tokens per batch line and can test up to 256k-lengthed contexts with extrapolation, 128 times to the limit of existing PLMs (e.g. GPT3). Based on EVALM, we scale up the size of examples efficiently in both instruction tuning and in-context learning to explore the boundary of the benefits from more annotated data. Experimental results on a diverse set of tasks show that EVALM achieves 4.1% higher accuracy on average, and the average length of achieving the best accuracy score over tasks is around 12k. We find that in-context learning can achieve higher performance with more demonstrations under many-shot instruction tuning (8k), and further extending the length of instructions (16k) can further improve the upper bound of scaling in-context learning.",
    "citationCount": 40,
    "referenceCount": 60
}