{
    "paperId": "2e840e763fe0f74ab1b173296a833a16c59624b0",
    "title": "Roulette: A Semantic Privacy-Preserving Device-Edge Collaborative Inference Framework for Deep Learning Classification Tasks",
    "year": 2023,
    "venue": "IEEE Transactions on Mobile Computing",
    "authors": [
        "Jingyi Li",
        "Guocheng Liao",
        "Lin Chen",
        "Xu Chen"
    ],
    "doi": "10.1109/TMC.2023.3312304",
    "arxivId": "2309.02820",
    "url": "https://www.semanticscholar.org/paper/2e840e763fe0f74ab1b173296a833a16c59624b0",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.02820",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning classifiers are crucial in the age of artificial intelligence. The device-edge-based collaborative inference has been widely adopted as an efficient framework for promoting its applications in IoT and 5 G/6 G networks. However, it suffers from accuracy degradation under non-i.i.d. data distribution and privacy disclosure. For accuracy degradation, direct use of transfer learning and split learning is high cost and privacy issues remain. For privacy disclosure, cryptography-based approaches lead to a huge overhead. Other lightweight methods assume that the ground truth is non-sensitive and can be exposed. But for many applications, the ground truth is the user's crucial privacy-sensitive information. In this paper, we propose a framework of Roulette, which is a task-oriented semantic privacy-preserving collaborative inference framework for deep learning classifiers. More than input data, we treat the ground truth of the data as private information. We develop a novel paradigm of split learning where the back-end DNN is frozen and the front-end DNN is retrained to be both a feature extractor and an encryptor. Moreover, we provide a differential privacy guarantee and analyze the hardness of ground truth inference attacks. To validate the proposed Roulette, we conduct extensive performance evaluations using realistic datasets, which demonstrate that Roulette can effectively defend against various attacks and meanwhile achieve good model accuracy. In a situation where the non-i.i.d. is very severe, Roulette improves the inference accuracy by 21% averaged over benchmarks, while making the accuracy of discrimination attacks almost equivalent to random guessing.",
    "citationCount": 11,
    "referenceCount": 83
}