{
    "paperId": "2e8bbde16b2ab53f31b023a32e0729979e3eba18",
    "title": "Towards International Maritime Organization Carbon Targets: A Multi-Criteria Decision-Making Analysis for Sustainable Container Shipping",
    "year": 2023,
    "venue": "Sustainability",
    "authors": [
        "Hamid Reza Soltani Motlagh",
        "Seyed Behbood Issa Zadeh",
        "C. Garay-Rondero"
    ],
    "doi": "10.3390/su152416834",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e8bbde16b2ab53f31b023a32e0729979e3eba18",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/15/24/16834/pdf?version=1702541766",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, decarbonizing the maritime industry, which accounts for 2.8% of world emissions, has become essential. However, as a crucial component of maritime transportation, container shipping also carries substantial significance. In this context, the International Maritime Organization endeavors to endorse several projects and methods to mitigate maritime transport emissions. As a result, this research assesses frameworks, infrastructure, training, and other critical factors to analyze multiple operational and technological possibilities for predicted decarbonization solutions in container shipping using the multi-criteria decision-making (MCDM) approach to assess ship owners’ and stakeholders’ desires. It employs a comprehensive methodology that begins with a systematic literature review using the preferred reporting items for systematic reviews and meta-analyses (PRISMA) method to prepare questionaries, followed by an MCDM analysis using the analytic hierarchy process (AHP) and the technique for order of preference by similarity to ideal solution (TOPSIS) methods to examine the results. This research contributes to the scholarly discourse on reducing the emissions of maritime transportation. According to the findings, operational alternatives, such as ship speed, trim, and maritime route optimizations, are considerably more appealing than design and technology solutions, such as technically advanced ship hulls or machinery reforms. The pragmatic advantages of the operational alternatives, such as lower costs and shorter implementation schedules, stimulate their adoption. In contrast, design and technological solutions can influence emission reductions in the long term. It is possible to find operational alternatives for short-term decarbonization, while technological and design advancements can aid in long-term emission reductions in container shipping.",
    "citationCount": 22,
    "referenceCount": 87
}