{
    "paperId": "2e9bd0c50c196a31313cf2bfa1f63635495b7d84",
    "title": "Beyond Zero Trust: Reclaiming Blue Cyberspace with AI*",
    "year": 2024,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Scott A. Weed"
    ],
    "doi": "10.1109/HPEC62836.2024.10938491",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2e9bd0c50c196a31313cf2bfa1f63635495b7d84",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Given the rapidly evolving cyberspace threat land-scape and current US military cyber capabilities, how can the DOD employ emergent technology to regain its competitive advantage? Industry best practices are necessary but insufficient to counter the threats undermining national security. They cede friendly and neutral cyberspace to adversaries and cannot serve as the desired end state. This article offers a literature review of evolving approaches, analyzes gaps within the DOD cyber strategy, and discusses one emergent capability to fill those gaps. This research contends that the military must field an AI-enabled domain-sensing capability to provide new strategic outcomes. This capability, only possible through modern network and computing resources, offers Internet-scale, machine-speed Deep Learning to defend DOD networks. The military could then observe, pursue, and counter threats and realize a more active defense posture to defend the nation against converging non-state and state malign cyber actors.",
    "citationCount": 7,
    "referenceCount": 68
}