{
    "paperId": "2ea954a807eeb2e0ddadfeb476af26b6e57959b1",
    "title": "Fast and Efficient DNN Deployment via Deep Gaussian Transfer Learning",
    "year": 2021,
    "venue": "IEEE International Conference on Computer Vision",
    "authors": [
        "Qi Sun",
        "Chen Bai",
        "Tinghuan Chen",
        "Hao Geng",
        "Xinyun Zhang",
        "Yang Bai",
        "Bei Yu"
    ],
    "doi": "10.1109/ICCV48922.2021.00533",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2ea954a807eeb2e0ddadfeb476af26b6e57959b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep neural networks (DNNs) have been widely used recently while their hardware deployment optimizations are very time-consuming and the historical deployment knowledge is not utilized efficiently. In this paper, to accelerate the optimization process and find better deployment configurations, we propose a novel transfer learning method based on deep Gaussian processes (DGPs). Firstly, a deep Gaussian process (DGP) model is built on the historical data to learn empirical knowledge. Secondly, to transfer knowledge to a new task, a tuning set is sampled for the new task under the guidance of the DGP model. Then DGP is tuned according to the tuning set via maximum-a-posteriori (MAP) estimation to accommodate for the new task and finally used to guide the deployments of the task. The experiments show that our method achieves the best inference latencies of convolutions while accelerating the optimization process significantly, compared with previous arts.",
    "citationCount": 6,
    "referenceCount": 56
}