{
    "paperId": "2eaf0bccfe3cac743c587f31a5037e9272e57aee",
    "title": "Detecting and Classifying Malevolent Dialogue Responses: Taxonomy, Data and Methodology",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Yangjun Zhang",
        "Pengjie Ren",
        "M. D. Rijke"
    ],
    "doi": null,
    "arxivId": "2008.09706",
    "url": "https://www.semanticscholar.org/paper/2eaf0bccfe3cac743c587f31a5037e9272e57aee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Conversational interfaces are increasingly popular as a way of connecting people to information. Corpus-based conversational interfaces are able to generate more diverse and natural responses than template-based or retrieval-based agents. With their increased generative capacity of corpusbased conversational agents comes the need to classify and filter out malevolent responses that are inappropriate in terms of content and dialogue acts. Previous studies on the topic of recognizing and classifying inappropriate content are mostly focused on a certain category of malevolence or on single sentences instead of an entire dialogue. In this paper, we define the task of Malevolent Dialogue Response Detection and Classification (MDRDC). We make three contributions to advance research on this task. First, we present a Hierarchical Malevolent Dialogue Taxonomy (HMDT). Second, we create a labelled multi-turn dialogue dataset and formulate the MDRDC task as a hierarchical classification task over this taxonomy. Third, we apply stateof-the-art text classification methods to the MDRDC task and report on extensive experiments aimed at assessing the performance of these approaches.",
    "citationCount": 12,
    "referenceCount": 77
}