{
    "paperId": "2ebfab0b6fcb40296bf8c72a78657c7b0de59041",
    "title": "Intelligent Development of Enterprise Management Innovation Based on Artificial Neural Network",
    "year": 2022,
    "venue": "Mobile Information Systems",
    "authors": [
        "Jintao Wu",
        "Xinlong Ding"
    ],
    "doi": "10.1155/2022/4121907",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2ebfab0b6fcb40296bf8c72a78657c7b0de59041",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/misy/2022/4121907.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence technology is gradually entering all aspects of our lives while also promoting the development of various fields. Artificial intelligence can also solve problems that could not be solved by computing before. This paper combines artificial intelligence and network function virtualization, two very advanced and popular technologies in modern society, and uses neural networks to solve and develop the service chain problem in network function virtualization. The simulation shows that all algorithms almost decrease linearly with the change of VNR. This decrease means that there is no noise. The optimal mapping of each VNE problem can be achieved within the scope of the existing solutions, and the heuristic method is to try to find possible mappings. In terms of enterprise management innovation, this article points out the need to strengthen in-depth cooperation and exchanges between universities and enterprises. At the same time, the government, as a third party in cooperation, should play an active leadership role and an intermediary coordination role. In terms of innovation management cooperation, the establishment and improvement of government plans and policy support mechanisms are important external driving factors.",
    "citationCount": 0,
    "referenceCount": 17
}