{
    "paperId": "2ed35779ac0bfaaf331a36cf13c1e4d42cd72b59",
    "title": "Interpretable Neural PDE Solvers using Symbolic Frameworks",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Y. Y. R. Lee"
    ],
    "doi": "10.48550/arXiv.2310.20463",
    "arxivId": "2310.20463",
    "url": "https://www.semanticscholar.org/paper/2ed35779ac0bfaaf331a36cf13c1e4d42cd72b59",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Partial differential equations (PDEs) are ubiquitous in the world around us, modelling phenomena from heat and sound to quantum systems. Recent advances in deep learning have resulted in the development of powerful neural solvers; however, while these methods have demonstrated state-of-the-art performance in both accuracy and computational efficiency, a significant challenge remains in their interpretability. Most existing methodologies prioritize predictive accuracy over clarity in the underlying mechanisms driving the model's decisions. Interpretability is crucial for trustworthiness and broader applicability, especially in scientific and engineering domains where neural PDE solvers might see the most impact. In this context, a notable gap in current research is the integration of symbolic frameworks (such as symbolic regression) into these solvers. Symbolic frameworks have the potential to distill complex neural operations into human-readable mathematical expressions, bridging the divide between black-box predictions and solutions.",
    "citationCount": 1,
    "referenceCount": 31
}