{
    "paperId": "2ef1c2438c3a4552db9e7080e15d8c51bc071f58",
    "title": "Language Models Enable Simple Systems for Generating Structured Views of Heterogeneous Data Lakes",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Simran Arora",
        "Brandon Yang",
        "Sabri Eyuboglu",
        "A. Narayan",
        "Andrew Hojel",
        "Immanuel Trummer",
        "Christopher Ré"
    ],
    "doi": "10.14778/3626292.3626294",
    "arxivId": "2304.09433",
    "url": "https://www.semanticscholar.org/paper/2ef1c2438c3a4552db9e7080e15d8c51bc071f58",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2304.09433",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n A long standing goal in the data management community is developing systems that input documents and output queryable tables without user effort. Given the sheer variety of potential documents, state-of-the art systems make simplifying assumptions and use domain specific training. In this work, we ask whether we can maintain generality by using the in-context learning abilities of large language models (LLMs). We propose and evaluate Evaporate, a prototype system powered by LLMs. We identify two strategies for implementing this system: prompt the LLM to directly extract values from documents or prompt the LLM to synthesize code that performs the extraction. Our evaluations show a cost-quality tradeoff between these two approaches. Code synthesis is cheap, but far less accurate than directly processing each document with the LLM. To improve quality while maintaining low cost, we propose an extended implementation, Evaporate-Code+, which achieves better quality than direct extraction. Our insight is to generate many candidate functions and ensemble their extractions using weak supervision. Evaporate-Code+ outperforms the state-of-the art systems using a\n sublinear\n pass over the documents with the LLM. This equates to a 110X reduction in the number of documents the LLM needs to process across our 16 real-world evaluation settings.\n",
    "citationCount": 115,
    "referenceCount": 80
}