{
    "paperId": "2f06e2fcaa8cfa837e84d9052ee7c3e2f3b60514",
    "title": "Toward Efficient and Scalable Design of In-Memory Graph-Based Vector Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Ilias Azizi",
        "Karima Echihabi",
        "Themis Palpanas",
        "V. Christophides"
    ],
    "doi": "10.48550/arXiv.2509.05750",
    "arxivId": "2509.05750",
    "url": "https://www.semanticscholar.org/paper/2f06e2fcaa8cfa837e84d9052ee7c3e2f3b60514",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Vector data is prevalent across business and scientific applications, and its popularity is growing with the proliferation of learned embeddings. Vector data collections often reach billions of vectors with thousands of dimensions, thus, increasing the complexity of their analysis. Vector search is the backbone of many critical analytical tasks, and graph-based methods have become the best choice for analytical tasks that do not require guarantees on the quality of the answers. Although several paradigms (seed selection, incremental insertion, neighborhood propagation, neighborhood diversification, and divide-and-conquer) have been employed to design in-memory graph-based vector search algorithms, a systematic comparison of the key algorithmic advances is still missing. We conduct an exhaustive experimental evaluation of twelve state-of-the-art methods on seven real data collections, with sizes up to 1 billion vectors. We share key insights about the strengths and limitations of these methods; e.g., the best approaches are typically based on incremental insertion and neighborhood diversification, and the choice of the base graph can hurt scalability. Finally, we discuss open research directions, such as the importance of devising more sophisticated data adaptive seed selection and diversification strategies.",
    "citationCount": 0,
    "referenceCount": 86
}