{
    "paperId": "2f121efb2efd7c02a583a33df8317f4a5f81e9dd",
    "title": "Multi-Cloud Query Optimisation with Accurate and Efficient Quoting",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Damien T. Wojtowicz",
        "Shaoyi Yin",
        "J. Martinez-Gil",
        "F. Morvan",
        "A. Hameurlain"
    ],
    "doi": "10.1109/BigData55660.2022.10020835",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2f121efb2efd7c02a583a33df8317f4a5f81e9dd",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.science/hal-03841516/file/pdfxpress.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A recent trend among major organisations is to release their datasets in the cloud over various Database-as-a-Service (DBaaS) providers’ premises, creating a use case for multi-cloud querying. As identified in the literature, middlewares with such capabilities should quote the monetary cost and the response time of the queries in order to gain the trust of their users, and also optimise the queries so as to avoid cost overruns and meet the quotations. Considering those requirements, this paper introduces an accurate cost model and an efficient execution plan search strategy for dealing with large-scale multi-cloud queries. The former is an ensemble learning stack leveraging online machine learning models, and the latter is a randomised method inspired by iterative improvement. We evaluated our middleware over simulated providers by using the Join Order Benchmark. Experiments showed that the cost model manages to correct the estimations from the providers. The randomised strategy can produce more efficiently execution plans that yield better performances and a lower monetary cost compared to an exhaustive approach from previous work.",
    "citationCount": 0,
    "referenceCount": 19
}