{
    "paperId": "2f2a44770106bd7953537bf6e193d76be04c90dd",
    "title": "Track Merging for Effective Video Query Processing",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Daren Chao",
        "Yueting Chen",
        "Nick Koudas",
        "Xiaohui Yu"
    ],
    "doi": "10.1109/ICDE55515.2023.00020",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2f2a44770106bd7953537bf6e193d76be04c90dd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Video analysis frameworks supporting declarative queries are actively researched in recent years. A major prerequisite in executing such queries is the ability to accurately extract metadata at the frame level utilizing various computer vision algorithms, including object tracking models. Tracking models are of profound importance as they establish unique identifiers for the objects across frames.Despite the maturity of tracking algorithms, they still face challenges (such as occlusions, object glaze etc.) which diminish their quality and accuracy. This gives rise to the track fragmentation problem in which a single track is fragmented into multiple smaller tracks. This impacts downstream temporal querying applications degrading query accuracy.In this paper, we propose an algorithm, TMerge for identifying and merging fragmented tracks that constitutes a pre-processing step during data ingestion for video query processing. The algorithm exploits the properties of the problem and utilizes a sampling methodology that significantly reduces the time required to pre-process and ingest the video sequence.We comprehensively describe and analyze our proposals utilizing real data sets and also present the results of a detailed experimental evaluation varying parameters of interest. We demonstrate performance savings of up to two orders of magnitude without loss in accuracy.",
    "citationCount": 9,
    "referenceCount": 54
}