{
    "paperId": "2f33344e0d810f419307875bcc646bdcc757fcbd",
    "title": "TorchProbe: Fuzzing Dynamic Deep Learning Compilers",
    "year": 2023,
    "venue": "Asian Symposium on Programming Languages and Systems",
    "authors": [
        "Qidong Su",
        "Chuqin Geng",
        "Gennady Pekhimenko",
        "Xujie Si"
    ],
    "doi": "10.48550/arXiv.2310.20078",
    "arxivId": "2310.20078",
    "url": "https://www.semanticscholar.org/paper/2f33344e0d810f419307875bcc646bdcc757fcbd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Static and dynamic computational graphs represent two distinct approaches to constructing deep learning frameworks. The former prioritizes compiler-based optimizations, while the latter focuses on programmability and user-friendliness. The recent release of PyTorch 2.0, which supports compiling arbitrary deep learning programs in Python, signifies a new direction in the evolution of deep learning infrastructure to incorporate compiler techniques in a more dynamic manner and support more dynamic language features like dynamic control flows and closures. Given PyTorch's seamless integration with Python, its compiler aims to support arbitrary deep learning code written in Python. However, the inherent dynamism of Python poses challenges to the completeness and robustness of the compiler. While recent research has introduced fuzzing to test deep learning compilers, there is still a lack of comprehensive analysis on how to test dynamic features. To address this issue, we propose several code transformations to generate test cases involving dynamic features. These transformations preserve the program's semantics, ensuring that any discrepancy between the transformed and original programs indicates the presence of a bug. Through our approach, we have successfully identified twenty previously unknown bugs in the PyTorch compiler and its underlying tensor compiler Triton.",
    "citationCount": 3,
    "referenceCount": 59
}