{
    "paperId": "2f5c7fb4820fc6d4ea653eb73e1edb0c0704e05a",
    "title": "DAG*: A Novel A*-Alike Algorithm for Optimal Workflow Execution Across IoT Platforms",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Errikos Streviniotis",
        "Dimitrios Banelas",
        "Nikos Giatrakos",
        "Antonios Deligiannakis"
    ],
    "doi": "10.1109/ICDE65448.2025.00066",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2f5c7fb4820fc6d4ea653eb73e1edb0c0704e05a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many IoT applications from diverse domains rely on real-time, online analytics workflow execution to timely support decision making procedures. The efficient execution of analytics workflows requires the utilization of the processing power available across the cloud to edge continuum. Nonetheless, suggesting the optimal workflow execution over a large network of heterogeneous devices is a challenging task. The increased IoT network size increases the complexity of the optimization problem at hand. The ingested data streams exhibit highly volatile properties. The population of network devices dynamically changes. We introduce DAG*, an A*-alike algorithm that prunes large amounts of the search space explored for suggesting the most efficient workflow execution with formal optimality guarantees. We provide an incremental version of DAG* retaining the optimality property. Our experimentation in real-world scenarios shows that DAG* suggests the optimal workflow execution with 3 to 31 orders of magnitude fewer iterations compared to the entire search space size, outperforming heuristics employed in prior state of the art up to x4.S wrt the goodness of the suggested workflow.",
    "citationCount": 1,
    "referenceCount": 37
}