{
    "paperId": "2f685c0739798e629788abbeba2bafc35f953fa1",
    "title": "Intelligent Malicious URL Classification with ANOVA-F and XGBoost",
    "year": 2025,
    "venue": "2025 International Conference on Computing, Intelligence, and Application (CIACON)",
    "authors": [
        "Divya Kapil",
        "Vinay Prasad Tamta"
    ],
    "doi": "10.1109/CIACON65473.2025.11189297",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2f685c0739798e629788abbeba2bafc35f953fa1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The surge in internet usage has amplified the threat of malicious URLs, which are frequently used in cyberattacks such as phishing, malware distribution, and fraud. Machine learning presents a powerful solution for detecting these threats by analyzing patterns in large URL datasets, though its success relies on effective feature selection and classifier choice. In this study, we developed an advanced machine-learning model for malicious URL detection using a comprehensive dataset with 80 features. We employed the ANOVA F-test for feature selection, reducing dimensionality while retaining impactful features, and evaluated multiple classifiers, including random forest, support vector machine, logistic regression, and XGBoost. The results revealed that XGBoost and Random Forest achieved superior performance, demonstrating high detection rates and low false positive rates. Our findings validate that combining effective feature selection with robust classifiers can significantly enhance detection accuracy, providing a reliable framework for proactive cybersecurity measures. The proposed model also ensures scalability and adaptability to evolving threat landscapes. Future work will explore deep learning techniques and real-time detection capabilities to further strengthen the defense against malicious URLs.",
    "citationCount": 0,
    "referenceCount": 17
}