{
    "paperId": "2f88c632edd76ae8550e65eb0f017dc6669be48f",
    "title": "Dual Contrastive Learning for Efficient Static Feature Representation in Sequential Recommendations",
    "year": 2024,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "P. Li",
        "Maofei Que",
        "Alexander Tuzhilin"
    ],
    "doi": "10.1109/TKDE.2023.3289469",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2f88c632edd76ae8550e65eb0f017dc6669be48f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Static user and item features constitute important information to be taken into account in the recommendation process. However, as these features are usually sparse and of large-vocabulary, existing deep learning-based methods typically construct large tables of high-dimensional feature embeddings, which is inefficient in terms of memory storage and is computationally problematic. On the other hand, while product quantization-based methods have been proposed to compress latent embeddings, they usually come at the cost of compromising recommendation performance due to the restrictive expressive power, as feature correlations and user-item interactions are not properly captured in the compression process. To address these issues, we propose a novel Dual Contrastive Learning method to generate low-dimensional discrete static feature representations that significantly reduce memory storage and computational complexity, while simultaneously producing superior recommendation performance. Extensive offline experiments on three large-scale industrial datasets demonstrate that our proposed model significantly outperforms the selected baselines. In addition, we conducted an online A/B test at Alibaba and show that the proposed model significantly improves the average video streaming time, while reducing the size of the feature embedding table by 90% over the currently deployed system.",
    "citationCount": 5,
    "referenceCount": 61
}