{
    "paperId": "2fc6e68ea5ebb1c0b9b34ee1de2455e2419d6605",
    "title": "Automated Detection of Anomalous Events in Surveillance Video Scenes Using Deep Learning Techniques",
    "year": 2023,
    "venue": "2023 7th International Conference on Computation System and Information Technology for Sustainable Solutions (CSITSS)",
    "authors": [
        "Abhishek S. Rao",
        "Karthik Pai B H",
        "Sathvik R Rao",
        "Samarth Prathap M",
        "Anjani Prabhu K",
        "Rakshitha K"
    ],
    "doi": "10.1109/CSITSS60515.2023.10334204",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/2fc6e68ea5ebb1c0b9b34ee1de2455e2419d6605",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The identification of anomalous events in surveillance camera situations is a critical issue in public safety and security. Traditional surveillance systems, reliant on human operators, are labor-intensive and prone to errors. To address this challenge, we propose a deep learning approach for the automated detection of unusual events in surveillance video scenes. Utilizing the remarkable performance of deep learning techniques in computer vision, we extract spatiotemporal information from video frames and classify them as normal or unusual using a combination of convolutional neural networks (CNNs) and long short-term memory (LSTM) networks. The objective of this project is to develop a deep learning approach that overcomes the limitations of traditional video surveillance systems by automatically detecting and classifying unusual events. The proposed approach combines CNNs to extract spatial features and LSTMs to model temporal dependencies between frames, effectively capturing both spatial and temporal characteristics of video scenes. Experiments were conducted on two public datasets for abnormal event detection, and the proposed approach outperformed state-of-the-art methods, achieving an accuracy of 80%. The significant implications of this approach for public safety and security lie in its ability to improve the accuracy and efficiency of video surveillance systems while reducing the workload of human operators. By automating the detection of unusual events, this deep learning approach can enhance overall surveillance capabilities and help prevent critical security issues.",
    "citationCount": 2,
    "referenceCount": 15
}