{
    "paperId": "300823792f3854a857c452259455fe4b162c3104",
    "title": "Query Processing on Tensor Computation Runtimes",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Dong He",
        "Supun Nakandala",
        "Dalitso Banda",
        "Rathijit Sen",
        "Karla Saur",
        "Kwanghyun Park",
        "C. Curino",
        "Jes'us Camacho-Rodr'iguez",
        "Konstantinos Karanasos",
        "Matteo Interlandi"
    ],
    "doi": "10.14778/3551793.3551833",
    "arxivId": "2203.01877",
    "url": "https://www.semanticscholar.org/paper/300823792f3854a857c452259455fe4b162c3104",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2203.01877",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The huge demand for computation in artificial intelligence (AI) is driving unparalleled investments in hardware and software systems for AI. This leads to an explosion in the number of specialized hardware devices, which are now offered by major cloud vendors. By hiding the low-level complexity through a tensor-based interface, tensor computation runtimes (TCRs) such as PyTorch allow data scientists to efficiently exploit the exciting capabilities offered by the new hardware. In this paper, we explore how database management systems can ride the wave of innovation happening in the AI space.\n We design, build, and evaluate Tensor Query Processor (TQP): TQP transforms SQL queries into tensor programs and executes them on TCRs. TQP is able to run the full TPC-H benchmark by implementing novel algorithms for relational operators on the tensor routines. At the same time, TQP can support various hardware while only requiring a fraction of the usual development effort. Experiments show that TQP can improve query execution time by up to 10X over specialized CPU- and GPU-only systems. Finally, TQP can accelerate queries mixing ML predictions and SQL end-to-end, and deliver up to 9X speedup over CPU baselines.",
    "citationCount": 44,
    "referenceCount": 136
}