{
    "paperId": "300fc797c012f8a2b1e41a8ae3dce8ceb6cb17a2",
    "title": "A Survey on Federated Analytics: Taxonomy, Enabling Techniques, Applications and Open Issues",
    "year": 2024,
    "venue": "IEEE Communications Surveys &amp; Tutorials",
    "authors": [
        "Zibo Wang",
        "Haichao Ji",
        "Yifei Zhu",
        "Dan Wang",
        "Zhu Han"
    ],
    "doi": "10.48550/arXiv.2404.12666",
    "arxivId": "2404.12666",
    "url": "https://www.semanticscholar.org/paper/300fc797c012f8a2b1e41a8ae3dce8ceb6cb17a2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The escalating influx of data generated by networked edge devices, coupled with the growing awareness of data privacy, has restricted the traditional data analytics workflow, where the edge data are gathered by a centralized server to be further utilized by data analysts. To continue leveraging vast edge data to support various data-incentive applications, computing paradigms have promoted a transformative shift from centralized data processing to privacy-preserved distributed data processing. The need to perform data analytics on private edge data motivates federated analytics (FA), an emerging technique to support collaborative data analytics among diverse data owners without centralizing the raw data. Despite the wide applications of FA in industry and academia, a comprehensive examination of existing research efforts in FA has been notably absent. This survey aims to bridge this gap by first providing an overview of FA, elucidating key concepts, and discussing its relationship with similar concepts. We then thoroughly examine FA, including its key challenges, taxonomy, and enabling techniques. Diverse FA applications, including statistical metrics, frequency-related applications, database query operations, FL-assisting FA tasks, and other wireless network applications are then carefully reviewed. We complete the survey with several open research issues, future directions, and a comprehensive lessons learned part. This survey intends to provide a holistic understanding of the emerging FA techniques and foster the continued evolution of privacy-preserving distributed data processing in the emerging networked society.",
    "citationCount": 4,
    "referenceCount": 240
}