{
    "paperId": "30716945afe2e1db747dbed9632761d4e1d9d7f8",
    "title": "Computational Advertising: Recent Advances",
    "year": 2025,
    "venue": "The Web Conference",
    "authors": [
        "Junwei Pan",
        "Zhilin Zhang",
        "Han Zhu",
        "Jian Xu",
        "Jie Jiang",
        "Bo Zheng"
    ],
    "doi": "10.1145/3701716.3715872",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/30716945afe2e1db747dbed9632761d4e1d9d7f8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Computational advertising is one of the most successful application scenarios of machine learning and artificial intelligence. This tutorial is designed to review the latest progress of several critical areas in computational advertising: matching, prediction, auction and bidding. Particularly, with the recent advances in generative AI such as large language models, there is a growing interest in further enhancing these areas with these techniques. In this tutorial, we first introduce the recent advances in matching, including its architecture alternatives, model developments, and how it co-evolves with the ad products which distinguishes itself from that in recommendation products. We then review the recent advances in prediction, with a focus on topics such as feature interactions, user interest models, and multi-task/domain learning. We will show how these building bricks constitute large prediction models and LLM-enhanced/LLM-based prediction models. Then, we discuss auction and bidding, a unique area in computational advertising. Both traditional and learning-based auctions will be introduced, followed by their applications in real-world ad products. Given the auction designs, we show how bidding evolves from control-based, to reinforcement learning-based, and most recently to generative AI-based. Our aim is to help the audience grasp the recent developments in computational advertising, as well as to spark inspiration for future research.",
    "citationCount": 0,
    "referenceCount": 86
}