{
    "paperId": "30bee7c88ecb3a341904d674988bb1cece0fdec3",
    "title": "MASS: A Multiattribute Sketch Secure Data Sharing Scheme for IoT Wearable Medical Devices Based on Blockchain",
    "year": 2025,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Lin Chen",
        "Yuxiang Chen",
        "Wei Liang",
        "Xiong Li",
        "Kuan Ching Li",
        "Jin Wang",
        "Neal N. Xiong"
    ],
    "doi": "10.1109/JIOT.2024.3468733",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/30bee7c88ecb3a341904d674988bb1cece0fdec3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the swift advancement of the Internet of Things (IoT) and artificial intelligence (AI), various technologies have been integrated into wearable medical health devices, improving users’ awareness of their physical states and enabling the analysis of a greater amount of human data. However, these sensitive pieces of information are prone to tampering or theft during storage and transmission, posing security risks. In this article, we propose a multiattribute sketch secure data sharing scheme for IoT wearable medical devices based on blockchain (MASS). We introduce a multiattribute sketch storage method that stores the encrypted hash of health data transmitted by medical wearable devices on the blockchain. This work also designs a ciphertext-policy attribute-based encryption (CP-ABE) access control mechanism that effectively addresses the secure sharing of data from wearable medical devices among healthcare professionals. Experimental findings indicate that with the rise in the number of medical health data documents, the costs associated with index generation and search time decrease by 55.3% and 10.83%, respectively. Additionally, as the frequency of data access increases, there is a 13.5% reduction in encryption time, and the implementation of multiattribute sketches results in a 24.8% and 11.3% reduction in index generation and search times, respectively.",
    "citationCount": 5,
    "referenceCount": 38
}