{
    "paperId": "30ee1ca3994f1749db58d32a70ce53b8bdc02df9",
    "title": "A survey of multimodal event detection based on data fusion",
    "year": 2024,
    "venue": "The VLDB journal",
    "authors": [
        "Manuel Mondal",
        "Mourad Khayati",
        "Hông-Ân Sandlin",
        "Philippe Cudré-Mauroux"
    ],
    "doi": "10.1007/s00778-024-00878-5",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/30ee1ca3994f1749db58d32a70ce53b8bdc02df9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s00778-024-00878-5",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n With the emergence of the Internet of Things (IoT) and the rise of shared multimedia content on social media networks, available datasets have become increasingly heterogeneous. Several multimodal techniques for detecting events in data of different types and formats have emerged. Those techniques implement various detection algorithms and present different trade-offs in terms of data fusion. Unfortunately, little is known about their underlying detection mechanisms, as existing comparisons are limited to either unimodal event detection techniques or specific types or representations for multimodal techniques. Understanding the behavior of multimodal event detection techniques remains an acute open research problem. In this work, we present a systematic literature review of multimodal event detection techniques. We describe how various techniques leverage information from different modalities through data fusion. We further propose a novel taxonomy of multimodal event detection techniques according to their temporal orientation and the inner workings of their detection mechanism. Finally, we analyze the datasets and metrics used in previous works as well as their reported results. Our survey allows to uncover the properties of each approach and discuss future research directions in this field.",
    "citationCount": 4,
    "referenceCount": 82
}