{
    "paperId": "30f73939577f576bbde64c58ac8214af325df796",
    "title": "Estimating the electrical power output of industrial devices with end-to-end time-series classification in the presence of label noise",
    "year": 2021,
    "venue": "ECML/PKDD",
    "authors": [
        "Andrea Castellani",
        "Sebastian Schmitt",
        "B. Hammer"
    ],
    "doi": "10.1007/978-3-030-86486-6_29",
    "arxivId": "2105.00349",
    "url": "https://www.semanticscholar.org/paper/30f73939577f576bbde64c58ac8214af325df796",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2105.00349",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In complex industrial settings, it is common practice to monitor the operation of machines in order to detect undesired states, adjust maintenance schedules, optimize system performance or collect usage statistics of individual machines. In this work, we focus on estimating the power output of a Combined Heat and Power (CHP) machine of a medium-sized company facility by analyzing the total facility power consumption. We formulate the problem as a time-series classification problem where the class label represents the CHP power output. As the facility is fully instrumented and sensor measurements from the CHP are available, we generate the training labels in an automated fashion from the CHP sensor readings. However, sensor failures result in mislabeled training data samples which are hard to detect and remove from the dataset. Therefore, we propose a novel multi-task deep learning approach that jointly trains a classifier and an autoencoder with a shared embedding representation. The proposed approach targets to gradually correct the mislabelled data samples during training in a self-supervised fashion, without any prior assumption on the amount of label noise. We benchmark our approach on several time-series classification datasets and find it to be comparable and sometimes better than state-of-the-art methods. On the real-world use-case of predicting the CHP power output, we thoroughly evaluate the architectural design choices and show that the final architecture considerably increases the robustness of the learning process and consistently beats other recent state-of-the-art algorithms in the presence of unstructured as well as structured label noise.",
    "citationCount": 22,
    "referenceCount": 58
}