{
    "paperId": "30fcde1d6db07b8ce76b0e98ef9d86adba134a59",
    "title": "ProS: data series progressive k-NN similarity search and classification with probabilistic quality guarantees",
    "year": 2022,
    "venue": "The VLDB journal",
    "authors": [
        "Karima Echihabi",
        "Theophanis Tsandilas",
        "Anna Gogolou",
        "A. Bezerianos",
        "Themis Palpanas"
    ],
    "doi": "10.1007/s00778-022-00771-z",
    "arxivId": "2212.13310",
    "url": "https://www.semanticscholar.org/paper/30fcde1d6db07b8ce76b0e98ef9d86adba134a59",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2212.13310",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing systems dealing with the increasing volume of data series cannot guarantee interactive response times, even for fundamental tasks such as similarity search. Therefore, it is necessary to develop analytic approaches that support exploration and decision making by providing progressive results, before the final and exact ones have been computed. Prior works lack both efficiency and accuracy when applied to large-scale data series collections. We present and experimentally evaluate ProS, a new probabilistic learning-based method that provides quality guarantees for progressive nearest neighbor (NN) query answering. We develop our method for k -NN queries and demonstrate how it can be applied with the two most popular distance measures, namely Euclidean and dynamic time warping. We provide both initial and progressive estimates of the final answer that are getting better during the similarity search, as well suitable stopping criteria for the progressive queries. Moreover, we describe how this method can be used in order to develop a progressive algorithm for data series classification (based on a k -NN classifier), and we additionally propose a method designed specifically for the classification task. Experiments with several and diverse synthetic and real datasets demonstrate that our prediction methods constitute the first practical solutions to the problem, significantly outperforming competing approaches.",
    "citationCount": 16,
    "referenceCount": 146
}