{
    "paperId": "313b35dae184ce0f7053e23ec22e538210e26c20",
    "title": "Accelerating Cloud-Native Databases with Distributed PMem Stores",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Jason Sun",
        "Haoxiang Ma",
        "Li Zhang",
        "Huicong Liu",
        "Haiyang Shi",
        "Shangyu Luo",
        "Kai Wu",
        "Kevin Bruhwiler",
        "Cheng Zhu",
        "Yuanyuan Nie",
        "Jianjun Chen",
        "Lei Zhang",
        "Y. Liang"
    ],
    "doi": "10.1109/ICDE55515.2023.00233",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/313b35dae184ce0f7053e23ec22e538210e26c20",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Relational databases have gone through a phase of architectural transition from a monolithic to a distributed architecture to take full advantage of cloud technology. These distributed databases can leverage remote storage to maintain larger amounts of data than monolithic databases at the cost of increased latency. At ByteDance, we have built a distributed database called veDB based on the popular compute-storage separation architecture, however we have observed the system is unable to provide both low latency and high throughput required by some business critical applications, such as batched order processing.In this paper we present our novel approaches to tackle this problem. We have modified our system’s storage to utilize persistent memory (PMem) coupled with a remote direct memory access (RDMA) network to reduce read/write latency and increase the throughput. We also propose a query push-down framework to push partial computations to the PMem storage layer to accelerate analytical queries and reduce the impact of the transaction workload in the computation layer. Our experiments show that our methods improve the throughput by up to 1.5× and reduce latency by up to 20× for standard benchmarks and real-world applications.",
    "citationCount": 4,
    "referenceCount": 83
}