{
    "paperId": "3158b45ffd7467d047e7ec58bd2e899dbc5f7c47",
    "title": "A Deep Reinforcement Learning Approach to Efficient Drone Mobility Support",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Yun Chen",
        "Xingqin Lin",
        "T. Khan",
        "Mohammad Mozaffari"
    ],
    "doi": null,
    "arxivId": "2005.05229",
    "url": "https://www.semanticscholar.org/paper/3158b45ffd7467d047e7ec58bd2e899dbc5f7c47",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing deployment of drones in a myriad of applications relies on seamless and reliable wireless connectivity for safe control and operation of drones. Cellular technology is a key enabler for providing essential wireless services to flying drones in the sky. Existing cellular networks targeting terrestrial usage can support the initial deployment of low-altitude drone users, but there are challenges such as mobility support. In this paper, we propose a novel handover framework for providing efficient mobility support and reliable wireless connectivity to drones served by a terrestrial cellular network. Using tools from deep reinforcement learning, we develop a deep Q-learning algorithm to dynamically optimize handover decisions to ensure robust connectivity for drone users. Simulation results show that the proposed framework significantly reduces the number of handovers at the expense of a small loss in signal strength relative to the baseline case where a drone always connect to a base station that provides the strongest received signal strength.",
    "citationCount": 7,
    "referenceCount": 33
}