{
    "paperId": "317cf7a3b8ba7655a993cf1e471dabc26330ee3d",
    "title": "Genetic dissection of root traits in a rice ‘global MAGIC’ population for candidate traits to breed for reduced methane emission",
    "year": 2025,
    "venue": "Frontiers in Plant Science",
    "authors": [
        "Ripon Kumar Roy",
        "Gopal Misra",
        "Shaina Sharma",
        "Bandana Pahi",
        "Seyed Mahdi Hosseiniyan Khatibi",
        "K. Trijatmiko",
        "Sung-Ryul Kim",
        "Jose E. Hernandez",
        "Amelia Henry",
        "N. Sreenivasulu",
        "M. G. Q. Diaz",
        "E. T. M. Ocampo",
        "Pallavi Sinha",
        "Ajay Kohli"
    ],
    "doi": "10.3389/fpls.2025.1616424",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/317cf7a3b8ba7655a993cf1e471dabc26330ee3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rice cultivation is critical for global food security. The largely practiced method of rice cultivation by transplantation under flooded fields contributes significantly to methane (CH4) emissions, posing challenges to climate-smart agriculture. This study uses a multi-parent advanced generation inter-cross (MAGIC) population of 250 rice genotypes to understand the genetic basis of root traits that may govern CH4 mitigation. Phenotyping under controlled greenhouse conditions revealed significant variation in root diameter (0.122–0.481 mm) and porosity (5.344–56.793%), and strong correlations between root diameter and porosity traits (r = 0.40–0.50, p < 0.001). Association studies revealed key candidate genes including Os05g0411200 (thermosensitive chloroplast development), Os10g0177300 (chalcone synthase), and Os04g0405300 (alcohol dehydrogenase), which regulate aerenchyma formation and auxin homeostasis. Protein-protein interaction networks linked these genes to flavonoid biosynthesis (KEGG map00941) and N-glycan pathways, earlier identified as critical for root architecture. Haplotype-phenotype analysis revealed 8 superior haplotypes across 7 genes for average root porosity, base root porosity, root diameter, and tip root porosity. These findings provide the foundation for breeding high-yielding rice varieties with reduced methane emissions, addressing the challenges of food security and climate change.",
    "citationCount": 0,
    "referenceCount": 69
}