{
    "paperId": "317f0943f1b2a893625d7645370f6796ad1b95da",
    "title": "Learning to Sample: Counting with Complex Queries",
    "year": 2019,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Brett Walenz",
        "Stavros Sintos",
        "Sudeepa Roy",
        "Jun Yang"
    ],
    "doi": "10.14778/3368289.3368302",
    "arxivId": "1906.09335",
    "url": "https://www.semanticscholar.org/paper/317f0943f1b2a893625d7645370f6796ad1b95da",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1906.09335",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n We study the problem of efficiently estimating counts for queries involving complex filters, such as user-defined functions, or predicates involving self-joins and correlated subqueries. For such queries, traditional sampling techniques may not be applicable due to the complexity of the filter preventing sampling over joins, and sampling after the join may not be feasible due to the cost of computing the full join. The other natural approach of training and using an inexpensive classifier to estimate the count instead of the expensive predicate suffers from the difficulties in training a good classifier and giving meaningful confidence intervals. In this paper we propose a new method of\n learning to sample\n where we combine the best of both worlds by using sampling in two phases. First, we use samples to learn a probabilistic classifier, and then use the classifier to design a stratified sampling method to obtain the final estimates. We theoretically analyze algorithms for obtaining an optimal stratification, and compare our approach with a suite of natural alternatives like quantification learning, weighted and stratified sampling, and other techniques from the literature. We also provide extensive experiments in diverse use cases using multiple real and synthetic datasets to evaluate the quality, efficiency, and robustness of our approach.\n",
    "citationCount": 16,
    "referenceCount": 27
}