{
    "paperId": "3196b1ef42a98d7dea501277dff05f24868e483f",
    "title": "PRE-SERVICE LANGUAGE TEACHERS’ READINESS FOR DEEP LEARNING APPROACHES: INSIGHTS FROM A CROSS-REGIONAL STUDY IN ASIA",
    "year": 2025,
    "venue": "LLT Journal: A Journal on Language and Language Teaching",
    "authors": [
        "Muhammad Aridan",
        "Umi Hijriyah",
        "Kushieva Nodira Khabibjonovna",
        "Hui Geng",
        "Inamul Azad",
        "T. Elyas"
    ],
    "doi": "10.24071/llt.v28i2.12274",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3196b1ef42a98d7dea501277dff05f24868e483f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study examines the readiness of pre-service language teachers from five Asian countries (China, Indonesia, Uzbekistan, Saudi Arabia, and India) to implement deep learning strategies. A total of 6,113 participants completed a Likert-scale readiness questionnaire administered via Google Forms, and their responses were analyzed using the Rasch model, focusing on their preparedness in pedagogical, technological, and affective dimensions. The results revealed significant regional differences, with teachers from China demonstrating the highest levels of readiness, particularly in pedagogical and technological aspects, due to stronger institutional support. In contrast, teachers from India and Indonesia showed lower readiness, particularly in technological integration and institutional support. Gender differences were also observed, with female teachers showing higher readiness in pedagogical and affective areas. Age played a role, with teachers aged 26–35 years showing higher levels of readiness compared to younger participants. The findings highlight the need for teacher education programs to tailor their approaches to address regional, gender, and age-related differences, ensuring that all pre-service teachers are prepared to implement deep learning strategies effectively in diverse contexts.",
    "citationCount": 0,
    "referenceCount": 61
}