{
    "paperId": "31b133c89c06b0868728828cd4a34425441835c3",
    "title": "ExtraPeak: Advanced Automatic Performance Modeling for HPC Applications",
    "year": 2020,
    "venue": "Software for Exascale Computing",
    "authors": [
        "A. Calotoiu",
        "Marcin Copik",
        "T. Hoefler",
        "M. Ritter",
        "Sergei Shudler",
        "F. Wolf"
    ],
    "doi": "10.1007/978-3-030-47956-5_15",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/31b133c89c06b0868728828cd4a34425441835c3",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007%2F978-3-030-47956-5_15.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Performance models are powerful tools allowing developers to understand the behavior of their applications, and empower them to address performance issues already during the design or prototyping phase. Unfortunately, the difficulties of creating such models manually and the effort involved render performance modeling a topic limited to a relatively small community of experts. This article summarizes the results of the two projects Catwalk, which aimed to create tools that automate key activities of the performance modeling process, and ExtraPeak, which built upon the results of Catwalk and worked toward making this powerful methodology more flexible, streamlined and easy to use. The sew projects both provide accessible tools and methods that bring performance modeling to a wider audience of HPC application developers. Since its outcome represents the final state of the two projects, we expand to a greater extent on the results of ExtraPeak.",
    "citationCount": 10,
    "referenceCount": 56
}