{
    "paperId": "31d06ef3183face16d9b1eacee107a62b12039b3",
    "title": "5-Hydroxymethylcytosine signatures in circulating cell-free DNA as potential diagnostic markers for breast cancer.",
    "year": 2025,
    "venue": "Biomarkers in Medicine",
    "authors": [
        "Nadire Aishan",
        "Siwei Ju",
        "Zhongqiu Zheng",
        "Yongxia Chen",
        "Qingna Meng",
        "Qina He",
        "Jiahang Zhang",
        "Jiaheng Lang",
        "Bojian Xie",
        "Lidan Jin",
        "Jun Shen",
        "Yi Lu",
        "Yangjun Cai",
        "Feiyang Ji",
        "Feilin Cao",
        "Linbo Wang"
    ],
    "doi": "10.1080/17520363.2025.2483156",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/31d06ef3183face16d9b1eacee107a62b12039b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "AIMS\nBreast cancer is one of the most prevalent cancers among women, and early diagnosis is crucial in reducing the mortality rate. This study aims to identify novel, reliable, and specific biomarkers for breast cancer diagnosis using 5-Hydroxymethylcytosine (5hmC) signatures in circulating cell-free DNA (cfDNA).\n\n\nMATERIALS AND METHODS\nWe utilized the sensitive 5hmC seal method to map 5hmC profiles in cfDNA samples from 203 breast cancer patients and 60 healthy individuals. Machine learning models were applied to identify 5hmC marker signatures with high sensitivity and specificity.\n\n\nRESULTS\nA global loss of 5hmC was observed in the blood samples from cancer patients compared to the control group. Several specific 5hmC marker signatures were identified, providing a basis for distinguishing between tumor and healthy individuals.\n\n\nCONCLUSIONS\nOur study offers a comprehensive understanding of genome-wide 5hmC in cfDNA from breast cancer patients, and identifies valuable epigenetic biomarkers for the minimally invasive diagnosis of breast cancer.",
    "citationCount": 0,
    "referenceCount": 58
}