{
    "paperId": "31fb5037b5fb3b6980ed528d67daf9ca9ae3513b",
    "title": "Statistical Mechanics and Artificial Neural Networks: Principles, Models, and Applications",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Lucas Böttcher",
        "Gregory R. Wheeler"
    ],
    "doi": "10.1142/9789819800827_0003",
    "arxivId": "2405.10957",
    "url": "https://www.semanticscholar.org/paper/31fb5037b5fb3b6980ed528d67daf9ca9ae3513b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The field of neuroscience and the development of artificial neural networks (ANNs) have mutually influenced each other, drawing from and contributing to many concepts initially developed in statistical mechanics. Notably, Hopfield networks and Boltzmann machines are versions of the Ising model, a model extensively studied in statistical mechanics for over a century. In the first part of this chapter, we provide an overview of the principles, models, and applications of ANNs, highlighting their connections to statistical mechanics and statistical learning theory. Artificial neural networks can be seen as high-dimensional mathematical functions, and understanding the geometric properties of their loss landscapes (i.e., the high-dimensional space on which one wishes to find extrema or saddles) can provide valuable insights into their optimization behavior, generalization abilities, and overall performance. Visualizing these functions can help us design better optimization methods and improve their generalization abilities. Thus, the second part of this chapter focuses on quantifying geometric properties and visualizing loss functions associated with deep ANNs.",
    "citationCount": 0,
    "referenceCount": 141
}