{
    "paperId": "322bf1a636cb7fba722b94b4731a2f1a227db78e",
    "title": "Neural Distributed Autoassociative Memories: A Survey",
    "year": 2017,
    "venue": "arXiv.org",
    "authors": [
        "V. Gritsenko",
        "D. Rachkovskij",
        "A. Frolov",
        "R. Gayler",
        "D. Kleyko",
        "Evgeny Osipov"
    ],
    "doi": "10.15407/kvt188.02.005",
    "arxivId": "1709.00848",
    "url": "https://www.semanticscholar.org/paper/322bf1a636cb7fba722b94b4731a2f1a227db78e",
    "isOpenAccess": true,
    "openAccessPdf": "http://kvt-journal.org.ua/content/2017/188/1-Gritsenko.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction. Neural network models of autoassociative, distributed memory allow storage and retrieval of many items (vectors) where the number of stored items can exceed the vector dimension (the number of neurons in the network). This opens the possibility of a sublinear time search (in the number of stored items) for approximate nearest neighbors among vectors of high dimension. The purpose of this paper is to review models of autoassociative, distributed memory that can be naturally implemented by neural networks (mainly with local learning rules and iterative dynamics based on information locally available to neurons). Scope. The survey is focused mainly on the networks of Hopfield, Willshaw and Potts, that have connections between pairs of neurons and operate on sparse binary vectors. We discuss not only autoassociative memory, but also the generalization properties of these networks. We also consider neural networks with higher-order connections and networks with a bipartite graph structure for non-binary data with linear constraints. Conclusions. In conclusion we discuss the relations to similarity search, advantages and drawbacks of these techniques, and topics for further research. An interesting and still not completely resolved question is whether neural autoassociative memories can search for approximate nearest neighbors faster than other index structures for similarity search, in particular for the case of very high dimensional vectors.",
    "citationCount": 33,
    "referenceCount": 151
}