{
    "paperId": "32424c7d5e0407ac067c715f77bb5ace55aa9293",
    "title": "Optimization of network edge video caching based on machine learning",
    "year": 2024,
    "venue": "International journal of communication and information technology",
    "authors": [
        "Misbah Ullah",
        "Xiaopeng Wang",
        "Murtaza Khan",
        "Jalalud Din",
        "Sohail Khan"
    ],
    "doi": "10.33545/2707661x.2024.v5.i1b.83",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/32424c7d5e0407ac067c715f77bb5ace55aa9293",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper investigates the applicability of machine learning (ML) approaches in enhancing video caching at the network edge. To improve the video delivery performance and minimize the latency level, we employed different Machine Learning techniques, such as Random Forest, Linear Regression, and Bayesian Regression. Regarding the performance assessment of the proposed ML-driven caching strategies, we have utilized datasets from video streaming structures and simulated network scenarios. In the Random Forest model application, an enhanced cache hit ratios were determined with the conventional methods being improved by 22%. Linear regression and Bayesian regression also showed good results with the performances increased by 18% and 15%. Each of the ML methods provided a consistent reduction to latency with Random Forest providing a 25% reduction during peak periods, Linear Regression at 20% and Bayesian Regression at 18%. First of all, the versatility of the ML methods was observed, which resulted from the ability to address shifts in users’ requirements and the variability of the content during the analysis of the Random Forest model. Although the presented results are quite encouraging, the study also recognizes the increasing concern of user data privacy, especially in the context of privacy-preserving ML-based caching. To sum up, the use of ML techniques for video caching at the network edge shows high effectiveness of cache hit rates and low latency, which opens the way for the application of ML based caching to reform content delivery systems. Privacy issues have been established to be a crucial aspect that requires more research in order to establish the proper way of developing secure and effective video caching mechanisms",
    "citationCount": 0,
    "referenceCount": 43
}