{
    "paperId": "32685b07ab3b153f909ed0b4cfb5653ac2da5941",
    "title": "Scalable Blockchain Analytics: an LLM-Powered Approach",
    "year": 2025,
    "venue": "International Conference on Blockchain",
    "authors": [
        "Mostafa Chegenizadeh",
        "Zixian Pang",
        "Junyong Cao",
        "Lundrim Azemi"
    ],
    "doi": "10.1109/ICBC64466.2025.11114538",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/32685b07ab3b153f909ed0b4cfb5653ac2da5941",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Blockchain analytics is essential for understanding network centralization and operational dynamics, yet it faces challenges such as human error, technical complexity, diverse data formats, and multi-step processes. To address these limitations, this paper proposes a scalable framework powered by large language models (LLMs) to streamline blockchain data analysis. The proposed framework adopts a modular multi-agent architecture with specialized agents: the SQL Agent for data retrieval, the Analysis Agent for data processing, and the Visualization Agent for generating visual representations. This design ensures scalability, efficiency, and adaptability while minimizing reliance on technical expertise and reducing errors. The framework’s effectiveness is demonstrated through a case study on Cardano blockchain data analysis, encompassing tasks such as stake address analysis, staking pool dynamics, delegated stake distribution, and rewards analysis. Comprehensive prompt engineering further optimizes the interaction between LLM agents and blockchain data. As the first study to explore the integration of LLM agents in blockchain analytics, this work highlights the transformative potential of LLM-powered systems for scalable and automated blockchain data analysis.",
    "citationCount": 0,
    "referenceCount": 22
}