{
    "paperId": "327c5b77c975d9809721a7537228de446255d6e4",
    "title": "Classifications and Analysis of Caching Strategies in Information‐Centric Networking for Modern Communication Systems",
    "year": 2025,
    "venue": "Engineering Reports",
    "authors": [
        "Firdous Qaiser",
        "Khoula Said Al Harthy",
        "Mudassar Hussain",
        "Jaroslav Frnda",
        "Rashid Amin",
        "Rahma Gantassi",
        "Muhammad D Zakaria"
    ],
    "doi": "10.1002/eng2.70005",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/327c5b77c975d9809721a7537228de446255d6e4",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1002/eng2.70005",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Information Centric Networking (ICN), a paradigm shift in network design that prioritizes content distribution over host‐centric methods, arises in this dynamic environment. Integrating built‐in network caches into ICN is essential for optimizing content distribution effectiveness, which raises hit rates, boosts throughput, and lowers transmission delays. This paper provides a comprehensive exploration and classification of ICN caching strategies across diverse domains, including the Internet of Things (IoT), Internet of Vehicles (IoV), Mobility ICN, Edge Computing, and Fog Computing. It further offers a detailed analysis of these strategies based on their proposed methods, identifying key trends, strengths, and limitations. Through a balanced performance assessment, the study evaluates these strategies using critical metrics such as cache hit ratio, efficiency, retrieval latency, security, and throughput. Furthermore, the paper highlights open challenges and presents future research directions to advance caching mechanisms, fostering the continued evolution of ICN for scalable and efficient content delivery for users.",
    "citationCount": 3,
    "referenceCount": 203
}