{
    "paperId": "329ecd5cc91585242825a956ebb8405069daf156",
    "title": "A Lightweight Multi-View Learning Approach for Phishing Attack Detection Using Transformer with Mixture of Experts",
    "year": 2023,
    "venue": "Applied Sciences",
    "authors": [
        "Yanbin Wang",
        "Wenrui Ma",
        "Haitao Xu",
        "Yiwei Liu",
        "Peng Yin"
    ],
    "doi": "10.3390/app13137429",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/329ecd5cc91585242825a956ebb8405069daf156",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/13/13/7429/pdf?version=1687751283",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Phishing poses a significant threat to the financial and privacy security of internet users and often serves as the starting point for cyberattacks. Many machine-learning-based methods for detecting phishing websites rely on URL analysis, offering simplicity and efficiency. However, these approaches are not always effective due to the following reasons: (1) highly concealed phishing websites may employ tactics such as masquerading URL addresses to deceive machine learning models, and (2) phishing attackers frequently change their phishing website URLs to evade detection. In this study, we propose a robust, multi-view Transformer model with an expert-mixture mechanism for accurate phishing website detection utilizing website URLs, attributes, content, and behavioral information. Specifically, we first adapted a pretrained language model for URL representation learning by applying adversarial post-training learning in order to extract semantic information from URLs. Next, we captured the attribute, content, and behavioral features of the websites and encoded them as vectors, which, alongside the URL embeddings, constitute the website’s multi-view information. Subsequently, we introduced a mixture-of-experts mechanism into the Transformer network to learn knowledge from different views and adaptively fuse information from various views. The proposed method outperforms state-of-the-art approaches in evaluations of real phishing websites, demonstrating greater performance with less label dependency. Furthermore, we show the superior robustness and enhanced adaptability of the proposed method to unseen samples and data drift in more challenging experimental settings.",
    "citationCount": 17,
    "referenceCount": 52
}