{
    "paperId": "32b9f9e2654b7280671a2be355cbd04c1b7cc2ea",
    "title": "FeB4RAG: Evaluating Federated Search in the Context of Retrieval Augmented Generation",
    "year": 2024,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Shuai Wang",
        "Ekaterina Khramtsova",
        "Shengyao Zhuang",
        "G. Zuccon"
    ],
    "doi": "10.1145/3626772.3657853",
    "arxivId": "2402.11891",
    "url": "https://www.semanticscholar.org/paper/32b9f9e2654b7280671a2be355cbd04c1b7cc2ea",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2402.11891",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Federated search systems aggregate results from multiple search engines, selecting appropriate sources to enhance result quality and align with user intent. With the increasing uptake of Retrieval-Augmented Generation (RAG) pipelines, federated search can play a pivotal role in sourcing relevant information across heterogeneous data sources to generate informed responses. However, existing datasets, such as those developed in the past TREC FedWeb tracks, predate the RAG paradigm shift and lack representation of modern information retrieval challenges. To bridge this gap, we present FeB4RAG, a novel dataset specifically designed for federated search within RAG frameworks. This dataset, derived from 16 sub-collections of the widely used BEIR benchmarking collection, includes 790 information requests (akin to conversational queries) tailored for chatbot applications, along with top results returned by each resource and associated LLM-derived relevance judgements. Additionally, to support the need for this collection, we demonstrate the impact on response generation of a high quality federated search system for RAG compared to a naive approach to federated search. We do so by comparing answers generated by the RAG pipeline with a qualitative side-by-side comparison. Our collection fosters and supports the development and evaluation of new federated search methods, especially in the context of RAG pipelines. The resource is publicly available at https://github.com/ielab/FeB4RAG.",
    "citationCount": 21,
    "referenceCount": 57
}