{
    "paperId": "32fc96c55f2cd1ba08781822b040cc2bf599030a",
    "title": "GateRL: Automated Circuit Design Framework of CMOS Logic Gates Using Reinforcement Learning",
    "year": 2021,
    "venue": "Electronics",
    "authors": [
        "Hyoungsik Nam",
        "Young In Kim",
        "Jina Bae",
        "Junhee Lee"
    ],
    "doi": "10.3390/ELECTRONICS10091032",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/32fc96c55f2cd1ba08781822b040cc2bf599030a",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/10/9/1032/pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper proposes a GateRL that is an automated circuit design framework of CMOS logic gates based on reinforcement learning. Because there are constraints in the connection of circuit elements, the action masking scheme is employed. It also reduces the size of the action space leading to the improvement on the learning speed. The GateRL consists of an agent for the action and an environment for state, mask, and reward. State and reward are generated from a connection matrix that describes the current circuit configuration, and the mask is obtained from a masking matrix based on constraints and current connection matrix. The action is given rise to by the deep Q-network of 4 fully connected network layers in the agent. In particular, separate replay buffers are devised for success transitions and failure transitions to expedite the training process. The proposed network is trained with 2 inputs, 1 output, 2 NMOS transistors, and 2 PMOS transistors to design all the target logic gates, such as buffer, inverter, AND, OR, NAND, and NOR. Consequently, the GateRL outputs one-transistor buffer, two-transistor inverter, two-transistor AND, two-transistor OR, three-transistor NAND, and three-transistor NOR. The operations of these resultant logics are verified by the SPICE simulation.",
    "citationCount": 7,
    "referenceCount": 27
}