{
    "paperId": "333fb3ac1a5c401c756728f927dc88d422f08e5b",
    "title": "FactoryDC: Network and Resource Planning for Emerging Applications in Future Factories",
    "year": 2023,
    "venue": "IIoT-NETs@SIGCOMM",
    "authors": [
        "Marco Reisacher",
        "Reinhard Frank",
        "Andreas Blenk"
    ],
    "doi": "10.1145/3609389.3610564",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/333fb3ac1a5c401c756728f927dc88d422f08e5b",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3609389.3610564",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Today's industrial factory networks have neither been designed for traffic demands of new applications that use machine learning (ML) nor have they considered a deep connection with the cloud. Accordingly, there is a lack of knowledge w.r.t how to plan new factory networks given the new demands of applications using ML and network technology opportunities. We argue that within widely-spanned factory networks, there is indeed a high potential to bring the context of ML applications into consideration. It is important to plan and evaluate different topologies to accommodate said demands. In this paper, we propose a method of analyzing ML models, a network planning concept, and a tool bringing data center networks and factory layouts with ML in mind together. We illustrate and evaluate the proposed method with a concrete use case. The results demonstrate the need for new planning procedures in factories. In particular, they show the impact of flexible network architectures on factory traffic.",
    "citationCount": 2,
    "referenceCount": 11
}