{
    "paperId": "335b7372a82731e7901cd1cfc34be0e958297999",
    "title": "An Innovative Study of Interactive Performance Combining the Art of Drill and Dance with Deep Learning",
    "year": 2024,
    "venue": "Applied Mathematics and Nonlinear Sciences",
    "authors": [
        "Rongbin Yang",
        "Jianwei He"
    ],
    "doi": "10.2478/amns-2024-3448",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/335b7372a82731e7901cd1cfc34be0e958297999",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.2478/amns-2024-3448",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Art",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract This paper starts with the performance of audiovisual, using computer technology animation simulation gymnastics dance team formation, providing a way of arranging choreography. According to the basic elements of the ray tracing algorithm, set up the lighting model to improve the realism of stage rendering. Collect survey data to identify the challenges in creating gymnastics dance, and analyze the advantages of computer technology in the application of gymnastics dance team performance creation and training. Obtain the audience’s overall perception of the interactive performance of gymnastics and dance art, and analyze their satisfaction with all aspects of the choreographic design using holographic technology for gymnastics and dance art. The survey on the satisfaction of the elements of holographic choreography design for the performance of dance manipulation is mainly divided into three aspects, including the real choreography effect, virtual choreography effect and performance music effect, in which the gymnastics dancer’s expressiveness (65.99%), holographic projection screen effect (72.56%), the cooperation between the music and the holographic projection screen (63.77%) are all recognized by the audience, so the use of holographic projection technology in the performance of gymnastics dance manipulation is a good opportunity to get the audience’s satisfaction. The purpose of gymnastics dance teaching in sports education is to develop students’ physical coordination, rhythm, and aesthetic abilities. The introduction of deep learning techniques to gymnastics teaching and performance can not only provide a more vivid and realistic learning environment but also improve students’ interest and performance. To improve the effective strategy of gymnastics dancing performance, it can be achieved through the students’ rich practice activities, strengthening of technical methods, and the form of diversified performance.",
    "citationCount": 0,
    "referenceCount": 13
}