{
    "paperId": "336197384648cee3a5790124b7ab342a28eb88d8",
    "title": "Artificial intelligence for antiviral drug discovery in low resourced settings: A perspective",
    "year": 2022,
    "venue": "Frontiers in Drug Discovery",
    "authors": [
        "Cyril T Namba-Nzanguim",
        "G. Turon",
        "C. V. Simoben",
        "I. Tietjen",
        "L. Montaner",
        "S. M. Efange",
        "Miquel Duran-Frigola",
        "F. Ntie‐Kang"
    ],
    "doi": "10.3389/fddsv.2022.1013285",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/336197384648cee3a5790124b7ab342a28eb88d8",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fddsv.2022.1013285/pdf",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current antiviral drug discovery efforts face many challenges, including development of new drugs during an outbreak and coping with drug resistance due to rapidly accumulating viral mutations. Emerging artificial intelligence and machine learning (AI/ML) methods can accelerate anti-infective drug discovery and have the potential to reduce overall development costs in Low and Middle-Income Countries (LMIC), which in turn may help to develop new and/or accessible therapies against communicable diseases within these countries. While the marketplace currently offers a plethora of data-driven AI/ML tools, most to date have been developed within the context of non-communicable diseases like cancer, and several barriers have limited the translation of existing tools to the discovery of drugs against infectious diseases. Here, we provide a perspective on the benefits, limitations, and pitfalls of AI/ML tools in the discovery of novel therapeutics with a focus on antivirals. We also discuss available and emerging data sharing models including intellectual property-preserving AI/ML. In addition, we review available data sources and platforms and provide examples for low-cost and accessible screening methods and other virus-based bioassays suitable for implementation of AI/ML-based programs in LMICs. Finally, we introduce an emerging AI/ML-based Center in Cameroon (Central Africa) which is currently developing methods and tools to promote local, independent drug discovery and represents a model that could be replicated among LMIC globally.",
    "citationCount": 8,
    "referenceCount": 129
}