{
    "paperId": "33a96df6ca2799a4f3b240099a293529cbae7fbf",
    "title": "Interpretable Learning-to-Rank with Generalized Additive Models",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Honglei Zhuang",
        "Xuanhui Wang",
        "Michael Bendersky",
        "Alexander Grushetsky",
        "Yonghui Wu",
        "Petr Mitrichev",
        "Ethan Sterling",
        "Nathan Bell",
        "Walker Ravina",
        "Hai Qian"
    ],
    "doi": null,
    "arxivId": "2005.02553",
    "url": "https://www.semanticscholar.org/paper/33a96df6ca2799a4f3b240099a293529cbae7fbf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Interpretability of learning-to-rank models is a crucial yet relatively under-examined research area. Recent progress on interpretable ranking models largely focuses on generating post-hoc explanations for existing black-box ranking models, whereas the alternative option of building an intrinsically interpretable ranking model with transparent and self-explainable structure remains unexplored. Developing fully-understandable ranking models is necessary in some scenarios (e.g., due to legal or policy constraints) where post-hoc methods cannot provide sufficiently accurate explanations. In this paper, we lay the groundwork for intrinsically interpretable learning-to-rank by introducing generalized additive models (GAMs) into ranking tasks. Generalized additive models (GAMs) are intrinsically interpretable machine learning models and have been extensively studied on regression and classification tasks. We study how to extend GAMs into ranking models which can handle both item-level and list-level features and propose a novel formulation of ranking GAMs. To instantiate ranking GAMs, we employ neural networks instead of traditional splines or regression trees. We also show that our neural ranking GAMs can be distilled into a set of simple and compact piece-wise linear functions that are much more efficient to evaluate with little accuracy loss. We conduct experiments on three data sets and show that our proposed neural ranking GAMs can achieve significantly better performance than other traditional GAM baselines while maintaining similar interpretability.",
    "citationCount": 12,
    "referenceCount": 61
}