{
    "paperId": "33b14a8486c6a578ae75c54239812700f96b07bf",
    "title": "Scalable and Accurate Density-Peaks Clustering on Fully Dynamic Data",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Daichi Amagata"
    ],
    "doi": "10.1109/BigData55660.2022.10020690",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/33b14a8486c6a578ae75c54239812700f96b07bf",
    "isOpenAccess": true,
    "openAccessPdf": "https://ir.library.osaka-u.ac.jp/repo/ouka/all/92845/Proc-IEEEIntConfBigData,BigData_445.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Clustering is a primitive and important operator that analyzes a given dataset to discover its hidden patterns and features. Because datasets are usually updated dynamically (i.e., it accepts continuous insertions and arbitrary deletions), analyzing such dynamic data is also an important topic, and dynamic clustering effectively supports it, but is a challenging problem. In this paper, we consider the problem of density-peaks clustering (DPC) on dynamic data. DPC is one of the density-based clustering algorithms and attracts attention for many applications, due to its effectiveness. We investigate the hardness of this problem theoretically to measure the efficiencies of dynamic DPC algorithms. We prove that any exact solutions are costly, and propose an approximation algorithm to enable faster updates. We conduct experiments on real datasets, and the results confirm that our algorithm is much faster and more accurate than state-of-the-art.",
    "citationCount": 6,
    "referenceCount": 52
}