{
    "paperId": "33e92da0591712c932a2d0bb9418d14063ad2ada",
    "title": "XHarvest: Rethinking High-Performance and Cost-Efficient SSD Architecture with CXL-Driven Harvesting",
    "year": 2025,
    "venue": "International Symposium on Computer Architecture",
    "authors": [
        "Li Peng",
        "Wenbo Wu",
        "Shushu Yi",
        "Xianzhang Chen",
        "Chenxi Wang",
        "Shengwen Liang",
        "Zhe Wang",
        "Nong Xiao",
        "Qiao Li",
        "Mingzhe Zhang",
        "Jie Zhang"
    ],
    "doi": "10.1145/3695053.3731028",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/33e92da0591712c932a2d0bb9418d14063ad2ada",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The occasional nature of I/O bursts in production clusters makes the substantial and expensive SSD internal hardware resources (e.g., computation and memory resources) always underutilized, resulting in cost inefficiency. Open-Channel SSD (OCSSD), as a pioneering solution, removes the SSD internal resources but rather leverages the host-side resources to serve I/O requests. Unfortunately, it faces adoption obstacles due to the heavy resource contention with user applications, hampered host-SSD collaboration, and proprietary firmware leakage risks. Tackling these challenges, we propose XHarvest, a new cost-efficient and high-performance SSD architecture, which harnesses compute express link (CXL) and trusted execution environment (TEE) to facilitate dynamic, efficient, and secure host resource harvesting. It reserves moderate SSD internal resources to isolate SSD internal tasks and applications under regular I/O loads while coping with occasional I/O bursts via dynamic host resource harvesting. To this end, XHarvest executes the firmware within the host-side TEE without disclosing sensitive algorithms while leveraging the cache-coherent and fine-grained CXL to build a unified and efficient metadata cache. XHarvest also capitalizes on the CXL and its security feature to enable secure and efficient host-SSD collaboration. The evaluation results show that XHarvest reduces the hardware cost by 31.50% while achieving the same or even higher performance than conventional SSDs. It relieves resource contention via dynamic harvesting, reducing 2.27 × execution time over OCSSD in memory-intensive tasks.",
    "citationCount": 1,
    "referenceCount": 108
}