{
    "paperId": "33e998bd2a6b29b555dd300c093b6f2103548369",
    "title": "Is Sharing Caring? Analyzing the Incentives for Shared Cloud Clusters",
    "year": 2023,
    "venue": "International Conference on Performance Engineering",
    "authors": [
        "Talha Mehboob",
        "Noman Bashir",
        "M. Zink",
        "David E. Irwin"
    ],
    "doi": "10.1145/3578244.3583730",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/33e998bd2a6b29b555dd300c093b6f2103548369",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1145/3578244.3583730",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many organizations maintain and operate large shared computing clusters, since they can substantially reduce computing costs by leveraging statistical multiplexing to amortize it across all users. Importantly, such shared clusters are generally not free to use, but have an internal pricing model that funds their operation. Since employees at many large organizations, especially Universities, have some budgetary autonomy over purchase decisions, internal shared clusters are increasingly competing for users with cloud platforms, which may offer lower costs and better performance. As a result, many organizations are shifting their shared clusters to operate on cloud resources. This paper empirically analyzes the user incentives for shared cloud clusters under two different pricing models using an 8-year job trace from a large shared cluster for a large University system. Our analysis shows that, with either pricing model, a large fraction of users have little financial incentive to participate in a shared cloud cluster compared to directly acquiring resources from a cloud platform. While shared cloud clusters can provide some limited reductions in cost by leveraging reserved instances at a discount, due to bursty workloads, realizing these reductions generally requires imposing long job waiting times, which for many users are likely not worth the cost reduction. In particular, we show that, assuming users defect from the shared cluster if their wait time is greater than 15x their average job runtime, over 80% of the users would defect, which increases the price of the remaining users such that it eliminates any incentive to participate in a shared cluster. Thus, while shared cloud clusters may provide users other benefits, their financial incentives are weak.",
    "citationCount": 0,
    "referenceCount": 23
}