{
    "paperId": "33f36d448a0ea4f491eda4775e1e2df5a3319f33",
    "title": "15 years of Big Data: a systematic literature review",
    "year": 2024,
    "venue": "Journal of Big Data",
    "authors": [
        "Davide Tosi",
        "Redon Kokaj",
        "M. Roccetti"
    ],
    "doi": "10.1186/s40537-024-00914-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/33f36d448a0ea4f491eda4775e1e2df5a3319f33",
    "isOpenAccess": true,
    "openAccessPdf": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-024-00914-9",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Big Data is still gaining attention as a fundamental building block of the Artificial Intelligence and Machine Learning world. Therefore, a lot of effort has been pushed into Big Data research in the last 15 years. The objective of this Systematic Literature Review is to summarize the current state of the art of the previous 15 years of research about Big Data by providing answers to a set of research questions related to the main application domains for Big Data analytics; the significant challenges and limitations researchers have encountered in Big Data analysis, and emerging research trends and future directions in Big Data. The review follows a predefined procedure that automatically searches five well-known digital libraries. After applying the selection criteria to the results, 189 primary studies were identified as relevant, of which 32 were Systematic Literature Reviews. Required information was extracted from the 32 studies and summarized. Our Systematic Literature Review sketched the picture of 15 years of research in Big Data, identifying application domains, challenges, and future directions in this research field. We believe that a substantial amount of work remains to be done to align and seamlessly integrate Big Data into data-driven advanced software solutions of the future.",
    "citationCount": 22,
    "referenceCount": 205
}