{
    "paperId": "33ffaccff24702e5a571b43268ba7edc6c18ebd5",
    "title": "DBMS-LLM Integration Strategies in Industrial and Business Applications: Current Status and Future Challenges",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zhengtong Yan",
        "Gongsheng Yuan",
        "Qingsong Guo",
        "Jiaheng Lu"
    ],
    "doi": "10.48550/arXiv.2507.19254",
    "arxivId": "2507.19254",
    "url": "https://www.semanticscholar.org/paper/33ffaccff24702e5a571b43268ba7edc6c18ebd5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern enterprises are increasingly driven by the DATA+AI paradigm, in which Database Management Systems (DBMSs) and Large Language Models (LLMs) have become two foundational infrastructures powering a wide range of industrial and business applications, such as enterprise analytics, intelligent customer service, and data-driven decision-making. The efficient integration of DBMSs and LLMs within a unified system offers significant opportunities but also introduces new technical challenges. This paper surveys recent developments in DBMS+LLM integration and identifies key future challenges. Specifically, we categorize five representative architectural patterns based on their core design principles, strengths, and trade-offs. Based on this analysis, we further highlight several critical open challenges. We aim to provide a systematic understanding of the current integration landscape and to outline the unresolved issues that must be addressed to achieve scalable and efficient integration of traditional data management and advanced language reasoning in future intelligent applications.",
    "citationCount": 0,
    "referenceCount": 69
}