{
    "paperId": "3401dc00d4c4a82e8a6e48ab71110a938a100747",
    "title": "Solving 3d radar imaging inverse problems With a multi-cognition task-oriented framework",
    "year": 2022,
    "venue": "IEEE International Geoscience and Remote Sensing Symposium",
    "authors": [
        "Xu Zhan",
        "Xiaoling Zhang",
        "Mou Wang",
        "Jun Shi",
        "Shunjun Wei",
        "Tianjiao Zeng"
    ],
    "doi": "10.1109/IGARSS52108.2023.10282151",
    "arxivId": "2211.14989",
    "url": "https://www.semanticscholar.org/paper/3401dc00d4c4a82e8a6e48ab71110a938a100747",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.14989",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work focuses on 3D Radar imaging inverse problems. Current methods obtain undifferentiated results that suffer task-depended information retrieval loss and thus don’t meet the task’s specific demands well. For example, biased scattering energy may be acceptable for screen imaging but not for scattering diagnosis. To address this issue, we propose a new task-oriented imaging framework. The imaging principle is task-oriented through an analysis phase to obtain task's demands. The imaging model is multi-cognition regularized to embed and fulfill demands. The imaging method is designed to be generalized, where couplings between cognitions are decoupled and solved individually with approximation and variable-splitting techniques. Tasks include scattering diagnosis, person screen imaging, and parcel screening imaging are given as examples. Experiments on data from two systems indicate that the proposed framework outperforms the current ones in task-depended information retrieval.",
    "citationCount": 1,
    "referenceCount": 31
}