{
    "paperId": "342d3f92d03623f7709dc19f35239f29f9648fa5",
    "title": "Optimizing agricultural yield: a predictive model for profitable crop harvesting based on market dynamics",
    "year": 2025,
    "venue": "Frontiers of Computer Science",
    "authors": [
        "Nilesh P. Sable",
        "Vinod Kumar Shukla",
        "P. Mahalle",
        "V. Khedkar"
    ],
    "doi": "10.3389/fcomp.2025.1567333",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/342d3f92d03623f7709dc19f35239f29f9648fa5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In agriculture, optimizing harvesting schedules is crucial for maximizing profits while minimizing resource waste. This research introduces a novel forecasting model that forecasts the most profitable months to harvest different crops, to optimize agricultural productivity. Using Machine Learning (ML) techniques, our program takes historical price data, seasonal trends, and market dynamics into account to determine the best harvesting dates. To be more specific, we train and evaluate predictive models using 3 years' worth of agricultural data from Krushi Utpanna Bazar Samiti in Haveli Pune using several machine learning techniques, such as Random Forest (RF), Decision Trees (DT), Linear Regression (LR), and others. After a thorough study using the Mean Squared Error (MSE) and R2 score, it was determined that the DT model performed the best, with an outstanding R2 score of 99%. Furthermore, we use Streamlit to create an easy-to-use web application that lets farmers input crop types, years, and desired price estimates to determine the best months to harvest. Our approach gives farmers a data-driven means to make informed decisions that increase revenue and improve the sustainability of agriculture. By developing precision agriculture and decision support systems, we want to enhance agricultural productivity and enable more efficient crop management techniques.",
    "citationCount": 1,
    "referenceCount": 38
}