{
    "paperId": "3431d267fbb0ef7be7adcc2ec418183c069b6b3f",
    "title": "Accelerating Subgraph Matching Through Advanced Compression and Label Filtering",
    "year": 2025,
    "venue": "Algorithms",
    "authors": [
        "Yanfeng Chai",
        "Jiashu Li",
        "Qiang Zhang"
    ],
    "doi": "10.3390/a18090541",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3431d267fbb0ef7be7adcc2ec418183c069b6b3f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficiently identifying subgraphs that match a given query graph within large-scale graphs has become a critical focus in both academic and industrial research. Subgraph matching, a fundamental problem in graph algorithms, facilitates the effective querying of graph data and is fundamentally based on the subgraph isomorphism problem, which is known to be NP-complete. Among the various stages of subgraph matching, the filtering phase is particularly crucial as it directly affects the overall efficiency of the algorithm. A robust filtering mechanism can rapidly identify candidate nodes that satisfy the query criteria, thereby significantly reducing computational costs in the subsequent stages. The analysis of existing subgraph matching techniques reveals several challenges in the filtering stage: (1) redundant enumeration of equivalent nodes; (2) incomplete filtering due to structural limitations; and (3) excessive redundant validations during the verification phase. To overcome these issues, we propose an adaptive subgraph matching (ASM) framework that integrates efficient compressed graph nodes (CGNs) and a novel label count filter (LCF) algorithm. These innovations enhance the filtering process, resulting in significant improvements in query processing performance. Experimental evaluations demonstrate that our approach achieves substantial gains, outperforming state-of-the-art subgraph search and matching algorithms by several orders of magnitude in query processing time.",
    "citationCount": 0,
    "referenceCount": 31
}