{
    "paperId": "34591489e93897bf8131f4e13b9fc0f7fca62a28",
    "title": "A Self-Attentional ResNet-LightGBM Model for IoT-Enabled Voice Liveness Detection",
    "year": 2023,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Xiaochuan Sun",
        "Jingchang Fu",
        "Biao Wei",
        "Zhigang Li",
        "Yingqi Li",
        "Ning Wang"
    ],
    "doi": "10.1109/JIOT.2022.3230992",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/34591489e93897bf8131f4e13b9fc0f7fca62a28",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Voice user interface (VUI) brings high efficiency and convenience for the applications of Internet of Things (IoT), meanwhile, it can also cause increasingly serious security issues. The word-level voice liveness detection is proved to be the promising solution to thwart spoofing attacks. However, the complex acoustic feature, diversified attacks, and different interaction distance can severely affects the improvement of detection accuracy. To alleviate this issue, we develop a novel pop noise-based word-level voice liveness detection framework. First, a new voice frame selection method is proposed for determining optimal frames, including short time Fourier transform, low-frequency average energy computation, and sequencing. Then, the acoustic features of the selected frames are calculated by the Gammatone frequency cepstral coefficient (GFCC). Finally, based on these features, a newly built joint voice detector, fusing the self-attentional residual network (ResNet), and light gradient boosting machine (LightGBM), can achieve accurate voice classification. On the popular voice spoofing attack data sets, experimental results show that our proposal significantly outperforming the baseline and the state-of-the-arts models, and it is gender dependent. Moreover, our proposal has good generalization ability for far-field replay voice attack, speech synthesis and voice conversion attacks, and partial fake voice attack. Finally, its effectiveness is verified by the ablation study.",
    "citationCount": 11,
    "referenceCount": 61
}