{
    "paperId": "3463d5b721c5d2e4f99a26e164e2d2a1bd92217a",
    "title": "Enhanced Climate Modeling for Accurate Long-Term Climate Predictions Using Deep Learning",
    "year": 2024,
    "venue": "2024 IEEE 9th International Conference on Engineering Technologies and Applied Sciences (ICETAS)",
    "authors": [
        "Anupama Prasanth"
    ],
    "doi": "10.1109/ICETAS62372.2024.11120016",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3463d5b721c5d2e4f99a26e164e2d2a1bd92217a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Climate induced models estimate changes in the of the complex climatic system of the Earth. While climate models' effectiveness for forecasting the future of the climate develops, so does the demand for enhanced accuracy and reliability in climate projections that are long-term. The research examines the application of algorithms based on machine learning in climatic modelling to improve the accuracy and consistency of long-range climate projections. Because they rely on mathematical formulas and physical principles, traditional climate models are unable to adequately represent the complexity of the climate system. An additional strategy is machine learning, which takes data from simulations and experiments and finds patterns and correlations. Machine learning algorithms can find hidden patterns and relationships in big and diverse datasets from satellites, weather stations, and other sources, which traditional models may overlook. The current study looks into how machine learning algorithms like recurrent neural networks, deep learning, and large-scale ensemble methods can enhance the precision and predictive power of climate models. With the help of taking the concept into account, a variety of factors such as the trends in temperature, patterns of precipitation, catastrophic storms, and the consequences of global warming on ecosystems is acknowledged. The goal of this research is to develop a new generation of climate models that will yield more precise long-term climate predictions while also more accurately reflecting the complexities of the climate system. The results of this study can be used to make major progress toward a more resilient and sustainable future by accurately predicting variations in the climate.",
    "citationCount": 0,
    "referenceCount": 26
}