{
    "paperId": "347114420431e700d3d519913ad672b74087992a",
    "title": "The use of deep learning in intelligent athlete motion recognition: Integrating biological mechanisms",
    "year": 2025,
    "venue": "Molecular &amp; Cellular Biomechanics",
    "authors": [
        "Ming Zhang",
        "Yanfeng Li",
        "Yuhong Cui"
    ],
    "doi": "10.62617/mcb670",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/347114420431e700d3d519913ad672b74087992a",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.62617/mcb670",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work explores the effective application of deep learning for recognizing athletes’ movements, aiming to enhance precision in competitive sports. Traditional motion analysis methods primarily rely on manual observation, which can introduce subjective bias and limit accuracy. To address these limitations, we propose an automated method based on deep learning for recognizing and classifying athletes’ technical movements while evaluating their performance. A hybrid model, combining Convolutional Neural Networks (CNN) and Long Short-Term Memory (LSTM) networks, is utilized to extract key frames from video data. The CNN is responsible for feature extraction, capturing the intricate details of movement, while the LSTM captures the temporal sequence characteristics, providing context to the actions. To further strengthen our approach, we delve into the biological mechanisms underlying athletic movements. Understanding the biomechanics of motion—such as joint angles, muscle activation patterns, and energy expenditure—can enhance the accuracy of deep learning models. By integrating these biological insights into our model, we improve the recognition process, allowing for a more nuanced understanding of how movements impact performance. Through experiments, we demonstrate that the model achieves high accuracy across multiple benchmark datasets (UCF-101, HMDB-51, Kinetics-400, and Sports-1M), with a particularly high accuracy of 93.5% on the UCF-101 dataset. These results indicate that the proposed method is both accurate and reliable, making it suitable for athlete training and competition analysis. The findings of this research have significant implications for sports science, training evaluation, and injury prevention. By providing coaches and athletes with precise feedback based on deep learning analysis, we can facilitate targeted training interventions that enhance performance while reducing injury risks. This work aims to offer a powerful tool for athletes, coaches, and researchers, contributing to the advancement of competitive sports through a deeper understanding of movement dynamics and their biological underpinnings.",
    "citationCount": 1,
    "referenceCount": 26
}