{
    "paperId": "3493269f6e18378ba22f8513f9cfbf8ff3a19e57",
    "title": "A Comprehensive Review of Proppant Selection in Unconventional Reservoirs",
    "year": 2025,
    "venue": "ACS Omega",
    "authors": [
        "M. Shafiq",
        "S. Alajmei",
        "M. Aljawad",
        "Lei Wang",
        "A. Bahri"
    ],
    "doi": "10.1021/acsomega.4c09936",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3493269f6e18378ba22f8513f9cfbf8ff3a19e57",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The article provides a comprehensive overview of the selection of proppants in hydraulic fracturing for unconventional reservoirs. Proppants are essential for maintaining the conductivity of hydraulic fractures in well production. The industry has developed various types of proppants, including silica, ceramic, and advanced ultralightweight proppants. The paper covers the fundamentals of proppants, their types, compositions, geometries, and novel technologies for downhole pumping and placement of proppants, as well as in situ generation of proppants. Proppants are critical to improving hydrocarbon recovery as they keep the fractures open, which increases the overall hydrocarbon recovery. The selection of proppants must be tailored to the geological conditions of the reservoirs, and their performance is evaluated based on compatibility with the reservoir and rheological properties. Proppants must withstand closure stresses and diagenesis to ensure long-term fracture conductivity. Regarding proppant size, larger sizes maximize initial production, and smaller sizes allow for a slower long-term decline. Proppant crushing is a significant concern as it affects fracture conductivity. Factors influencing proppant crushing include proppant diagenesis, which refers to the chemical and physical changes proppants undergo in the reservoir. The development of various proppants, including sand, ceramic, resin-coated, curable resin-coated, lightweight, sintered, high-strength, and ultralightweight proppants, each with its advantages and limitations, is also discussed. Case studies from the Bakken and Marcellus Shale Formation demonstrate the impact of proppant selection on well production. Then, the economic optimization of proppant selection, considering factors like payout, internal rate of return, and net present value, is emphasized. The review also covers advancements in proppant technologies, such as multifunctional proppants, traceable proppants, and coated proppants. The potential of in situ proppant generation and the use of ultralightweight proppants are also discussed. The paper concludes with insights into the challenges and considerations for selecting proppants in unconventional reservoirs, stressing the importance of economic optimization and compatibility with fracturing fluids.",
    "citationCount": 1,
    "referenceCount": 43
}