{
    "paperId": "34e0a72203d2963395d05ebcb859b3aa1c6f689d",
    "title": "Low Complexity Speech Secure Hash Retrieval Algorithm Based on KDTree Nearest Neighbor Search",
    "year": 2025,
    "venue": "ACM Trans. Asian Low Resour. Lang. Inf. Process.",
    "authors": [
        "Yi-bo Huang",
        "Li An",
        "Qiuyu Zhang"
    ],
    "doi": "10.1145/3723161",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/34e0a72203d2963395d05ebcb859b3aa1c6f689d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the continuous growth of dimensions in retrieval systems, only a few data points are distributed near the center (empty space phenomenon), and the distance between data points in high-dimensional space is nearly equal (dimensional effect), resulting in high complexity and low accuracy in retrieval. Aiming at the preceding problems, this article designs a speech secure hash retrieval scheme. In this scheme, the spectral subband centroids of speech are extracted to generate the feature vector, then the biometric template index is established by KDTree classification, and the specific SHA256-Ushiki chaotic encryption algorithm key is allocated to each index. The security framework is constructed according to the cancelable biometric template generated by the combination of classification and distribution key, and the binary hash vector is generated, then the hash vector is encrypted. Experimental results show that through the establishment of the KDTree cancelable biometric template index, the super rectangular region of the K-dimensional space is constructed, which effectively solves the empty space phenomenon and the dimensional effect. Through the KDTree nearest neighbor search, the algorithm reduces the number of matches between classes, which effectively reduces computational complexity and accuracy problems. The tampering comparison of mobile terminal realizes the content verifiable retrieval. The speech encryption effectively prevents the leakage of plaintext and ensures security of the speech storage and transmission process.",
    "citationCount": 0,
    "referenceCount": 38
}