{
    "paperId": "3510cb5cd55182b3b3c4b014a955726cb3984864",
    "title": "Constructions and Applications for Accurate Counting of the Bloom Filter False Positive Free Zone",
    "year": 2020,
    "venue": "ACM SIGCOMM Symposium on Software Defined Networking Research",
    "authors": [
        "Ori Rottenstreich",
        "P. Reviriego",
        "E. Porat",
        "S. Muthukrishnan"
    ],
    "doi": "10.1145/3373360.3380845",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3510cb5cd55182b3b3c4b014a955726cb3984864",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bloom filters are used in many networking applications to answer set membership queries at low cost but suffer from false positives. We study Bloom filter constructions that when representing a set of size up to d taken from a finite universe of size n, completely avoid false positives. We suggest memory-efficient Bloom filters constructions with a false positive free zone to allow representations of larger sets through linear memory dependency in the set size. Our first construction relies on Orthogonal Latin Square (OLS) codes and the second relies on the representation of elements through values of polynomials defined modulo primes. Beyond Bloom filters supporting set membership, we also consider sketches allowing a more general functionality such as flow size estimation. In particular, we show the applicability of the false positive free zone for accurate size estimation in the famous Count-Min sketch. We compare the new constructions to existing approaches through analytical and experimental evaluations for showing their superiority.",
    "citationCount": 12,
    "referenceCount": 43
}