{
    "paperId": "351d4f437eec3c85cde30f0dfcd78c6644315d30",
    "title": "Marina: Realizing ML-Driven Real-Time Network Traffic Monitoring at Terabit Scale",
    "year": 2024,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Michael Seufert",
        "K. Dietz",
        "Nikolas Wehner",
        "Stefan Geissler",
        "Joshua Schüler",
        "Manuel Wolz",
        "Andreas Hotho",
        "P. Casas",
        "Tobias Hossfeld",
        "Anja Feldmann"
    ],
    "doi": "10.1109/TNSM.2024.3382393",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/351d4f437eec3c85cde30f0dfcd78c6644315d30",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/4275028/5699970/10480735.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Network operators require real-time traffic monitoring insights to provide high performance and security to their customers. It has been shown that artificial intelligence and machine learning (ML) can improve the visibility of telemetry systems, especially with encrypted traffic. However, current solutions cannot cope with high traffic rates and volumes in large-scale networks. To realize the ML-driven network intelligence paradigm at terabit scale, we design Marina, a system that spreads monitoring over a highly efficient data plane, which can extract traffic statistics at line rate, and a powerful ML server, which can run monitoring inference using complex ML models. We apply temporal microaggregation into sub-second time slots and extract moment-based statistics. These allow to flexibly obtain accurate ML-based monitoring decisions during the next time slot. To demonstrate the scalability of our design, we implement and evaluate a Marina data plane prototype on a Barefoot Wedge 100BF-65X P4 switch, which can monitor more than 520,000 concurrent flows at full switching capacity of $\\mathrm {6.4 Tbps}$ . We validate the analytics capabilities enabled by our Marina implementation for four ML-driven real-time monitoring tasks with a broad set of standard ML models, achieving comparable or better than state-of-the-art results.",
    "citationCount": 18,
    "referenceCount": 133
}