{
    "paperId": "352e5190585b188556ceef9b47347847afd0b3c7",
    "title": "Introducing HL7 FHIR Genomics Operations: a developer-friendly approach to genomics-EHR integration",
    "year": 2022,
    "venue": "J. Am. Medical Informatics Assoc.",
    "authors": [
        "R. Dolin",
        "B. Heale",
        "G. Alterovitz",
        "Rohan Gupta",
        "Justin Aronson",
        "A. Boxwala",
        "Shaileshbhai R. Gothi",
        "David Haines",
        "Arthur Hermann",
        "T. Hongsermeier",
        "Ammar Husami",
        "James Jones",
        "F. Naeymi-Rad",
        "Barbara Rapchak",
        "Chandan Ravishankar",
        "J. Shalaby",
        "May Terry",
        "Ning Xie",
        "Powell Zhang",
        "S. Chamala"
    ],
    "doi": "10.1093/jamia/ocac246",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/352e5190585b188556ceef9b47347847afd0b3c7",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/jamia/article-pdf/30/3/485/49198723/ocac246.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Objective Enabling clinicians to formulate individualized clinical management strategies from the sea of molecular data remains a fundamentally important but daunting task. Here, we describe efforts towards a new paradigm in genomics-electronic health record (HER) integration, using a standardized suite of FHIR Genomics Operations that encapsulates the complexity of molecular data so that precision medicine solution developers can focus on building applications. Materials and Methods FHIR Genomics Operations essentially “wrap” a genomics data repository, presenting a uniform interface to applications. More importantly, operations encapsulate the complexity of data within a repository and normalize redundant data representations—particularly relevant in genomics, where a tremendous amount of raw data exists in often-complex non-FHIR formats. Results Fifteen FHIR Genomics Operations have been developed, designed to support a wide range of clinical scenarios, such as variant discovery; clinical trial matching; hereditary condition and pharmacogenomic screening; and variant reanalysis. Operations are being matured through the HL7 balloting process, connectathons, pilots, and the HL7 FHIR Accelerator program. Discussion Next-generation sequencing can identify thousands to millions of variants, whose clinical significance can change over time as our knowledge evolves. To manage such a large volume of dynamic and complex data, new models of genomics-EHR integration are needed. Qualitative observations to date suggest that freeing application developers from the need to understand the nuances of genomic data, and instead base applications on standardized APIs can not only accelerate integration but also dramatically expand the applications of Omic data in driving precision care at scale for all.",
    "citationCount": 23,
    "referenceCount": 49
}