{
    "paperId": "3549c05317c8073aeadc38dba83a58b6b877c397",
    "title": "Identification of Challenges and Limitations of Current Methods for Detection and Segmentation of Brain Tumor",
    "year": 2023,
    "venue": "2023 International Conference on Integrated Intelligence and Communication Systems (ICIICS)",
    "authors": [
        "V. H. Shruti",
        "Lakshmi Patil"
    ],
    "doi": "10.1109/ICIICS59993.2023.10421293",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3549c05317c8073aeadc38dba83a58b6b877c397",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work presents a comprehensive survey having goal to uncover the challenges and limitations inherent in current methodologies for the segmentation and detection of Brain-Tumors (BT) in medical imaging. This paper introduces and rigorously evaluates six distinct methods, employing the Brats 2018 dataset as the testing ground. The assessment encompasses crucial performance metrics, including the Specificity, Dice-Similarity-Coefficient (DSC), and Sensitivity. Remarkably, the results underscore the effectiveness of the Group Cross-Channel-Attention Residual U-Net (GCAU-Net) as it consistently outperforms other methods, excelling in terms of Specificity, DSC, and Sensitivity. Furthermore, the study suggests that addressing class imbalance issues could be a promising avenue for future research, thereby offering a holistic perspective on the current state of brain tumor detection and segmentation methodologies. This paper contributes valuable insights to both the academic and medical communities, fostering advancements in the field and ultimately improving the accuracy and reliability of brain tumor segmentation techniques.",
    "citationCount": 1,
    "referenceCount": 26
}