{
    "paperId": "3558599bd03e4b5c6ea238c5a56b9f2ddadc65cb",
    "title": "PA-ATP: Progress-Aware Transmission Protocol for In-Network Aggregation",
    "year": 2023,
    "venue": "IEEE International Conference on Network Protocols",
    "authors": [
        "Zhaoyi Li",
        "Jiawei Huang",
        "Tao Zhang",
        "Shengwen Zhou",
        "Qile Wang",
        "Yijun Li",
        "Jingling Liu",
        "Wanchun Jiang",
        "Jianxin Wang"
    ],
    "doi": "10.1109/ICNP59255.2023.10355636",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3558599bd03e4b5c6ea238c5a56b9f2ddadc65cb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large-scale machine learning typically adopts distributed machine learning (DML) techniques to accelerate model training. Due to the large communication overhead, unfortu-nately, the phase of gradient aggregation has become the performance bottleneck for DML. To reduce traffic volume, several in-network aggregation (INA) transmission protocols are proposed to offload gradient aggregation function into the programmable switches. However, since existing INA transmission protocols use synchronous congestion control mechanism to drive each round of gradient aggregation, the straggling workers lead to long iteration time and significant performance degradation. To solve the above problem, we propose PA-ATP, a progress-aware INA transmission protocol, which adopts the progress-aware asynchronous congestion control. PA-ATP adjusts the sending rate in accordance with the transmission progress, allowing the straggling flow to grab more bandwidth than the leading flow and control the asynchronous degree of straggling job. We use a P4 programmable switch and a kernel-bypass protocol stack to implement PA-ATP. The results of testbed and large-scale NS3 simulations show that PA-ATP reduces training time by up to 62% compared to the state-of-the-art INA transmission protocols.",
    "citationCount": 1,
    "referenceCount": 28
}