{
    "paperId": "35978049ffd8a0d5de078250da267f6278319882",
    "title": "Genome-wide identification analysis in wild-type Solanum pinnatisectum reveals some genes defending against Phytophthora infestans",
    "year": 2024,
    "venue": "Frontiers in Genetics",
    "authors": [
        "Chunxiu Shen",
        "Qineng Lu",
        "Di Yang",
        "Xueru Zhang",
        "Xinping Huang",
        "Rungen Li",
        "Zhiqun Que",
        "Na Chen"
    ],
    "doi": "10.3389/fgene.2024.1379784",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/35978049ffd8a0d5de078250da267f6278319882",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/genetics/articles/10.3389/fgene.2024.1379784/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Solanum pinnatisectum exhibits strong resistance to late blight caused by Phytophthora infestans but only an incomplete genome assembly based on short Illumina reads has been published. In this study, we generated the first chromosome-level draft genome for the wild-type potato species S. pinnatisectum in China using Oxford Nanopore technology sequencing and Hi-C technology. The high-quality assembled genome size is 664 Mb with a scaffold N50 value of 49.17 Mb, of which 65.87% was occupied by repetitive sequences, and predominant long terminal repeats (42.51% of the entire genome). The genome of S. pinnatisectum was predicted to contain 34,245 genes, of which 99.34% were functionally annotated. Moreover, 303 NBS-coding disease resistance (R) genes were predicted in the S. pinnatisectum genome to investigate the potential mechanisms of resistance to late blight disease. The high-quality chromosome-level reference genome of S. pinnatisectum is expected to provide potential valuable resources for intensively and effectively investigating molecular breeding and genetic research in the future.",
    "citationCount": 0,
    "referenceCount": 109
}