{
    "paperId": "35cec6597c06c1fe4b4898c46eab124521c3ced8",
    "title": "Genome-wide association study, population structure, and genetic diversity of the tea plant in Guizhou Plateau",
    "year": 2024,
    "venue": "BMC Plant Biology",
    "authors": [
        "Yihan Wang",
        "S. Niu",
        "Xinyue Deng",
        "Ding-hua Bai",
        "Zhengwu Chen",
        "Xiuling Deng",
        "Dejun Huang"
    ],
    "doi": "10.1186/s12870-024-04761-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/35cec6597c06c1fe4b4898c46eab124521c3ced8",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcplantbiol.biomedcentral.com/counter/pdf/10.1186/s12870-024-04761-x",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Guizhou Plateau, as one of the original centers of tea plant, has a profound multi-ethnic cultural heritage and abundant tea germplasm resources. However, the impact of indigenous community factors on the genetic diversity, population structure and geographical distribution of tea plant is still unclear. Results Using the genotyping-by-sequencing (GBS) approach, we collected 415 tea plant accessions from the study sites, estimated genetic diversity, developed a core collection, and conducted a genome-wide association study (GWAS) based on 99,363 high-quality single-nucleotide polymorphisms (SNPs). A total of 415 tea accessions were clustered into six populations (GP01, GP02, GP03, GP04, GP05 and GP06), and the results showed that GP04 and GP05 had the highest and lowest genetic diversity (Pi = 0.214 and Pi = 0.145, respectively). Moreover, 136 tea accessions (33%) were selected to construct the core set that can represent the genetic diversity of the whole collection. By analyzing seven significant SNP markers associated with the traits such as the germination period of one bud and two leaves (OTL) and the germination period of one bud and three leaves (OtL), four candidate genes possibly related to OTL and OtL were identified. Conclusions This study revealed the impact of indigenous communities on the population structure of 415 tea accessions, indicating the importance of cultural practices for protection and utilization of tea plant genetic resources. Four potential candidate genes associated with the OTL and OtL of tea plant were also identified, which will facilitate genetic research, germplasm conservation, and breeding. Supplementary Information The online version contains supplementary material available at 10.1186/s12870-024-04761-x.",
    "citationCount": 6,
    "referenceCount": 78
}