{
    "paperId": "35d157b86d7b9d6747b46a9144d3a7d2c99a5688",
    "title": "Seizing Requirements Engineering Issues through Supervised Learning Techniques",
    "year": 2020,
    "venue": "IEEE Latin America Transactions",
    "authors": [
        "María Guadalupe Gramajo",
        "Luciana C. Ballejos",
        "M. Ale"
    ],
    "doi": "10.1109/TLA.2020.9099757",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/35d157b86d7b9d6747b46a9144d3a7d2c99a5688",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, the popularity of machine learning techniques has grown due to the availability of larges volumes of data and the increased processing capacity of computers. Despite the inherent value of these techniques, few studies have attempted to summarize how machine learning algorithms, especially supervised learning have contributed to task automation and resolving challenges in Requirements Engineering. This paper proposes a systematic mapping of the literature to identify and analyze proposals which employ supervised learning in Requirements Engineering between 2002-2018. The goal of this research is to identify trends, datasets, and methods used. Thirty-three studies were selected based on defined inclusion and exclusion criteria. The results show that researches using these techniques focuses on eight broad categories: detection of linguistic problems in requirements documents and artifacts written in natural language, classification of document content, traceability, effort estimation, requirements analysis, failures prediction, quality and detection of business rules. The most used supervised learning algorithms were Support Vector Machine, Naive Bayes, Decision Tree, K-Nearest Neighbour, and Random Forest. Twenty-five public and twenty -eight private data sources were identified. Among the most used public data sources are Predictor Models in Software Engineering, iTrust Electronic Health Care System and Metric Data Program from NASA.",
    "citationCount": 13,
    "referenceCount": 61
}