{
    "paperId": "35f9688a7975243e1f3eb645ead5176adf627270",
    "title": "Temporal and structural patterns of hepatitis B virus integrations in hepatocellular carcinoma",
    "year": 2023,
    "venue": "Journal of Medical Virology",
    "authors": [
        "Haozhen Ren",
        "Xun Chen",
        "Jinglin Wang",
        "Ying Chen",
        "Alex Hafiz",
        "Qian Xiao",
        "Shiwei Fu",
        "Advaitha Madireddy",
        "Wei Vivian Li",
        "Xiaolei Shi",
        "Jian Cao"
    ],
    "doi": "10.1002/jmv.29187",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/35f9688a7975243e1f3eb645ead5176adf627270",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/jmv.29187",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Chronic infection of hepatitis B virus (HBV) is the major cause of hepatocellular carcinoma (HCC). Notably, 90% of HBV‐positive HCC cases exhibit detectable HBV integrations, hinting at the potential early entanglement of these viral integrations in tumorigenesis and their subsequent oncogenic implications. Nevertheless, the precise chronology of integration events during HCC tumorigenesis, alongside their sequential structural patterns, has remained elusive thus far. In this study, we applied whole‐genome sequencing to multiple biopsies extracted from six HBV‐positive HCC cases. Through this approach, we identified point mutations and viral integrations, offering a blueprint for the intricate tumor phylogeny of these samples. The emergent narrative paints a rich tapestry of diverse evolutionary trajectories characterizing the analyzed tumors. We uncovered oncogenic integration events in some samples that appear to happen before and during the initiation stage of tumor development based on their locations in reconstituted trajectories. Furthermore, we conducted additional long‐read sequencing of selected samples and unveiled integration‐bridged chromosome rearrangements and tandem repeats of the HBV sequence within integrations. In summary, this study revealed premalignant oncogenic and sequential complex integrations and highlighted the contributions of HBV integrations to HCC development and genome instability.",
    "citationCount": 5,
    "referenceCount": 32
}