{
    "paperId": "364b282a1d8e076b6627c66423e73ff3d38af90f",
    "title": "The constrained-disorder principle defines the functions of systems in nature",
    "year": 2024,
    "venue": "Frontiers in Network Physiology",
    "authors": [
        "Yaron Ilan"
    ],
    "doi": "10.3389/fnetp.2024.1361915",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/364b282a1d8e076b6627c66423e73ff3d38af90f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Constrained Disorder Principle (CDP) defines all systems in nature by their degree of inherent variability. Per the CDP, the intrinsic variability is mandatory for their proper function and is dynamically changed based on pressures. The CDP defines the boundaries of inherent variability as a mechanism for continuous adaptation to internal and external perturbations, enabling survival and function under dynamic conditions. The laws of nature govern the world’s natural phenomena and underlie the function of all systems. Nevertheless, the laws of physics do not entirely explain systems’ functionality under pressure, which is essential for determining the correct operation of complex systems in nature. Variability and noise are two broad sources of inherent unpredictability in biology and technology. This paper explores how the CDP defines the function of systems and provides examples from various areas in nature where the CDP applies, including climate, genetic, biology, and human behavioral variabilities. According to the CDP, system malfunction results from inappropriate performance of the boundaries of inherent variability. The environment influences the physiological variability, and species interactions influence eco-evolutionary outcomes. The CDP defines human behavior as being driven by randomness and accounts for malfunctions and their corrections. The paper reviews variability-based CDP algorithms and CDP-based second-generation artificial intelligence systems and their potential for improving systems’ prediction and efficiency by using variability.",
    "citationCount": 6,
    "referenceCount": 181
}