{
    "paperId": "3657ebf63f54641e436d8773ab69e1079360de94",
    "title": "A2P: Attention-based Memory Access Prediction for Graph Analytics",
    "year": 2022,
    "venue": "International Conference on Data Technologies and Applications",
    "authors": [
        "Pengmiao Zhang",
        "R. Kannan",
        "Anant V. Nori",
        "V. Prasanna"
    ],
    "doi": "10.5220/0011309700003269",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3657ebf63f54641e436d8773ab69e1079360de94",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5220/0011309700003269",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Graphs are widely used to represent real-life applications including social networks, web search engines, bioin-formatics, etc. With the rise of Big Data, graph analytics offers signiﬁcant potential in exploring challenging problems on relational data. Graph analytics is typically memory-bound. One way to hide the memory access latency is through data prefetching, which relies on accurate memory access prediction. Traditional prefetchers with pre-deﬁned rules cannot adapt to complex graph analytics memory patterns. Recently, Machine Learning (ML) models, especially Long Short-Term Memory (LSTM), have shown improved performance for memory access prediction. However, existing models have shortcomings including unstable LSTM models, interleaved patterns in labels using consecutive deltas (difference between addresses), and large output dimensions. We propose A2P, a novel attention-based memory access prediction model for graph analytics. We apply multi-head attention to extract features, which are easier to be trained than LSTM. We design a novel bitmap labeling method, which collects future deltas within a spatial range and makes the patterns easier to be learned. By constraining the prediction range, bitmap labeling provides up to 5K × compression for model output dimension. We further introduce a novel concept of super page , which allows the model prediction to break the constraint of a physical page. For the widely used GAP benchmark, our results show that for the top three predictions, A2P outperforms the widely used state-of-the-art LSTM-based model by 23.1% w.r.t. Precision, 21.2% w.r.t. Recall, and 10.4% w.r.t. Coverage.",
    "citationCount": 4,
    "referenceCount": 48
}