{
    "paperId": "36a0a1a18c874ec50483adbcdbee629a32e07e68",
    "title": "An Optimized Deep Neural Network for Overhead Contact System Recognition from LiDAR Point Clouds",
    "year": 2021,
    "venue": "Remote Sensing",
    "authors": [
        "Siping Liu",
        "Xiaohan Tu",
        "Cheng Xu",
        "Lipei Chen",
        "Shuai Lin",
        "Renfa Li"
    ],
    "doi": "10.3390/rs13204110",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/36a0a1a18c874ec50483adbcdbee629a32e07e68",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-4292/13/20/4110/pdf?version=1634198392",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As vital infrastructures, high-speed railways support the development of transportation. To maintain the punctuality and safety of railway systems, researchers have employed manual and computer vision methods to monitor overhead contact systems (OCSs), but they have low efficiency. Investigators have also used light detection and ranging (LiDAR) to generate point clouds by emitting laser beams. The point cloud is segmented for automatic OCS recognition, which improves recognition efficiency. However, existing LiDAR point cloud segmentation methods have high computational/model complexity and latency. In addition, they cannot adapt to embedded devices with different architectures. To overcome these issues, this article presents a lightweight neural network EffNet consisting of three modules: ExtractA, AttenA, and AttenB. ExtractA extracts the features from the disordered and irregular point clouds of an OCS. AttenA keeps information flowing in EffNet while extracting useful features. AttenB uses channel and spatialwise statistics to enhance important features and suppress unimportant ones efficiently. To further speed up EffNet and match it with diverse architectures, we optimized it with a generation framework of tensor programs and deployed it on embedded systems with different architectures. Extensive experiments demonstrated that EffNet has at least a 0.57% higher mean accuracy, but with 25.00% and 9.30% lower computational and model complexity for OCS recognition than others, respectively. The optimized EffNet can be adapted to different architectures. Its latency decreased by 51.97%, 56.47%, 63.63%, 82.58%, 85.85%, and 91.97% on the NVIDIA Nano CPU, TX2 CPU, UP Board CPU, Nano GPU, TX2 GPU, and RTX 2,080 Ti GPU, respectively.",
    "citationCount": 6,
    "referenceCount": 30
}