{
    "paperId": "36b35bc8ea704f894ce776d27644baff5bc15f7e",
    "title": "Optimization Problem Solving Can Transition to Evolutionary Agentic Workflows",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Wenhao Li",
        "Bo Jin",
        "Mingyi Hong",
        "Changhong Lu",
        "Xiangfeng Wang"
    ],
    "doi": "10.48550/arXiv.2505.04354",
    "arxivId": "2505.04354",
    "url": "https://www.semanticscholar.org/paper/36b35bc8ea704f894ce776d27644baff5bc15f7e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This position paper argues that optimization problem solving can transition from expert-dependent to evolutionary agentic workflows. Traditional optimization practices rely on human specialists for problem formulation, algorithm selection, and hyperparameter tuning, creating bottlenecks that impede industrial adoption of cutting-edge methods. We contend that an evolutionary agentic workflow, powered by foundation models and evolutionary search, can autonomously navigate the optimization space, comprising problem, formulation, algorithm, and hyperparameter spaces. Through case studies in cloud resource scheduling and ADMM parameter adaptation, we demonstrate how this approach can bridge the gap between academic innovation and industrial implementation. Our position challenges the status quo of human-centric optimization workflows and advocates for a more scalable, adaptive approach to solving real-world optimization problems.",
    "citationCount": 0,
    "referenceCount": 173
}