{
    "paperId": "36f838940cb0d5e0066ccfb83cf2f3c9277a335e",
    "title": "Structurally-Encrypted Databases Combined With Filters: Enhanced Security and Rich Queries",
    "year": 2025,
    "venue": "IEEE Transactions on Information Forensics and Security",
    "authors": [
        "Feng Liu",
        "Jinjiang Yang",
        "Jingchen Zhao",
        "Yingjie Xue",
        "Kaiping Xue"
    ],
    "doi": "10.1109/TIFS.2025.3561680",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/36f838940cb0d5e0066ccfb83cf2f3c9277a335e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Building encrypted databases has been a long-standing challenge in the field of database security. In recent years, Structured Encryption (STE) has emerged as a promising approach to constructing encrypted databases, striking a balance between security and efficiency. Although existing STE-based encrypted database systems achieve high efficiency in query processing, all these schemes struggle to support rich queries with minimal information leakage. In this paper, we present a new STE-based encrypted database system, named Filter-integrated Encrypted Database (FinEDB), which supports exact-match and range queries, conjunctive queries and join operations, while maintaining limited information leakage. We first design a novel secure inverted index to avoid storage overhead blow-up when extending to support rich query capabilities. Then, we integrate Binary Fuse filters into our proposed inverted index to enable efficient query processing. By leveraging the homomorphic property of Binary Fuse filters, our approach leaks less information than existing STE-based solutions. Besides, we provide rigorous proof for our proposed scheme under the simulation paradigm. To evaluate the performance, we implement the prototype of FinEDB and compare it with the baseline STE-based scheme. Experiment results demonstrate that FinEDB is practical and can support rich queries on real-world databases.",
    "citationCount": 0,
    "referenceCount": 41
}