{
    "paperId": "371e2444aff2bedc8081fe7aa087a55f7d26fbc8",
    "title": "Hard way or hardware? Taking the heat out of AI",
    "year": 2025,
    "venue": "APL Machine Learning",
    "authors": [
        "Ampattu R. Jayakrishnan",
        "Markus Hellenbrand",
        "Sebastian Dixon",
        "Adnan Mehonic",
        "José P. B. Silva",
        "J. MacManus‐Driscoll"
    ],
    "doi": "10.1063/5.0270385",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/371e2444aff2bedc8081fe7aa087a55f7d26fbc8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The flurry of news worldwide surrounding the launch of DeepSeek’s artificial intelligence (AI) tool, operating at ∼5% of OpenAI’s GPT models, has drawn significant attention to global competitiveness in the AI field. Greater efficiency in software design to lower costs is of clear benefit to AI customers. It is also, however, critical to acknowledge the urgent need to sustain the otherwise continuous growth of compute power needed for AI systems and to reduce the energy consumption of AI systems, both of which are generally growing exponentially. Hardware has a critical role to play here. Thus, in addition to software progress, fundamental innovations across the hardware stack—from functional materials and novel devices to efficient system architectures and new computing paradigms—are pressing needs. Considering the ongoing climate crisis, we argue for the urgent need for accelerated and connected government- and industry-funded research and development in the hardware domain. We believe that the route to sustainable energy efficiency of compute systems requires closely linked efforts between academia and industry, starting with the most fundamental level of the AI system stack.",
    "citationCount": 0,
    "referenceCount": 16
}