{
    "paperId": "3729e52e94382ae42894a355b2f97a2c6cc38b5c",
    "title": "Enhancing Environmental Control in Broiler Production: Retrieval-Augmented Generation for Improved Decision-Making with Large Language Models",
    "year": 2025,
    "venue": "AgriEngineering",
    "authors": [
        "Marcus Vinicius Leite",
        "J. Abe",
        "Marcos Leandro Hoffmann Souza",
        "I. de Alencar Nääs"
    ],
    "doi": "10.3390/agriengineering7010012",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3729e52e94382ae42894a355b2f97a2c6cc38b5c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/agriengineering7010012",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing global demand for animal protein, particularly chicken meat, challenges poultry farming to adapt production systems through the adoption of digital technologies. Among the promising advances in artificial intelligence (AI), large language models (LLMs) hold potential to enhance decision-making in broiler production by supporting environmental control through the interpretation of climatic data, the generation of reports to optimize conditions, guidance on ventilation adjustments, recommendations for thermal management, assistance in air quality monitoring, and the translation of simulation results into actionable suggestions to improve bird welfare. For this purpose, the key limitations of LLMs in terms of transparency, accuracy, precision, and relevance must be effectively addressed. This study investigates the impact of retrieval-augmented generation (RAG) on improving LLM precision and relevance for environmental control in broiler production. Experiments with the OpenAI GPT-4o model and semantic similarity analysis were used to evaluate response quality with and without RAG. The results confirmed the approach’s effectiveness while identifying areas for improvement. A paired t-test revealed significantly higher similarity scores with RAG, demonstrating its impact on response quality. This study contributes to the field by advancing RAG-enhanced LLMs for environmental control, addressing market demands by demonstrating how AI improves decision-making for productivity and animal welfare, and benefits society by providing small-scale producers with cost-effective and accessible solutions for actionable insights.",
    "citationCount": 5,
    "referenceCount": 28
}