{
    "paperId": "37399c9bb76e041cf63b4c921239d6ef06eb319c",
    "title": "Iron-related gene mutations driving global Mycobacterium tuberculosis transmission revealed by whole-genome sequencing",
    "year": 2024,
    "venue": "BMC Genomics",
    "authors": [
        "Ya-meng Li",
        "Yifan Li",
        "Yao Liu",
        "Xiang-long Kong",
        "Ningning Tao",
        "Yawei Hou",
        "Ting-ting Wang",
        "Qi-lin Han",
        "Yu-zhen Zhang",
        "Fei Long",
        "Huaichen Li"
    ],
    "doi": "10.1186/s12864-024-10152-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/37399c9bb76e041cf63b4c921239d6ef06eb319c",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcgenomics.biomedcentral.com/counter/pdf/10.1186/s12864-024-10152-1",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Iron plays a crucial role in the growth of Mycobacterium tuberculosis ( M. tuberculosis ). However, the precise regulatory mechanism governing this system requires further elucidation. Additionally, limited studies have examined the impact of gene mutations related to iron on the transmission of M. tuberculosis globally. This research aims to investigate the correlation between mutations in iron-related genes and the worldwide transmission of M. tuberculosis . Results A total of 13,532 isolates of M. tuberculosis were included in this study. Among them, 6,104 (45.11%) were identified as genomic clustered isolates, while 8,395 (62.04%) were classified as genomic clade isolates. Our results showed that a total of 12 single nucleotide polymorphisms (SNPs) showed a positive correlation with clustering, such as Rv1469 ( ctpD , C758T), Rv3703c ( etgB , G1122T), and Rv3743c ( ctpJ , G676C). Additionally, seven SNPs, including Rv0104 (T167G, T478G), Rv0211 ( pckA , A302C), Rv0283 ( eccB3 , C423T), Rv1436 ( gap , G654T), ctpD C758T, and etgB C578A, demonstrated a positive correlation with transmission clades across different countries. Notably, our findings highlighted the positive association of Rv0104 T167G, pckA A302C, eccB3 C423T, ctpD C758T, and etgB C578A with transmission clades across diverse regions. Furthermore, our analysis identified 78 SNPs that exhibited significant associations with clade size. Conclusions Our study reveals the link between iron-related gene SNPs and M. tuberculosis transmission, offering insights into crucial factors influencing the pathogenicity of the disease. This research holds promise for targeted strategies in prevention and treatment, advancing research and interventions in this field.",
    "citationCount": 1,
    "referenceCount": 36
}