{
    "paperId": "375016e0ecb23f2488e94f423200e3504d9eb5e1",
    "title": "﻿Comparative mitogenomics, phylogeny, and biogeography of selected species of Saxicola (Aves, Passeriformes)",
    "year": 2025,
    "venue": "ZooKeys",
    "authors": [
        "Chuan Jiang",
        "Wenwen Zhu",
        "Shujia Wu",
        "Xilong Zhao",
        "Nassoro Mohamed",
        "Bo Li"
    ],
    "doi": "10.3897/zookeys.1249.152269",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/375016e0ecb23f2488e94f423200e3504d9eb5e1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "﻿Abstract Saxicola is a genus of insectivorous birds widely distributed across Eurasia and Africa. Their mitochondrial genomes (mitogenomes), classification, phylogeny, and biogeography are underresearched. Here, we sequenced and/or assembled the mitogenomes of S.stejnegeri, S.torquatus, S.maurus, S.rubicolahibernans, S.r.rubicola and S.dacotiae for detailed comparative analysis, integrating them with published mitogenomes of members of Muscicapidae for phylogenetic reconstruction. Additionally, we estimated the divergence times and ancestral ranges for Saxicola using ND2 and Cytb. These mitogenomes, spanning 16,764 bp to 16,804 bp, exhibit typical gene arrangement, AT bias, and A/C skew tendencies. Among the 13 protein-coding genes, ND3 evolved the fastest, whereas COX1 evolved the slowest. The 22 tRNAs form the classic cloverleaf structure except trnS1 (AGY). The control region has three domains with 10 conserved elements. Mitogenomic phylogenetic analysis revealed the topology: (((((S.r.hibernans + S.r.rubicola) + S.dacotiae) + S.maurus) + S.torquatus) + S.stejnegeri), supporting the independent species status of S.stejnegeri rather than a subspecies of S.maurus. Ancestral range reconstruction indicated that Saxicola originated in the Indian subcontinent and mainland Southeast Asia during the late Miocene. These findings enhance our understanding of the classification, evolution, and geographical origin of Saxicola.",
    "citationCount": 0,
    "referenceCount": 89
}