{
    "paperId": "376a2155beec4bc823ccf0591b29406191934a7d",
    "title": "Can physics-informed neural networks beat the finite element method?",
    "year": 2023,
    "venue": "IMA Journal of Applied Mathematics",
    "authors": [
        "T. G. Grossmann",
        "U. J. Komorowska",
        "J. Latz",
        "C. Schönlieb"
    ],
    "doi": "10.1093/imamat/hxae011",
    "arxivId": "2302.04107",
    "url": "https://www.semanticscholar.org/paper/376a2155beec4bc823ccf0591b29406191934a7d",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1093/imamat/hxae011",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Partial differential equations (PDEs) play a fundamental role in the mathematical modelling of many processes and systems in physical, biological and other sciences. To simulate such processes and systems, the solutions of PDEs often need to be approximated numerically. The finite element method, for instance, is a usual standard methodology to do so. The recent success of deep neural networks at various approximation tasks has motivated their use in the numerical solution of PDEs. These so-called physics-informed neural networks and their variants have shown to be able to successfully approximate a large range of PDEs. So far, physics-informed neural networks and the finite element method have mainly been studied in isolation of each other. In this work, we compare the methodologies in a systematic computational study. Indeed, we employ both methods to numerically solve various linear and nonlinear PDEs: Poisson in 1D, 2D and 3D, Allen–Cahn in 1D, semilinear Schrödinger in 1D and 2D. We then compare computational costs and approximation accuracies. In terms of solution time and accuracy, physics-informed neural networks have not been able to outperform the finite element method in our study. In some experiments, they were faster at evaluating the solved PDE.",
    "citationCount": 137,
    "referenceCount": 84
}