{
    "paperId": "376c0baea51c15198183556850c7936f73e8d414",
    "title": "Analysis of Factors Affecting the Effectiveness of Oil Spill Clean-Up: A Bayesian Network Approach",
    "year": 2023,
    "venue": "Sustainability",
    "authors": [
        "Liangxia Zhong",
        "Jiaxin Wu",
        "Y. Wen",
        "Bingjie Yang",
        "M. Grifoll",
        "Yunping Hu",
        "P. Zheng"
    ],
    "doi": "10.3390/su15064965",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/376c0baea51c15198183556850c7936f73e8d414",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/15/6/4965/pdf?version=1678449442",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ship-related marine oil spills pose a significant threat to the environment, and while it may not be possible to prevent such incidents entirely, effective clean-up efforts can minimize their impact on the environment. The success of these clean-up efforts is influenced by various factors, including accident-related factors such as the type of accident, location, and environmental weather conditions, as well as emergency response-related factors such as available resources and response actions. To improve targeted and effective responses to oil spills resulting from ship accidents and enhance oil spill emergency response methods, it is essential to understand the factors that affect their effectiveness. In this study, a data-driven Bayesian network (TAN) analysis approach was used with data from the U.S. Coast Guard (USCG) to identify the key accident-related factors that impact oil spill clean-up performance. The analysis found that the amount of discharge, severity, and the location of the accident are the most critical factors affecting the clean-up ratio. These findings are significant for emergency management and planning oil spill clean-up efforts.",
    "citationCount": 4,
    "referenceCount": 41
}