{
    "paperId": "3774e5c3bc5d46b79138d0fc9c02ffdbe8ce189d",
    "title": "Bootstrapping Urban Planning",
    "year": 2020,
    "venue": "Security, Privacy, and Forensics Issues in Big Data",
    "authors": [
        "Ankur Lohachab"
    ],
    "doi": "10.4018/978-1-5225-9742-1.CH009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3774e5c3bc5d46b79138d0fc9c02ffdbe8ce189d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rapid growth of embedded devices and population density in IoT-based smart cities provides great potential for business and opportunities in urban planning. For addressing the current and future needs of living, smart cities have to revitalize the potential of big data analytics. However, a colossal amount of sensitive information invites various computational challenges. Moreover, big data generated by the IoT paradigm acquires different characteristics as compared to traditional big data because it contains heterogeneous unstructured data. Despite various challenges in big data, enterprises are trying to utilize its true potential for providing proactive applications to the citizens. In this chapter, the author finds the possibilities of the role of big data in the efficient management of smart cities. Representative applications of big data, along with advantages and disadvantages, are also discussed. By delving into the ongoing research approaches in securing and providing privacy to big data, this chapter is concluded by highlighting the open research issues in the domain.",
    "citationCount": 3,
    "referenceCount": 58
}