{
    "paperId": "37815cad412e197bc3899a501658c2ad6245f4b9",
    "title": "(Self) Driving Under the Influence: Intoxicating Adversarial Network Inputs",
    "year": 2019,
    "venue": "ACM Workshop on Hot Topics in Networks",
    "authors": [
        "Roland Meier",
        "Thomas Holterbach",
        "Stephan Keck",
        "Matthias Stähli",
        "Vincent Lenders",
        "Ankit Singla",
        "Laurent Vanbever"
    ],
    "doi": "10.1145/3365609.3365850",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/37815cad412e197bc3899a501658c2ad6245f4b9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional network control planes can be slow and require manual tinkering from operators to change their behavior. There is thus great interest in a faster, data-driven approach that uses signals from real-time traffic instead. However, the promise of fast and automatic reaction to data comes with new risks: malicious inputs designed towards negative outcomes for the network, service providers, users, and operators. Adversarial inputs are a well-recognized problem in other areas; we show that networking applications are susceptible to them too. We characterize the attack surface of data-driven networks and examine how attackers with different privileges---from infected hosts to operator-level access---may target network infrastructure, applications, and protocols. To illustrate the problem, we present case studies with concrete attacks on recently proposed data-driven systems. Our analysis urgently calls for a careful study of attacks and defenses in data-driven networking, with a view towards ensuring that their promise is not marred by oversights in robust design.",
    "citationCount": 22,
    "referenceCount": 62
}