{
    "paperId": "3793d20f1cb3e632ccaa893ed8a388063c977b5c",
    "title": "Anomaly detection in multivariate time series data using deep ensemble models",
    "year": 2024,
    "venue": "PLoS ONE",
    "authors": [
        "Amjad Iqbal",
        "Rashid Amin",
        "Faisal S. Alsubaei",
        "Abdulrahman Alzahrani"
    ],
    "doi": "10.1371/journal.pone.0303890",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3793d20f1cb3e632ccaa893ed8a388063c977b5c",
    "isOpenAccess": true,
    "openAccessPdf": "https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0303890&type=printable",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Anomaly detection in time series data is essential for fraud detection and intrusion monitoring applications. However, it poses challenges due to data complexity and high dimensionality. Industrial applications struggle to process high-dimensional, complex data streams in real time despite existing solutions. This study introduces deep ensemble models to improve traditional time series analysis and anomaly detection methods. Recurrent Neural Networks (RNNs) and Long Short-Term Memory (LSTM) networks effectively handle variable-length sequences and capture long-term relationships. Convolutional Neural Networks (CNNs) are also investigated, especially for univariate or multivariate time series forecasting. The Transformer, an architecture based on Artificial Neural Networks (ANN), has demonstrated promising results in various applications, including time series prediction and anomaly detection. Graph Neural Networks (GNNs) identify time series anomalies by capturing temporal connections and interdependencies between periods, leveraging the underlying graph structure of time series data. A novel feature selection approach is proposed to address challenges posed by high-dimensional data, improving anomaly detection by selecting different or more critical features from the data. This approach outperforms previous techniques in several aspects. Overall, this research introduces state-of-the-art algorithms for anomaly detection in time series data, offering advancements in real-time processing and decision-making across various industrial sectors.",
    "citationCount": 21,
    "referenceCount": 46
}