{
    "paperId": "379abdaabd0df7021acda8586e2b5d48b2e082cd",
    "title": "The mutational profile in a South African cohort with inherited neuropathies and spastic paraplegia",
    "year": 2023,
    "venue": "Frontiers in Neurology",
    "authors": [
        "Amokelani C. Mahungu",
        "Elizabeth Steyn",
        "Niki Floudiotis",
        "Lindsay A Wilson",
        "J. Vandrovcova",
        "M. Reilly",
        "Christopher J Record",
        "M. Benatar",
        "Gang Wu",
        "Sharika Raga",
        "J. Wilmshurst",
        "Kireshnee Naidu",
        "Michael Hanna",
        "M. Nel",
        "J. Heckmann"
    ],
    "doi": "10.3389/fneur.2023.1239725",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/379abdaabd0df7021acda8586e2b5d48b2e082cd",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fneur.2023.1239725/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Limited diagnostics are available for inherited neuromuscular diseases (NMD) in South Africa and (excluding muscle disease) are mainly aimed at the most frequent genes underlying genetic neuropathy (GN) and spastic ataxias in Europeans. In this study, we used next-generation sequencing to screen 61 probands with GN, hereditary spastic paraplegia (HSP), and spastic ataxias for a genetic diagnosis. Methods After identifying four GN probands with PMP22 duplication and one spastic ataxia proband with SCA1, the remaining probands underwent whole exome (n = 26) or genome sequencing (n = 30). The curation of coding/splice region variants using gene panels was guided by allele frequencies from internal African-ancestry control genomes (n = 537) and the Clinical Genome Resource's Sequence Variant Interpretation guidelines. Results Of 32 GN probands, 50% had African-genetic ancestry, and 44% were solved: PMP22 (n = 4); MFN2 (n = 3); one each of MORC2, ATP1A1, ADPRHL2, GJB1, GAN, MPZ, and ATM. Of 29 HSP probands (six with predominant ataxia), 66% had African-genetic ancestry, and 48% were solved: SPG11 (n = 3); KIF1A (n = 2); and one each of SPAST, ATL1, SPG7, PCYT2, PSEN1, ATXN1, ALDH18A1, CYP7B1, and RFT1. Structural variants in SPAST, SPG11, SPG7, MFN2, MPZ, KIF5A, and GJB1 were excluded by computational prediction and manual visualisation. Discussion In this preliminary cohort screening panel of disease genes using WES/WGS data, we solved ~50% of cases, which is similar to diagnostic yields reported for global cohorts. However, the mutational profile among South Africans with GN and HSP differs substantially from that in the Global North.",
    "citationCount": 8,
    "referenceCount": 68
}