{
    "paperId": "37cc6fa5dc1fd7c845123dee1870454f75937415",
    "title": "DiscRec: Disentangled Semantic-Collaborative Modeling for Generative Recommendation",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Chang Liu",
        "Yimeng Bai",
        "Xiaoyan Zhao",
        "Yang Zhang",
        "Fuli Feng",
        "Wenge Rong"
    ],
    "doi": "10.48550/arXiv.2506.15576",
    "arxivId": "2506.15576",
    "url": "https://www.semanticscholar.org/paper/37cc6fa5dc1fd7c845123dee1870454f75937415",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative recommendation is emerging as a powerful paradigm that directly generates item predictions, moving beyond traditional matching-based approaches. However, current methods face two key challenges: token-item misalignment, where uniform token-level modeling ignores item-level granularity that is critical for collaborative signal learning, and semantic-collaborative signal entanglement, where collaborative and semantic signals exhibit distinct distributions yet are fused in a unified embedding space, leading to conflicting optimization objectives that limit the recommendation performance. To address these issues, we propose DiscRec, a novel framework that enables Disentangled Semantic-Collaborative signal modeling with flexible fusion for generative Recommendation. First, DiscRec introduces item-level position embeddings, assigned based on indices within each semantic ID, enabling explicit modeling of item structure in input token sequences. Second, DiscRec employs a dual-branch module to disentangle the two signals at the embedding layer: a semantic branch encodes semantic signals using original token embeddings, while a collaborative branch applies localized attention restricted to tokens within the same item to effectively capture collaborative signals. A gating mechanism subsequently fuses both branches while preserving the model's ability to model sequential dependencies. Extensive experiments on four real-world datasets demonstrate that DiscRec effectively decouples these signals and consistently outperforms state-of-the-art baselines. Our codes are available on https://github.com/Ten-Mao/DiscRec.",
    "citationCount": 3,
    "referenceCount": 45
}