{
    "paperId": "3809af2a8172b67413707e4cac2e437597a4b716",
    "title": "Comparing Approaches to Distributed Control of Fluid Systems based on Multi-Agent Systems",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Kevin T. Logan",
        "J. Stürmer",
        "T. Müller",
        "P. Pelz"
    ],
    "doi": "10.48550/arXiv.2212.08450",
    "arxivId": "2212.08450",
    "url": "https://www.semanticscholar.org/paper/3809af2a8172b67413707e4cac2e437597a4b716",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.08450",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Conventional control of fluid systems does not consider system-wide knowledge for optimising energy efficient operation. Distributed control of fluid systems combines reliable local control of components while using system-wide cooperation to ensure energy efficient operation. The presented work compares three approaches to distributed control based on multi-agent systems, distributed model predictive control (DMPC), multi-agent deep reinforcement learning (MADRL) and market mechanism design. These approaches were applied to a generic fluid system and evaluated with regard to functionality, energy efficient operation, modeling effort, reliability in the face of disruptions, and transparency of control decisions. All approaches were shown to fulfil the functionality, though a trade-off between functional quality and energy efficiency was identified. Increased modeling effort was shown to improve the performance slightly while a strong interdependence of information caused by excessive information sharing has proven to be disadvantageous. DMPC and partially observable MADRL were less sensitive to disruptions than market mechanism. In conclusion, agent-based control of fluid systems achieves greater energy efficiency than conventional methods, with values similar to centralized optimal control and thus represent a viable design approach of fluid system control.",
    "citationCount": 1,
    "referenceCount": 108
}