{
    "paperId": "3814865efd9d686fba414470762942d705f35710",
    "title": "Enhancement of shock-capturing methods via machine learning",
    "year": 2020,
    "venue": "Theoretical and Computational Fluid Dynamics",
    "authors": [
        "Ben Stevens",
        "T. Colonius"
    ],
    "doi": "10.1007/s00162-020-00531-1",
    "arxivId": "2002.02521",
    "url": "https://www.semanticscholar.org/paper/3814865efd9d686fba414470762942d705f35710",
    "isOpenAccess": true,
    "openAccessPdf": "https://authors.library.caltech.edu/records/1xdr6-8n320/files/2002.02521.pdf?download=1",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, machine learning has been used to create data-driven solutions to problems for which an algorithmic solution is intractable, as well as fine-tuning existing algorithms. This research applies machine learning to the development of an improved finite-volume method for simulating PDEs with discontinuous solutions. Shock-capturing methods make use of nonlinear switching functions that are not guaranteed to be optimal. Because data can be used to learn nonlinear relationships, we train a neural network to improve the results of a fifth-order WENO method. We post-process the outputs of the neural network to guarantee that the method is consistent. The training data consist of the exact mapping between cell averages and interpolated values for a set of integrable functions that represent waveforms we would expect to see while simulating a PDE. We demonstrate our method on linear advection of a discontinuous function, the inviscid Burgers’ equation, and the 1-D Euler equations. For the latter, we examine the Shu–Osher model problem for turbulence–shock wave interactions. We find that our method outperforms WENO in simulations where the numerical solution becomes overly diffused due to numerical viscosity.",
    "citationCount": 53,
    "referenceCount": 37
}