{
    "paperId": "38336477b890d29aeee330acdb79514e49239898",
    "title": "Identification and reconstruction of anomalous data in dam monitoring considering temporal correlation",
    "year": 2023,
    "venue": "Smart materials and structures (Print)",
    "authors": [
        "Yongjiang Chen",
        "Kui Wang",
        "M. Zhao",
        "Yong Xiong",
        "Chuanzhou Li",
        "Jianfeng Liu"
    ],
    "doi": "10.1088/1361-665X/acf970",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/38336477b890d29aeee330acdb79514e49239898",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In dam monitoring, anomalous data is often removed directly by researchers. However, some anomalous data may be due to sudden changes in the state of the dam itself and should not be removed. In this study, anomalous data in dam monitoring is divided into two categories: anomalous error data caused by anomalies in the monitoring equipment, and anomalous warning data caused by sudden changes in the state of the dam itself. Then we propose a method for identifying and reconstructing anomalous data in dam monitoring that takes into account temporal correlation. This method is able to identify and retain anomalous warning data, while removing and reconstructing anomalous error data. To determine the temporal correlation between dam monitoring parameters (e.g. water level, horizontal displacement, etc), we use association rules, and to reconstruct the removed dam monitoring data in the case of an incomplete dataset, we propose a dam monitoring data reconstruction network (DMDRN) based on generative adversarial network. On this basis and in combination with the density-based spatial clustering of applications with noise algorithm, the types of anomalous data in dam monitoring are identified, and the anomalous error data is reconstructed based on DMDRN. Our approach has been successfully validated in two experiments to identify and reconstruct anomalous data at a particular dam in China.",
    "citationCount": 5,
    "referenceCount": 43
}