{
    "paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46",
    "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview",
    "year": 2022,
    "venue": "Datenbank-Spektrum",
    "authors": [
        "L. Thamsen",
        "Dominik Scheinert",
        "Jonathan Will",
        "Jonathan Bader",
        "Odej Kao"
    ],
    "doi": "10.1007/s13222-022-00416-z",
    "arxivId": "2206.00429",
    "url": "https://www.semanticscholar.org/paper/38511a8a8d6ca24c4676c954fb05d578e444ec46",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s13222-022-00416-z.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many organizations routinely analyze large datasets using systems for distributed data-parallel processing and clusters of commodity resources. Yet, users need to configure adequate resources for their data processing jobs. This requires significant insights into expected job runtimes and scaling behavior, resource characteristics, input data distributions, and other factors. Unable to estimate performance accurately, users frequently overprovision resources for their jobs, leading to low resource utilization and high costs. In this paper, we present major building blocks towards a collaborative approach for optimization of data processing cluster configurations based on runtime data and performance models. We believe that runtime data can be shared and used for performance models across different execution contexts, significantly reducing the reliance on the recurrence of individual processing jobs or, else, dedicated job profiling. For this, we describe how the similarity of processing jobs and cluster infrastructures can be employed to combine suitable data points from local and global job executions into accurate performance models. Furthermore, we outline approaches to performance prediction via more context-aware and reusable models. Finally, we lay out how metrics from previous executions can be combined with runtime monitoring to effectively re-configure models and clusters dynamically.",
    "citationCount": 3,
    "referenceCount": 40
}