{
    "paperId": "38919149304248163bd613b89ed3cc08a5752b93",
    "title": "This is the Table I Want! Interactive Data Transformation on Desktop and in Virtual Reality",
    "year": 2023,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Sungwon In",
        "Tica Lin",
        "Chris North",
        "Hanspeter Pfister",
        "Yalong Yang"
    ],
    "doi": "10.1109/TVCG.2023.3299602",
    "arxivId": "2309.12168",
    "url": "https://www.semanticscholar.org/paper/38919149304248163bd613b89ed3cc08a5752b93",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.12168",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data transformation is an essential step in data science. While experts primarily use programming to transform their data, there is an increasing need to support non-programmers with user interface-based tools. With the rapid development in interaction techniques and computing environments, we report our empirical findings about the effects of interaction techniques and environments on performing data transformation tasks. Specifically, we studied the potential benefits of direct interaction and virtual reality (VR) for data transformation. We compared gesture interaction versus a standard WIMP user interface, each on the desktop and in VR. With the tested data and tasks, we found time performance was similar between desktop and VR. Meanwhile, VR demonstrates preliminary evidence to better support provenance and sense-making throughout the data transformation process. Our exploration of performing data transformation in VR also provides initial affirmation for enabling an iterative and fully immersive data science workflow.",
    "citationCount": 7,
    "referenceCount": 101
}