{
    "paperId": "38b294724dc07ae62e6baee31e4a47c024067e93",
    "title": "KickTree: A Recursive Algorithmic Scheme for Packet Classification with Bounded Worst-Case Performance",
    "year": 2021,
    "venue": "Symposium on Architectures for Networking and Communications Systems",
    "authors": [
        "Yao Xin",
        "Yuxi Liu",
        "Wenjun Li",
        "Ruyi Yao",
        "Yang Xu",
        "Yi Wang"
    ],
    "doi": "10.1145/3493425.3502752",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/38b294724dc07ae62e6baee31e4a47c024067e93",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a promising alternative to TCAM-based solutions for packet classification, FPGA has received increasing attention. Although extensive research has been conducted in this area, existing FPGA-based packet classifiers cannot satisfy the burgeoning needs from OpenFlow, which demands large-scale rule sets and frequent rule updates. As a recently proposed hardware-specific approach, TabTree avoids rule replication and supports dynamic rule update. However, it still faces problems of unbalanced rule subset partition, unevenly distributed subtrees and excessive TSS leaf nodes when implemented on FPGA. In this paper, we propose a hardware-friendly packet classification approach called KickTree, which is elaborated by considering hardware properties. To take advantage of intrinsic parallelism of FPGA, KickTree adopts multiple balanced decision trees which can run simultaneously. The bit selection is more flexible which breaks the restriction of rule subset. Moreover, each subset size is strictly limited, leading to bounded and evenly-distributed",
    "citationCount": 9,
    "referenceCount": 47
}