{
    "paperId": "391e118ffc0417a33632dc35bdfc402012920835",
    "title": "DBCopilot: Natural Language Querying over Massive Databases via Schema Routing",
    "year": 2023,
    "venue": "International Conference on Extending Database Technology",
    "authors": [
        "Tianshu Wang",
        "Xiaoyan Chen",
        "Hongyu Lin",
        "Xianpei Han",
        "Le Sun",
        "Hao Wang",
        "Zhenyu Zeng"
    ],
    "doi": "10.48786/edbt.2025.57",
    "arxivId": "2312.03463",
    "url": "https://www.semanticscholar.org/paper/391e118ffc0417a33632dc35bdfc402012920835",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The development of Natural Language Interfaces to Databases (NLIDBs) has been greatly advanced by the advent of large language models (LLMs), which provide an intuitive way to translate natural language (NL) questions into Structured Query Language (SQL) queries. While significant progress has been made in LLM-based NL2SQL, existing approaches face several challenges in real-world scenarios of natural language querying over massive databases. In this paper, we present DBCopilot, a framework that addresses these challenges by employing a compact and flexible copilot model for routing over massive databases. Specifically, DBCopilot decouples schema-agnostic NL2SQL into schema routing and SQL generation. This framework utilizes a single lightweight differentiable search index to construct semantic mappings for massive database schemata, and navigates natural language questions to their target databases and tables in a relation-aware joint retrieval manner. The routed schemata and questions are then fed into LLMs for effective SQL generation. Furthermore, DBCopilot introduces a reverse schema-to-question generation paradigm that can automatically learn and adapt the router over massive databases without manual intervention. Experimental results verify that DBCopilot is a scalable and effective solution for schema-agnostic NL2SQL, providing a significant advance in handling natural language querying over massive databases for NLIDBs.",
    "citationCount": 8,
    "referenceCount": 82
}