{
    "paperId": "393ed898426e3039f464b85cb991c1382ca007f9",
    "title": "Effects of sampling and horizon in predictive reinforcement learning",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Pavel Osinenko",
        "Dmitrii Dobriborsci"
    ],
    "doi": null,
    "arxivId": "2108.04802",
    "url": "https://www.semanticscholar.org/paper/393ed898426e3039f464b85cb991c1382ca007f9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Plain reinforcement learning (RL) may be prone to loss of convergence, constraint violation, unexpected performance, etc. Commonly, RL agents undergo extensive learning stages to achieve acceptable functionality. This is in contrast to classical control algorithms which are typically model-based. An direction of research is the fusion of RL with such algorithms, especially model-predictive control (MPC). This, however, introduces new hyper-parameters related to the prediction horizon. Furthermore, RL is usually concerned with Markov decision processes. But the most of the real environments are not time-discrete. The factual physical setting of RL consists of a digital agent and a time-continuous dynamical system. There is thus, in fact, yet another hyper-parameter -- the agent sampling time. In this paper, we investigate the effects of prediction horizon and sampling of two hybrid RL-MPC-agents in a case study with a mobile robot parking, which is in turn a canonical control problem. We benchmark the agents with a simple variant of MPC. The sampling showed a kind of a\"sweet spot\"behavior, whereas the RL agents demonstrated merits at shorter horizons.",
    "citationCount": 0,
    "referenceCount": 57
}