{
    "paperId": "39580fab8021c5e1047ecd3f7a1783e1b4d42882",
    "title": "End-to-End Application Cloning for Distributed Cloud Microservices with Ditto",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Mingyu Liang",
        "Yu Gan",
        "Yueying Li",
        "Carlos Torres",
        "A. Dhanotia",
        "M. Ketkar",
        "Christina Delimitrou"
    ],
    "doi": "10.48550/arXiv.2212.13867",
    "arxivId": "2212.13867",
    "url": "https://www.semanticscholar.org/paper/39580fab8021c5e1047ecd3f7a1783e1b4d42882",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.13867",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The lack of representative, publicly-available cloud services has been a recurring problem in the architecture and systems communi-ties. While open-source benchmarks exist, they do not capture the full complexity of cloud services. Application cloning is a promising way to address this, however, prior work is limited to CPU-/cache-centric, single-node services, operating at user level. We present Ditto, an automated framework for cloning end-to-end cloud applications, both monolithic and microservices, which captures I/O and network activity, as well as kernel operations, in addition to application logic. Ditto takes a hierarchical approach to application cloning, starting with capturing the dependency graph across distributed services, to recreating each tier’s control/data flow, and finally generating system calls and assembly that mim-ics the individual applications. Ditto does not reveal the logic of the original application, facilitating publicly sharing clones of production services with hardware vendors, cloud providers, and the research community. We show that across a diverse set of single- and multi-tier applications, Ditto accurately captures their CPU and memory characteristics as well as their high-level performance metrics, is portable across platforms, and facilitates a wide range of system studies.",
    "citationCount": 0,
    "referenceCount": 106
}