{
    "paperId": "396a0917cbf90fd4cbd5eea3b13a89ff735c334b",
    "title": "ISAC: In-Switch Approximate Cache for IoT Object Detection and Recognition",
    "year": 2023,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Wenquan Xu",
        "Zijian Zhang",
        "Haoyu Song",
        "Shuxin Liu",
        "Yong Feng",
        "Bin Liu"
    ],
    "doi": "10.1109/INFOCOM53939.2023.10229067",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/396a0917cbf90fd4cbd5eea3b13a89ff735c334b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In object detection and recognition, similar but nonidentical sensing data probably maps to the same result. Therefore, a cache preserving popular results to support approximate match for similar input requests can accelerate the task by avoiding the otherwise expensive deep learning model inferences. However, the current software and hardware practices carried on edge or cloud servers are inefficient in either cost or performance. Taking advantage of the on-path programmable switches, we propose In-Switch Approximate Cache (ISAC) to reduce the server workload and latency. The unique approximate matching requirement sets ISAC apart from a conventional exact-match cache. Equipped with efficient encoding and qualifying algorithms, ISAC in an on-path switch can fulfill most of the input requests with high accuracy. When adapting to a P4 programmable switch, it can sustain up to 194M frames per second and fulfill 60.3% of them, achieving a considerable reduction on detection latency, server cost, and power consumption. Readily deployable in existing network infrastructure, ISAC is the first-of-its-kind approximate cache that can be completely implemented in a switch to support a class of IoT applications.",
    "citationCount": 1,
    "referenceCount": 64
}