{
    "paperId": "397075bf9bc5587a0b5a0199ee367045ce31e77e",
    "title": "A mixed-methods protocol to develop and validate a stewardship maturity matrix for human genomic data in the cloud",
    "year": 2022,
    "venue": "Frontiers in Genetics",
    "authors": [
        "V. Rahimzadeh",
        "G. Peng",
        "Mildred K. Cho"
    ],
    "doi": "10.3389/fgene.2022.876869",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/397075bf9bc5587a0b5a0199ee367045ce31e77e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fgene.2022.876869/pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article describes a mixed-methods protocol to develop and test the implementation of a stewardship maturity matrix (SMM) for repositories which govern access to human genomic data in the cloud. It is anticipated that the cloud will host most human genomic and related health datasets generated as part of publicly funded research in the coming years. However, repository managers lack practical tools for identifying what stewardship outcomes matter most to key stakeholders as well as how to track progress on their stewardship goals over time. In this article we describe a protocol that combines Delphi survey methods with SMM modeling first introduced in the earth and planetary sciences to develop a stewardship impact assessment tool for repositories that manage access to human genomic data. We discuss the strengths and limitations of this mixed-methods design and offer points to consider for wrangling both quantitative and qualitative data to enhance rigor and representativeness. We conclude with how the empirical methods bridged in this protocol have potential to improve evaluation of data stewardship systems and better align them with diverse stakeholder values in genomic data science.",
    "citationCount": 0,
    "referenceCount": 50
}