{
    "paperId": "397a7d7006eacb6dcd8844016c82d5fcc525b4cb",
    "title": "Does Industrial Structure Upgrading Promote China’s Outward Foreign Direct Investment (OFDI) in ASEAN Countries? Evidence from Provincial Panels",
    "year": 2024,
    "venue": "Economies",
    "authors": [
        "Ai Li",
        "Jinjing Zhao",
        "Zhenqing Su",
        "Miao Su"
    ],
    "doi": "10.3390/economies12090228",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/397a7d7006eacb6dcd8844016c82d5fcc525b4cb",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/economies12090228",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Numerous studies have explored the impact of Outward Foreign Direct Investment (OFDI) on upgrading industrial structures in home countries. However, a notable gap exists in the literature regarding the reverse relationship. Based on the cross-border greenfield investment data of Chinese provinces in Association of Southeast Asian Nations (ASEAN) countries from 2003 to 2021, this study employed the Ordinary Least Squares (OLS) model to evaluate the impact of industrial upgrading in each province on OFDI to address this gap. The findings suggest that China’s industrial structure upgrading significantly promotes OFDI toward ASEAN countries, though the effect varies by region within China and by the income levels of host countries. Regionally, industrial upgrading in eastern China notably stimulates OFDI growth, while the effect is not significant in the central and western regions, reflecting inconsistent evolution of industrial structures in various regions. Regarding host country income levels, the promotion effect of industrial structure upgrading on OFDI is influenced by the economic development level of the host country. Furthermore, we find that R&D intensity acts as a moderator that links industrial structural upgrading to OFDI responses. These findings withstand robustness checks, including tests for endogeneity. Ultimately, this study provides policy insights for strengthening the virtuous cycle between industrial upgrading and OFDI.",
    "citationCount": 1,
    "referenceCount": 71
}