{
    "paperId": "39cb64da4482867e8dcfe33b5251ab61d1d5f2e0",
    "title": "A Global Energy-Efficient Framework for Edge AI in Industry and Railway",
    "year": 2024,
    "venue": "International Conference on Control, Automation and Systems",
    "authors": [
        "C. Nicodeme"
    ],
    "doi": "10.23919/iccas63016.2024.10773332",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/39cb64da4482867e8dcfe33b5251ab61d1d5f2e0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Since its inception, railway has always been the greenest transportation system, whether for freight or passengers. It is based on an old but simple and efficient physical solution: the low adhesion between the wheels and the tracks. However, in the past decades, this mode of transport is undergoing and taking advantage of digital transformation. In particular, the development of Internet of Things (IoT) systems for smart transport now offers the possibility to extract meaningful insights and assist decision-making. Indeed, they generates humongous amount of data; they need to be processed in real time, so that the information is not outdated. Artificial Intelligence (AI) and Deep Learning are the perfect tools for large dataset processing, in particular through their elusive features extraction. Unfortunately, AI-based algorithms require substantial resources for developing their architecture, training them and executing the program when industrialized. This is not suitable for many industries and embedded systems. Hence, despite AI appeal for railway companies, it cannot be used as is. In this work, the authors present a synthetic review of edge AI (edge computing + AI), from data acquisition to inference, and propose a framework compatible with computationally limited systems.",
    "citationCount": 0,
    "referenceCount": 30
}