{
    "paperId": "39e3554906eb00d36e5d0da5ec67d007a6392537",
    "title": "An AI-Augmented Kernel for Dynamic Resource Utilization in Virtualized Environments",
    "year": 2025,
    "venue": "Engineering, Technology &amp; Applied Science Research",
    "authors": [
        "B. Nethravathi",
        "Girija Rani Suthoju",
        "B. C. Kavitha",
        "M. K. Bindiya",
        "B. Madhu",
        "B. R. Harsha",
        "Deepti S. Deshpande",
        "B. Y. Rakshitha",
        "S. Gokul"
    ],
    "doi": "10.48084/etasr.12536",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/39e3554906eb00d36e5d0da5ec67d007a6392537",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dynamic resource utilization in virtualized environments can be achieved through an AI-augmented kernel that employs a Random Forest model for real-time prediction of the optimal resource allocation. This approach addresses key challenges in resource management for cloud computing and data-intensive applications by leveraging machine learning to analyze system metrics, such as CPU and memory usage. The experimental setup utilizes control groups (cgroups) and the psutil library for effective resource monitoring and control. The results demonstrate significant improvements in system performance, with the AI-driven model achieving an accuracy of 99.34%. This high level of accuracy indicates efficient resource allocation, minimizing waste and enhancing the system stability. This study highlights the potential of integrating machine learning at the kernel level and lays the groundwork for further exploration of AI-enabled operating systems capable of improved adaptability and responsiveness in the modern computing infrastructure.",
    "citationCount": 0,
    "referenceCount": 25
}