{
    "paperId": "3a0ebddcc6c482f3d934e403f44b7a5b52155214",
    "title": "Comprehending the Use of Intelligent Techniques to Support Technical Debt Management",
    "year": 2022,
    "venue": "2022 IEEE/ACM International Conference on Technical Debt (TechDebt)",
    "authors": [
        "D. Albuquerque",
        "Everton T. Guimarães",
        "G. Tonin",
        "M. Perkusich",
        "H. Almeida",
        "A. Perkusich"
    ],
    "doi": "10.1145/3524843.3528097",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3a0ebddcc6c482f3d934e403f44b7a5b52155214",
    "isOpenAccess": true,
    "openAccessPdf": "https://scholarsphere.psu.edu/resources/840ba615-33db-47ea-b48d-facfce12eb77/downloads/21047",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Technical Debt (TD) refers to the consequences of taking shortcuts when developing software. Technical Debt Management (TDM) becomes complex since it relies on a decision process based on multiple and heterogeneous data, which are not straightforward to be synthesized. In this context, there is a promising opportunity to use Intelligent Techniques to support TDM activities since these techniques explore data for knowledge discovery, reasoning, learning, or supporting decision-making. Although these techniques can be used for improving TDM activities, there is no empirical study exploring this research area. This study aims to identify and analyze solutions based on Intelligent Techniques employed to sup-port TDM activities. A Systematic Mapping Study was performed, covering publications between 2010 and 2020. From 2276 extracted studies, we selected 111 unique studies. We found a positive trend in applying Intelligent Techniques to support TDM activities, being Machine Learning, Reasoning Under Uncertainty, and Natu-ral Language Processing the most recurrent ones. Identification, measurement, and monitoring were the more recurrent TDM ac-tivities, whereas Design, Code, and Architectural were the most frequently investigated TD types. Although the research area is up-and-coming, it is still in its infancy, and this study provides a baseline for future research.",
    "citationCount": 6,
    "referenceCount": 36
}