{
    "paperId": "3a1e8c05ac3317c5c5a5bddac174dce96758090b",
    "title": "Unsupervised Network Traffic Classification Based on Multi-Source Synergistic Distribution Alignment",
    "year": 2023,
    "venue": "Global Communications Conference",
    "authors": [
        "Bowen Gao",
        "Yang Yang",
        "Zhipeng Gao",
        "Peng Yu",
        "Rui Lyu",
        "Shaoying Chen"
    ],
    "doi": "10.1109/GLOBECOM54140.2023.10437268",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3a1e8c05ac3317c5c5a5bddac174dce96758090b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Network traffic classification is a key technology in network communication management, which is of great significance for building intelligent communication and so on. Due to the difficult and time-consuming process of network traffic labeling, it is difficult to obtain any labeled traffic data in some special networks. At the same time, in a real network environment, there are multiple network traffic domains, and the data distribution of each network traffic domain is different, making it extremely difficult to train a network traffic classification model that performs well on multiple traffic domains simultaneously. Therefore, this paper proposes a network traffic classification method in unsupervised scenarios, aiming to study how to learn traffic knowledge from multiple source traffic domains and achieve accurate classification of unlabeled network traffic without labeled traffic data in the target traffic domain. This paper divides three traffic domains from the data set, namely VPN, nonVPN and nonTor. And three traffic classification tasks of unsupervised multi-source domain are constructed. The accuracy of traffic classification tasks in the source traffic domain is nonTor and nonVPN, and the target traffic domain is VPN reaches 89.76%. The source traffic domain is VPN and nonTor, the accuracy of the classification task is 91.73% when the target traffic domain is nonVPN, and 90.35% when the source traffic domain is VPN and nonVPN, and the target traffic domain is nonTor. Experimental results show the effectiveness of the network traffic classification algorithm proposed in this paper.",
    "citationCount": 1,
    "referenceCount": 12
}