{
    "paperId": "3a36bc00c511288c20b3119c4cb9d87c71c001c9",
    "title": "Methods for a feminist technoscience of information practice: Design justice and speculative futurities",
    "year": 2021,
    "venue": "J. Assoc. Inf. Sci. Technol.",
    "authors": [
        "Diana Floegel",
        "K. Costello"
    ],
    "doi": "10.1002/asi.24597",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3a36bc00c511288c20b3119c4cb9d87c71c001c9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article builds on the argument that feminist technoscience will advance information practice scholarship beyond its current limitations. These limitations reflect neoliberalism in the field of information science and include a reliance on extractive logics in theories and models, monological individualism, binaries constructed between people and technologies, and techno‐solutionism. Here, we address the question: what does it look like to apply technofeminism to the study of information practice at methodological and methods levels? We first outline our metatheoretical conception of feminist technoscience, which embraces intersectionality and assemblage theory in order to move past white and colonialist logics embedded in cyborg theory. We next offer design justice as a methodological framework and movement that provides a necessary overhaul of the neoliberal ways that information science approaches scholarship, particularly in terms of participatory research. We suggest that speculative futurities provide a promising method for advancing technofeminism in information practice research because they explicitly reject neoliberalism and its techno‐solutionist bent. Overall, a feminist technoscience of information practice offers directions for our field that are rooted in liberatory epistemologies. We emphasize that in order to achieve liberation, a major overhaul in how our discipline approaches arrangements of information, people, and technologies is sorely needed.",
    "citationCount": 12,
    "referenceCount": 69
}