{
    "paperId": "3a8245e090b7c6e305612c17b137f70bfd256b7f",
    "title": "A Lightweight General Adaptive Optimization Tool for Relational DBMSs under HTAP Workloads",
    "year": 2022,
    "venue": "IEEE International Conference on Services Computing",
    "authors": [
        "Zhu Yuan",
        "Hao-peng Chen",
        "Ziang Huang",
        "Jiansi Wang",
        "Zhengtong Zhang"
    ],
    "doi": "10.1109/SCC55611.2022.00020",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3a8245e090b7c6e305612c17b137f70bfd256b7f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "It is well-known challenging to operate data-intensive applications on RDBMS(Relational DBMS) because the static storage model does not perform well for real-time processing queries and historical analyses. Existing HTAP systems pursue the robustness and functional completeness of the system excessively, which leads to over-design in the scenario where OLAP and OLTP alternate instead of coming simultaneously. Therefore, we present a lightweight general and adaptive optimization tool for RDBMS to address this issue. By deep learning-based workload forecasting, our tool optimizes the storage model continuously and ensures that the database is always at its best when handling coming HTAP requests. It differs from previous methods in that it adaptively optimizes existing databases as a plug-in but not with intrusive programming. Through experimental validation, our tool has an average performance improvement of 13.1% compared with static row-store RDBMS and 45.3% compared with static column-store RDBMS under a typical HTAP workload. The validation result illustrates that our tool makes RDBMSs more efficient in handling HTAP workloads at a tiny cost.",
    "citationCount": 0,
    "referenceCount": 27
}