{
    "paperId": "3b11bf8853eff3c22479a1ae0a1ad64af7601443",
    "title": "Unlocking the Potential of IndoBERT for Classification of Indonesian Thesis",
    "year": 2024,
    "venue": "2024 International Conference on Informatics, Multimedia, Cyber and Information System (ICIMCIS)",
    "authors": [
        "Marcel Kurniawan",
        "Budi Juarto"
    ],
    "doi": "10.1109/ICIMCIS63449.2024.10956541",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3b11bf8853eff3c22479a1ae0a1ad64af7601443",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nowadays, the development of digital information volume is growing rapidly, thus creating new challenges in data processing in educational institutions. One of the data that will always increase every year is thesis, a scientific work prepared by final year students as a graduation requirement. The purpose of this study is to explore the use of IndoBERT in classifying Indonesian thesis which has never been done before. This study also compares the performance of IndoBERT with traditional machine learning models such as XGBoost, LightGBM, and Gradient Boosting Machine (GBM). The stages of this research include data collection followed by text preprocessing, text representation, model implementation, and result evaluation. The results of this study show IndoBERT's high performance in classifying thesis documents by almost classifying all documents with 96% accuracy which proves that IndoBERT can classify Indonesian thesis documents accurately. The high performance of IndoBERT in classifying Indonesian theses is because IndoBERT is a pre-trained model that has been trained from various Indonesian language sources such as news and the internet.",
    "citationCount": 0,
    "referenceCount": 28
}