{
    "paperId": "3b22251b1baf172faaa5ab94d6261002350d3fb1",
    "title": "Algorithmic research on surface roughness in laser-melted claddings: A review",
    "year": 2024,
    "venue": "Surface Engineering",
    "authors": [
        "Changlong Zhao",
        "Zihao Zhang",
        "Zice Yu",
        "Weilong Du"
    ],
    "doi": "10.1177/02670844241298946",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3b22251b1baf172faaa5ab94d6261002350d3fb1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a breakthrough of the additive manufacturing technology being achieved, many fields have broadly applied laser cladding due to its unique advantages. But the surface characteristics of the cladding layer are not frequently aligned with the standards necessary for industrial use. Consequently, with a particular focus on refining its surface roughness, it has emerged as a significant area of interest among numerous investigators. This paper reviews a variety of methods for optimizing the surface roughness of laser cladding, covering from deterministic algorithms such as Taguchi's method, orthogonal experimental method, gradient descent method, to stochastic algorithms including neural network, genetic algorithm, Gray Wolf algorithm, and even hybrid algorithms combining multiple algorithms like neural network genetic algorithm, adaptive neural fuzzy reasoning algorithm, and improved genetic algorithms for response surface analysis, and so on. Through comparative analysis, it is found that the hybrid algorithms can quickly generate the optimal optimization parameters for the sake of achieving the optimal surface quality since they may combine the accuracy of deterministic algorithms and the robustness of stochastic algorithms. In addition, this paper also looks forward to the future development direction of surface quality optimization methods for laser cladding, aiming at laying a foundation for the research work of high-quality coating preparation.",
    "citationCount": 1,
    "referenceCount": 59
}