{
    "paperId": "3b459b7d6d1362d7a32aaaf2fbf8669d9f4c5747",
    "title": "CAsT-19: A Dataset for Conversational Information Seeking",
    "year": 2020,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Jeffrey Dalton",
        "Chenyan Xiong",
        "Vaibhav Kumar",
        "Jamie Callan"
    ],
    "doi": "10.1145/3397271.3401206",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3b459b7d6d1362d7a32aaaf2fbf8669d9f4c5747",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "CAsT-19 is a new dataset that supports research on conversational information seeking. The corpus is 38,426,252 passages from the TREC Complex Answer Retrieval (CAR) and Microsoft MAchine Reading COmprehension (MARCO) datasets. Eighty information seeking dialogues (30 train, 50 test) are an average of 9 to 10 questions long. A dialogue may explore a topic broadly or drill down into subtopics. Questions contain ellipsis, implied context, mild topic shifts, and other characteristics of human conversation that may prevent them from being understood in isolation. Relevance assessments are provided for 30 training topics and 20 test topics. CAsT-19 promotes research on conversational information seeking by defining it as a task in which effective passage selection requires understanding a question's context (the dialogue history). It focuses attention on user modeling, analysis of prior retrieval results, transformation of questions into effective queries, and other topics that have been difficult to study with existing datasets.",
    "citationCount": 70,
    "referenceCount": 10
}