{
    "paperId": "3bcc2c2bd8ba6e07afae17031a47a57277ed1fcf",
    "title": "AI-Driven Stacking Ensemble for Predicting Total Power Output of Wave Energy Converters: A Data-Driven Approach to Renewable Energy Processes",
    "year": 2025,
    "venue": "Processes",
    "authors": [
        "T. Muthamizhan",
        "K. Karthick",
        "S. K. Aruna",
        "P. Velmurugan"
    ],
    "doi": "10.3390/pr13040961",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3bcc2c2bd8ba6e07afae17031a47a57277ed1fcf",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/pr13040961",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study develops and evaluates an AI-driven stacked hybrid machine learning model for predicting the total power output of wave energy converters (WECs) across four Australian coastal locations: Adelaide, Perth, Sydney, and Tasmania. This research enhances prediction accuracy through advanced ensemble learning techniques while addressing spatial variability in wave energy processes. The dataset comprises spatial coordinates and power output readings from 16 fully submerged WECs per location, capturing the variability of wave energy across different coastal regions. Data preprocessing included missing value imputation, duplicate removal, and spatial feature transformation via Euclidean distance calculation. Principal component analysis (PCA) was employed to reduce dimensionality while preserving critical features influencing power generation. To develop an accurate prediction model, we employed a stacking ensemble approach using XGBoost, LightGBM, and CatBoost as base learners, optimized via Optuna hyperparameter tuning with 10-fold cross-validation. A Ridge regression meta-learner combined the outputs of these models, leveraging their complementary strengths to enhance predictive performance. Experimental results demonstrate that the hybrid model consistently outperforms individual models, enhancing predictive accuracy across all locations. Sydney exhibited the highest accuracy (RMSE = 9089.58 W, R2 = 0.8576), while Tasmania posed the greatest challenge (RMSE = 45,032.37 W, R2 = 0.8378). The ensemble approach mitigated overfitting and improved generalization by leveraging the complementary strengths of XGBoost, LightGBM, and CatBoost. By leveraging AI-driven ensemble learning, this study provides a scalable and reliable framework for wave energy forecasting, facilitating more efficient grid integration and resource planning in renewable energy systems.",
    "citationCount": 1,
    "referenceCount": 41
}