{
    "paperId": "3bdb87927b67b29bddb3bf46000c459f28e3415e",
    "title": "OpenDC 2.0: Convenient Modeling and Simulation of Emerging Technologies in Cloud Datacenters",
    "year": 2021,
    "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing",
    "authors": [
        "Fabian Mastenbroek",
        "G. Andreadis",
        "Soufiane Jounaid",
        "Wenchen Lai",
        "Jacob Burley",
        "J. Bosch",
        "Erwin Van Eyk",
        "L. Versluis",
        "V. V. Beek",
        "A. Iosup"
    ],
    "doi": "10.1109/CCGrid51090.2021.00055",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3bdb87927b67b29bddb3bf46000c459f28e3415e",
    "isOpenAccess": true,
    "openAccessPdf": "https://research.vu.nl/files/239054370/OpenDC_2.0.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud datacenters are important for the digital society, serving stakeholders across industry, government, and academia. Simulation is a critical part of exploring datacenter technologies, enabling scalable experimentation with millions of jobs and hundreds of thousands of machines, and what-if analysis in a matter of minutes to hours. Although the community has already developed powerful simulators, emerging technologies and applications in modern datacenters require new approaches. Addressing this requirement, in this work we propose OpenDC, a new platform for datacenter simulation. OpenDC includes novel models for emerging cloud-datacenter technologies and applications, such as serverless computing with FaaS deployment and TensorFlow-based machine learning. Our design also focuses on convenience, with a web-based interface for interactive experimentation, support for experiment automation, a library of prefabs for constructing and sharing datacenter designs, and support for diverse input formats and output metrics. We implement, validate, and open-source OpenDC 2.0, a significant redesign and release after a multi-year research and development process. We demonstrate the benefits of OpenDC for the field through a set of representative use-cases: serverless, machine learning, procurement of HPC-as-a-Service infrastructure, educational practices, and reproducibility studies. Overall, OpenDC helps understand how datacenters work, design datacenter infrastructure, and train the next generation of experts.",
    "citationCount": 28,
    "referenceCount": 62
}