{
    "paperId": "3c0d194b4446126c0488e9c23fc76837db7a3171",
    "title": "A hybrid environmental multi-objective optimization algorithm for eco-friendly vehicle routing in smart cities",
    "year": 2025,
    "venue": "Land and Architecture",
    "authors": [
        "Amrita Prakash",
        "Amir Khusru Akhtar"
    ],
    "doi": "10.56294/la2025151",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c0d194b4446126c0488e9c23fc76837db7a3171",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction: this paper presents HEMO, an intelligent vehicle routing system designed to address urban sustainability challenges in smart cities. The algorithm optimizes transportation networks by simultaneously evaluating multiple environmental and operational parameters, including route efficiency, vehicular emissions, fuel efficiency, noise pollution, and traffic regulation compliance.Method: our comprehensive evaluation demonstrates HEMO’s superior performance compared to conventional routing approaches, achieving significant improvements across all measured metrics: a 19,3 % reduction in travel distance, 20,7 % decrease in harmful emissions, and 19,5 % lower fuel consumption. Notably, the system shows exceptional effectiveness in mitigating urban nuisances, with 75 % fewer noise violations and 77,8 % reduction in speed limit infractions.Results: these results establish HEMO as a balanced solution that harmonizes ecological preservation with traffic management objectives. The algorithm’s multi-criteria optimization framework represents a substantial advancement over existing eco-routing methods, offering municipal authorities a practical tool for implementing sustainable mobility solutions.Conclusions: by dynamically adapting to real-time urban conditions while prioritizing environmental protection, HEMO provides a scalable model for smart city infrastructure that addresses both immediate traffic concerns and long-term sustainability goals.",
    "citationCount": 1,
    "referenceCount": 13
}