{
    "paperId": "3c2280ecd14a21f69914ee3208d4af27ecefb142",
    "title": "In-memory database acceleration on FPGAs: a survey",
    "year": 2019,
    "venue": "The VLDB journal",
    "authors": [
        "Jian Fang",
        "Yvo T. B. Mulder",
        "J. Hidders",
        "Jinho Lee",
        "H. P. Hofstee"
    ],
    "doi": "10.1007/s00778-019-00581-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c2280ecd14a21f69914ee3208d4af27ecefb142",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00778-019-00581-w.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While FPGAs have seen prior use in database systems, in recent years interest in using FPGA to accelerate databases has declined in both industry and academia for the following three reasons. First, specifically for in-memory databases, FPGAs integrated with conventional I/O provide insufficient bandwidth, limiting performance. Second, GPUs, which can also provide high throughput, and are easier to program, have emerged as a strong accelerator alternative. Third, programming FPGAs required developers to have full-stack skills, from high-level algorithm design to low-level circuit implementations. The good news is that these challenges are being addressed. New interface technologies connect FPGAs into the system at main-memory bandwidth and the latest FPGAs provide local memory competitive in capacity and bandwidth with GPUs. Ease of programming is improving through support of shared coherent virtual memory between the host and the accelerator, support for higher-level languages, and domain-specific tools to generate FPGA designs automatically. Therefore, this paper surveys using FPGAs to accelerate in-memory database systems targeting designs that can operate at the speed of main memory.",
    "citationCount": 79,
    "referenceCount": 154
}