{
    "paperId": "3c2643116ff38b28ce9a7c741b6c155463681116",
    "title": "Database Evolution: The Transformation of Data Partitioning and Indexing in the Cloud Era",
    "year": 2025,
    "venue": "Journal of Computer Science and Technology Studies",
    "authors": [
        "Purushotham Jinka"
    ],
    "doi": "10.32996/jcsts.2025.7.5.3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c2643116ff38b28ce9a7c741b6c155463681116",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud computing has revolutionized database management systems, transforming traditional approaches to data partitioning and indexing strategies. The shift from on-premises to cloud-native solutions has introduced automated scaling, dynamic resource allocation, and intelligent workload distribution mechanisms. This transformation has enabled organizations to achieve higher availability, improved performance, and reduced operational costs. The evolution encompasses machine learning-driven optimizations, enhanced cross-region data distribution, and advanced predictive scaling capabilities, fundamentally changing how databases are designed, deployed, and managed in modern applications. The integration of artificial intelligence and automation has further enhanced database operations, enabling real-time optimization, predictive maintenance, and autonomous decision-making capabilities while ensuring data consistency and reliability across distributed environments. These advancements have redefined the boundaries of database management, creating more resilient and adaptive systems capable of meeting evolving business demands.",
    "citationCount": 1,
    "referenceCount": 12
}