{
    "paperId": "3c2714565b5b96661e68010fe5221986c70fb3ae",
    "title": "To Share, or not to Share Online Event Trend Aggregation Over Bursty Event Streams",
    "year": 2021,
    "venue": "SIGMOD Conference",
    "authors": [
        "Olga Poppe",
        "Chuan Lei",
        "L. Ma",
        "Allison Rozet",
        "Elke A. Rundensteiner"
    ],
    "doi": "10.1145/3448016.3452785",
    "arxivId": "2101.00361",
    "url": "https://www.semanticscholar.org/paper/3c2714565b5b96661e68010fe5221986c70fb3ae",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3448016.3452785",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Complex event processing (CEP) systems continuously evaluate large workloads of pattern queries under tight time constraints. Event trend aggregation queries with Kleene patterns are commonly used to retrieve summarized insights about the recent trends in event streams. State-of-art methods are limited either due to repetitive computations or unnecessary trend construction. Existing shared approaches are guided by statically selected and hence rigid sharing plans that are often sub-optimal under stream fluctuations. In this work, we propose a novel framework Hamlet that is the first to overcome these limitations. Hamlet introduces two key innovations. First, Hamlet adaptively decides at run time whether to share or not to share computations depending on the current stream properties to harvest the maximum sharing benefit. Second, Hamlet is equipped with a highly efficient shared trend aggregation strategy that avoids trend construction. Our experimental study on both real and synthetic data sets demonstrates that Hamlet consistently reduces query latency by up to five orders of magnitude compared to state-of-the-art approaches.",
    "citationCount": 14,
    "referenceCount": 51
}