{
    "paperId": "3c3842ce2f0a7b2941f5b739af6c7353fc495288",
    "title": "Hybrid Models in Diabetes Prediction: A Review of Techniques, Performance, and Potential",
    "year": 2024,
    "venue": "Journal of Al-Qadisiyah for Computer Science and Mathematics",
    "authors": [
        "Mustafa M. Abd Zaid",
        "Ahmed Abed Mohammed"
    ],
    "doi": "10.29304/jqcsm.2024.16.41805",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c3842ce2f0a7b2941f5b739af6c7353fc495288",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This review focuses on the versatility of hybrid models in diabetes prediction, for which early and accurate diagnosis is crucial for patients. Hybrid models have an advantage over traditional approaches since they utilize a combination of machine learning and deep learning to overcome several restrictions inherent in conventional techniques in terms of feature extraction, accuracy, and robustness. Among the structures discussed in this paper, Combine Convolutional Neural Networks and Long Short Term Memory (CNN-LSTM), Support Vector Machine (SVM) with clustering or Decision Tree, and ensemble methods all show high capabilities of capturing the patterns in the diabetes datasets. Analyses state that current typical implementations of hybrid models, intense machine learning, and machine learning achieve the finest steadiness and predictability. However, the following challenges are still experienced: high computational demand, data demands, and interpretability. The subsequent studies should enhance the clinical relevance of these models, including efforts to interpret these models, combine electronic health records, and improve models’ ability to work in real-time before contributing to more effective healthcare solutions for diabetes.",
    "citationCount": 1,
    "referenceCount": 39
}