{
    "paperId": "3c45d5cff2a8bf9f50d37b14b977c8ac7a010fed",
    "title": "Accurate Photovoltaic Forecasting through a Multi-connected Structural Network",
    "year": 2024,
    "venue": "2024 IEEE 4th International Conference on Power, Electronics and Computer Applications (ICPECA)",
    "authors": [
        "Jiangshan Xie",
        "Yanming Hu",
        "Fangying Rong"
    ],
    "doi": "10.1109/ICPECA60615.2024.10471028",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c45d5cff2a8bf9f50d37b14b977c8ac7a010fed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growing demand for renewable energy sources, the importance of accurate photovoltaic (PV) forecasting has become crucial for effective energy management. Predicting PV output remains a challenge due to the need for high accuracy and low computational complexity. This paper introduces a novel method for general PV forecasting through a multi-connected structural network to pursue accurate PV generation. We explore the impact of different neural network interactions on actual power data within the network layer and test its relevance by constantly changing parameters. Stacked gate recurrent unit (GRU) and bidirectional long short-term memory (BiLSTM) networks are used to learn universal meteorological data feature as input for network layers, and after incorporating an attention mechanism, they are trained in a hierarchical manner of multi model fusion, interaction, and infiltration. Experimental results indicate that the proposed method can achieve competitive performance when compared to traditional single approaches.",
    "citationCount": 0,
    "referenceCount": 19
}