{
    "paperId": "3c58e3355736a0520a46601837339392092c59a4",
    "title": "Bidirectional Analog Conductance Modulation for RRAM-Based Neural Networks",
    "year": 2020,
    "venue": "IEEE Transactions on Electron Devices",
    "authors": [
        "Zizhen Jiang",
        "Ziwen Wang",
        "Xin Zheng",
        "S. Fong",
        "MemberIEEE Shengjun Qin",
        "Hong-Yu Chen",
        "Ethan C. Ahn",
        "MemberIEEE Ji Cao",
        "Y. Nishi",
        "LifeFellowIEEE S. Simon Wong",
        "Ieee H.-S. Philip Wong Fellow"
    ],
    "doi": "10.1109/TED.2020.3025849",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c58e3355736a0520a46601837339392092c59a4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Increasing computation demand of machine learning (ML) applications (recommender system, image classification, speech recognition, and so on) calls for the development of specialized hardware for ML and neuromorphic computing. New memories, such as resistive random access memory (RRAM), can be used to store weights of neural networks and to accelerate matrix multiplication, the dominant operation in neural networks. One of the key challenges for RRAM-based neural networks is to achieve bidirectional analog conductance modulation for online training. This article provides a programming scheme (SRA: small RESET voltage amplitude and appropriate SET voltage) to achieve bidirectional analog conductance modulation of RRAM devices. We find that both abrupt and gradual SET can be obtained for the same device. The controlling parameters for modulating the gradual SET behavior are the SET voltage and the local device temperature. We suggest that the filament morphology before SET may be the key to understanding this phenomenon; gradual SET is obtained when the filaments have a single-layer gap in the RESET state, and abrupt SET is obtained when the filaments have a multilayer gap in the RESET state.",
    "citationCount": 4,
    "referenceCount": 33
}