{
    "paperId": "3c7ec704d1716d89a17860a4beeb5b3ed9982200",
    "title": "Management of Implicit Requirements Data in Large SRS Documents",
    "year": 2022,
    "venue": "SIGMOD record",
    "authors": [
        "Dev Dave",
        "Angeli Celestino",
        "A. Varde",
        "Vaibhav Anu"
    ],
    "doi": "10.1145/3552490.3552494",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3c7ec704d1716d89a17860a4beeb5b3ed9982200",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Implicit Requirements (IMR) identification is part of the Requirements Engineering (RE) phase in Software Engineering during which data is gathered to create SRS (Software Requirements Specifications) documents. As opposed to explicit requirements clearly stated, IMRs constitute subtle data and need to be inferred. Research has shown that IMRs are crucial to the success of software development. Many software systems can encounter failures due to lack of IMR data management. SRS documents are large, often hundreds of pages, due to which manually identifying IMRs by human software engineers is not feasible. Moreover, such data is evergrowing due to the expansion of software systems. It is thus important to address the crucial issue of IMR data management. This article presents a survey on IMRs in SRS documents with the definition and overview of IMR data, detailed taxonomy of IMRs with explanation and examples, practices in managing IMR data, and tools for IMR identification. In addition to reviewing classical and state-of-the-art approaches, we highlight trends and challenges and point out open issues for future research. This survey article is interesting based on data quality, hidden information retrieval, veracity and salience, and knowledge discovery from large textual documents with complex heterogeneous data.",
    "citationCount": 5,
    "referenceCount": 43
}