{
    "paperId": "3cab37916cc2b1c1d8e73dff3b01a2513688ec45",
    "title": "Layer 2 Blockchains: An Introduction",
    "year": 2024,
    "venue": "Artificial Intelligence and Cloud Computing Conference",
    "authors": [
        "Wenbing Zhao",
        "Xiong Luo"
    ],
    "doi": "10.1145/3719384.3719451",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3cab37916cc2b1c1d8e73dff3b01a2513688ec45",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we provide an overview of a specific, but rather popular type of blockchain scaling solutions, which are usually referred to as Layer 2 blockchains. These solutions depend on the rollup scaling strategy. First, they all create batches of transactions known as rollups. Second, there are two primary approaches to rollup verifications. One approach is referred to as optimistic rollup, where it is assumed that fraudulent transactions rarely occur and should it happen, then some nodes could raise a challenge, which would lead to the resolution of the problem. The interaction between the asserter and the challenger is referred to as interactive fraud proof. The other approach is a conservative approach, where every rollup batch is associated with a validity proof. For all practical purposes, Ethereum is used as the Layer 1 blockchain because it is the first and only large-scale public blockchain that supports Turing-complete smart contracts. These Layer 2 blockchains typically deploy at least two smart contracts on the Layer 1 blockchain, one to receive rollups from the Layer 2 blockchain, and the other to verify the rollup batch. Furthermore, we provide technical details of two Layer 2 blockchains (i.e., Arbitrum and Optimism) that use the optimistic rollup mechanism, and two Layer 2 blockchains (i.e., Polygon and Starknet) that use validity rollup mechanism. Finally, we analyze the Layer 2 blockchain solutions in the framework of the blockchain trilemma theory. We show that all Layer 2 scaling solutions trade decentralization for better scalability.",
    "citationCount": 0,
    "referenceCount": 44
}