{
    "paperId": "3cbdd736ac187fbbc1c883231e17d792d11e3249",
    "title": "Photoperiods induced the circRNA differential expression in the thyroid gland of OVX+E2 ewes",
    "year": 2022,
    "venue": "Frontiers in Endocrinology",
    "authors": [
        "Wei Wang",
        "Xiaoyun He",
        "R. Di",
        "Xiangyu Wang",
        "M. Chu"
    ],
    "doi": "10.3389/fendo.2022.974518",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3cbdd736ac187fbbc1c883231e17d792d11e3249",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fendo.2022.974518/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Circular RNAs (circRNAs) are non-coding RNAs newly identified and play important roles in RNA regulation. However, little is known regarding photoperiods induced circRNAs in the thyroid gland. In this study, we performed a comprehensive analysis of circRNA profiles in the thyroid gland of OVX+E2 ewes at different photoperiods by whole transcriptome sequencing. A total of 37,470 novel circRNAs were detected in different photoperiods (42 days of short photoperiod treatment, SP42; 42 days of long photoperiod treatment, LP42; SP42 transfer to LP42, SPLP42), with a total of 817 circRNAs for SP42-LP42 (down: 132; up: 114), LP42-SPLP42 (down: 136; up: 112) and SP42-SPLP42 (down: 182; up: 141) having differentially expressed. Functional enrichment annotation analysis of DE-circRNAs for GO and KEGG by R package, features that influence photoperiod response in Sunite ewes through the Inositol phosphate metabolism, cGMP-PKG signaling pathway, Calcium signaling pathway, MAPK signaling pathway, and Oocyte meiosis. In addition, competitive endogenous RNA (ceRNA) network analysis revealed target binding sites for identified miRNAs in DE-cirRNAs such as oar-miR-10b, oar-miR-200c, oar-miR-21, oar-miR-370-3p, oar-miR-377-3p, oar-miR-181a, oar-miR-432, and oar-miR-495-3p. These results of this study will provide some new information for understanding circRNA function as well as the changes in the sheep thyroid gland under different photoperiods.",
    "citationCount": 5,
    "referenceCount": 69
}