{
    "paperId": "3cc24a518a9db0887f709669b52f0d4c0c25cd01",
    "title": "Multi-Modal Large Language Model with RAG Strategies in Soccer Commentary Generation",
    "year": 2025,
    "venue": "IEEE Workshop/Winter Conference on Applications of Computer Vision",
    "authors": [
        "Xiang Li",
        "Yangfan He",
        "Shuaishuai Zu",
        "Zhengyang Li",
        "Tianyu Shi",
        "Yiting Xie",
        "Kevin Zhang"
    ],
    "doi": "10.1109/WACV61041.2025.00604",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3cc24a518a9db0887f709669b52f0d4c0c25cd01",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a globally celebrated sport, soccer has seen its appeal greatly amplified by engaging and vivid commentary. Recently, Multi-Modal Large Language Models (MLLMs) have attracted attention in generating soccer commentaries due to their remarkable capacities of understanding different modalities of the input videos. Most of these methods have shown that the use of multiple modalities can enhance the commentary quality, which includes video, audio, and structured meta-data. However, delivering precise and rich commentary requires the ability to accurately discern sub-tle differences in similar backgrounds, events, and players. This presents a significant challenge for existing MLLMs. So we propose SoccerComment, a framework for generating soccer commentary that integrates MLLMs with Retrieval-Augmented Generation (RAG) strategies. This framework enhances inference efficiency and reduces the need for continuous training through a multimodal clustering memory unit and retrieval-augmented in-context learning mechanisms, ultimately improving the accuracy and diversity of the commentary. Based on similar retrieved scenarios, SoccerComment demonstrates outstanding zero-shot performance, offering a new direction and scalable solution for future research in soccer commentary generation.",
    "citationCount": 12,
    "referenceCount": 43
}