{
    "paperId": "3cd6c8e3fbb18fefeee000683c9bb7d1f8643114",
    "title": "Auto Search Indexer for End-to-End Document Retrieval",
    "year": 2023,
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "authors": [
        "Tianchi Yang",
        "Minghui Song",
        "Zihan Zhang",
        "Haizhen Huang",
        "Weiwei Deng",
        "Feng Sun",
        "Qi Zhang"
    ],
    "doi": "10.48550/arXiv.2310.12455",
    "arxivId": "2310.12455",
    "url": "https://www.semanticscholar.org/paper/3cd6c8e3fbb18fefeee000683c9bb7d1f8643114",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval, which is a new advanced paradigm for document retrieval, has recently attracted research interests, since it encodes all documents into the model and directly generates the retrieved documents. However, its power is still underutilized since it heavily relies on the\"preprocessed\"document identifiers (docids), thus limiting its retrieval performance and ability to retrieve new documents. In this paper, we propose a novel fully end-to-end retrieval paradigm. It can not only end-to-end learn the best docids for existing and new documents automatically via a semantic indexing module, but also perform end-to-end document retrieval via an encoder-decoder-based generative model, namely Auto Search Indexer (ASI). Besides, we design a reparameterization mechanism to combine the above two modules into a joint optimization framework. Extensive experimental results demonstrate the superiority of our model over advanced baselines on both public and industrial datasets and also verify the ability to deal with new documents.",
    "citationCount": 26,
    "referenceCount": 35
}