{
    "paperId": "3d0c8e650220427ae41a23bf65bc5b709d916d29",
    "title": "Shedding Light on How Intelligent Techniques can Support Technical Debt Management and Influence Software Quality Attributes",
    "year": 2022,
    "venue": "International Symposium on Information Science and Engineering",
    "authors": [
        "D. Albuquerque",
        "Ferdinandy Chagas",
        "Everton T. Guimarães",
        "G. Tonin",
        "M. Perkusich",
        "H. Almeida",
        "A. Perkusich"
    ],
    "doi": "10.5753/ise.2022.227051",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3d0c8e650220427ae41a23bf65bc5b709d916d29",
    "isOpenAccess": true,
    "openAccessPdf": "https://sol.sbc.org.br/index.php/ise/article/download/22529/22353",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Technical Debt (TD) is a consequence of decision-making in the development process that can negatively impact Software Quality Attributes (SQA) in the long term. Technical Debt Management (TDM) is a complex task to minimize TD that relies on a decision process based on multiple and heterogeneous data that are not straightforward to synthesize. Recent studies show that Intelligent Techniques can be a promising opportunity to support TDM activities since they explore data for knowledge discovery, reasoning, learning, or supporting decision-making. Although these techniques can improve TDM activities, there is a need to identify and analyze solutions based on Intelligent Techniques to support TDM activities and their impact on SQA. For doing so, a Systematic Mapping Study was performed, covering publications between 2010 and 2020. From 2276 extracted studies, we selected 111 unique studies. We found a positive trend in applying Intelligent Techniques to support TDM activities being Machine Learning and Reasoning Under Uncertainty the most recurrent ones. Design and Code were the most frequently investigated TD types. TDM activities supported by intelligent techniques impact different characteristics of SQA, mainly Maintainability, Reliability, and Security. Although the research area is up-and-coming, it is still in its infancy, and this study provides a baseline for future research.",
    "citationCount": 0,
    "referenceCount": 26
}