{
    "paperId": "3d0c18e766ac1194057f667dd396e82a882c5a5a",
    "title": "On the behavior of compacted filtered iron ore tailings submitted to high pressures",
    "year": 2024,
    "venue": "E3S Web of Conferences",
    "authors": [
        "J. P. Silva",
        "J. V. Carvalho",
        "A. C. Wagner",
        "N. Consoli"
    ],
    "doi": "10.1051/e3sconf/202454413004",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3d0c18e766ac1194057f667dd396e82a882c5a5a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mine tailings have been disposed of in a slurry form in tailings dams for many years. However, recent disasters involving conventional disposal in dams reinforced the need for alternative structures to store these materials safely. One alternative is dry stacking of tailings. In these structures, tailings are filtered to low moisture content and then compacted in layers. Due to material compaction, dry stacks tend to be stable and are usually built with elevated heights to use the available area better. So, it becomes essential to understand the mechanical behavior of tailings subjected to high pressures, especially concerning the possibility of grain breakage. In this context, the present research focuses on studying the geotechnical behavior of iron ore tailings from different stages of ore beneficiation plants in Quadrilátero Ferrífero, Brazil, when subjected to high pressures both in compression and in shear paths. The results demonstrate that the inclusion of fines can change the geotechnical performance of the dry stack tailings considering the same compaction energy (greater strength, stiffness, and lower permeability) both in drained and undrained conditions. No breakage could be identified for the stress level studied (6 MPa).",
    "citationCount": 0,
    "referenceCount": 25
}