{
    "paperId": "3d0f0b8e3b910eb44a7c1579ae18572520468f2e",
    "title": "Dynamic Demand-Aware Link Scheduling for Reconfigurable Datacenters",
    "year": 2023,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Kathrin Hanauer",
        "Monika Henzinger",
        "Lara Ost",
        "Stefan Schmid"
    ],
    "doi": "10.1109/INFOCOM53939.2023.10229050",
    "arxivId": "2301.05751",
    "url": "https://www.semanticscholar.org/paper/3d0f0b8e3b910eb44a7c1579ae18572520468f2e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2301.05751",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Emerging reconfigurable datacenters allow to dynamically adjust the network topology in a demand-aware manner. These datacenters rely on optical switches which can be reconfigured to provide direct connectivity between racks, in the form of edge-disjoint matchings. While state-of-the-art optical switches in principle support microsecond reconfigurations, the demand-aware topology optimization constitutes a bottleneck.This paper proposes a dynamic algorithms approach to improve the performance of reconfigurable datacenter networks, by supporting faster reactions to changes in the traffic demand. This approach leverages the temporal locality of traffic patterns in order to update the interconnecting matchings incrementally, rather than recomputing them from scratch. In particular, we present six (batch-)dynamic algorithms and compare them to static ones. We conduct an extensive empirical evaluation on 176 synthetic and 39 real-world traces, and find that dynamic algorithms can both significantly improve the running time and reduce the number of changes to the configuration, especially in networks with high temporal locality, while retaining matching weight.",
    "citationCount": 10,
    "referenceCount": 45
}