{
    "paperId": "3d1bd14765b5a842b97d3cb4049775ae9e5b638b",
    "title": "RecPipe: Co-designing Models and Hardware to Jointly Optimize Recommendation Quality and Performance",
    "year": 2021,
    "venue": "Micro",
    "authors": [
        "Udit Gupta",
        "Samuel Hsia",
        "J. Zhang",
        "Mark Wilkening",
        "Javin Pombra",
        "Hsien-Hsin S. Lee",
        "Gu-Yeon Wei",
        "Carole-Jean Wu",
        "D. Brooks"
    ],
    "doi": "10.1145/3466752.3480127",
    "arxivId": "2105.08820",
    "url": "https://www.semanticscholar.org/paper/3d1bd14765b5a842b97d3cb4049775ae9e5b638b",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2105.08820",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning recommendation systems must provide high quality, personalized content under strict tail-latency targets and high system loads. This paper presents RecPipe, a system to jointly optimize recommendation quality and inference performance. Central to RecPipe is decomposing recommendation models into multi-stage pipelines to maintain quality while reducing compute complexity and exposing distinct parallelism opportunities. RecPipe implements an inference scheduler to map multi-stage recommendation engines onto commodity, heterogeneous platforms (e.g., CPUs, GPUs). While the hardware-aware scheduling improves ranking efficiency, the commodity platforms suffer from many limitations requiring specialized hardware. Thus, we design RecPipeAccel (RPAccel), a custom accelerator that jointly optimizes quality, tail-latency, and system throughput. RPAccel is designed specifically to exploit the distinct design space opened via RecPipe. In particular, RPAccel processes queries in sub-batches to pipeline recommendation stages, implements dual static and dynamic embedding caches, a set of top-k filtering units, and a reconfigurable systolic array. Compared to previously proposed specialized recommendation accelerators and at iso-quality, we demonstrate that RPAccel improves latency and throughput by 3 × and 6 ×.",
    "citationCount": 33,
    "referenceCount": 68
}