{
    "paperId": "3d1cd3c2e8b002180a70ced6ea4e9e0edcf91cbf",
    "title": "Comparative Analysis of Binary and Interpolation Search Algorithms on Integer Data Using C Programming Language",
    "year": 2023,
    "venue": "International Conference on Information Management and Technology",
    "authors": [
        "B. A. Saputra",
        "Stevans Calvin Candra",
        "Franis Berta Wijaya",
        "Kristien Margi Suryaningrum",
        "Hanis Amalia Saputri"
    ],
    "doi": "10.1109/ICIMTech59029.2023.10277955",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3d1cd3c2e8b002180a70ced6ea4e9e0edcf91cbf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To perform data search, there are various algorithms that have been developed, such as binary search and interpolation search. There are various views on these two algorithms, regarding which one is better than the other. From the various views that have emerged, this study aims to find out which algorithm is more efficient in terms of time complexity and memory complexity using Big-O notation, as well as its execution time in the C programming language. This research was conducted with 6 datasets consisting of 3 datasets with uniform data types and 3 datasets with non-uniform data types. Each dataset type consists of 1 million, 10 million, and 100 million data. The results show that the binary search algorithm is more efficient to use rather than interpolation search on datasets that are not uniformly distributed or the data type is unknown. While the interpolation search algorithm is more efficient to use rather than binary search on datasets that are known to be uniformly distributed.",
    "citationCount": 1,
    "referenceCount": 30
}