{
    "paperId": "3d47b7f7c0819c4190f925c6a5379bac7f31e338",
    "title": "Sequencing of cerebrospinal fluid cell-free DNA facilitated early differential diagnosis of intramedullary spinal cord tumors",
    "year": 2024,
    "venue": "npj Precision Oncology",
    "authors": [
        "Ruichao Chai",
        "Songyuan An",
        "Han Lin",
        "Bo Pang",
        "Hao Yan",
        "Yun Liu",
        "Yilin Wu",
        "Long Wang",
        "Xing Liu",
        "Huiyuan Chen",
        "Xueyu Yang",
        "Q. Chang",
        "Wenqing Jia",
        "Yongzhi Wang"
    ],
    "doi": "10.1038/s41698-024-00541-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3d47b7f7c0819c4190f925c6a5379bac7f31e338",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41698-024-00541-w.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Pre-surgery differential diagnosis is valuable for personalized treatment planning in intramedullary spinal cord tumors. This study assessed the performance of sequencing cell-free DNA (cfDNA) in cerebrospinal fluid (CSF) for differential diagnosis of these tumors. Prospectively enrolling 45 patients with intramedullary spinal cord lesions, including diffuse midline glioma (DMG), H3K27-altered (14/45), glioblastoma (1/45), H3-wildtype-astrocytoma (10/45), ependymoma (11/45), and other lesions (9/45), CSF samples were collected via lumbar puncture (41/45), intraoperative extraction (3/45), and Ommaya reservoir (1/45). Then, these samples underwent targeted sequencing along with paired tissue DNA. DMG, H3K27-altered patients exhibited a higher ctDNA positivity (85.7%, 12/14) compared to patients with H3-wildtype-astrocytoma (0/8, P = 0.0003), ependymoma (2/10, P = 0.003), and glioneuronal tumor (0/3, P = 0.009). The histological-grade-IV (P = 0.0027), Ki-67 index ≥10% (P = 0.014), and tumor reaching spinal cord surface (P = 0.012) are also associated with higher ctDNA positivity. Interestingly, for patients with TERT promoter mutant tumors, TERT mutation was detectable in the CSF cfDNA of one DMG case, but not other five cases with histological-grade-II tumors. Shared copy number variants were exclusively observed in DMG, H3K27-altered, and showed a strong correlation (Correlation = 0.95) between CSF and tissue. Finally, H3K27M mutations in CSF exhibited high diagnostic efficiency for DMG, H3K27-altered (Sensitivity = 85.7%, Specificity = 100.0%, AUC = 0.929). Notably, H3K27M was detectable in CSF from patients with recurrent tumors, making it easily applicable for postoperative monitoring. In conclusion, the molecular profile from ctDNA released into CSF of malignant tumors was more frequently detected compared to relatively benign ones. Sequencing of ctDNA in CSF exhibited high efficiency for the differential diagnosis of DMG, H3K27-altered.",
    "citationCount": 13,
    "referenceCount": 47
}