{
    "paperId": "3d5922d71a370f32b7f232a596def914f67eebd1",
    "title": "Self-Adaptive In-Context Learning: An Information Compression Perspective for In-Context Example Selection and Ordering",
    "year": 2022,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Zhiyong Wu",
        "Yaoxiang Wang",
        "Jiacheng Ye",
        "Lingpeng Kong"
    ],
    "doi": "10.48550/arXiv.2212.10375",
    "arxivId": "2212.10375",
    "url": "https://www.semanticscholar.org/paper/3d5922d71a370f32b7f232a596def914f67eebd1",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.10375",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite the surprising few-shot performance of in-context learning (ICL), it is still a common practice to randomly sample examples to serve as context. This paper advocates a new principle for ICL: self-adaptive in-context learning. The self-adaption mechanism is introduced to help each sample find an in-context example organization (i.e., selection and permutation) that can derive the correct prediction, thus maximizing performance. To validate the effectiveness of self-adaptive ICL, we propose a general select-then-rank framework and instantiate it with new selection and ranking algorithms. Upon extensive evaluation on eight different NLP datasets, our self-adaptive ICL method achieves a 40% relative improvement over the common practice setting. Further analysis reveals the enormous potential of self-adaptive ICL that it might be able to close the gap between ICL and finetuning given more advanced algorithms. Our code will be released to facilitate future research.",
    "citationCount": 168,
    "referenceCount": 50
}