{
    "paperId": "3d75feab06a7e629c87720577cf6a96e69b92d69",
    "title": "SeqMvRL: A Sequential Fusion Framework for Multi-view Representation Learning",
    "year": 2025,
    "venue": "Computer Vision and Pattern Recognition",
    "authors": [
        "Ren Wang",
        "Haoliang Sun",
        "Yuxiu Lin",
        "Chuanhui Zuo",
        "Yongshun Gong",
        "Yilong Yin",
        "Wenjia Meng"
    ],
    "doi": "10.1109/CVPR52734.2025.02405",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3d75feab06a7e629c87720577cf6a96e69b92d69",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multi-view representation learning integrates multiple observable views of an entity into a unified representation to facilitate downstream tasks. Current methods predominantly focus on distinguishing compatible components across views, followed by a single-step parallel fusion process. However, this parallel fusion is static in essence, overlooking potential conflicts among views and compromising representation ability. To address this issue, this paper proposes a novel Sequential fusion framework for Multi-view Representation Learning, termed SeqMvRL. Specifically, we model multi-view fusion as a sequential decision-making problem and construct a pairwise integrator (PI) and a next-view selector (NVS), which represent the environment and agent in reinforcement learning, respectively. PI merges the current fused feature with the selected view, while NVS is introduced to determine which view to fuse subsequently. By adaptively selecting the next optimal view for fusion based on the current fusion state, SeqMvRL thereby effectively reduces conflicts and enhances unified representation quality. Additionally, an elaborate novel reward function encourages the model to prioritize views that enhance the discriminability of the fused features. Experimental results demonstrate that SeqMvRL outperforms parallel fusion schemes in classification and clustering tasks.",
    "citationCount": 0,
    "referenceCount": 51
}