{
    "paperId": "3d8c584f0c8a63c9925b9a35a8613327a3f0d134",
    "title": "TeeRollup: Efficient Rollup Design Using Heterogeneous TEE",
    "year": 2024,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Xiaoqing Wen",
        "Quanbi Feng",
        "Hanzheng Lyu",
        "Jianyu Niu",
        "Yinqian Zhang",
        "Chen Feng"
    ],
    "doi": "10.1109/TC.2025.3596698",
    "arxivId": "2409.14647",
    "url": "https://www.semanticscholar.org/paper/3d8c584f0c8a63c9925b9a35a8613327a3f0d134",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rollups have emerged as a promising approach to improving blockchains’ scalability by offloading transaction execution off-chain. Existing rollup solutions either leverage complex zero-knowledge proofs or optimistically assume execution correctness unless challenged. However, these solutions suffer from high gas costs and significant withdrawal delays, hindering their adoption in decentralized applications. This paper introduces TeeRollup, an efficient rollup protocol that leverages Trusted Execution Environments (TEEs) to achieve both low gas costs and short withdrawal delays. Sequencers (i.e., system participants) execute transactions within TEEs and upload signed execution results to the blockchain with confidential keys of TEEs. Unlike most TEE-assisted blockchain designs, TeeRollup adopts a practical threat model where the integrity and availability of TEEs may be compromised. To address these issues, we first introduce a distributed system of sequencers with heterogeneous TEEs, ensuring system security even if a certain proportion of TEEs are compromised. Second, we propose a challenge mechanism to solve the redeemability issue caused by TEE unavailability. Furthermore, TeeRollup incorporates Data Availability Providers (DAPs) to reduce on-chain storage overhead and uses a laziness penalty mechanism to regulate DAP behavior. We implement a prototype of TeeRollup in Golang, using the Ethereum test network, Sepolia. Our experimental results indicate that TeeRollup outperforms zero-knowledge rollups (ZK-rollups), reducing on-chain verification costs by approximately 86% and withdrawal delays to a few minutes.",
    "citationCount": 0,
    "referenceCount": 64
}