{
    "paperId": "3dab6960707a266129600370542bade2d3820af7",
    "title": "Online Algorithms with Uncertainty-Quantified Predictions",
    "year": 2023,
    "venue": "International Conference on Machine Learning",
    "authors": [
        "Bo Sun",
        "Jerry Huang",
        "Nicolas Christianson",
        "M. Hajiesmaili",
        "Adam Wierman"
    ],
    "doi": "10.48550/arXiv.2310.11558",
    "arxivId": "2310.11558",
    "url": "https://www.semanticscholar.org/paper/3dab6960707a266129600370542bade2d3820af7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The burgeoning field of algorithms with predictions studies the problem of using possibly imperfect machine learning predictions to improve online algorithm performance. While nearly all existing algorithms in this framework make no assumptions on prediction quality, a number of methods providing uncertainty quantification (UQ) on machine learning models have been developed in recent years, which could enable additional information about prediction quality at decision time. In this work, we investigate the problem of optimally utilizing uncertainty-quantified predictions in the design of online algorithms. In particular, we study two classic online problems, ski rental and online search, where the decision-maker is provided predictions augmented with UQ describing the likelihood of the ground truth falling within a particular range of values. We demonstrate that non-trivial modifications to algorithm design are needed to fully leverage the UQ predictions. Moreover, we consider how to utilize more general forms of UQ, proposing an online learning framework that learns to exploit UQ to make decisions in multi-instance settings.",
    "citationCount": 11,
    "referenceCount": 61
}