{
    "paperId": "3e1ca026052d30e3b9677e363616fae23f6616df",
    "title": "Large Language Models as Data Preprocessors",
    "year": 2023,
    "venue": "VLDB Workshops",
    "authors": [
        "Haochen Zhang",
        "Yuyang Dong",
        "Chuan Xiao",
        "M. Oyamada"
    ],
    "doi": "10.48550/arXiv.2308.16361",
    "arxivId": "2308.16361",
    "url": "https://www.semanticscholar.org/paper/3e1ca026052d30e3b9677e363616fae23f6616df",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2308.16361",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language Models (LLMs), typified by OpenAI's GPT, have marked a significant advancement in artificial intelligence. Trained on vast amounts of text data, LLMs are capable of understanding and generating human-like text across a diverse range of topics. This study expands on the applications of LLMs, exploring their potential in data preprocessing, a critical stage in data mining and analytics applications. Aiming at tabular data, we delve into the applicability of state-of-the-art LLMs such as GPT-4 and GPT-4o for a series of preprocessing tasks, including error detection, data imputation, schema matching, and entity matching. Alongside showcasing the inherent capabilities of LLMs, we highlight their limitations, particularly in terms of computational expense and inefficiency. We propose an LLM-based framework for data preprocessing, which integrates cutting-edge prompt engineering techniques, coupled with traditional methods like contextualization and feature selection, to improve the performance and efficiency of these models. The effectiveness of LLMs in data preprocessing is evaluated through an experimental study spanning a variety of public datasets. GPT-4 emerged as a standout, achieving 100\\% accuracy or F1 score on 4 of these datasets, suggesting LLMs' immense potential in these tasks. Despite certain limitations, our study underscores the promise of LLMs in this domain and anticipates future developments to overcome current hurdles.",
    "citationCount": 44,
    "referenceCount": 39
}