{
    "paperId": "3e67038db1a4aa1268354a982b6e98be2469d469",
    "title": "A Tutorial Toolbox to Simplify Bioinformatics and Biostatistics Analyses of Microbial Omics Data in an Island Context",
    "year": 2025,
    "venue": "BioMedInformatics",
    "authors": [
        "Isaure Quétel",
        "Sourakhata Tirera",
        "Damien Cazenave",
        "Nina Allouch",
        "Chloé Baum",
        "Yann Reynaud",
        "Degrâce Batantou Mabandza",
        "Virginie Nerrière",
        "Serge Vedy",
        "M. Pot",
        "Sébastien Breurec",
        "Anne Lavergne",
        "Séverine Ferdinand",
        "Vincent Guerlais",
        "D. Couvin"
    ],
    "doi": "10.3390/biomedinformatics5020027",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3e67038db1a4aa1268354a982b6e98be2469d469",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Bioinformatics is increasingly used in various scientific works. Large amounts of heterogeneous data are being generated these days. It is difficult to interpret and analyze these data effectively. Several software tools have been developed to facilitate the handling and analysis of biological data, based on specific needs. Methods: The Galaxy web platform is one of these software tools, allowing free access to users and facilitating the use of thousands of tools. Other software tools, such as Bioconda or Jupyter Notebook, facilitate the installation of tools and their dependencies. In addition to these tools, RStudio can be mentioned as a powerful interface that facilitates the use of the R programming language for data analysis and statistics. Results: The aim of this study is to provide the scientific community with guides on how to perform bioinformatics/biostatistical analyses in a simpler manner. With this work, we also try to democratize well-documented software tools to make them suitable for both bioinformaticians and non-bioinformaticians. We believe that user-friendly guides and real-life/concrete examples will provide end-users with suitable and easy-to-use methods for their bioinformatics analysis needs. Furthermore, tutorials and usage examples are available on our dedicated GitHub repository. Conclusions: These tutorials/examples (In English and/or French) could be used as pedagogical tools to promote bioinformatics analysis and offer potential solutions to several bioinformatics needs. Special emphasis is placed on microbial omics data analysis.",
    "citationCount": 0,
    "referenceCount": 58
}