{
    "paperId": "3e8bc7917a8a99216fb7af1aa15621547393bcf6",
    "title": "QSRP: Efficient Reverse $k-\\text{Ranks}$ Query Processing on High-Dimensional Embeddings",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Zheng Bian",
        "Xiao Yan",
        "Jiahao Zhang",
        "Man Lung Yiu",
        "Bo Tang"
    ],
    "doi": "10.1109/ICDE60146.2024.00351",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3e8bc7917a8a99216fb7af1aa15621547393bcf6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Embedding models represent users and products as high-dimensional embedding vectors and are widely used for recommendation. In this paper, we study the reverse $k-\\mathbf{ranks}$ query, which finds the users that are the most interested in a product and has many applications including product promotion, targeted advertising, and market analysis. As reverse $k-\\mathbf{ranks}$ solutions for low dimensionality (e.g., trees) fail for the high-dimensional embeddings generated by embedding models, we propose the QSRP framework. QSRP precomputes the score table between all user and product embeddings to facilitate pruning and refinement at query time. As the score table is usually large, QSRP samples some of its columns as the index to fit in memory. To tackle the problem that naive uniform sampling results in poor pruning effect, we propose query-aware sampling, which conducts sampling by explicitly maximizing the pruning effect for a set of sample queries. Moreover, we introduce regression-based pruning, which fits cheap linear functions to predict the bounds used for pruning. We also design techniques to build the index with limited memory, reduce index building time, and handle updates. We evaluate QSRP under various configurations and compare with state-of-the-art baselines. The results show that QSRP achieves shorter query time than the baselines in all cases, and the speedup is usually over 100x.",
    "citationCount": 0,
    "referenceCount": 70
}