{
    "paperId": "3ea16975e2fecc5a811bf38015764c8285acad09",
    "title": "A Systematic Analysis of Data Diversity in Machine Learning for EDA",
    "year": 2023,
    "venue": "International Conferences on Information Technologies and Electrical Engineering",
    "authors": [
        "Jiachen Ren"
    ],
    "doi": "10.1145/3640115.3640160",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3ea16975e2fecc5a811bf38015764c8285acad09",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the exponential growth of Very Large-Scale Integration (VLSI) scale and complexity, traditional algorithms of Electronic Design Automation (EDA) are gradually encountering bottlenecks. The successful application of Machine Learning (ML) in various fields has opened a new path for the development of EDA. The ML model has strong adaptability and generalization ability, which can discover patterns in complex circuit designs, make fast and accurate predictions, and effectively optimize with high quality. Data serves as an important link between ML algorithms and circuit design, and effective data features can improve the assistance of ML models to EDA. This article provides a summary of the front-end of circuit design and selects an ML based EDA application framework with typical data characteristics. It analyzes the data and features in each ML model, lists their predictions or optimizations based on algorithms, and proposes suggestions and considerations for the future development trend of this field. Academic research has demonstrated the enormous potential of ML in EDA applications. Future development requires the integration of stakeholders in the entire design and EDA ecosystem to bring future expansion benefits to the entire industry and society.",
    "citationCount": 0,
    "referenceCount": 21
}