{
    "paperId": "3ea786e7bc8b8b01ac1e7cf85c32210ca98698b7",
    "title": "On the Effectiveness of Graph Reordering for Accelerating Approximate Nearest Neighbor Search on GPU",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yutaro Oguri",
        "Mai Nishimura",
        "Yusuke Matsui"
    ],
    "doi": "10.48550/arXiv.2508.15436",
    "arxivId": "2508.15436",
    "url": "https://www.semanticscholar.org/paper/3ea786e7bc8b8b01ac1e7cf85c32210ca98698b7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present the first systematic investigation of graph reordering effects for graph-based Approximate Nearest Neighbor Search (ANNS) on a GPU. While graph-based ANNS has become the dominant paradigm for modern AI applications, recent approaches focus on algorithmic innovations while neglecting memory layout considerations that significantly affect execution time. Our unified evaluation framework enables comprehensive evaluation of diverse reordering strategies across different graph indices through a graph adapter that converts arbitrary graph topologies into a common representation and a GPU-optimized graph traversal engine. We conduct a comprehensive analysis across diverse datasets and state-of-the-art graph indices, introducing analysis metrics that quantify the relationship between structural properties and memory layout effectiveness. Our GPU-targeted reordering achieves up to 15$\\%$ QPS improvements while preserving search accuracy, demonstrating that memory layout optimization operates orthogonally to existing algorithmic innovations. We will release all code upon publication to facilitate reproducibility and foster further research.",
    "citationCount": 0,
    "referenceCount": 49
}