{
    "paperId": "3ec6b7a55359ae541fd22feb41c3e25b2c891ceb",
    "title": "Federated Learning in Healthcare: Model Misconducts, Security, Challenges, Applications, and Future Research Directions - A Systematic Review",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Md. Shahin Ali",
        "M. Ahsan",
        "Lamia Tasnim",
        "Sadia Afrin",
        "Koushik Biswas",
        "Md. Maruf Hossain",
        "Md. Mahfuz Ahmed",
        "Ronok Hashan",
        "Md. Khairul Islam",
        "Shivakumar Raman"
    ],
    "doi": "10.48550/arXiv.2405.13832",
    "arxivId": "2405.13832",
    "url": "https://www.semanticscholar.org/paper/3ec6b7a55359ae541fd22feb41c3e25b2c891ceb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data privacy has become a major concern in healthcare due to the increasing digitization of medical records and data-driven medical research. Protecting sensitive patient information from breaches and unauthorized access is critical, as such incidents can have severe legal and ethical complications. Federated Learning (FL) addresses this concern by enabling multiple healthcare institutions to collaboratively learn from decentralized data without sharing it. FL's scope in healthcare covers areas such as disease prediction, treatment customization, and clinical trial research. However, implementing FL poses challenges, including model convergence in non-IID (independent and identically distributed) data environments, communication overhead, and managing multi-institutional collaborations. A systematic review of FL in healthcare is necessary to evaluate how effectively FL can provide privacy while maintaining the integrity and usability of medical data analysis. In this study, we analyze existing literature on FL applications in healthcare. We explore the current state of model security practices, identify prevalent challenges, and discuss practical applications and their implications. Additionally, the review highlights promising future research directions to refine FL implementations, enhance data security protocols, and expand FL's use to broader healthcare applications, which will benefit future researchers and practitioners.",
    "citationCount": 15,
    "referenceCount": 187
}