{
    "paperId": "3ec861b28e230f4622d9e6950cabce00244baa26",
    "title": "A Decade of Progress: A Systematic Literature Review on the Integration of AI in Software Engineering Phases and Activities (2013-2023)",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "U. Durrani",
        "Mustafa Akpınar",
        "M. Fatih Adak",
        "Abdullah Talha Kabakus",
        "Muhammed Maruf Öztürk",
        "Mohammed Saleh"
    ],
    "doi": "10.1109/ACCESS.2024.3488904",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3ec861b28e230f4622d9e6950cabce00244baa26",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3488904",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The synergy between software engineering (SE) and artificial intelligence (AI) catalyzes software development, as numerous recent studies illustrate an intensified intersection between these domains. This systematic literature review examines the integration of AI techniques or methodologies across SE phases and related activities spanning from 2013 to 2023, resulting in the selection of 110 research papers. Investigating the profound influence of AI techniques, including machine learning, deep learning, natural language processing, optimization algorithms, and expert systems, across various SE phases—such as planning, requirement engineering, design, development, testing, deployment, and maintenance—is the focal point of this study. Notably, the extensive adoption of machine learning and deep learning algorithms in the development and testing phases has enhanced software quality through defect prediction, code recommendation, and vulnerability detection initiatives. Furthermore, natural language processing’s role in automating requirements classification and sentiment analysis has streamlined SE practices. Optimization algorithms have also demonstrated efficacy in refining SE activities such as feature location and software repair action predictions, augmenting precision and efficiency in maintenance endeavors. Prospective research emphasizes the imperative of interpretable AI models and the exploration of novel AI paradigms, including explainable AI and reinforcement learning, to promote ethical and efficient software development practices. This paper fills the gap identified in AI techniques dedicated to improving SE phases. The review concludes that AI in SE is revolutionizing the discipline, enhancing software quality, efficiency, and innovation, with ongoing efforts targeting the mitigation of identified limitations and the augmentation of AI capabilities for intelligent and dependable SE.",
    "citationCount": 15,
    "referenceCount": 150
}