{
    "paperId": "3f01b5e34dc1592a245ce69c285880f523123e24",
    "title": "Learning to Slim Deep Networks with Bandit Channel Pruning",
    "year": 2021,
    "venue": "2021 4th International Conference on Advanced Electronic Materials, Computers and Software Engineering (AEMCSE)",
    "authors": [
        "Q. Yang",
        "Huihui Hu",
        "Shijie Zhao",
        "Hongliang Zhong"
    ],
    "doi": "10.1109/AEMCSE51986.2021.00217",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3f01b5e34dc1592a245ce69c285880f523123e24",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent years, deep neural network has achieved great success in machine vision, natural language processing, and reinforcement learning. While deploying these models on embedded devices and large clusters faces challenge in high energy consumption and low efficiency. In this paper, we propose an effective approach named Bandit Channel Pruning (BCP) to accelerate neural network by channel-level pruning.Inspired by autoML, we use Multi-Armed Bandit (MAB) method to explore and exploit the impact of each channel on model performance. Specifically, we use the loss value of model’s output as penalty term to find the set of redundant channels. In addition, we prove that the change of this loss value can be used as criterion of channel redundant. We analyze the complexity of BCP and give the upper bound of search times.Our approach is validated with several deep neural networks, including VGGNet, ResNet56, ResNet110, on different image classification datasets. Extensive experiments on these models and datasets demonstrate the performance of this method is better than state-of-the-art channel pruning methods.",
    "citationCount": 0,
    "referenceCount": 43
}