{
    "paperId": "3f05797344d43e54daa8e98664c4920ccd21e37f",
    "title": "Diffusion on Graph: Augmentation of Graph Structure for Node Classification",
    "year": 2025,
    "venue": "Trans. Mach. Learn. Res.",
    "authors": [
        "Yancheng Wang",
        "Changyu Liu",
        "Yingzhen Yang"
    ],
    "doi": "10.48550/arXiv.2503.12563",
    "arxivId": "2503.12563",
    "url": "https://www.semanticscholar.org/paper/3f05797344d43e54daa8e98664c4920ccd21e37f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph diffusion models have recently been proposed to synthesize entire graphs, such as molecule graphs. Although existing methods have shown great performance in generating entire graphs for graph-level learning tasks, no graph diffusion models have been developed to generate synthetic graph structures, that is, synthetic nodes and associated edges within a given graph, for node-level learning tasks. Inspired by the research in the computer vision literature using synthetic data for enhanced performance, we propose Diffusion on Graph (DoG), which generates synthetic graph structures to boost the performance of GNNs. The synthetic graph structures generated by DoG are combined with the original graph to form an augmented graph for the training of node-level learning tasks, such as node classification and graph contrastive learning (GCL). To improve the efficiency of the generation process, a Bi-Level Neighbor Map Decoder (BLND) is introduced in DoG. To mitigate the adverse effect of the noise introduced by the synthetic graph structures, a low-rank regularization method is proposed for the training of graph neural networks (GNNs) on the augmented graphs. Extensive experiments on various graph datasets for semi-supervised node classification and graph contrastive learning have been conducted to demonstrate the effectiveness of DoG with low-rank regularization. The code of DoG is available at https://github.com/Statistical-Deep-Learning/DoG.",
    "citationCount": 1,
    "referenceCount": 106
}