{
    "paperId": "3f0da8d53a40cb044fa4fbdea0831055cad67187",
    "title": "Unveiling population structure in South Pacific albacore: insights from genetics and growth",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Dongqi Lu",
        "Qinqin Lin",
        "Feng Wu",
        "Jiangfeng Zhu",
        "Fan Zhang"
    ],
    "doi": "10.1038/s41598-025-20480-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3f0da8d53a40cb044fa4fbdea0831055cad67187",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Albacore (Thunnus alalunga) is a high-value, highly migratory tuna in the South Pacific that is currently assessed and managed as a single stock. Uncertainty it remains over whether southwestern and southeastern individuals constitute the same biological population, with implications for stock assessment and management. Here, we tested for population structure by combining genome-wide resequencing (from which a panel of putatively adaptive SNPs was derived) with analyses of growth (length-weight relationships and growth parameter estimates). Genetic analyses using adaptive markers revealed differentiation between western (WCPO) and eastern Pacific samples. Growth analyses indicated regional differences: western individuals attain larger asymptotic sizes (L∞), whereas eastern individuals exhibit faster growth (higher k) and different length-weight scaling (b). Together, the results provide moderate genomic evidence and strong phenotypic evidence for spatially structured variation in South Pacific albacore, consistent with a mixture of partially differentiated subpopulations. Further broad-scale sampling and integrative studies (e.g., neutral and adaptive genomics, otolith chemistry, tagging, and age-structured growth models) are needed to disentangle environmental and genetic drivers and to evaluate alternative stock-structure hypotheses for management. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-20480-1.",
    "citationCount": 0,
    "referenceCount": 66
}