{
    "paperId": "3f20fafbcee7ef7b70cc56549b97695006a00261",
    "title": "MRSch: Multi-Resource Scheduling for HPC",
    "year": 2022,
    "venue": "IEEE International Conference on Cluster Computing",
    "authors": [
        "Boyang Li",
        "Yuping Fan",
        "M. Dearing",
        "Z. Lan",
        "Paul M. Rich",
        "W. Allcock",
        "M. Papka"
    ],
    "doi": "10.1109/CLUSTER51413.2022.00020",
    "arxivId": "2403.16298",
    "url": "https://www.semanticscholar.org/paper/3f20fafbcee7ef7b70cc56549b97695006a00261",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Emerging workloads in high-performance computing (HPC) are embracing significant changes, such as having diverse resource requirements instead of being CPU -centric. This advancement forces cluster schedulers to consider multiple schedulable resources during decision-making. Existing scheduling studies rely on heuristic or optimization methods, which are limited by an inability to adapt to new scenarios for ensuring long-term scheduling performance. We present an intelligent scheduling agent named MRSch for multi-resource scheduling in HPC that leverages direct future prediction (DFP), an advanced multi-objective reinforcement learning algorithm. While DFP demonstrated outstanding performance in a gaming competition, it has not been previously explored in the context of HPC scheduling. Several key techniques are developed in this study to tackle the challenges involved in multi-resource scheduling. These techniques enable MRSch to learn an appropriate scheduling pol-icy automatically and dynamically adapt its policy in response to workload changes via dynamic resource prioritizing. We compare MRSch with existing scheduling methods through extensive trace-base simulations. Our results demonstrate that MRSch improves scheduling performance by up to 48 % compared to the existing scheduling methods.",
    "citationCount": 9,
    "referenceCount": 38
}