{
    "paperId": "3f4da2504203d1f50be4830f4a12b5a8ce020de6",
    "title": "QFEDS: A GNN-Based Query Featurization Enhancement Method for Cardinality Estimation",
    "year": 2024,
    "venue": "IEEE International Conference on e-Business Engineering",
    "authors": [
        "Jun Tie",
        "Ziyi Pan",
        "Chong Sun",
        "Lifeng Wu",
        "Yinglun Hu",
        "Bowen Zhang",
        "Shipeng Cao"
    ],
    "doi": "10.1109/ICEBE62490.2024.00054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3f4da2504203d1f50be4830f4a12b5a8ce020de6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The cardinality estimation based on machine learning can overcome the problems existing in the traditional methods effectively. However, most machine learning-based methods adopt the one-hot encoding for query featurization, which largely ignores the structure of the database schema, and fails to fully leverage potential dependencies between tables and columns for query feature optimization. Furthermore, capturing semantic information, such as the distribution of attribute values, presents a significant challenge. To address these challenges, we propose a query featurization enhancement method based on database schema, called QFEDS. The core idea is to introduce Graph Neural Networks for encoding the database schema, with the aim of capturing the connections between SQL queries and database schema items, while integrating statistical data obtained from the database system into query feature encoding. In this paper, we conducted experimental evaluations of QFEDS on the IMDb dataset, and the experimental results on multiple workloads demonstrate that integrating QFEDS into existing query-driven cardinality estimation can effectively reduce the error of the cardinality estimation model.",
    "citationCount": 0,
    "referenceCount": 19
}