{
    "paperId": "3fbb767ef492cecae35c2da983aa861f31ca61cb",
    "title": "An Analysis on Automatic Performance Optimization in Database Management Systems",
    "year": 2020,
    "venue": "2020 World Conference on Computing and Communication Technologies (WCCCT)",
    "authors": [
        "S. Samson",
        "A. Aponso"
    ],
    "doi": "10.1109/WCCCT49810.2020.9169995",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3fbb767ef492cecae35c2da983aa861f31ca61cb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maintaining database management systems under optimum condition is crucial for any enterprise application as it affects the overall system performance. However, the optimization process is a non-trivial task even for experienced database administrators due to many underlying challenges. Due to the importance of database optimization, this domain has been researched for the past several years. In this analysis starting off with discussing the importance of an optimum database for the overall performance, then we focus on the reasons behind the poor performance of database management systems. Database optimization is divided under two main categories as Physical design based optimization and Configuration parameter based optimization. While both of these will be discussed, the priority is given for the Configuration parameter optimization. Configuration based optimization comes with its own set of challenges as of 1) Large configuration parameter space, 2) Interdependency of configuration parameters, and 3) Configuration change with different types of workloads. These challenges will be elaborated while carrying out an analysis on the different approaches used in preexisting work to overcome the challenges. Finally, the paper would focus on foundations of optimization techniques which can be utilized for the configuration based database optimization process.",
    "citationCount": 3,
    "referenceCount": 29
}