{
    "paperId": "3fdb153d2e2533cd92f542e31b8a4cbdbb91f0ee",
    "title": "Human Trust in Robots: A Survey on Trust Models and Their Controls/Robotics Applications",
    "year": 2024,
    "venue": "IEEE Open Journal of Control Systems",
    "authors": [
        "Yue Wang",
        "Fangjian Li",
        "Huanfei Zheng",
        "Longsheng Jiang",
        "Maziar Fooladi Mahani",
        "Zhanrui Liao"
    ],
    "doi": "10.1109/OJCSYS.2023.3345090",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3fdb153d2e2533cd92f542e31b8a4cbdbb91f0ee",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/9552933/9712344/10366819.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Trust model is a topic that first gained interest in organizational studies and then human factors in automation. Thanks to recent advances in human-robot interaction (HRI) and human-autonomy teaming, human trust in robots has gained growing interest among researchers and practitioners. This article focuses on a survey of computational models of human-robot trust and their applications in robotics and robot controls. The motivation is to provide an overview of the state-of-the-art computational methods to quantify trust so as to provide feedback and situational awareness in HRI. Different from other existing survey papers on human-robot trust models, we seek to provide in-depth coverage of the trust model categorization, formulation, and analysis, with a focus on their utilization in robotics and robot controls. The paper starts with a discussion of the difference between human-robot trust with general agent-agent trust, interpersonal trust, and human trust in automation and machines. A list of impacting factors for human-robot trust and different trust measurement approaches, and their corresponding scales are summarized. We then review existing computational human-robot trust models and discuss the pros and cons of each category of models. These include performance-centric algebraic, time-series, Markov decision process (MDP)/Partially Observable MDP (POMDP)-based, Gaussian-based, and dynamic Bayesian network (DBN)-based trust models. Following the summary of each computational human-robot trust model, we examine its utilization in robot control applications, if any. We also enumerate the main limitations and open questions in this field and discuss potential future research directions.",
    "citationCount": 14,
    "referenceCount": 216
}