{
    "paperId": "401ec1cf878b8846d942c2deb08e8cae146ede03",
    "title": "Re3val: Reinforced and Reranked Generative Retrieval",
    "year": 2024,
    "venue": "Findings",
    "authors": [
        "EuiYul Song",
        "Sangryul Kim",
        "Haeju Lee",
        "Joonkee Kim",
        "James Thorne"
    ],
    "doi": "10.48550/arXiv.2401.16979",
    "arxivId": "2401.16979",
    "url": "https://www.semanticscholar.org/paper/401ec1cf878b8846d942c2deb08e8cae146ede03",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval models encode pointers to information in a corpus as an index within the model’s parameters. These models serve as part of a larger pipeline, where retrieved information conditions generation for knowledge-intensive NLP tasks. However, we identify two limitations: the generative retrieval does not account for contextual information. Secondly, the retrieval can’t be tuned for the downstream readers as decoding the page title is a non-differentiable operation. This paper introduces Re3val, trained with generative reranking and reinforcement learning using limited data. Re3val leverages context acquired via Dense Passage Retrieval to rerank the retrieved page titles and utilizes REINFORCE to maximize rewards generated by constrained decoding. Additionally, we generate questions from our pre-training dataset to mitigate epistemic uncertainty and bridge the domain gap between the pre-training and fine-tuning datasets. Subsequently, we extract and rerank contexts from the KILT database using the rerank page titles. Upon grounding the top five reranked contexts, Re3val demonstrates the Top 1 KILT scores compared to all other generative retrieval models across five KILT datasets.",
    "citationCount": 12,
    "referenceCount": 48
}