{
    "paperId": "40ca22b9d2d87c23170d9f5070d2957607c4f7d6",
    "title": "Design and Implementation of a Low-Power TCAM Controller Based on Bloom Filter",
    "year": 2025,
    "venue": "2025 5th International Conference on Consumer Electronics and Computer Engineering (ICCECE)",
    "authors": [
        "Tingfeng Sun",
        "Jianxin Cui",
        "Yifan Zhang"
    ],
    "doi": "10.1109/ICCECE65250.2025.10985064",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/40ca22b9d2d87c23170d9f5070d2957607c4f7d6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ternary Content Addressable Memory (TCAM) has a wide range of applications in network packet filtering, route lookup, and other scenarios due to its extremely fast lookup speed. However, the high storage cost and power consumption of TCAM limit its application in large-scale deployment. To address this challenge, this paper proposes a Bloom Filter-based low-power TCAM controller (BF-LPTCAM) design scheme, which aims to reduce the storage cost and power consumption of TCAM while maintaining its efficient data matching capability. In this paper, a pipelined structure is used to filter the looked-up TCAM cells using logical table partitioning method and Bloom filtering technique to support the storage and look-up of 80/160/320 bits of data. In this paper, RTL implementation, functional simulation and logic synthesis are carried out for the algorithm, which can save at least more than 83.2 % power consumption and storage utilisation can be better without matching entries in TCAM. Under the TSMC 7nm process, the system can support a 1GHz frequency clock and a single lookup operation takes only 40ns.",
    "citationCount": 0,
    "referenceCount": 7
}