{
    "paperId": "410b80d0f3d5167cb5007c0f8b9f47c525544769",
    "title": "Quantifying Spatial Data Uncertainty with Fuzzy Entropy",
    "year": 2024,
    "venue": "Pacific Rim Conference on Communications, Computers and Signal Processing",
    "authors": [
        "Zhonghao Zhang",
        "Caterina Valeo"
    ],
    "doi": "10.1109/PACRIM61180.2024.10690206",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/410b80d0f3d5167cb5007c0f8b9f47c525544769",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fuzzy entropy is a measure used to quantify the uncertainty or complexity of a system. This paper presents an exploration of spatial data complexity and discrepancies between model and actual data through fuzzy entropy. Fuzzy entropy is employed to quantify differences across various scales and assess the change of entropy value over scale. The study area is the Tod creek watershed in Saanich, BC, where the uncertainty between geographic information and neighborhood averages is quantified. The research introduces a novel approach for determining the membership function from a histogram as well as computing spatial fuzzy entropy, emphasizing terrain complexity and elevation variability and associated spatial patterns. The results demonstrate that fuzzy entropy provides insights for identifying terrain heterogeneity and homogeneity, that are crucial for realistic model simulations.",
    "citationCount": 0,
    "referenceCount": 14
}