{
    "paperId": "4112721edb315cc380f76289a86769f36dcfa794",
    "title": "Machine Learning Model: Perspectives for quality, observability, risk and continuous monitoring",
    "year": 2024,
    "venue": "Anais do XXI Congresso Latino-Americano de Software Livre e Tecnologias Abertas (Latinoware 2024)",
    "authors": [
        "Diego Nogare",
        "I. F. Silveira",
        "Pedro Pinheiro Cabral",
        "Rafael Jorge Hauy",
        "Veronica Neves"
    ],
    "doi": "10.5753/latinoware.2024.245679",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4112721edb315cc380f76289a86769f36dcfa794",
    "isOpenAccess": true,
    "openAccessPdf": "https://sol.sbc.org.br/index.php/latinoware/article/download/31526/31329",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The transition of machine learning (ML) and artificial intelligence (AI) projects from experimental stages to fully operational solutions presents substantial challenges. This is especially true for applications where these technologies play a critical role, demanding high-quality, reliable, and observable ML models. This paper explores the crucial aspects of continuous monitoring in ML models and emphasizes the need for a comprehensive approach that goes beyond technical development. It highlights that ensuring the reliability and robustness of deployed ML models requires a multifaceted framework encompassing data governance, model lifecycle management, and thorough team training. The paper addresses key aspects such as model quality, risk management, and the crucial role of observability in maintaining model stability and reliability in production environments. Using Itaú Unibanco as a case study, the paper showcases a robust model risk management approach and a dual monitoring system: an independent validation team oversees riskier models, while smaller models are monitored by their development team. The paper concludes by emphasizing the significance of a robust Model Risk Management (MRM) framework in the evolving landscape of AI and ML, particularly as these technologies become deeply integrated into various business operations. Highlighting that Itaú Unibanco’s rigorous approach to model quality, observability, low risk, and continuous integration aligns with the regulatory requirements set by the Brazilian central bank.",
    "citationCount": 2,
    "referenceCount": 14
}