{
    "paperId": "412ba360709586816ed3e729101e429bf7be6705",
    "title": "Transforming Public Management",
    "year": 2025,
    "venue": "Indonesian Journal of Education and Social Sciences",
    "authors": [
        "H. Zangana",
        "N. Y. Ali",
        "Subhi R. M. Zeebaree"
    ],
    "doi": "10.56916/ijess.v4i1.783",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/412ba360709586816ed3e729101e429bf7be6705",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper explores the integration of distributed systems in public management and its implications for governance, service delivery, and innovation. Drawing on a review of existing literature and case studies, the paper examines the applications, benefits, challenges, and opportunities associated with distributed systems in the public sector. \nKey findings indicate that distributed systems, such as blockchain technology, offer the potential to enhance transparency, accountability, and efficiency in public management. By providing immutable and auditable records of transactions and interactions, distributed systems can reduce the risk of corruption and fraud while streamlining operations and improving service delivery. However, challenges such as interoperability issues, data privacy concerns, and regulatory complexities pose significant hurdles to adoption. Nevertheless, the adoption of distributed systems presents opportunities for innovation and collaboration, enabling governments to develop novel solutions for governance, resource management, and service delivery. Moreover, distributed systems raise important ethical and societal considerations, emphasizing the need for inclusivity, equity, and social justice in their design and deployment. At last, while challenges remain, the integration of distributed systems holds promise for building more resilient, responsive, and inclusive governance systems that better serve the needs of citizens and society as a whole.",
    "citationCount": 1,
    "referenceCount": 28
}