{
    "paperId": "4146cea25b7006fafbe34e7612d15d1c2e5ba6f4",
    "title": "Modelling human genetic disorders in Xenopus tropicalis",
    "year": 2024,
    "venue": "Disease Models & Mechanisms",
    "authors": [
        "H. Willsey",
        "E. Seaby",
        "Annie Godwin",
        "Sarah Ennis",
        "Matt Guille",
        "Robert M Grainger"
    ],
    "doi": "10.1242/dmm.050754",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4146cea25b7006fafbe34e7612d15d1c2e5ba6f4",
    "isOpenAccess": true,
    "openAccessPdf": "https://journals.biologists.com/dmm/article-pdf/17/5/dmm050754/3467923/dmm050754.pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Recent progress in human disease genetics is leading to rapid advances in understanding pathobiological mechanisms. However, the sheer number of risk-conveying genetic variants being identified demands in vivo model systems that are amenable to functional analyses at scale. Here we provide a practical guide for using the diploid frog species Xenopus tropicalis to study many genes and variants to uncover conserved mechanisms of pathobiology relevant to human disease. We discuss key considerations in modelling human genetic disorders: genetic architecture, conservation, phenotyping strategy and rigour, as well as more complex topics, such as penetrance, expressivity, sex differences and current challenges in the field. As the patient-driven gene discovery field expands significantly, the cost-effective, rapid and higher throughput nature of Xenopus make it an essential member of the model organism armamentarium for understanding gene function in development and in relation to disease.",
    "citationCount": 6,
    "referenceCount": 137
}