{
    "paperId": "419209e026c389b818b6437f1cc43e5465bdd73c",
    "title": "A Review of Wearable Gait Recognition: Techniques, Methods, and Future Trends in Biometric Authentication",
    "year": 2024,
    "venue": "International Conference on Identification, Information, and Knowledge in the Internet of Things",
    "authors": [
        "Chenggang Lu",
        "Zhengqing He",
        "Xiaoxu Wen",
        "Ruixiang Hu",
        "Qiangsong Zhao",
        "Yan Wang"
    ],
    "doi": "10.1109/IIKI65561.2024.00021",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/419209e026c389b818b6437f1cc43e5465bdd73c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid development of the Internet of Things and smart wearable devices has driven the widespread application of biometric authentication technologies in fields such as healthcare, mobile payment, and smart security. Among these, gait recognition, which relies on dynamic human features, has captured notable attention due to its non-invasive nature and ease of data collection. This paper presents a review of the current wearable gait identification technologies, highlighting key steps such as data acquisition, feature extraction, model training, and recognition testing. The focus is placed on gait feature extraction techniques and associated methods. Moreover, this review explores the use of recognition models, and examines popular gait datasets and their performance across various scenarios. By summarizing recent research developments, we also discuss the challenges and future directions of gait recognition technology, particularly in areas such as data diversity, cross-device adaptability, real-time performance, and data privacy concerns.",
    "citationCount": 0,
    "referenceCount": 54
}