{
    "paperId": "419f1ea4ac8318b045b88afd49e6b7c1a49b9d61",
    "title": "Investigation of BigData Optimization Techniques Used for Multi-Stage Attacks Detection",
    "year": 2025,
    "venue": "2025 IEEE Ural-Siberian Conference on Biomedical Engineering, Radioelectronics and Information Technology (USBEREIT)",
    "authors": [
        "Igor Zelichenok",
        "Igor Kotenko"
    ],
    "doi": "10.1109/USBEREIT65494.2025.11054183",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/419f1ea4ac8318b045b88afd49e6b7c1a49b9d61",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern network intrusion detection systems (NIDS) face significant challenges in identifying multi-stage attacks due to the increasing complexity and unpredictability of modern cyber threats. Traditional methods often struggle to efficiently process and analyze large volumes of streaming network data in real time while maintaining high detection accuracy. This paper introduces an optimized detection pipeline based on Long Short-Term Memory (LSTM) models, leveraging advanced big data techniques such as batch and stream processing, NoSQL storage, and distributed computing. The proposed system improves the detection of sophisticated multi-step attacks by utilizing time-series analysis, multithreading, and data clustering to extract meaningful patterns from continuous network traffic. Experimental evaluation using the EDGE-IIOTSET dataset demonstrates that the optimized approach significantly reduces detection latency and enhances overall performance. As a result of the experiments, it was possible to reduce the delay between the receipt of a data packet and the output of attacks with a period of 8.88 to 5.74 seconds, and also introduce a buffering mechanism to avoid system overload. These improvements make the system well-suited for real-world cybersecurity applications, ensuring faster threat identification and mitigation in dynamic and large-scale network environments.",
    "citationCount": 0,
    "referenceCount": 10
}