{
    "paperId": "41dcfa296794f97331715891fdcbb05f2ad055bf",
    "title": "Physics Embedded Deep Neural Network for Solving Volume Integral Equation: 2-D Case",
    "year": 2022,
    "venue": "IEEE Transactions on Antennas and Propagation",
    "authors": [
        "Rui Guo",
        "Tao Shan",
        "Xiaoqian Song",
        "Maokun Li",
        "Fan Yang",
        "Shenheng Xu",
        "A. Abubakar"
    ],
    "doi": "10.1109/TAP.2021.3070152",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/41dcfa296794f97331715891fdcbb05f2ad055bf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The volume integral equation (VIE) that describes the forward scattering problem is generally solved by iterative methods, such as the conjugate gradient (CG) method. In this work, we unfold the CG method into an iterative deep neural network to accelerate solving the VIE. After the dielectric scatterer’s relative permittivity and the incident field are input into the network, the total field is trained to converge to the ground truth iteratively. In the neural network, Green’s function is taken as an explicit operator to describe wave physics, and the fast Fourier transform (FFT) is applied to accelerate the computation of volume integrations. The global influence of all points in the space is compressed into a layer by the volume integration. In numerical tests, we validate the accuracy, efficiency, and generalization ability of the proposed neural network, and investigate the feasibility of changing the input size and the frequency in the prediction. Results show that the network is scale-independent and adaptable to predict fields in a narrow frequency band. This work provides us a new perspective of incorporating both learned parameters and physics into numerical algorithms for fast computation, and has the potential of being applied in deep-learning-based inverse scattering problems.",
    "citationCount": 39,
    "referenceCount": 38
}