{
    "paperId": "4221d5510df9e7dacf33e9b4bc54ba1f78c0f233",
    "title": "Monitoring the Production Information of Conventional Machining Equipment Based on Edge Computing",
    "year": 2022,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Yuguo Wang",
        "Miaocong Shen",
        "Xiaochun Zhu",
        "Bin Xie",
        "Kun Zheng",
        "Jiaxiang Fei"
    ],
    "doi": "10.3390/s23010402",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4221d5510df9e7dacf33e9b4bc54ba1f78c0f233",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/1/402/pdf?version=1672391024",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A production status monitoring method based on edge computing is proposed for traditional machining offline equipment to address the deficiencies that traditional machining offline equipment have, which cannot automatically count the number of parts produced, obtain part processing time information, and discern anomalous operation status. Firstly, the total current signal of the collected equipment was filtered to extract the processing segment data. The processing segment data were then used to manually calibrate the feature vector of the equipment for specific parts and processes, and the feature vector was used as a reference to match with the real-time electric current data on the edge device to identify and obtain the processing start time, processing end time, and anomalous marks for each part. Finally, the information was uploaded to further obtain the part processing time, loading and unloading standby time, and the cause of the anomaly. To verify the reliability of the method, a prototype system was built, and extensive experiments were conducted on many different types of equipment in an auto parts manufacturer. The experimental results show that the proposed monitoring algorithm based on the calibration vector can stably and effectively identify the production information of each part on an independently developed edge device.",
    "citationCount": 3,
    "referenceCount": 41
}