{
    "paperId": "428bd1a7d3c91dbb7ef3d296fcae08332a544978",
    "title": "Scalability and Maintainability Challenges and Solutions in Machine Learning: Systematic Literature Review",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Karthik Shivashankar",
        "Ghadi S. Al Hajj",
        "Antonio Martini"
    ],
    "doi": "10.48550/arXiv.2504.11079",
    "arxivId": "2504.11079",
    "url": "https://www.semanticscholar.org/paper/428bd1a7d3c91dbb7ef3d296fcae08332a544978",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This systematic literature review examines the critical challenges and solutions related to scalability and maintainability in Machine Learning (ML) systems. As ML applications become increasingly complex and widespread across industries, the need to balance system scalability with long-term maintainability has emerged as a significant concern. This review synthesizes current research and practices addressing these dual challenges across the entire ML life-cycle, from data engineering to model deployment in production. We analyzed 124 papers to identify and categorize 41 maintainability challenges and 13 scalability challenges, along with their corresponding solutions. Our findings reveal intricate inter dependencies between scalability and maintainability, where improvements in one often impact the other. The review is structured around six primary research questions, examining maintainability and scalability challenges in data engineering, model engineering, and ML system development. We explore how these challenges manifest differently across various stages of the ML life-cycle. This comprehensive overview offers valuable insights for both researchers and practitioners in the field of ML systems. It aims to guide future research directions, inform best practices, and contribute to the development of more robust, efficient, and sustainable ML applications across various domains.",
    "citationCount": 1,
    "referenceCount": 152
}