{
    "paperId": "42d697b615556dac43b78d59eef9c7ed16d2789e",
    "title": "Calculation of RMS Current Load on DC-Link Capacitors for Multiphase Machine Drives under Carrier-Phase Shift Control",
    "year": 2023,
    "venue": "J of Control Science and Engineering",
    "authors": [
        "Zhigang Zhang",
        "Pengcheng Zhang",
        "Yang Zhang",
        "Wenjuan Zhang",
        "Mengdi Li",
        "Zichen Xiong"
    ],
    "doi": "10.1155/2023/6909403",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/42d697b615556dac43b78d59eef9c7ed16d2789e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1155/2023/6909403",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The reliability and economy of dc-link capacitors are important concerns in multiphase drive systems. Due to the parallel connection of several converters, the dc-link capacitors are subjected to a higher RMS current, and the root mean square (RMS) current of dc-link capacitors is an important reference standard to determine its lifetime, cost, and volume. In this paper, the RMS current of dc-link capacitor is calculated by using the dual Fourier integral method and the effect of carrier interleave is studied. Meanwhile, the modulation ratio, harmonic sidebands, and switching frequency are also considered. In order to optimize the reliability and economy of the multiphase drive system, a Cotes method combined with carrier-phase shifting technology (CPST) for calculating RMS current of the dc-link capacitor is proposed. The proposed method can provide optimization guidance for the design of dc-link capacitors. Finally, the analytical and experiment results are compared with the existing methods, and the experimental results verify the effectiveness of the proposed method.",
    "citationCount": 2,
    "referenceCount": 26
}