{
    "paperId": "43720b9f68d549772d75ffa333d4e3dc8c5d3dc6",
    "title": "Proactive Streaming Analytics at Scale: A Journey from the State-of-the-art to a Production Platform",
    "year": 2023,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Nikos Giatrakos",
        "E. Alevizos",
        "Antonios Deligiannakis",
        "Ralf Klinkenberg",
        "A. Artikis"
    ],
    "doi": "10.1145/3583780.3615293",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/43720b9f68d549772d75ffa333d4e3dc8c5d3dc6",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3583780.3615293",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Proactive streaming analytics continuously extract real-time business value from massive data that stream in data centers or clouds. This requires (a) to process the data while they are still in motion; (b) to scale the processing to multiple machines, often over various, dispersed computer clusters, with diverse Big Data technologies; and (c) to forecast complex business events for proactive decision-making. Combining the necessary facilities for proactive streaming analytics at scale entails: (I) deep knowledge of the relevant state-of-the-art, (II) cherry-picking cutting edge research outcomes based on desired features and with the prospect of building interoperable components, and (III) building components and deploying them into a holistic architecture within a real-world platform. In this tutorial, we drive the audience through the whole journey from (I) to (III), delivering cutting edge research into a commercial analytics platform, for which we provide a hands-on experience.",
    "citationCount": 2,
    "referenceCount": 51
}