{
    "paperId": "43796a5e908cd435850f57e8ba5835d68bc55967",
    "title": "Quantum Machine Learning: Foundation, New Techniques, and Opportunities for Database Research",
    "year": 2023,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Tobias Winker",
        "Sven Groppe",
        "Valter Uotila",
        "Zhengtong Yan",
        "Jiaheng Lu",
        "Maja Franz",
        "Wolfgang Mauerer"
    ],
    "doi": "10.1145/3555041.3589404",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/43796a5e908cd435850f57e8ba5835d68bc55967",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3555041.3589404",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the last few years, the field of quantum computing has experienced remarkable progress. The prototypes of quantum computers already exist and have been made available to users through cloud services (e.g., IBM Q experience, Google quantum AI, or Xanadu quantum cloud). While fault-tolerant and large-scale quantum computers are not available yet (and may not be for a long time, if ever), the potential of this new technology is undeniable. Quantum algorithms have the proven ability to either outperform classical approaches for several tasks, or are impossible to be efficiently simulated by classical means under reasonable complexity-theoretic assumptions. Even imperfect current-day technology is speculated to exhibit computational advantages over classical systems. Recent research is using quantum computers to solve machine learning tasks. Meanwhile, the database community has already successfully applied various machine learning algorithms for data management tasks, so combining the fields seems to be a promising endeavour. However, quantum machine learning is a new research field for most database researchers. In this tutorial, we provide a fundamental introduction to quantum computing and quantum machine learning and show the potential benefits and applications for database research. In addition, we demonstrate how to apply quantum machine learning to the join order optimization problem in databases.",
    "citationCount": 31,
    "referenceCount": 71
}