{
    "paperId": "438568070be098a8037ef335de35faa9a62c5eb5",
    "title": "Self-Adaptive Moving Target Defense with Cyberdeception for Proactive Defense of IoT Networks",
    "year": 2025,
    "venue": "Italian Conference on Theoretical Computer Science",
    "authors": [
        "Mouhammd Alkasassbeh",
        "Ashwaq Khalil",
        "Mohammad Almseidin"
    ],
    "doi": "10.1109/ICTCS65341.2025.10989318",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/438568070be098a8037ef335de35faa9a62c5eb5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the Internet of Things (IoT) continues to grow the rise, in connected devices has made networks more susceptible to cyber threats. Traditional cybersecurity methods often stay the same making them less effective against changing and clever cyberattacks. A new model called Self Adaptive Moving Target Defense (MTD) is introduced in this research. It integrates Cyberdeception. Uses a Q learning approach to boost network security. By changing the layout of decoy networks this model aims to confuse potential attackers and strengthen network resilience. Through reinforcement learning, Q learning our model adjusts to attackers actions improving defense strategies to effectively mislead both not so smart adversaries. The effectiveness of our proposed model is tested in a smart hospital network environment demonstrating its superiority in fooling attackers and extending the networks lifespan compared to MTD tactics. Our results suggest that the proposed Self Adaptive MTD model, by employing changes and Cyberdeception techniques significantly increases the number of fooled attackers. This indicates an approach for defense against cyber threats in IoT environments. This study brings a perspective to cybersecurity by offering a method to protect IoT networks emphasizing adaptability and proactive measures, in addressing the ever changing landscape of cyber risks.",
    "citationCount": 0,
    "referenceCount": 27
}