{
    "paperId": "4388f8a34b46bb3e07f75619d4592439d784cad5",
    "title": "Enhancing Network Management Using Code Generated by Large Language Models",
    "year": 2023,
    "venue": "ACM Workshop on Hot Topics in Networks",
    "authors": [
        "Sathiya Kumaran Mani",
        "Yajie Zhou",
        "Kevin Hsieh",
        "Santiago Segarra",
        "Trevor Eberl",
        "Eliran Azulai",
        "Ido Frizler",
        "Ranveer Chandra",
        "Srikanth Kandula"
    ],
    "doi": "10.1145/3626111.3628183",
    "arxivId": "2308.06261",
    "url": "https://www.semanticscholar.org/paper/4388f8a34b46bb3e07f75619d4592439d784cad5",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2308.06261",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analyzing network topologies and communication graphs is essential in modern network management. However, the lack of a cohesive approach results in a steep learning curve, increased errors, and inefficiencies. In this paper, we present a novel approach that enables natural-language-based network management experiences, leveraging large language models (LLMs) to generate task-specific code from natural language queries. This method addresses the challenges of explainability, scalability, and privacy by allowing network operators to inspect the generated code, removing the need to share network data with LLMs, and focusing on application-specific requests combined with program synthesis techniques. We develop and evaluate a prototype system using benchmark applications, demonstrating high accuracy, cost-effectiveness, and potential for further improvements using complementary program synthesis techniques.",
    "citationCount": 41,
    "referenceCount": 62
}