{
    "paperId": "43974d7753da1acf1f70ad2f8f184971d5bdc2be",
    "title": "SQL Synthesis with Input-Output Example Based on Deep Learning",
    "year": 2023,
    "venue": "IEEE International Joint Conference on Neural Network",
    "authors": [
        "Shun Zhang",
        "Quansheng Dou",
        "H. Tang",
        "Hao Pan",
        "Huixian Wang"
    ],
    "doi": "10.1109/IJCNN54540.2023.10191168",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/43974d7753da1acf1f70ad2f8f184971d5bdc2be",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, an increasing number of people rely on data manipulation tasks to complete their work. However, many of these users lack programming background and find it challenging to write complex programs, especially SQL. As a result, the automatic synthesis of SQL has become a hot research topic. This process, called Query Reverse Engineering (QRE), involves automatically synthesizing SQL based on input-output tables provided by users. While most SQL synthesizers focus on structures that do not use deep learning, we propose a new SQL synthesis method that lever-ages the superiority of deep learning. Our method uses a deep neural network (DNN) to predict the correlation between the input-output table and DSL operators, eliminate irrelevant operators, and improve the efficiency of SQL synthesis. We have implemented the SQL synthesis system, Solid, based on this method. The system introduces the Deep Neural Network (DNN) based on SQUARES, one of the best query synthesizers. To verify the effectiveness of our proposed method, we conducted experiments using a simple neural network structure. The results show that our method outperforms SQUARES, with an increased success rate of stereo synthesis from 80% to 89.1%, and a reduced average synthesis time from 251s to 130s.",
    "citationCount": 0,
    "referenceCount": 44
}