{
    "paperId": "43c1ea61ec76217458b14781d3301c4835f1db51",
    "title": "Towards Personalized AI-Based Diabetes Therapy: A Review",
    "year": 2024,
    "venue": "IEEE journal of biomedical and health informatics",
    "authors": [
        "Sara Campanella",
        "Giovanni Paragliola",
        "V. Cherubini",
        "P. Pierleoni",
        "Lorenzo Palma"
    ],
    "doi": "10.1109/JBHI.2024.3443137",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/43c1ea61ec76217458b14781d3301c4835f1db51",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/jbhi.2024.3443137",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Insulin pumps and other smart devices have recently made significant advancements in the treatment of diabetes, a disorder that affects people all over the world. The development of medical AI has been influenced by AI methods designed to help physicians make diagnoses, choose a course of therapy, and predict outcomes. In this article, we thoroughly analyse how AI is being used to enhance and personalize diabetes treatment. The search turned up 77 original research papers, from which we've selected the most crucial information regarding the learning models employed, the data typology, the deployment stage, and the application domains. We identified two key trends, enabled mostly by AI: patient-based therapy personalization and therapeutic algorithm optimization. In the meanwhile, we point out various shortcomings in the existing literature, like a lack of multimodal database analysis or a lack of interpretability. The rapid improvements in AI and the expansion of the amount of data already available offer the possibility to overcome these difficulties shortly and enable a wider deployment of this technology in clinical settings.",
    "citationCount": 6,
    "referenceCount": 121
}