{
    "paperId": "43da223b236ebb0916c3125baba76dc65081224c",
    "title": "HeavyTracker: An Efficient Algorithm for Heavy-Hitter Detection in High-Speed Networks",
    "year": 2023,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Jiakun Yu",
        "Yu-E. Sun",
        "He Huang",
        "Yangyan Du",
        "Guoju Gao",
        "Hongli Xu",
        "Shigang Chen"
    ],
    "doi": "10.1109/ICPADS56603.2022.00054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/43da223b236ebb0916c3125baba76dc65081224c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Detecting heavy hitters that constitute the majority of network traffic is a critical task in network measurement. However, the highly skewed network traffic and the size-limited on-chip memory pose great challenges for heavy-hitter detection. The prior arts either use sketches to track all flows or maintain a fix-sized tracking list for recording elephant flows, resulting in limited detection precision or time-consuming tracking list exchanges. This paper presents HeavyTracker, an efficient algorithm that detects heavy hitters based on a count-with-threshold strategy. A two-dimensional tracker unit array is employed in our design to capture the heavy hitters, where each flow is randomly mapped to one unit in all rows. The tracker unit is designed to accept many flows and precisely report the largest two with frequencies that reach a predefined threshold. This design eliminates the frequent and time-consuming exchanges for maintaining the tracking list, allowing us to use a hash table to track the reported elephant flows. Experimental results based on real Internet traces show that HeavyTracker achieves a high $\\mathbf{F}_{\\beta}$-Score of threshold-t detection (0.97) and over 99% precision of top-k detection under a tight memory size. Besides, it reduces the frequency estimation error by 97.4% compared to the state-of-the-art.",
    "citationCount": 1,
    "referenceCount": 21
}