{
    "paperId": "440c6b56ad0778bc183da9d3a5d24a39966c8b8a",
    "title": "A Comparative Study of Object-Oriented, Procedural, and Functional Programming Paradigms in Microservice Architecture",
    "year": 2025,
    "venue": "VFAST Transactions on Software Engineering",
    "authors": [
        "Mustafa Ahmed Khan",
        "Syed Shabeeb Raza",
        "Khalid Mahboob",
        "Sana Alam",
        "Muhammad Asghar Khan",
        "Muhammad Noman Hasany"
    ],
    "doi": "10.21015/vtse.v13i3.2216",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/440c6b56ad0778bc183da9d3a5d24a39966c8b8a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "It is noted here that the microservices architecture has changed the whole paradigm of software engineering so that it permits building systems that could be distributed, scalable, and maintainable. Object-Oriented Programming (OOP) still dominates the design paradigms in industry. However, there has been revived interest in evaluating it in light of Procedural Programming (PP) and Functional Programming (FP) paradigms with respect to the evolving nature of software architecture. This paper covers a comprehensive comparative analysis of these three paradigm types in relation to microservice-based system design. In this case, each of the paradigms is applied in almost the exact architectural requirements upon a real-world e-commerce domain model, and finally, the evaluation was made on the basis of modularity, scalability, maintainability, and operational efficiency. Our finding is that, although OOP provides a balanced mix between abstraction and modularity beneficial for service-based architecture, FP is about minimizing mutable state through immutability and pure functions; hence the reduction of race conditions and making concurrency safer in distributed environments. Procedural programming is quite efficient for small-scale operations, but it faces serious hurdles in establishing service modularization and maintainability. In terms of such an ideal model supported by the current literature (2020-2025). This paper argues that OOP will be the most relevant paradigm for microservices, with Functional Programming reaping its benefits and promising alternatives for cloud-native or event-driven scenarios. In conclusion, this study narrates the call for hybrid approaches-the approaches that will utilize the strength of all paradigms to fulfill the ever-evolving software needs.",
    "citationCount": 1,
    "referenceCount": 14
}