{
    "paperId": "4457e4a3e9cf18410d0c7c522d67829966c4beff",
    "title": "DH-SVRF: A Reconfigurable Unicast/Multicast Forwarding for High-Performance Packet Forwarding Engines",
    "year": 2022,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "Zhu Jin",
        "Wen-Kang Jia"
    ],
    "doi": "10.1109/TPDS.2021.3108899",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4457e4a3e9cf18410d0c7c522d67829966c4beff",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-performance multicast-enabled packet forwarding engines (PFEs), as an essential component of high-end switches, use a polynomial-time membership query algorithm to determine which port(s) the data packet should be forwarded. The currently widely used query algorithm is Bloom Filter (BF), which has been proven to have many fatal flaws. Another error-free membership query algorithm includes Scalar-pair Vectors Routing Forwarding (SVRF), Fractional-N Scalar-pair Vectors Routing Forwarding (Frac-N SVRF), and the Per-Port Prime Filter Array (P3FA) also have some shortcomings in space and time efficiencies. In this paper, we proposed a hybrid strategy: Divaricate Heterogeneous SVRF (DH-SVRF) scheme, which based on the P3FA and Frac-N SVRF, which randomly divides all member ships into N groups, and each group has the same structure and is independent of each other to obtain higher time efficiency and space utilization. Finally, we also discussed the selection of the optimal egress-diversity threshold. Through mathematical modeling and simulation, we validate that the proposed DH-SVRF scheme is superior to the SVRF/Frac-N SVRF and traditional BF in terms of scalability, space utilization, and time efficiency in specific conditions such as appropriate egress-diversity thresholds.",
    "citationCount": 6,
    "referenceCount": 47
}