{
    "paperId": "446accf98cb51e5a2d3dbed21762117c55dea5f0",
    "title": "SOMONITOR: Combining Explainable AI&Large Language Models for Marketing Analytics",
    "year": 2024,
    "venue": "",
    "authors": [
        "Aleksandr Farseev",
        "Qi Yang",
        "Marlo Ongpin",
        "Ilia Gossoudarev",
        "Yu-Yi Chu-Farseeva",
        "Sergey Nikolenko"
    ],
    "doi": null,
    "arxivId": "2407.13117",
    "url": "https://www.semanticscholar.org/paper/446accf98cb51e5a2d3dbed21762117c55dea5f0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online marketing faces formidable challenges in managing and interpreting immense volumes of data necessary for competitor analysis, content research, and strategic branding. It is impossible to review hundreds to thousands of transient online content items by hand, and partial analysis often leads to suboptimal outcomes and poorly performing campaigns. We introduce an explainable AI framework SOMONITOR that aims to synergize human intuition with AI-based efficiency, helping marketers across all stages of the marketing funnel, from strategic planning to content creation and campaign execution. SOMONITOR incorporates a CTR prediction and ranking model for advertising content and uses large language models (LLMs) to process high-performing competitor content, identifying core content pillars such as target audiences, customer needs, and product features. These pillars are then organized into broader categories, including communication themes and targeted customer personas. By integrating these insights with data from the brand's own advertising campaigns, SOMONITOR constructs a narrative for addressing new customer personas and simultaneously generates detailed content briefs in the form of user stories that, as shown in the conducted case study, can be directly applied by marketing teams to streamline content production and campaign execution. The adoption of SOMONITOR in daily operations allows digital marketers to quickly parse through extensive datasets, offering actionable insights that significantly enhance campaign effectiveness and overall job satisfaction.",
    "citationCount": 4,
    "referenceCount": 112
}