{
    "paperId": "446ddc40ae42f95258ded4369828713fd5aebc76",
    "title": "MEST: An Efficient Authenticated Secondary Index in Blockchain Systems",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Jinping Jia",
        "Yichen Gao",
        "Yifei Zhen",
        "Zhao Zhang",
        "Qian Kun",
        "Cheqing Jin"
    ],
    "doi": "10.1109/ICDE65448.2025.00126",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/446ddc40ae42f95258ded4369828713fd5aebc76",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing blockchain systems can quickly respond to verifiable primary key queries based on authenticated indexes. However, many blockchain applications also require high-performance queries on non-primary keys. For example, traders query NFT or tokenized RWA with certain features, e.g., type and return. Therefore, it necessitates authenticated secondary indexes to support efficient verifiable queries on non-primary keys. However, the existing approach to authenticated index design that couples index and authenticated digest together does not adapt well to the phased nature of non-primary key queries, making the most time-consuming process of commitment generation severely block the query process. In this study, we propose the first authenticated secondary index MEST for verifiable non-primary key queries. MEST decouples the data index and authenticated digest, which can parallelize commitment generation on the secondary index and the query processing on the primary index, thus greatly reducing the latency of the non-primary key query. Furthermore, we adopt an Extendible Hash Table to index data and propose a Merkle Growth Tree to generate commitment, which can dynamically adapt to the rapid growth of data and the skew in data access pattern. Extensive experiments on both synthetic and real datasets demonstrate that MEST improves throughput by 3.17×, reduces latency by 59%, and exhibits better scalability than baselines.",
    "citationCount": 0,
    "referenceCount": 62
}