{
    "paperId": "446f33ded20fc81492582ef533646753f3651e70",
    "title": "Addressing Scalability Issues of Blockchains With Hypergraph Payment Networks",
    "year": 2025,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Arad Kotzer",
        "Bence Ladóczki",
        "János Tapolcai",
        "Ori Rottenstreich"
    ],
    "doi": "10.1109/TNSM.2025.3542960",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/446f33ded20fc81492582ef533646753f3651e70",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Payment channels are auspicious candidates in layer-2 solutions to reduce the number of on-chain transactions on traditional blockchains and increase transaction throughput. To construct payment channels, peers lock funds on 2-of-2 multisig addresses and open channels between one another to transact via instant peer-to-peer transactions. Transactions between peers without a direct channel are made possible by routing the payment over a series of adjacent channels. In certain cases, this can lead to relatively low transaction success rates and high transaction fees. In this work, we introduce pliability to constructing payment channels and graft edges with more than two endpoints into the payment graph. We refer to these constructions as hyperedges. We present hyperedge-based topologies to form hypergraphs and compare them to Bitcoin’s Lightning network and other state-of-the-art solutions. The results demonstrate that hyperedge-based implementations can both increase transaction success rate, in addition to decreasing the network cost by more than 50% compared to that of the Lightning Network.",
    "citationCount": 0,
    "referenceCount": 68
}