{
    "paperId": "447e5b78ce9064d057f30210e592036e566ada02",
    "title": "VIP Hashing - Adapting to Skew in Popularity of Data on the Fly",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Aarati Kakaraparthy",
        "J. Patel",
        "Brian Kroth",
        "Kwanghyun Park"
    ],
    "doi": "10.14778/3547305.3547306",
    "arxivId": "2206.12380",
    "url": "https://www.semanticscholar.org/paper/447e5b78ce9064d057f30210e592036e566ada02",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n All data is not equally popular. Often, some portion of data is more frequently accessed than the rest, which causes a skew in popularity of the data items. Adapting to this skew can improve performance, and this topic has been studied extensively in the past for disk-based settings. In this work, we consider an in-memory data structure, namely\n hash table\n , and show how one can leverage the skew in popularity for higher performance.\n \n \n Hashing is a low-latency operation, sensitive to the effects of caching and code complexity, among other factors. These factors make learning in-the-loop challenging as the overhead of performing additional operations can have significant impact on performance. In this paper, we propose VIP hashing, a hash table method that uses lightweight mechanisms for\n learning\n the skew in popularity and\n adapting\n the hash table layout on the fly. These mechanisms are non-blocking, i.e, the hash table is operational at all times. The overhead is controlled by\n sensing\n changes in the popularity distribution to\n dynamically switch-on/off\n the mechanisms as needed.\n \n \n We ran extensive tests against a host of workloads generated by\n Wiscer\n , a homegrown benchmarking tool, and we find that VIP hashing improves performance in the presence of skew (22% increase in fetch operation throughput for a hash table with 1M keys under low skew) while adapting to insert and delete operations, and changing popularity distribution of keys on the fly. Our experiments on DuckDB show that VIP hashing reduces the end-to-end execution time of TPC-H query 9 by 20% under low skew.\n",
    "citationCount": 11,
    "referenceCount": 38
}