{
    "paperId": "44bf4ac08649e2c330f7c24cd9f8e567f59fad26",
    "title": "Feature Fusion Network for Personalized Online Advertising Systems",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Weijie Zhao",
        "Peng Yang",
        "Dong Li",
        "Xing Shen",
        "Lin Liu",
        "Ping Li"
    ],
    "doi": "10.1109/BigData55660.2022.10020981",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/44bf4ac08649e2c330f7c24cd9f8e567f59fad26",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sponsored online advertising delivers many billions of revenues for online ads publishers. The ads systems take userinput query keywords and display ads that are relevant to the query. the task of click-through rate (CTR) prediction aims to estimate the likelihood of a user clicking on the ads, which has become one of the core goals in the ads system. In order to further improve the CTR, user portraits are also considered as an input to make personalized ads display and recommendations, in the current deep learning CTR training platform. The naive combination of user space (~ 109) and feature space (~ 10]12 however, would yield a 1021 dimensional space. It is not only infeasible to feed the 1021 parameters into the embedding layer with any off-the-shelf storage, but also impractical to train the network in such massive-scale dimensional space. In this paper, we design a novel CTR prediction framework for ads systems to tackle the massive-scale user-feature combination challenge. Specifically, we introduce a feature fusion network to explicitly learn user-feature cross embedding in an end-to-end manner. To improve the efficiency, we prune the feature fusion networks to a practical number through a network importance ranking scheme. Extensive empirical experiments on Baidu’s ads data validate the effectiveness of the proposed feature fusion networks.",
    "citationCount": 0,
    "referenceCount": 40
}