{
    "paperId": "44c16d33627063be59674af2eca84e8c863b07bd",
    "title": "OPO-CVI: design and implementation of an ocean profiling observation system for wave-powered vertical profiler following an ISO standard",
    "year": 2024,
    "venue": "Frontiers in Marine Science",
    "authors": [
        "Sining Jiang",
        "Zhongwen Guo",
        "Hailei Zhao",
        "Ziyuan Cui",
        "Weigang Wang"
    ],
    "doi": "10.3389/fmars.2024.1324523",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/44c16d33627063be59674af2eca84e8c863b07bd",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fmars.2024.1324523/pdf?isPublishedV2=False",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents the design and implementation of an ISO-compliant ocean profiling observation system for wave-powered vertical profiler. This system aims to provide a comprehensive, scalable, and interoperable solution for high-resolution, real-time oceanic observation. As a part of this system, we introduce a wave-powered vertical profiler, known as “Wave Master,” designed to offer enhanced stability and reliability for long-term oceanic data collection. The core of the paper focuses on the Ocean Profiling Observation Complex Virtual Instrument (OPO-CVI), a comprehensive system developed in alignment with ISO 21851 standard. OPO-CVI seamlessly integrates data collection, transmission, storage, and visualization. Specifically, OPO-CVI addresses the challenges of information isolation, system rigidity, and lack of modularity in traditional ocean profiling methods by standardizing data formats and transmission protocols, allowing for seamless integration of new observation elements, and employing a modular architecture for enhanced scalability and reusability. By offering detailed technical insights into the OPO-CVI architecture and its compliance with ISO 21851 standard, this paper aims to contribute significantly to the advancement of standardized, efficient, and reliable oceanic observation systems.",
    "citationCount": 3,
    "referenceCount": 43
}