{
    "paperId": "44d2cfdc0aef124663545b1a312db246e3de4b76",
    "title": "Enhancing In-Memory Spatial Indexing with Learned Search",
    "year": 2023,
    "venue": "Datenbanksysteme für Business, Technologie und Web",
    "authors": [
        "Varun Pandey",
        "Alexander van Renen",
        "Eleni Tzirita Zacharatou",
        "Andreas Kipf",
        "Ibrahim Sabek",
        "Jialin Ding",
        "Volker Markl",
        "A. Kemper"
    ],
    "doi": "10.48550/arXiv.2309.06354",
    "arxivId": "2309.06354",
    "url": "https://www.semanticscholar.org/paper/44d2cfdc0aef124663545b1a312db246e3de4b76",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.06354",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spatial data is ubiquitous. Massive amounts of data are generated every day from a plethora of sources such as billions of GPS-enabled devices (e.g., cell phones, cars, and sensors), consumer-based applications (e.g., Uber and Strava), and social media platforms (e.g., location-tagged posts on Facebook, Twitter, and Instagram). This exponential growth in spatial data has led the research community to build systems and applications for efficient spatial data processing. In this study, we apply a recently developed machine-learned search technique for single-dimensional sorted data to spatial indexing. Specifically, we partition spatial data using six traditional spatial partitioning techniques and employ machine-learned search within each partition to support point, range, distance, and spatial join queries. Adhering to the latest research trends, we tune the partitioning techniques to be instance-optimized. By tuning each partitioning technique for optimal performance, we demonstrate that: (i) grid-based index structures outperform tree-based index structures (from 1.23$\\times$ to 2.47$\\times$), (ii) learning-enhanced variants of commonly used spatial index structures outperform their original counterparts (from 1.44$\\times$ to 53.34$\\times$ faster), (iii) machine-learned search within a partition is faster than binary search by 11.79% - 39.51% when filtering on one dimension, (iv) the benefit of machine-learned search diminishes in the presence of other compute-intensive operations (e.g. scan costs in higher selectivity queries, Haversine distance computation, and point-in-polygon tests), and (v) index lookup is the bottleneck for tree-based structures, which could potentially be reduced by linearizing the indexed partitions.",
    "citationCount": 4,
    "referenceCount": 101
}