{
    "paperId": "44e0b2fdbd5124f11c41d688aa3ba78fc799fa02",
    "title": "ZeroShotOpt: Towards Zero-Shot Pretrained Models for Efficient Black-Box Optimization",
    "year": 2025,
    "venue": "",
    "authors": [
        "Jamison Meindl",
        "Yunsheng Tian",
        "Tony Cui",
        "Veronika Thost",
        "Zhang-Wei Hong",
        "Johannes Durholt",
        "Jie Chen",
        "Wojciech Matusik",
        "Mina Konakovi'c Lukovi'c"
    ],
    "doi": null,
    "arxivId": "2510.03051",
    "url": "https://www.semanticscholar.org/paper/44e0b2fdbd5124f11c41d688aa3ba78fc799fa02",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Global optimization of expensive, derivative-free black-box functions requires extreme sample efficiency. While Bayesian optimization (BO) is the current state-of-the-art, its performance hinges on surrogate and acquisition function hyper-parameters that are often hand-tuned and fail to generalize across problem landscapes. We present ZeroShotOpt, a general-purpose, pretrained model for continuous black-box optimization tasks ranging from 2D to 20D. Our approach leverages offline reinforcement learning on large-scale optimization trajectories collected from 12 BO variants. To scale pretraining, we generate millions of synthetic Gaussian process-based functions with diverse landscapes, enabling the model to learn transferable optimization policies. As a result, ZeroShotOpt achieves robust zero-shot generalization on a wide array of unseen benchmarks, matching or surpassing the sample efficiency of leading global optimizers, including BO, while also offering a reusable foundation for future extensions and improvements. Our open-source code, dataset, and model are available at: https://github.com/jamisonmeindl/zeroshotopt",
    "citationCount": 1,
    "referenceCount": 47
}