{
    "paperId": "450b062c0dccdfd0cf4ca5affe154e672dc41aeb",
    "title": "SRFabric: A Semi-Reconfigurable Rack Scale Topology",
    "year": 2021,
    "venue": "Mathematical Problems in Engineering",
    "authors": [
        "Hu Song",
        "Quan Fang",
        "Yibo Jin",
        "Zhuzhong Qian"
    ],
    "doi": "10.1155/2021/6698957",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/450b062c0dccdfd0cf4ca5affe154e672dc41aeb",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/mpe/2021/6698957.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rack scale design is a promising trend towards customized hardware design, where high density clusters of SoCs are integrated in the rack. One of the biggest challenges for rack scale computing is the interconnection network. Traditional data center topologies require too many ToR switches to support hundreds of SoCs, while distributed fabrics deliver a considerably high end-to-end latency and network oversubscription. Since no one topology fits all kinds of workloads, a flexible in-rack topology requires a careful redesign to dynamically adapt to diverse data center traffic within tight cost and space constraints in the rack. SRFabric is a semi-reconfigurable rack scale network topology that exploits the high path diversity, the cost-effectiveness of distributed fabrics, and the dynamic reconfigurability of circuit switches. This is accomplished by enabling multiple static ports and dynamic ports for each SoC. Leveraging the partial link reconfigurability, SRFabric is able to optimize its topology to dynamically adapt to various workload patterns. We further propose the design of SRFabric to decide the nearly optimal number of dynamic ports and static ports for expected communication density and performance. Extensive evaluations demonstrate that SRFabric can deliver lower average path length, i.e., 2.21 hops on average, and higher bisection bandwidth, i.e., up to 77% nonblocking bandwidth, and provide comparable performance with state-of-the-art strategy XFabric at a lower cost, i.e., XFabric costs up to 3 times more than that of SRFabric.",
    "citationCount": 0,
    "referenceCount": 50
}