{
    "paperId": "453ca96373401d56cf2c2c4e32c41a978aed8f46",
    "title": "Augmented Reality Apps on Electronic Devices for Education Using Image-based Technique",
    "year": 2023,
    "venue": "Control and System Graduate Research Colloquium",
    "authors": [
        "Y. M. Yusof",
        "Ahmad Irfan Abd Rahim",
        "N. Kamaluddin",
        "Murizah Kassim"
    ],
    "doi": "10.1109/ICSGRC57744.2023.10215481",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/453ca96373401d56cf2c2c4e32c41a978aed8f46",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Engineering education is evolving with technology and educational methods and techniques for teaching and learning need to be renewed as technology continuously develops. The conventional way of teaching and learning is becoming least effective today as students tend to lose their focus during lectures. This research presents the development of Augmented Reality (AR) on electronic devices for education with Android smartphones. 3D models with Augmented Reality marker were developed using multiple Vuforia and Blender 3D software. The AR mobile application was designed using Unity 3D. Image based technique was used to track and scan the AR marker and display five engineering devices with detailed information. Virtual Studio Code is used to program the UI from Unity 3D. Result presents successful mobile AR apps for the five devices which created a new environment for teaching and learning. Sampling of 32 students were tested using the AR apps that shows they are immersive to learn due to the interaction with the 3D model. Analysis presents the effectiveness of augmented reality in education with 75% vote very effective and 25% for medium effectiveness. The respondents also contribute opinions on implementing augmented reality in virtual classes with agreement at 87.5% to implement the AR. Overall, a positive response with 90% of the testers finding Augmented Reality is helpful and stimulating in todays and future education.",
    "citationCount": 1,
    "referenceCount": 19
}