{
    "paperId": "454669e41f245d4d581225f46da89cfcc010f445",
    "title": "Joint Recommendation of Materialized Views and Indexes Based on Reinforcement Learning",
    "year": 2024,
    "venue": "IEEE International Conference on e-Business Engineering",
    "authors": [
        "Jiangqing Wang",
        "Yinglun Hu",
        "Chong Sun",
        "Huili Zhang",
        "Chongwei Ruan",
        "Shipeng Cao",
        "Bowen Zhang"
    ],
    "doi": "10.1109/ICEBE62490.2024.00040",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/454669e41f245d4d581225f46da89cfcc010f445",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the increasing amount of data in current OLAP databases, higher requirements are being placed on query efficiency. Index recommendation and materialized view recommendation are very important practical problems in database management systems, as both aim to improve the execution efficiency of specified workloads. Tuning both views and indexes for a given workload can be a daunting task for DBAs or automation tools, as both index tuning and view recommendation alone are NP-hard problems. When placed in the same tuning system, the search space rises exponentially. To address these challenges, we propose an intelligent approach for integrated physical database design recommendation. The system is made up of an index and view selection model based on Monte Carlo Tree Search and a utility estimation model based on deep learning, which can speed up the efficiency of index and view recommendation and quickly and accurately estimate the execution cost of a query. Specifically, our approach achieves up to a 60% performance gain when running industrial benchmarks.",
    "citationCount": 0,
    "referenceCount": 18
}