{
    "paperId": "455a4007807d8ca4c583bbca29ac410277e90668",
    "title": "Multi-Agent Deep Reinforcement Learning for Coordinated Multipoint in Mobile Networks",
    "year": 2024,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Stefan Schneider",
        "Holger Karl",
        "R. Khalili",
        "Artur Hecker"
    ],
    "doi": "10.1109/TNSM.2023.3300962",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/455a4007807d8ca4c583bbca29ac410277e90668",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Macrodiversity is a key technique to increase the capacity of mobile networks. It can be realized using coordinated multipoint (CoMP), simultaneously connecting users to multiple overlapping cells. Selecting which users to serve by how many and which cells is NP-hard but needs to happen continuously in real time as users move and channel state changes. Existing approaches often require strict assumptions about or perfect knowledge of the underlying radio system, its resource allocation scheme, or user movements, none of which is readily available in practice. Instead, we propose three novel self-learning and self-adapting approaches using model-free deep reinforcement learning (DRL): DeepCoMP, DD-CoMP, and D3-CoMP. DeepCoMP leverages central control and observations of all users to select cells almost optimally. DD-CoMP and D3-CoMP use multi-agent DRL, which allows distributed, robust, and highly scalable coordination. All three approaches learn from experience and self-adapt to varying scenarios, reaching 2x higher Quality of Experience than other approaches. They have very few built-in assumptions and do not need prior system knowledge, making them more robust to change and better applicable in practice than existing approaches.",
    "citationCount": 13,
    "referenceCount": 78
}