{
    "paperId": "455f114037d97dc1280fc12a98d5b2c4fe9803f0",
    "title": "The Genomic Computing Revolution: Defining the Next Decades of Accelerating Genomics",
    "year": 2024,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Harisankar Sadasivan",
        "Artur Klauser",
        "J. Hench",
        "Yatish Turakhia",
        "Gagandeep Singh",
        "Alberto Zeni",
        "Sarah Beecroft",
        "Satish Narayanasamy",
        "Jeff Nivala",
        "Bob Robey",
        "Onur Mutlu",
        "Kristof Denolf",
        "Sriranjani Sitaraman"
    ],
    "doi": "10.1109/HPEC62836.2024.10938492",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/455f114037d97dc1280fc12a98d5b2c4fe9803f0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of genomic data has positioned genomics to become one of the world's most storage-intensive and computationally demanding fields. This review paper provides a comprehensive analysis of emerging trends in software and hardware for genomics, addressing a critical gap in the current literature. We categorize and examine key algorithms in genomic sequencing workflows, including sequence data indexing, retrieval and pile-up, dynamic programming, and machine learning. We analyze how computational and memory requirements scale with input sizes for each category, offering insights into potential bottlenecks and optimization opportunities. Our review synthesizes recent advancements in hardware-software co-design, compression schemes, and acceleration techniques for genomic data processing. We propose graphics processing units (GPUs) as a promising first step for deploying genomics workflows due to their high throughput, memory bandwidth, and programmability. By providing a holistic perspective on the computational challenges in genomics, this paper attempts to set a promising direction for future researchers to work collectively to optimize all the components of genomic data processing workflows. Our work aims to foster more targeted and effective advancements in the field, potentially leading to significant improvements in the efficiency and scalability of genomic analyses. We also discuss performance portability as a second step to meet the diverse requirements in point-of-care workflows.",
    "citationCount": 1,
    "referenceCount": 117
}