{
    "paperId": "457217da9e30461d9c7071e3907667699d5bdc4f",
    "title": "Introduction: Non-Hermeneutic Reading",
    "year": 2023,
    "venue": "Helios",
    "authors": [
        "Joshua Billings",
        "Felix Budelmann"
    ],
    "doi": "10.1353/hel.2023.a948551",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/457217da9e30461d9c7071e3907667699d5bdc4f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract:The introduction discusses the genesis of this special issue. It describes the sense of discontent that led to an interest in 'non-hermeneutic reading,' understood as entailing a focus on the encounter between reader and text. It then lays out three contexts that shaped the papers in the issue: most formative are a group of tendencies, centered in English and modern language departments, toward 'postcritical' and other reader-centered methods of literary scholarship, associated with scholars such as Rita Felski and Eve Kosofsky Sedgwick; second are discussions of exclusion and disciplinary history within Classics, which have brought questions of readerly identity and identification to the fore; third is research into ancient practices of reading and criticism, which demonstrates a range of possibilities for literary writing that are relatively unexplored in modern scholarship. Finally, the introduction explains that 'non-hermeneutic reading' does not entail a complete rejection of meaning or interpretation as a goal of scholarship, but seeks rather to explore kinds of meanings that are not captured in hermeneutics as traditionally understood. It also observes that with the search for different kinds of meaning in reading comes experimentation with different forms of scholarly expression, including the use of a personal voice.",
    "citationCount": 0,
    "referenceCount": 25
}