{
    "paperId": "457b214bf9abdda527b768b35eb8a0ed80741197",
    "title": "Sugarcane Yield Estimation Using Satellite Remote Sensing Data in Empirical or Mechanistic Modeling: A Systematic Review",
    "year": 2024,
    "venue": "Remote Sensing",
    "authors": [
        "Nildson Rodrigues de França e Silva",
        "M. E. Chaves",
        "A. Luciano",
        "I. Sanches",
        "C. Almeida",
        "Marcos Adami"
    ],
    "doi": "10.3390/rs16050863",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/457b214bf9abdda527b768b35eb8a0ed80741197",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-4292/16/5/863/pdf?version=1709541056",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The sugarcane crop has great socioeconomic relevance because of its use in the production of sugar, bioelectricity, and ethanol. Mainly cultivated in tropical and subtropical countries, such as Brazil, India, and China, this crop presented a global harvested area of 17.4 million hectares (Mha) in 2021. Thus, decision making in this activity needs reliable information. Obtaining accurate sugarcane yield estimates is challenging, and in this sense, it is important to reduce uncertainties. Currently, it can be estimated by empirical or mechanistic approaches. However, the model’s peculiarities vary according to the availability of data and the spatial scale. Here, we present a systematic review to discuss state-of-the-art sugarcane yield estimation approaches using remote sensing and crop simulation models. We consulted 1398 papers, and we focused on 72 of them, published between January 2017 and June 2023 in the main scientific databases (e.g., AGORA-FAO, Google Scholar, Nature, MDPI, among others), using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) methodology. We observed how the models vary in space and time, presenting the potential, challenges, limitations, and outlooks for enhancing decision making in the sugarcane crop supply chain. We concluded that remote sensing data assimilation both in mechanistic and empirical models is promising and will be enhanced in the coming years, due to the increasing availability of free Earth observation data.",
    "citationCount": 15,
    "referenceCount": 100
}