{
    "paperId": "45a1f9690523e22023357d22933508925563803e",
    "title": "Anatomical mining method of cervical nerve root syndrome under visual sensing technology",
    "year": 2022,
    "venue": "EAI Endorsed Transactions on Pervasive Health and Technology",
    "authors": [
        "Xianghua Wu"
    ],
    "doi": "10.4108/eetpht.v8i3.657",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/45a1f9690523e22023357d22933508925563803e",
    "isOpenAccess": true,
    "openAccessPdf": "https://publications.eai.eu/index.php/phat/article/download/657/1904",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\nINTRODUCTION:  The gray resolution of anatomical image of cervical nerve root syndrome is low, that can not be mined accurately.\n\n\nOBJECTIVES: Aiming at the defect of low gray resolution of anatomical images, an image mining method using visual perception technology was studied.\n\n\nMETHODS: According to the visual perception technology, the internal parameter matrix and external parameter matrix of binocular visual camera were determined by coordinate transformation, and the anatomical images of cervical nerve root syndrome were collected. The collected images are smoothed and enhanced by nonlinear smoothing algorithm and multi-scale nonlinear contrast enhancement method. The directional binary simple descriptor method is selected to extract the features of the enhanced image; Using K-means clustering algorithm, the anatomical image mining of cervical nerve root syndrome is completed by obtaining the initial clustering center and image mining. \n\n\nRESULTS: Experimental results show that the information entropy of the images mined by the proposed method is higher than 5, the average gradient is greater than 7, the edge information retention is greater than 0.7, the peak signal-to-noise ratio is higher than 30 dB, and the similarity of the same category of images is greater than 0.9. \n\n\nCONCLUSIONS: This method can effectively mine the anatomical images of cervical nerve root syndrome and provide an important basis for the diagnosis and treatment of cervical nerve root syndrome.\n",
    "citationCount": 0,
    "referenceCount": 21
}