{
    "paperId": "45aeca5486de4b4d4eb2db00a6e9200868ae044f",
    "title": "Deep learning approaches for analyzing and controlling rumor spread in social networks using graph neural networks",
    "year": 2025,
    "venue": "Bulletin of Electrical Engineering and Informatics",
    "authors": [
        "Jonson Manurung",
        "Poltak Sihombing",
        "Mohammad Andri Budiman",
        "Sawaluddin Sawaluddin"
    ],
    "doi": "10.11591/eei.v14i1.8143",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/45aeca5486de4b4d4eb2db00a6e9200868ae044f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The pervasive influence of social networks on information dissemination necessitates robust strategies for understanding and mitigating the spread of rumors within these interconnected ecosystems. This research endeavors to address this imperative through the application of a graph neural network (GNN) model, designed to capture intricate relationships among users and content in social networks. The study integrates user-level attributes, content characteristics, and network structures to develop a comprehensive model capable of predicting the likelihood of rumor propagation. The proposed model is situated within a broader conceptual framework that incorporates sociological theories on information diffusion, user behavior, and network dynamics. The results of this research offer insights into the interpretability of the GNN model’s predictions and lay the groundwork for future investigations. The iterative refinement of the model, consideration of ethical implications, and comparison against traditional machine learning baselines emerge as crucial steps in advancing the understanding and application of deep learning methodologies for rumor control in social networks. By embracing the complexities of real-world scenarios and adhering to ethical standards, this research strives to contribute to the development of proactive tools for rumor management, fostering resilient and trustworthy online information ecosystems.",
    "citationCount": 0,
    "referenceCount": 28
}