{
    "paperId": "45ba4e19c99be063ba009d94a4c59dbc44c7acde",
    "title": "Bootstrapped Pre-training with Dynamic Identifier Prediction for Generative Retrieval",
    "year": 2024,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Yubao Tang",
        "Ruqing Zhang",
        "J. Guo",
        "M. D. Rijke",
        "Yixing Fan",
        "Xueqi Cheng"
    ],
    "doi": "10.48550/arXiv.2407.11504",
    "arxivId": "2407.11504",
    "url": "https://www.semanticscholar.org/paper/45ba4e19c99be063ba009d94a4c59dbc44c7acde",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval uses differentiable search indexes to directly generate relevant document identifiers in response to a query. Recent studies have highlighted the potential of a strong generative retrieval model, trained with carefully crafted pre-training tasks, to enhance downstream retrieval tasks via fine-tuning. However, the full power of pre-training for generative retrieval remains underexploited due to its reliance on pre-defined static document identifiers, which may not align with evolving model parameters. In this work, we introduce BootRet, a bootstrapped pre-training method for generative retrieval that dynamically adjusts document identifiers during pre-training to accommodate the continuing memorization of the corpus. BootRet involves three key training phases: (i) initial identifier generation, (ii) pre-training via corpus indexing and relevance prediction tasks, and (iii) bootstrapping for identifier updates. To facilitate the pre-training phase, we further introduce noisy documents and pseudo-queries, generated by large language models, to resemble semantic connections in both indexing and retrieval tasks. Experimental results demonstrate that BootRet significantly outperforms existing pre-training generative retrieval baselines and performs well even in zero-shot settings.",
    "citationCount": 2,
    "referenceCount": 49
}