{
    "paperId": "45d2bf5e971287d2e151c728173e0df569f582a4",
    "title": "Understanding teams and productivity in information retrieval research: Academia, industry, and cross-community collaborations",
    "year": 2025,
    "venue": "Journal of Data and Information Science",
    "authors": [
        "Jiaqi Lei",
        "Liang Hu",
        "Yi Bu",
        "Jiqun Liu"
    ],
    "doi": "10.2478/jdis-2025-0051",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/45d2bf5e971287d2e151c728173e0df569f582a4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n \n \n Prior Information Retrieval (IR) research synthesizes progress from individual studies, yet academia-industry collaboration dynamics remain unexplored. This study investigates: (1) productivity patterns and venues, (2) citations-downloads relationships, (3) topic evolution, and (4) collaboration trends.\n \n \n \n We perform an analysis of 53,471 ACM IR papers (2000–2018) using bibliometrics and DistilBERT topic modeling.\n \n \n \n We find that industry-involved papers preferred WWW/CIKM venues; collaborations dominated RecSys/CSCW. We see that academia-industry collaborations achieved the highest download-to-citation conversion rates. Academia focused on algorithms; industry on applications; collaborations bridged both with rising human-centered themes.\n \n \n \n This is a pioneering large-scale bibliometrics revealing collaboration’s impact on IR knowledge evolution and provides a methodological framework for cross-sector analysis.\n \n \n \n The paper identifies optimal venues (RecSys/CSCW) for partnerships and guides joint initiatives (shared datasets, grants) to bridge academia-industry divides and enhance research translation.\n \n \n \n This is the first large-scale bibliometric analysis of IR academia-industry collaboration. The paper finds many novel insights, including the fact that collaboration boosts citation efficiency, enables complementary specialization, and drives topic convergence.\n",
    "citationCount": 0,
    "referenceCount": 29
}