{
    "paperId": "45eb0b859ee951231b8ddd89ef47e226572efdee",
    "title": "RINO: Renormalization Group Invariance with No Labels",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zichun Hao",
        "Raghav Kansal",
        "Abhijith Gandrakota",
        "Chang Sun",
        "Ngadiuba Jennifer",
        "Javier Duarte",
        "M. Spiropulu"
    ],
    "doi": "10.48550/arXiv.2509.07486",
    "arxivId": "2509.07486",
    "url": "https://www.semanticscholar.org/paper/45eb0b859ee951231b8ddd89ef47e226572efdee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A common challenge with supervised machine learning (ML) in high energy physics (HEP) is the reliance on simulations for labeled data, which can often mismodel the underlying collision or detector response. To help mitigate this problem of domain shift, we propose RINO (Renormalization Group Invariance with No Labels), a self-supervised learning approach that can instead pretrain models directly on collision data, learning embeddings invariant to renormalization group flow scales. In this work, we pretrain a transformer-based model on jets originating from quantum chromodynamic (QCD) interactions from the JetClass dataset, emulating real QCD-dominated experimental data, and then finetune on the JetNet dataset -- emulating simulations -- for the task of identifying jets originating from top quark decays. RINO demonstrates improved generalization from the JetNet training data to JetClass data compared to supervised training on JetNet from scratch, demonstrating the potential for RINO pretraining on real collision data followed by fine-tuning on small, high-quality MC datasets, to improve the robustness of ML models in HEP.",
    "citationCount": 0,
    "referenceCount": 53
}