{
    "paperId": "461c914e8562dcb334c5c0a65f957bad8b7bf959",
    "title": "MLKAPS: Machine Learning and Adaptive Sampling for HPC Kernel Auto-tuning",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Mathys Jam",
        "Eric Petit",
        "P. D. O. Castro",
        "D. Defour",
        "Greg Henry",
        "W. Jalby"
    ],
    "doi": "10.48550/arXiv.2501.05811",
    "arxivId": "2501.05811",
    "url": "https://www.semanticscholar.org/paper/461c914e8562dcb334c5c0a65f957bad8b7bf959",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many High-Performance Computing (HPC) libraries rely on decision trees to select the best kernel hyperparameters at runtime,depending on the input and environment. However, finding optimized configurations for each input and environment is challengingand requires significant manual effort and computational resources. This paper presents MLKAPS, a tool that automates this task usingmachine learning and adaptive sampling techniques. MLKAPS generates decision trees that tune HPC kernels' design parameters toachieve efficient performance for any user input. MLKAPS scales to large input and design spaces, outperforming similar state-of-the-artauto-tuning tools in tuning time and mean speedup. We demonstrate the benefits of MLKAPS on the highly optimized Intel MKLdgetrf LU kernel and show that MLKAPS finds blindspots in the manual tuning of HPC experts. It improves over 85% of the inputswith a geomean speedup of x1.30. On the Intel MKL dgeqrf QR kernel, MLKAPS improves performance on 85% of the inputs with ageomean speedup of x1.18.",
    "citationCount": 1,
    "referenceCount": 34
}