{
    "paperId": "462d28b4217869f0f4c465a75fe1b379ce728449",
    "title": "Transforming Daily Tasks for Visually Impaired Seniors: Leveraging an OpenAI Model-Enhanced Multimodal Dialogue System with Speech Recognition in POF Smart Homes",
    "year": 2024,
    "venue": "SoutheastCon",
    "authors": [
        "Jason Zheng",
        "Paloma Almonte",
        "Jackson Haft",
        "D. Ribas",
        "A. Ortega",
        "EDUARDO LLEIDA SOLANO",
        "P. Carro",
        "M. A. Losada",
        "Alicia López",
        "Javier Mateo Gascón",
        "Yi Wang",
        "N. Antoniades",
        "D. Richards",
        "Jessica Jiang"
    ],
    "doi": "10.1109/SoutheastCon52093.2024.10500175",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/462d28b4217869f0f4c465a75fe1b379ce728449",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We proposed a Client Server Based Plastic Fiber Optic Network for an Elderly Support system in a smart home environment. The network will incorporate multimodal dialogue systems (MDS) and Artificial Intelligence (AI) systems. Existing AI models like GPT and Vicuna will be used and further trained to support the elderly in a smart home. The MDS systems, Whisper and Lavis, will act as intermediaries between the POF network of sensors and the AI systems. The systems will convert video and audio files into information that the AI systems can process and respond to. The POF network, consisting of sensors and a client-server architecture, will serve as the system's backbone. Its primary purpose is to gather data for the AI system and act based on its output. This research aims to enhance the safety, well-being, and independence of the elderly by leveraging advanced network technologies.",
    "citationCount": 1,
    "referenceCount": 22
}