{
    "paperId": "462f4b54420b8ef1414eb8267c1eefdff9473f4a",
    "title": "Bots and their Uses in Software Development: A Systematic Mapping Study",
    "year": 2022,
    "venue": "2022 10th International Conference in Software Engineering Research and Innovation (CONISOFT)",
    "authors": [
        "R. Moguel-Sánchez",
        "C. S. Martínez-Palacios",
        "J. O. Ocharán-Hernández",
        "X. Limón",
        "Á. Sánchez-García"
    ],
    "doi": "10.1109/CONISOFT55708.2022.00027",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/462f4b54420b8ef1414eb8267c1eefdff9473f4a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tools that help software developers in their activities have continually been created for tasks in the Software Development Life Cycle. Over the last few years, there has been an increasing interest in the research and development of bots designed to boost the software development process. Consequently, there has been a recent surge in published studies regarding bots in the software development process. Our aim is to present the state of the art of bots for software development. We detail uses, benefits, challenges, and intelligence levels of bots involved in software development reported in academic papers. In this work, we conducted a Systematic Mapping Study (SMS). From the primary studies, we have identified nine activities related to the software development phases in which bots are used, seven benefits, and seven challenges in using bots for software development. The most popular activities for bot applications in software development, in descending order, are project management, code analysis, debugging, and project onboarding. The main benefits are generating bug fixes, providing helpful information, and automating tasks. Alongside the benefits, the primary drawbacks were low effectiveness of fixes, poor bot performance in a task, and a dependency on third-party technologies. We seek to help developers learn about bots for their use in future projects, and investigators identify future research topics through this SMS.",
    "citationCount": 2,
    "referenceCount": 25
}