{
    "paperId": "46be8ce60a4f3257e72a7520a4dde83bf877dde7",
    "title": "Content-Based Collaborative Generation for Recommender Systems",
    "year": 2024,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Yidan Wang",
        "Zhaochun Ren",
        "Weiwei Sun",
        "Jiyuan Yang",
        "Zhixiang Liang",
        "Xin Chen",
        "Ruobing Xie",
        "Su Yan",
        "Xu Zhang",
        "Pengjie Ren",
        "Zhumin Chen",
        "Xin Xin"
    ],
    "doi": "10.1145/3627673.3679692",
    "arxivId": "2403.18480",
    "url": "https://www.semanticscholar.org/paper/46be8ce60a4f3257e72a7520a4dde83bf877dde7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative models have emerged as a promising utility to enhance recommender systems. It is essential to model both item content and user-item collaborative interactions in a unified generative framework for better recommendation. Although some existing large language model (LLM)-based methods contribute to fusing content information and collaborative signals, they fundamentally rely on textual language generation, which is not fully aligned with the recommendation task. How to integrate content knowledge and collaborative interaction signals in a generative framework tailored for item recommendation is still an open research challenge. In this paper, we propose co ntent-based col la borative generation for rec ommender systems, namely ColaRec. ColaRec is a sequence-to-sequence framework which is tailored for directly generating the recommended item identifier. Precisely, the input sequence comprises data pertaining to the user's interacted items, and the output sequence represents the generative identifier (GID) for the suggested item. To model collaborative signals, the GIDs are constructed from a pretrained collaborative filtering model, and the user is represented as the content aggregation of interacted items. To this end, ColaRec captures both collaborative signals and content information in a unified framework. Then an item indexing task is proposed to conduct the alignment between the content-based semantic space and the interaction-based collaborative space. Besides, a contrastive loss is further introduced to ensure that items with similar collaborative GIDs have similar content representations. To verify the effectiveness of ColaRec, we conduct experiments on four benchmark datasets. Empirical results demonstrate the superior performance of ColaRec.",
    "citationCount": 25,
    "referenceCount": 62
}