{
    "paperId": "46cc2e13923552e6b835b09c4b51e964fc8a949b",
    "title": "Host Factor SRSF7 Promotes HBV Replication Through Binding to and Stabilising Viral pgRNA",
    "year": 2025,
    "venue": "Journal of Viral Hepatitis",
    "authors": [
        "Yu Peng",
        "Yuxin Song",
        "Xin Liu",
        "Xinyu Du",
        "Zhao Zhou",
        "G. Yu",
        "Xiangmei Chen",
        "Fengmin Lu"
    ],
    "doi": "10.1111/jvh.70024",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/46cc2e13923552e6b835b09c4b51e964fc8a949b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hepatitis B virus (HBV) is the primary etiological agent of chronic hepatitis B (CHB) infection, posing a serious threat to human health. The pregenomic RNA (pgRNA) of HBV is the template for HBV reverse transcription, and the epsilon stem‐loop (ε) is required for nucleocapsid assembly. The host factor serine/arginine (SR)‐rich splicing factor 7 (SRSF7) is a splicing regulator and RNA‐binding protein that was involved in regulating viral RNA splicing and export from the nucleus during the viral life cycle, but its biological function and regulatory mechanisms in HBV remain unclear. In this study, SRSF7 was found to promote HBV replication and upregulate HBV RNA levels through knockdown or overexpression of SRSF7 in different cell lines using the HBV replication model. Surprisingly, we found that SRSF7 enhanced HBV RNA stability at the post‐transcriptional level, rather than regulating its splicing. We further demonstrated that SRSF7 could bind to pgRNA; deletion of the bulge and loop structures of the ε element significantly reduced its binding capacity. In addition, we confirmed that SRSF7 supports HBV replication in CHB patients. Our study suggests that the host factor SRSF7 promotes HBV replication, which provides new perspectives for further elucidation of HBV‐host interactions and the development of host‐targeted anti‐HBV drugs.",
    "citationCount": 0,
    "referenceCount": 35
}