{
    "paperId": "472cb4b20aadc8bc9c5c55fee49990dba085f397",
    "title": "BWA-MEME: BWA-MEM emulated with a machine learning approach",
    "year": 2021,
    "venue": "bioRxiv",
    "authors": [
        "Youngmok Jung",
        "Dongsu Han"
    ],
    "doi": "10.1101/2021.09.01.457579",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/472cb4b20aadc8bc9c5c55fee49990dba085f397",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2021/09/01/2021.09.01.457579.full.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Motivation The growing use of next-generation sequencing and enlarged sequencing throughput require efficient short-read alignment, where seeding is one of the major performance bottlenecks. The key challenge in the seeding phase is searching for exact matches of substrings of short reads in the reference DNA sequence. Existing algorithms, however, present limitations in performance due to their frequent memory accesses. Results This paper presents BWA-MEME, the first full-fledged short read alignment software that leverages learned indices for solving the exact match search problem for efficient seeding. BWA-MEME is a practical and efficient seeding algorithm based on a suffix array search algorithm that solves the challenges in utilizing learned indices for SMEM search which is extensively used in the seeding phase. Our evaluation shows that BWA-MEME achieves up to 3.45x speedup in seeding throughput over BWA-MEM2 by reducing the number of instructions by 4.60x, memory accesses by 8.77x, and LLC misses by 2.21x, while ensuring the identical SAM output to BWA-MEM2. Availability The source code and test scripts are available for academic use at https://github.com/kaist-ina/BWA-MEME/. Contact tom418@kaist.ac.kr, dhan.ee@kaist.ac.kr",
    "citationCount": 167,
    "referenceCount": 27
}