{
    "paperId": "476a14e5a2195ed83f3d307add76aba4480b2942",
    "title": "Bugs in Pods: Understanding Bugs in Container Runtime Systems",
    "year": 2024,
    "venue": "International Symposium on Software Testing and Analysis",
    "authors": [
        "Jiongchi Yu",
        "Xiaofei Xie",
        "Cen Zhang",
        "Sen Chen",
        "Yuekang Li",
        "Wenbo Shen"
    ],
    "doi": "10.1145/3650212.3680366",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/476a14e5a2195ed83f3d307add76aba4480b2942",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Container Runtime Systems (CRSs), which form the foundational infrastructure of container clouds, are critically important due to their impact on the quality of container cloud implementations. However, a comprehensive understanding of the quality issues present in CRS implementations remains lacking. To bridge this gap, we conduct the first comprehensive empirical study of CRS bugs. Specifically, we gather 429 bugs from 8,271 commits across dominant CRS projects, including runc, gvisor, containerd, and cri-o. Through manual analysis, we develop taxonomies of CRS bug symptoms and root causes, comprising 16 and 13 categories, respectively. Furthermore, we evaluate the capability of popular testing approaches, including unit testing, integration testing, and fuzz testing in detecting these bugs. The results show that 78.79% of the bugs cannot be detected due to the lack of test drivers, oracles, and effective test cases. Based on the findings of our study, we present implications and future research directions for various stakeholders in the domain of CRSs. We hope that our work can lay the groundwork for future research on CRS bug detection.",
    "citationCount": 3,
    "referenceCount": 49
}