{
    "paperId": "47707f8392ba5558b85c88dfdffc3a10798d9ae2",
    "title": "A Survey on Interpretable Reinforcement Learning",
    "year": 2021,
    "venue": "Machine-mediated learning",
    "authors": [
        "Claire Glanois",
        "P. Weng",
        "Matthieu Zimmer",
        "Dong Li",
        "Tianpei Yang",
        "Jianye Hao",
        "Wulong Liu"
    ],
    "doi": "10.1007/s10994-024-06543-w",
    "arxivId": "2112.13112",
    "url": "https://www.semanticscholar.org/paper/47707f8392ba5558b85c88dfdffc3a10798d9ae2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Although deep reinforcement learning has become a promising machine learning approach for sequential decision-making problems, it is still not mature enough for high-stake domains such as autonomous driving or medical applications. In such contexts, a learned policy needs for instance to be interpretable, so that it can be inspected before any deployment (e.g., for safety and verifiability reasons). This survey provides an overview of various approaches to achieve higher interpretability in reinforcement learning (RL). To that aim, we distinguish interpretability (as a property of a model) and explainability (as a post-hoc operation, with the intervention of a proxy) and discuss them in the context of RL with an emphasis on the former notion. In particular, we argue that interpretable RL may embrace different facets: interpretable inputs, interpretable (transition/reward) models, and interpretable decision-making. Based on this scheme, we summarize and analyze recent work related to interpretable RL with an emphasis on papers published in the past 10 years. We also discuss briefly some related research areas and point to some potential promising research directions.",
    "citationCount": 131,
    "referenceCount": 271
}