{
    "paperId": "47b8934d5d88f47d7b54f2bd637f24053245bc8e",
    "title": "Tuning Database Parameters Using Query Perception and Evolutionary Reinforcement Learning",
    "year": 2024,
    "venue": "CCEAI",
    "authors": [
        "Zunhan Zhao",
        "Wen Ye",
        "Peiyu Duan"
    ],
    "doi": "10.1145/3640824.3640869",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/47b8934d5d88f47d7b54f2bd637f24053245bc8e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database systems serves as powerful tools for managing big data. Within Database Management System (DBMS), hundreds of parameters impact the performance of database system. Reasonable configuration and optimization of these parameters is a proven way to increase system throughput and reduce query latency. Machine learning methods such as reinforcement learning and Gaussian processes have been employed for tuning database parameters. However, these approaches suffer from dependence on training benchmarks, challenges of regression analysis in high-dimensional spaces, extended training times and difficulties in finding optimal solutions. To tackle these issues, this paper proposes a database tuning model with query perception and evolutionary reinforcement learning. The model encodes database query statements, combines them with DBMS parameters and predicts their latency by a neural network. The query encoding and perceived latency are incorporated as part of environment information for an evolutionary reinforcement scheme in the model, this scheme aims to minimize query latency by on-line tuning the parameters related to memory, logs, evaluation plan, connections number and storage system. Query perception mitigates model’s dependence on the benchmarks as model training samples, providing parameters suggestions to improve the performance of databases in workload changing environments. Integrating evolutionary algorithms with reinforcement learning not only speeds up reinforcement learning based parameter tuning but also provides better parameter configuration by avoiding local convergence during learning procedures. This model has been validated on openGauss database system using several benchmarks. Compared to the default parameter configuration in openGauss, the optimized parameters suggested by the model significantly reduce the latency of workloads, with a maximum reduction of up to 55%. Additionally, the model also outperforms other referenced tuning schemes in query latency and model training time. It is demonstrated that leveraging machine learning to perceive workloads and adaptively adjust DBMS parameters is an effective approach for reducing query latency and increasing system throughput, enabling database systems to autonomously improve system performance in workload changing scenarios. This methodology allows database systems to play more significant roles in managing big data across diverse applications.",
    "citationCount": 0,
    "referenceCount": 33
}