{
    "paperId": "47ba01f711b67f98e57c514717c78a6794f4d466",
    "title": "Manufacturing Service Innovation and Foreign Trade Upgrade Model Based on Internet of Things and Industry 4.0",
    "year": 2022,
    "venue": "Mathematical Problems in Engineering",
    "authors": [
        "Ling Liu",
        "Ping Zhao"
    ],
    "doi": "10.1155/2022/4148713",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/47ba01f711b67f98e57c514717c78a6794f4d466",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/mpe/2022/4148713.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "At present, the industrial Internet has gradually become a product of the integration of new generation of information technology and manufacturing. The development of the traditional manufacturing industry with transformation and upgrading faces various bottlenecks. These bottlenecks require the industry to make technological improvements through the concept of promoting sustainable development. At the same time, these issues also need intelligent support to match them. IoT technology can help enterprises realize product design and production, inspection and testing, risk early warning and post-sales, and other process links. The Internet of Things technology improved and innovated the industrial production process in the process. This technology has become the main means to promote industrialization and information integration, and it is an important basis for promoting manufacturing capabilities and networking forces. At present, the industrial Internet of our country is generally developing rapidly. However, this technology encountered many difficulties in the process of promoting discrete manufacturing and upgrading. There are still some difficulties in the entire technology landing application process. For example, there is still a significant gap in the breadth and depth of the Internet of Things applications. In particular, the value of data needs to strengthen. Based on the analysis of the risk solutions and development dilemma of artisanship, this article shows the benefits of the Internet of Things technology. Trend demand, practical application demand, production efficiency demand, after-sales service demand, and other aspects promote management innovation. This article first classifies the development of the industrial Internet in information transmission and development of the industry around the world. On this basis, this article has built a three-dimensional reference model for the industrial Internet to promote the transformation and upgrade of discrete manufacturing. In addition, this article proposes a strategy to promote the transformation and upgrade of discrete manufacturing. It includes three development stages: industrial Internet, industrial and commercial Internet, and industrial intelligence Internet. On this basis, the text explains the corresponding technical system and its challenges. Through the research results of this article, it provides theoretical guidance for the industrial Internet to promote the transformation and upgrade of discrete manufacturing.",
    "citationCount": 4,
    "referenceCount": 26
}