{
    "paperId": "47c5af929094d6dff1e384c34854e7fcba878b2a",
    "title": "D-Bot: An LLM-Powered DBA Copilot",
    "year": 2025,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Zhaoyan Sun",
        "Xuanhe Zhou",
        "Jianming Wu",
        "Wei Zhou",
        "Guoliang Li"
    ],
    "doi": "10.1145/3722212.3725091",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/47c5af929094d6dff1e384c34854e7fcba878b2a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database administrators (DBAs) play an important role in maintaining the high performance and high availability of database systems. However, database diagnosis by DBAs often takes tedious efforts and time, which is insufficient for the large amount of database instances (e.g., millions of instances on the cloud). Besides, existing diagnosis tools built with rules and small-scale learned models lack the capability for flexible reasoning and report generation, and thus can only serve as ''one small piece of a bigger puzzle''. Recently, Large language models (LLMs) have exhibited superiority in natural language understanding, reasoning and generation, positioning them as a potential comprehensive copilot to DBAs to address these limitations. Thus, we introduce D-Bot, an LLM-powered DBA copilot that can automatically acquire pertinent knowledge from diagnostic documents, interact with users for self-refinement, and generate reasonable and well-founded diagnosis reports (i.e., specifying root causes, solutions, and references). We will show that D-Bot can effectively automate database diagnosis in real scenarios, even for complex anomalies.",
    "citationCount": 2,
    "referenceCount": 7
}