{
    "paperId": "47effa64fdf759a9adfb98c10aa56747fdff7a9e",
    "title": "Integrating Conversational Agents and Knowledge Graphs Within the Scholarly Domain",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Antonello Meloni",
        "Simone Angioni",
        "Angelo Salatino",
        "Francesco Osborne",
        "D. Recupero",
        "E. Motta"
    ],
    "doi": "10.1109/ACCESS.2023.3253388",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/47effa64fdf759a9adfb98c10aa56747fdff7a9e",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10061222.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the last few years, chatbots have become mainstream solutions adopted in a variety of domains for automatizing communication at scale. In the same period, knowledge graphs have attracted significant attention from business and academia as robust and scalable representations of information. In the scientific and academic research domain, they are increasingly used to illustrate the relevant actors (e.g., researchers, institutions), documents (e.g., articles, patents), entities (e.g., concepts, innovations), and other related information. Following the same direction, this paper describes how to integrate conversational agents with knowledge graphs focused on the scholarly domain, a.k.a. Scientific Knowledge Graphs. On top of the proposed architecture, we developed AIDA-Bot, a simple chatbot that leverages a large-scale knowledge graph of scholarly data. AIDA-Bot can answer natural language questions about scientific articles, research concepts, researchers, institutions, and research venues. We have developed four prototypes of AIDA-Bot on Alexa products, web browsers, Telegram clients, and humanoid robots. We performed a user study evaluation with 15 domain experts showing a high level of interest and engagement with the proposed agent.",
    "citationCount": 34,
    "referenceCount": 75
}