{
    "paperId": "47f31fc202fc087cfcd3e1769730dc4ac95ceac4",
    "title": "Promoting fairness in link prediction with graph enhancement",
    "year": 2024,
    "venue": "Frontiers Big Data",
    "authors": [
        "Yezi Liu",
        "Hanning Chen",
        "Mohsen Imani"
    ],
    "doi": "10.3389/fdata.2024.1489306",
    "arxivId": "2409.08658",
    "url": "https://www.semanticscholar.org/paper/47f31fc202fc087cfcd3e1769730dc4ac95ceac4",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3389/fdata.2024.1489306",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Link prediction is a crucial task in network analysis, but it has been shown to be prone to biased predictions, particularly when links are unfairly predicted between nodes from different sensitive groups. In this paper, we study the fair link prediction problem, which aims to ensure that the predicted link probability is independent of the sensitive attributes of the connected nodes. Existing methods typically incorporate debiasing techniques within graph embeddings to mitigate this issue. However, training on large real-world graphs is already challenging, and adding fairness constraints can further complicate the process. To overcome this challenge, we propose FairLink, a method that learns a fairness-enhanced graph to bypass the need for debiasing during the link predictor's training. FairLink maintains link prediction accuracy by ensuring that the enhanced graph follows a training trajectory similar to that of the original input graph. Meanwhile, it enhances fairness by minimizing the absolute difference in link probabilities between node pairs within the same sensitive group and those between node pairs from different sensitive groups. Our extensive experiments on multiple large-scale graphs demonstrate that FairLink not only promotes fairness but also often achieves link prediction accuracy comparable to baseline methods. Most importantly, the enhanced graph exhibits strong generalizability across different GNN architectures. FairLink is highly scalable, making it suitable for deployment in real-world large-scale graphs, where maintaining both fairness and accuracy is critical.",
    "citationCount": 5,
    "referenceCount": 70
}