{
    "paperId": "484105016ebb11460a409646c9875d9f6fefcfa6",
    "title": "Electro-Thermal Cosimulation of Vertical One-Transistor–One-Resistor (1T1R) Resistive Random Access Memory and Array",
    "year": 2024,
    "venue": "IEEE Transactions on Electron Devices",
    "authors": [
        "Xingyu Zhai",
        "Er-ping Li",
        "Yiqun Niu",
        "Da Li",
        "Wenchao Chen"
    ],
    "doi": "10.1109/TED.2024.3416424",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/484105016ebb11460a409646c9875d9f6fefcfa6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With switching dynamics similar to synapses, resistive random access memories (RRAMs) provide the solutions for brain-inspired computing. In this article, a compact model for a vertically integrated one-transistor-one-resistor (1T1R) element is developed, which includes an equivalent electrical circuit (EEC) and equivalent thermal circuit (ETC) model. The accuracy of our model is verified by comparisons with experiment data and numerical simulations. The electro-thermal co-simulations of the 1T1R cell and array are performed by using the compact model to capture both the steady and transient electro-thermal response of the device. Furthermore, the thermal crosstalk effect in a $4\\times 4~1$ T1R array is discussed by comparing the electro-thermal simulation results of the memristor cell in different write operating modes, which indicates that the thermal crosstalk during parallel write operating mode may cause the timing errors of RRAM circuits. Finally, the influence of background temperature variation on the resistive switching characteristics of the device is studied.",
    "citationCount": 2,
    "referenceCount": 43
}