{
    "paperId": "484af94a82232670fd0386a3d86ef7eaff81f054",
    "title": "Downscaling and Wind Resource Assessment of Climatic Wind Speed Data Based on Deep Learning: A Case Study of the Tengger Desert Wind Farm",
    "year": 2024,
    "venue": "Atmosphere",
    "authors": [
        "Hao Zhou",
        "Qi Luo",
        "Ling Yuan"
    ],
    "doi": "10.3390/atmos15030271",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/484af94a82232670fd0386a3d86ef7eaff81f054",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2073-4433/15/3/271/pdf?version=1708753516",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analyzing historical and reanalysis datasets for wind energy climatic characteristics offers crucial insights for wind farms and short-term electricity generation forecasting. However, large-scale wind farms in Chinese deserts, the Gobi, and barren areas often lack sufficient wind measurement data, leading to challenges in assessing long-term power generation revenue and introducing uncertainty. This study focuses on the Tengger Desert as the study area, processes the Coupled Model Intercomparison Project Phase 6 (CMIP6) data, and analyzes and compares wind energy’s future characteristics utilizing a developed deep learning (DL) downscaling algorithm. The findings indicate that (1) the Convolutional Neural Network (CNN) downscaling model, with the Weather Research and Forecasting Model (WRF) numerical simulation results as the targets, exhibits spatial distribution consistency with WRF simulation results in the experimental area. (2) Through testing and validation with three practical wind measurements, the annual average wind speed error is below 4%. (3) In the mid-term future (~2050), the average wind speed in the experimental area remains stable with a multi-year average of approximately 7.00 m·s−1. The overall wind speed distribution range is significant, meeting the requirements for wind farm development.",
    "citationCount": 4,
    "referenceCount": 30
}