{
    "paperId": "485787dcf70ddc4cea487bd446b111ae68373536",
    "title": "DesignX: Human-Competitive Algorithm Designer for Black-Box Optimization",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Hongshu Guo",
        "Zeyuan Ma",
        "Yining Ma",
        "Xinglin Zhang",
        "Wei-Neng Chen",
        "Yue-jiao Gong"
    ],
    "doi": "10.48550/arXiv.2505.17866",
    "arxivId": "2505.17866",
    "url": "https://www.semanticscholar.org/paper/485787dcf70ddc4cea487bd446b111ae68373536",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Designing effective black-box optimizers is hampered by limited problem-specific knowledge and manual control that spans months for almost every detail. In this paper, we present \\textit{DesignX}, the first automated algorithm design framework that generates an effective optimizer specific to a given black-box optimization problem within seconds. Rooted in the first principles, we identify two key sub-tasks: 1) algorithm structure generation and 2) hyperparameter control. To enable systematic construction, a comprehensive modular algorithmic space is first built, embracing hundreds of algorithm components collected from decades of research. We then introduce a dual-agent reinforcement learning system that collaborates on structural and parametric design through a novel cooperative training objective, enabling large-scale meta-training across 10k diverse instances. Remarkably, through days of autonomous learning, the DesignX-generated optimizers continuously surpass human-crafted optimizers by orders of magnitude, either on synthetic testbed or on realistic optimization scenarios such as Protein-docking, AutoML and UAV path planning. Further in-depth analysis reveals DesignX's capability to discover non-trivial algorithm patterns beyond expert intuition, which, conversely, provides valuable design insights for the optimization community. We provide DesignX's Python project at~ https://github.com/MetaEvo/DesignX.",
    "citationCount": 0,
    "referenceCount": 104
}