{
    "paperId": "486307a4ed069b6739ed03a6e775d0c7c9353463",
    "title": "Advances in Machine Learning for Wearable Sensors.",
    "year": 2024,
    "venue": "ACS Nano",
    "authors": [
        "Xiao Xiao",
        "Junyi Yin",
        "Jing Xu",
        "Trinny Tat",
        "Jun Chen"
    ],
    "doi": "10.1021/acsnano.4c05851",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/486307a4ed069b6739ed03a6e775d0c7c9353463",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent years have witnessed tremendous advances in machine learning techniques for wearable sensors and bioelectronics, which play an essential role in real-time sensing data analysis to provide clinical-grade information for personalized healthcare. To this end, supervised learning and unsupervised learning algorithms have emerged as powerful tools, allowing for the detection of complex patterns and relationships in large, high-dimensional data sets. In this Review, we aim to delineate the latest advancements in machine learning for wearable sensors, focusing on key developments in algorithmic techniques, applications, and the challenges intrinsic to this evolving landscape. Additionally, we highlight the potential of machine-learning approaches to enhance the accuracy, reliability, and interpretability of wearable sensor data and discuss the opportunities and limitations of this emerging field. Ultimately, our work aims to provide a roadmap for future research endeavors in this exciting and rapidly evolving area.",
    "citationCount": 38,
    "referenceCount": 193
}