{
    "paperId": "486d23817890fb6051bfd862274c6d61c3b764ed",
    "title": "Applying Machine Learning to DEEC Protocol: Improved Cluster Formation in Wireless Sensor Networks",
    "year": 2025,
    "venue": "Network",
    "authors": [
        "Abdulla Juwaied",
        "Lidia Jackowska-Strumillo"
    ],
    "doi": "10.3390/network5030026",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/486d23817890fb6051bfd862274c6d61c3b764ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Wireless Sensor Networks (WSNs) are specialised ad hoc networks composed of small, low-power, and often battery-operated sensor nodes with various sensors and wireless communication capabilities. These nodes collaborate to monitor and collect data from the physical environment, transmitting it to a central location or sink node for further processing and analysis. This study proposes two machine learning-based enhancements to the DEEC protocol for Wireless Sensor Networks (WSNs) by integrating the K-Nearest Neighbours (K-NN) and K-Means (K-M) machine learning (ML) algorithms. The Distributed Energy-Efficient Clustering with K-NN (DEEC-KNN) and with K-Means (DEEC-KM) approaches dynamically optimize cluster head selection to improve energy efficiency and network lifetime. These methods are validated through extensive simulations, demonstrating up to 110% improvement in packet delivery and significant gains in network stability compared with the original DEEC protocol. The adaptive clustering enabled by K-NN and K-Means is particularly effective for large-scale and dynamic WSN deployments where node failures and topology changes are frequent. These findings suggest that integrating ML with clustering protocols is a promising direction for future WSN design.",
    "citationCount": 0,
    "referenceCount": 22
}