{
    "paperId": "48b4691266d0cacc7d60c035d150c8f4adffba15",
    "title": "TDSQL: Tencent Distributed Database System",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Yuxing Chen",
        "Anqun Pan",
        "Hailin Lei",
        "Anda Ye",
        "Shuo Han",
        "Yan Tang",
        "Wei Lu",
        "Yunpeng Chai",
        "Feng Zhang",
        "Xiaoyong Du"
    ],
    "doi": "10.14778/3685800.3685812",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/48b4691266d0cacc7d60c035d150c8f4adffba15",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Distributed databases have become indispensable in contemporary computing and data processing, owing to their pivotal role in ensuring high availability and scalability. They effectively cater to the requirements of data management and high-concurrency access. However, developing a distributed database system that is well-suited for diverse application scenarios, particularly for large-scale applications, presents several challenges. These challenges include ensuring data consistency and achieving high levels of performance.\n This paper presents TDSQL, a distributed database system that prioritizes core design principles of distributed systems, including high availability, strong consistency, and scalability. In particular, TDSQL has achieved high performance through over a decade of practical experience and optimization in various modules, such as the kernel, synchronous replication, and transaction processing, in large-scale application scenarios. By conducting the TPC-C benchmark test, TDSQL demonstrated outstanding performance, achieving a throughput of 814 million tpmC across 1650 database nodes, with a jitter rate of less than 0.2%. This jitter rate is an order of magnitude lower than the standard required, showcasing the system's stability and reliability. During the 8-hour TPC-C standard stress test, TDSQL successfully completed over 860 billion transactions and processed 40 trillion order details, with zero forced rollbacks and zero data inconsistency.",
    "citationCount": 9,
    "referenceCount": 77
}