{
    "paperId": "48d533d359d5b4d4c7e607473ba165f635dea970",
    "title": "Knowledge Structure of the Application of High-Performance Computing: A Co-Word Analysis",
    "year": 2021,
    "venue": "Sustainability",
    "authors": [
        "Kiwon Lee",
        "Suchul Lee"
    ],
    "doi": "10.3390/su132011249",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/48d533d359d5b4d4c7e607473ba165f635dea970",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/13/20/11249/pdf?version=1634386871",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As high-performance computing (HPC) plays a key role in the Fourth Industrial Revolution, the application of HPC in various industries is becoming increasingly important. Several studies have reviewed the research trends of HPC but considered only the functional aspects, causing limitations when discussing the application. Thus, this study aims to identify the knowledge structure of the application of HPC, enabling practical and policy support in various industrial fields. Co-word analysis is mainly used to establish the knowledge structure. We first collected 28,941 published papers related to HPC applications and built a co-word network that used author keywords. We performed centrality analysis and cluster analysis of the co-word network; as a result, we derived the major keywords and 18 areas of HPC applications. To validate the knowledge structure, we conducted a case study to find opportunities for HPC research plans in the research community. As a result, we discovered 17 new research topics and presented their research priorities by conducting expert interviews and Analytic Hierarchy Process. The findings of this study contribute to an understanding of the application of HPC, to exploring promising research fields for technological and social development, and to supporting research plans for successful technology commercialization.",
    "citationCount": 10,
    "referenceCount": 92
}