{
    "paperId": "48fd8a608024000c1f1fc6184bbcd45520328874",
    "title": "Accelerator design with decoupled hardware customizations: benefits and challenges: invited",
    "year": 2022,
    "venue": "Design Automation Conference",
    "authors": [
        "D. Pal",
        "Yi-Hsiang Lai",
        "Shaojie Xiang",
        "Niansong Zhang",
        "Hongzheng Chen",
        "Jeremy Casas",
        "P. Cocchini",
        "Zhenkun Yang",
        "Jin Yang",
        "L. Pouchet",
        "Zhiru Zhang"
    ],
    "doi": "10.1145/3489517.3530681",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/48fd8a608024000c1f1fc6184bbcd45520328874",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The past decade has witnessed increasing adoption of high-level synthesis (HLS) to implement specialized hardware accelerators targeting either FPGAs or ASICs. However, current HLS programming models entangle algorithm specifications with hardware customization techniques, which lowers both the productivity and portability of the accelerator design. To tackle this problem, recent efforts such as HeteroCL propose to decouple algorithm definition from essential hardware customization techniques in compute, data type, and memory, increasing productivity, portability, and performance. While the decoupling of the algorithm and customizations provides benefits to the compilation/synthesis process, they also create new hurdles for the programmers to productively debug and validate the correctness of the optimized design. In this work, using HeteroCL and realistic machine learning applications as case studies, we first explain the key advantages of the decoupled programming model brought to a programmer to rapidly develop high-performance accelerators. Using the same case studies, we will further show how seemingly benign usage of the customization primitives can lead to new challenges to verification. We will then outline the research opportunities and discuss some of our recent efforts as the first step to enable a robust and viable verification solution in the future.",
    "citationCount": 6,
    "referenceCount": 25
}