{
    "paperId": "493d75dba2d82281d1305e33bf32698108d5e9a2",
    "title": "HJG: An Effective Hierarchical Joint Graph for ANNS in Multi-Metric Spaces",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Yifan Zhu",
        "Lu Chen",
        "Yunjun Gao",
        "Rui Ma",
        "Baihua Zheng",
        "Jingwen Zhao"
    ],
    "doi": "10.1109/ICDE60146.2024.00326",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/493d75dba2d82281d1305e33bf32698108d5e9a2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Owing to the widespread deployment of smartphones and networked devices, massive amount of data in different types are generated every day, including numeric data, locations, text data, images, etc. Nearest neighbour search in multi-metric spaces has attracted much attention, as it can accommodate any type of data and support search on flexible combinations of multiple metrics. However, most existing methods focus on single metric queries, failing to answer multi-metric queries efficiently due to the complex metric combinations. In this paper, for the first time, we study the approximate nearest neighbour search (ANNS) in multi-metric spaces, and propose HJG, a hierarchical joint graph, to solve the multi-metric query efficiently and effectively. HJG constructs hierarchical graphs for modeling objects of various types, and applies our presented balancing techniques to improve the graph distribution. To support efficient and accurate nearest neighbour search, we join individual graphs dynamically with high efficiency, and develop filtering techniques with efficient search strategy for HJG. Extensive experiments on four datasets demonstrate the superior effectiveness and scalability of our proposed HJG.",
    "citationCount": 1,
    "referenceCount": 56
}