{
    "paperId": "495ed5c2a0bf32f82f9f003f6985fb6879d01bbe",
    "title": "Effective Eyebrow Matting with Domain Adaptation",
    "year": 2022,
    "venue": "Computer graphics forum (Print)",
    "authors": [
        "Luyuan Wang",
        "Hanyuan Zhang",
        "Qinjie Xiao",
        "Haoji Xu",
        "Chunhua Shen",
        "Xiaogang Jin"
    ],
    "doi": "10.1111/cgf.14682",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/495ed5c2a0bf32f82f9f003f6985fb6879d01bbe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present the first synthetic eyebrow matting datasets and a domain adaptation eyebrow matting network for learning domain‐robust feature representation using synthetic eyebrow matting data and unlabeled in‐the‐wild images with adversarial learning. Different from existing matting methods that may suffer from the lack of ground‐truth matting datasets, which are typically labor‐intensive to annotate or even worse, unable to obtain, we train the matting network in a semi‐supervised manner using synthetic matting datasets instead of ground‐truth matting data while achieving high‐quality results. Specifically, we first generate a large‐scale synthetic eyebrow matting dataset by rendering avatars and collect a real‐world eyebrow image dataset while maximizing the data diversity as much as possible. Then, we use the synthetic eyebrow dataset to train a multi‐task network, which consists of a regression task to estimate the eyebrow alpha mattes and an adversarial task to adapt the learned features from synthetic data to real data. As a result, our method can successfully train an eyebrow matting network using synthetic data without the need to label any real data. Our method can accurately extract eyebrow alpha mattes from in‐the‐wild images without any additional prior and achieves state‐of‐the‐art eyebrow matting performance. Extensive experiments demonstrate the superior performance of our method with both qualitative and quantitative results.",
    "citationCount": 3,
    "referenceCount": 46
}