{
    "paperId": "49b95e7fe5d028494b3f624e16d0601c6ffc713f",
    "title": "Science Checker Reloaded: A Bidirectional Paradigm for Transparency and Logical Reasoning",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Loïc Rakotoson",
        "S. Massip",
        "F. Laleye"
    ],
    "doi": "10.48550/arXiv.2402.13897",
    "arxivId": "2402.13897",
    "url": "https://www.semanticscholar.org/paper/49b95e7fe5d028494b3f624e16d0601c6ffc713f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Information retrieval is a rapidly evolving field. However it still faces significant limitations in the scientific and industrial vast amounts of information, such as semantic divergence and vocabulary gaps in sparse retrieval, low precision and lack of interpretability in semantic search, or hallucination and outdated information in generative models. In this paper, we introduce a two-block approach to tackle these hurdles for long documents. The first block enhances language understanding in sparse retrieval by query expansion to retrieve relevant documents. The second block deepens the result by providing comprehensive and informative answers to the complex question using only the information spread in the long document, enabling bidirectional engagement. At various stages of the pipeline, intermediate results are presented to users to facilitate understanding of the system's reasoning. We believe this bidirectional approach brings significant advancements in terms of transparency, logical thinking, and comprehensive understanding in the field of scientific information retrieval.",
    "citationCount": 0,
    "referenceCount": 39
}