{
    "paperId": "49beeac66e4b934807a0b4cd8883967210450ad7",
    "title": "Age-related Difference in Conversational Search Behavior: Preliminary Findings",
    "year": 2022,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Zhaopeng Xing",
        "Xiaojun Yuan",
        "Javed Mostafa"
    ],
    "doi": "10.1145/3498366.3505830",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/49beeac66e4b934807a0b4cd8883967210450ad7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "When it comes to emerging technologies, older adults are often those who can greatly benefit from the advancements but are vastly under-represented in research and designs. This study presents preliminary findings of older adults' search behavior with a spoken conversational search agent which represents the next generation search paradigm. Our findings show that, compared with their younger counterparts, older adults' search conversations lasted longer and included more requests. Their requests had greater length and tended to have a lower proportion of unique words, more grammatically complex sentences and short pauses. In addition, the older subjects preferred to start a request with \"I\" and request questions with modal verbs were less frequent. They reformulated spoken requests as competently as did younger adults but elaborations on requests were uniquely founded among older adults. They also tended to have more than one query or question in a single request and rephrasing requests was more frequently observed than younger adults. System implications and future research directions are discussed.",
    "citationCount": 5,
    "referenceCount": 64
}