{
    "paperId": "49f04a0fadf6c6cf833555fe15fd3c32d6f46eae",
    "title": "AutoIndex: An Incremental Index Management System for Dynamic Workloads",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Xuanhe Zhou",
        "Luyang Liu",
        "Wenbo Li",
        "Lianyuan Jin",
        "Shifu Li",
        "Tianqing Wang",
        "Jianhua Feng"
    ],
    "doi": "10.1109/icde53745.2022.00210",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/49f04a0fadf6c6cf833555fe15fd3c32d6f46eae",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Indexes are vital to enhance the lookup on single or multiple columns, and building proper indexes can significantly improve the database performance. Existing works focus on adding new indexes that can benefit the read queries, but they have several limitations. First, real-world workloads may have numerous queries and it is tricky to analyze their index requirements and find the most beneficial indexes within resource limit. Second, they fail to consider the update of existing indexes, which may be redundant or even have negative effects to current workload. Third, they cannot estimate the index maintenance costs, which are affected by multiple index utilization factors and can significantly affect the index benefits, especially for high-write-ratio workloads. To address those challenges, we propose an incremental index management system Autoindex for dynamic workloads. First, to support incremental index management, we map the incoming queries into query templates and efficiently generate promising candidate indexes from matched templates. And then we propose to utilize Monte Carlo Tree Search to incrementally add indexes from the candidate indexes or remove indexes from existing indexes, so as to ensure high workload performance. Besides, we propose a deep index estimation model, which integrates the practical experience to extract critical cost features and applies deep regression to estimate index benefits from historical index management data. We have implemented the modules like candidate index generation and index estimator in an open-sourced database system openGauss. Experimental re-sults showed that our method outperformed existing approaches on both testing and real-world workloads.",
    "citationCount": 36,
    "referenceCount": 39
}