{
    "paperId": "4a8c3c11fc50c10845407d4e69464f4c9c57e124",
    "title": "Deep learning models for tendinopathy detection: a systematic review and meta-analysis of diagnostic tests",
    "year": 2024,
    "venue": "EFORT Open Reviews",
    "authors": [
        "Guillermo Droppelmann",
        "Constanza Rodríguez",
        "Dali Smague",
        "Carlos Jorquera",
        "F. Feijoo"
    ],
    "doi": "10.1530/EOR-24-0016",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4a8c3c11fc50c10845407d4e69464f4c9c57e124",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1530/eor-24-0016",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose Different deep-learning models have been employed to aid in the diagnosis of musculoskeletal pathologies. The diagnosis of tendon pathologies could particularly benefit from applying these technologies. The objective of this study is to assess the performance of deep learning models in diagnosing tendon pathologies using various imaging modalities. Methods A meta-analysis was conducted, with searches performed on MEDLINE/PubMed, SCOPUS, Cochrane Library, Lilacs, and SciELO. The QUADAS-2 tool was employed to assess the quality of the studies. Diagnostic measures, such as sensitivity, specificity, diagnostic odds ratio, positive and negative likelihood ratios, area under the curve, and summary receiver operating characteristic, were included using a random-effects model. Heterogeneity and subgroup analyses were also conducted. All statistical analyses and plots were generated using the R software package. The PROSPERO ID is CRD42024506491. Results Eleven deep-learning models from six articles were analyzed. In the random effects models, the sensitivity and specificity of the algorithms for detecting tendon conditions were 0.910 (95% CI: 0.865; 0.940) and 0.954 (0.909; 0.977). The PLR, NLR, lnDOR, and AUC estimates were found to be 37.075 (95%CI: 4.654; 69.496), 0.114 (95%CI: 0.056; 0.171), 5.160 (95% CI: 4.070; 6.250) with a (P < 0.001), and 96%, respectively. Conclusion The deep-learning algorithms demonstrated a high level of accuracy level in detecting tendon anomalies. The overall robust performance suggests their potential application as a valuable complementary tool in diagnosing medical images.",
    "citationCount": 1,
    "referenceCount": 47
}