{
    "paperId": "4ad0ea9d3b09fdd59180fa96114f3894ca66a01b",
    "title": "Parametric Dynamic Mode Decomposition with multi-linear interpolation for prediction of thermal fields of Al2O3-water nanofluid flows at unseen parameters",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "S. AbhijithM",
        "S. Sandra"
    ],
    "doi": "10.48550/arXiv.2503.18571",
    "arxivId": "2503.18571",
    "url": "https://www.semanticscholar.org/paper/4ad0ea9d3b09fdd59180fa96114f3894ca66a01b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The study proposes a data-driven model which combines the Dynamic Mode Decomposition with multi-linear interpolation to predict the thermal fields of nanofluid flows at unseen Reynolds numbers (Re) and particle volume concentrations ($\\epsilon$). The flow, considered for the study, is laminar and incompressible. The study employs an in-house Fortran-based solver to predict the thermal fields of Al$_2$O$_3$-water nanofluid flow through a two-dimensional rectangular channel, with the bottom wall subjected to a uniform heat flux. The performance of two models operating in one- and two-dimensional parametric spaces are investigated. Initially, a DMD with linear interpolation (DMD-LI) based solver is used for prediction of temperature of the nanofluid at any Re $>$ 100. The DMD-LI based model, predicts temperature fields with a maximum percentage difference of just 0.0273\\%, in comparison with the CFD-based solver at Re =960, and $\\epsilon$ = 1.0\\%. The corresponding difference in the average Nusselt numbers is only 0.39\\%. Following that a DMD with bi-linear interpolation (DMD-BLI) based solver is used for prediction of temperature of the nanofluid at any Re $>$ 100 and $\\epsilon$ $>$ 0.5\\%. The performance of two different ways of stacking the data are also examined. When compared to the CFD-based model, the DMD-BLI-based model predicts the temperature fields with a maximum percentage difference of 0.21 \\%, at Re = 800 and $\\epsilon$ = 1.35\\%. And the corresponding percentage difference in the average Nusselt number prediction is only 6.08\\%. All the results are reported in detail. Along side the important conclusions, the future scope of the study is also listed.",
    "citationCount": 0,
    "referenceCount": 31
}