{
    "paperId": "4adee81b4148bcd798d195e55b77616abc5945b9",
    "title": "Software Engineering by and for Humans in an AI Era",
    "year": 2025,
    "venue": "ACM Transactions on Software Engineering and Methodology",
    "authors": [
        "S. Abrahão",
        "John C. Grundy",
        "Mauro Pezzè",
        "M. Storey",
        "D. Tamburri"
    ],
    "doi": "10.1145/3715111",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4adee81b4148bcd798d195e55b77616abc5945b9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The landscape of software engineering is undergoing a transformative shift driven by advancements in machine learning, Artificial Intelligence (AI), and autonomous systems. This roadmap article explores how these technologies are reshaping the field, positioning humans not only as end users but also as critical components within expansive software ecosystems. We examine the challenges and opportunities arising from this human-centered paradigm, including ethical considerations, fairness, and the intricate interplay between technical and human factors. By recognizing humans at the heart of the software lifecycle—spanning professional engineers, end users, and end user developers—we emphasize the importance of inclusivity, human-aligned workflows, and the seamless integration of AI-augmented socio-technical systems. As software systems evolve to become more intelligent and human-centric, software engineering practices must adapt to this new reality. This article provides a comprehensive examination of this transformation, outlining current trends, key challenges, and opportunities that define the emerging research and practice landscape, and envisioning a future where software engineering and AI work synergistically to place humans at the core of the ecosystem.",
    "citationCount": 9,
    "referenceCount": 186
}