{
    "paperId": "4b1d545270511ab7623a919b850a597bbd548fee",
    "title": "An advanced AI driven database system",
    "year": 2025,
    "venue": "EDULEARN Proceedings",
    "authors": [
        "Mary Tedeschi",
        "Sariya Rizwan",
        "Chinmay Shringi",
        "Vaibhav Devram Chandgir",
        "Sergio Belich"
    ],
    "doi": "10.21125/edulearn.2025.1294",
    "arxivId": "2507.17778",
    "url": "https://www.semanticscholar.org/paper/4b1d545270511ab7623a919b850a597bbd548fee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Contemporary database systems, while effective, suffer severe issues related to complexity and usability, especially among individuals who lack technical expertise but are unfamiliar with query languages like Structured Query Language (SQL). This paper presents a new database system supported by Artificial Intelligence (AI), which is intended to improve the management of data using natural language processing (NLP) - based intuitive interfaces, and automatic creation of structured queries and semi-structured data formats like yet another markup language (YAML), java script object notation (JSON), and application program interface (API) documentation. The system is intended to strengthen the potential of databases through the integration of Large Language Models (LLMs) and advanced machine learning algorithms. The integration is purposed to allow the automation of fundamental tasks such as data modeling, schema creation, query comprehension, and performance optimization. We present in this paper a system that aims to alleviate the main problems with current database technologies. It is meant to reduce the need for technical skills, manual tuning for better performance, and the potential for human error. The AI database employs generative schema inference and format selection to build its schema models and execution formats.",
    "citationCount": 0,
    "referenceCount": 8
}