{
    "paperId": "4b4d16c72ebc5c69b16f3c92c1ef8ad1735efef6",
    "title": "Summarization-Based Document IDs for Generative Retrieval with Language Models",
    "year": 2023,
    "venue": "Proceedings of the First Workshop on Advancing Natural Language Processing for Wikipedia",
    "authors": [
        "Haoxin Li",
        "Phillip Keung",
        "Daniel Cheng",
        "Jungo Kasai",
        "Noah A. Smith"
    ],
    "doi": "10.18653/v1/2024.wikinlp-1.18",
    "arxivId": "2311.08593",
    "url": "https://www.semanticscholar.org/paper/4b4d16c72ebc5c69b16f3c92c1ef8ad1735efef6",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2311.08593",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval (Wang et al., 2022; Tay et al., 2022) is a popular approach for end-to-end document retrieval that directly generates document identifiers given an input query. We introduce summarization-based document IDs, in which each document's ID is composed of an extractive summary or abstractive keyphrases generated by a language model, rather than an integer ID sequence or bags of n-grams as proposed in past work. We find that abstractive, content-based IDs (ACID) and an ID based on the first 30 tokens are very effective in direct comparisons with previous approaches to ID creation. We show that using ACID improves top-10 and top-20 recall by 15.6% and 14.4% (relative) respectively versus the cluster-based integer ID baseline on the MSMARCO 100k retrieval task, and 9.8% and 9.9% respectively on the Wikipedia-based NQ 100k retrieval task. Our results demonstrate the effectiveness of human-readable, natural-language IDs created through summarization for generative retrieval. We also observed that extractive IDs outperformed abstractive IDs on Wikipedia articles in NQ but not the snippets in MSMARCO, which suggests that document characteristics affect generative retrieval performance.",
    "citationCount": 3,
    "referenceCount": 19
}