{
    "paperId": "4b64cd84c54dd20e63f364a56e517bcf8fc2fb65",
    "title": "Beyond Model Base Selection: Weaving Knowledge to Master Fine-grained Neural Network Design",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jialiang Wang",
        "Hanmo Liu",
        "Shimin Di",
        "Zhili Wang",
        "Jiachuan Wang",
        "Lei Chen",
        "Xiaofang Zhou"
    ],
    "doi": "10.48550/arXiv.2507.15336",
    "arxivId": "2507.15336",
    "url": "https://www.semanticscholar.org/paper/4b64cd84c54dd20e63f364a56e517bcf8fc2fb65",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database systems have recently advocated for embedding machine learning (ML) capabilities, offering declarative model queries over large, managed model repositories, thereby circumventing the huge computational overhead of traditional ML-based algorithms in automated neural network model selection. Pioneering database studies aim to organize existing benchmark repositories as model bases (MB), querying them for the model records with the highest performance estimation metrics for given tasks. However, this static model selection practice overlooks the fine-grained, evolving relational dependencies between diverse task queries and model architecture variations, resulting in suboptimal matches and failing to further refine the model effectively. To fill the model refinement gap in database research, we propose M-DESIGN, a curated model knowledge base (MKB) pipeline for mastering neural network refinement by adaptively weaving prior insights about model architecture modification. First, we propose a knowledge weaving engine that reframes model refinement as an adaptive query problem over task metadata. Given a user's task query, M-DESIGN quickly matches and iteratively refines candidate models by leveraging a graph-relational knowledge schema that explicitly encodes data properties, architecture variations, and pairwise performance deltas as joinable relations. This schema supports fine-grained relational analytics over architecture tweaks and drives a predictive query planner that can detect and adapt to out-of-distribution (OOD) tasks. We instantiate M-DESIGN for graph analytics tasks, where our model knowledge base enriches existing benchmarks with structured metadata covering 3 graph tasks and 22 graph datasets, contributing data records of 67,760 graph models. Empirical results demonstrate that M-DESIGN delivers the optimal model in 26 of 33 data-task pairs within limited budgets.",
    "citationCount": 0,
    "referenceCount": 64
}