{
    "paperId": "4b6fdbce8eede6fcaffb9dd898a5f6718ef29081",
    "title": "Capelin: Data-Driven Capacity Procurement for Cloud Datacenters using Portfolios of Scenarios - Extended Technical Report",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "George Andreadis",
        "Fabian Mastenbroek",
        "V. V. Beek",
        "A. Iosup"
    ],
    "doi": null,
    "arxivId": "2103.02060",
    "url": "https://www.semanticscholar.org/paper/4b6fdbce8eede6fcaffb9dd898a5f6718ef29081",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud datacenters provide a backbone to our digital society. Inaccurate capacity procurement for cloud datacenters can lead to significant performance degradation, denser targets for failure, and unsustainable energy consumption. Although this activity is core to improving cloud infrastructure, relatively few comprehensive approaches and support tools exist for mid-tier operators, leaving many planners with merely rule-of-thumb judgement. We derive requirements from a unique survey of experts in charge of diverse datacenters in several countries. We propose Capelin, a data-driven, scenario-based capacity planning system for mid-tier cloud datacenters. Capelin introduces the notion of portfolios of scenarios, which it leverages in its probing for alternative capacity-plans. At the core of the system, a trace-based, discrete-event simulator enables the exploration of different possible topologies, with support for scaling the volume, variety, and velocity of resources, and for horizontal (scale-out) and vertical (scale-up) scaling. Capelin compares alternative topologies and for each gives detailed quantitative operational information, which could facilitate human decisions of capacity planning. We implement and open-source Capelin, and show through comprehensive trace-based experiments it can aid practitioners. The results give evidence that reasonable choices can be worse by a factor of 1.5-2.0 than the best, in terms of performance degradation or energy consumption.",
    "citationCount": 1,
    "referenceCount": 61
}