{
    "paperId": "4b8d2e282a5ae43eeffb61c1f67ddfe3290a8fbe",
    "title": "TempGraph: An Efficient Chain-driven Temporal Graph Computing Framework on the GPU",
    "year": 2025,
    "venue": "Proceedings of the 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 3",
    "authors": [
        "Jin Zhao",
        "Qian Wang",
        "Ligang He",
        "Yu Zhang",
        "Sheng Di",
        "Bingsheng He",
        "Xinlei Wang",
        "Hui Yu",
        "Hao Qi",
        "Longlong Lin",
        "Linchen Yu",
        "Xiaofei Liao",
        "Hai Jin"
    ],
    "doi": "10.1145/3676642.3736116",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4b8d2e282a5ae43eeffb61c1f67ddfe3290a8fbe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tackling temporal path problems in temporal graphs is essential for time-sensitive applications. Although many solutions have been proposed to handle temporal path problems, due to the intrinsic time constraints, these solutions require the vertices of the temporal graph to be sequentially handled along the time-dependent chains (i.e., the temporal dependencies between these vertices) to form the temporal path. This sequential temporal nature poses the challenges of poor parallelism and slow convergence speed, preventing existing solutions from fully leveraging the massive parallelism and high internal bandwidth of GPU to handle temporal path problems. To overcome these challenges, this paper proposes TempGraph, an efficient chain-driven GPU-based temporal graph computing framework. Specifically, it transforms the temporal graph into a set of disjoint time-dependent chains that can elegantly expose the temporal dependency between the vertices while facilitating the fast path exploration along these chains over GPU. Furthermore, TempGraph employs a novel Generate-Activate-Compute execution model to decouple the temporal dependency between different chains through maintaining a set of shortcuts for them, which enables multiple chains to be concurrently handled by massive GPU threads, achieving fast convergence speed and high parallelism on the GPU. Experiments on an A100 GPU show that TempGraph outperforms the state-of-the-art GPU-based solutions by 3.0-16.2×. Besides, TempGraph on an A100 GPU gains 33.9-368.9× speedups compared to the cutting-edge CPU-based system TeGraph on a 128-core CPU machine.",
    "citationCount": 0,
    "referenceCount": 86
}