{
    "paperId": "4bdfc64f8a0976aa8d4290c0c509d95e8371245a",
    "title": "Uzaktan algılama verisi tabanlı coğrafi veri küpü teknolojisi: UDENE uygulaması",
    "year": 2025,
    "venue": "Geomatik",
    "authors": [
        "Nebiye Musaoğlu",
        "Bekir Kapukaya",
        "Onur Lenk",
        "A. Erbay",
        "Sedanur Kara"
    ],
    "doi": "10.29128/geomatik.1659359",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4bdfc64f8a0976aa8d4290c0c509d95e8371245a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "Günümüzde veri hacminin ve çeşitliliğinin hızla artması, çok boyutlu veri yönetimi ve analizi alanında yenilikçi yöntemlerin geliştirilmesini gerekli kılmaktadır. Veri küpü teknolojisi bu konuda geliştirilmiş, çözüme yönelik kullanım hızı ve kolaylığı ön gören en güncel yöntemlerden biridir. Çok boyutlu mekânsal ve zamansal verilerin belirgin kullanım senaryoları dahilinde yapılandırılması, analiz edilmesi ve görselleştirilmesi süreçleri, bu teknolojinin “coğrafi veri küpü” tanımına evrilmesiyle anlamlı bir uygulama alanı kazanmıştır. Bu çalışmada, veri küpleri ve veri küpü tasarımının nasıl yapılacağı açıklanmıştır. Ayrıca Doğal Deneyler Kullanarak Kentsel Gelişim Keşifleri (Urban Development Explorations using Natural Experiments-UDENE) projesi kapsamında uydu görüntüleri ve coğrafi veri temelinde geliştirilen coğrafi veri küpü örnek olarak sunulmuştur. Geliştirilen platformda farklı uydu görüntülerinin tek bir veri küpü çatısı altında saklanması ve indekslenmesi sağlanmış; veri ön işleme, sorgu performansı ve sıkıştırma stratejileri açısından elde edilen sonuçlar değerlendirilmiştir. Bulgular, veri küpü yaklaşımının hem veri saklama verimliliği hem de çok boyutlu sorgulama performansı bakımından geleneksel yöntemlere kıyasla önemli ölçüde avantaj sağladığını göstermektedir. Bununla birlikte, gerçek zamanlı veri işleme ve donanım altyapısı gereksinimleri, teknolojinin yaygın olarak benimsenmesi önünde hâlâ çözülmesi gereken bazı sınırlılıklar olarak belirlenmiştir. Çalışmanın sonunda, gelecekteki araştırmalarda makine öğrenimi ve bulut bilişim mimarileriyle bütünleşik veri küpü sistemlerinin geliştirilmesine ve veri analitiği uygulamalarında çok boyutlu veri işleme yeteneklerinin genişletilmesine ilişkin öneriler sunulmuştur.",
    "citationCount": 0,
    "referenceCount": 16
}