{
    "paperId": "4c1a51a7291d6622753c1fbf00f77767e80f66d9",
    "title": "FlexIM: Efficient and Verifiable Index Management in Blockchain",
    "year": 2025,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Binhong Li",
        "Licheng Lin",
        "Shijie Zhang",
        "Jianliang Xu",
        "Jiang Xiao",
        "Bo Li",
        "Hai Jin"
    ],
    "doi": "10.1109/TKDE.2025.3546997",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4c1a51a7291d6622753c1fbf00f77767e80f66d9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tkde.2025.3546997",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Blockchain-based query with its traceability and data provenance has become increasingly popular and widely adopted in numerous applications. Yet existing index-based query approaches are only efficient under static blockchain query workloads where the query attribute or type must be fixed. It turns out to be particularly challenging to construct an efficient index for dynamic workloads due to prohibitively long construction time and excessive storage consumption. In this paper, we present FlexIM, the first efficient and verifiable index management system for blockchain dynamic queries. The key innovation in FlexIM is to uncover the inherent characteristics of blockchain, i.e., data distribution and block access frequency, and then to optimally choose the index by utilizing reinforcement learning technique under varying workloads. In addition, we enhance and facilitate verifiability with low storage overhead by leveraging Root Merkle Tree (RMT) and Bloom Filter Merkle Tree (BMT). Our comprehensive evaluations demonstrate that FlexIM outperforms the state-of-the-art blockchain query mechanism, vChain+, by achieving a 26.5% speedup while consuming 94.2% less storage, on average, over real-world Bitcoin datasets.",
    "citationCount": 1,
    "referenceCount": 34
}