{
    "paperId": "4c66cd6ec8cb76edf70f323b6d15f78253a259ee",
    "title": "Deep Learning-Based Artificial Neural Network-Cellular Automata Model in Constructing Landscape Gene in Shaanxi Ancient Towns under Rural Revitalization",
    "year": 2022,
    "venue": "Computational Intelligence and Neuroscience",
    "authors": [
        "Xiameng Wei"
    ],
    "doi": "10.1155/2022/1340038",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4c66cd6ec8cb76edf70f323b6d15f78253a259ee",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/cin/2022/1340038.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "History",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of modern industrialization, the rational planning of land resources, especially rural settlements (RSs), has become an important part of rural revitalization. Optimizing the RS spatial layout and enhancing its evolution simulation can encourage effective land resource allocation. It helps improve rural residents' production and living standards, alleviates the pressure of urban and rural land conflicts, and promotes the common development of urban and rural economies. This work mainly uses the ANN-CN (artificial neural network-cellular automata) model to study the cultural landscape gene construction of ancient towns in Shaanxi. First, RSs' spatial layout and landscape pattern index (LPI) in Shaanxi are analyzed. Second, the ANN-CA model is designed using the artificial neural network (ANN). Finally, Hua Yang Ancient Town in southern Shaanxi, Feng Huo Town in Guan Zhong, and Zhong Jiao Town in Northern Shaanxi are selected as the research objects. The influencing factors of spatial layout are extracted, and the evolution extracted of spatial layout is simulated based on the ANN-CA model. The simulation experiment finds that the area change of Hua Yang Ancient Town is more obvious than that of the other two ancient towns, with a change rate of 6.98%. Although the area change rate of Feng Huo Town is 19.79%, the actual change area is less than that of Hua Yang Ancient Town. Second, comparing the simulation accuracy of the model under different parameters, we can obtain the most suitable parameter for predicting the ancient towns' land-use type and construing landscape gene land. Specifically, for Hua Yang Ancient Town, T = 0.9 and the random disturbance parameter α = 1.0. For Zhong Jiao Town, T = 0.8 and α = 1.0. For Feng Huo Town, T = 0.9 and α = 1.0. It is hoped that this work can further carry forward Shaanxi's traditional culture and carry out the protective development of traditional rural buildings.",
    "citationCount": 5,
    "referenceCount": 29
}