{
    "paperId": "4ca4073253fa1dab6195cdfb2eeb4fcc49656599",
    "title": "Association between toxin-antitoxin system mutations and global transmission of MDR-TB",
    "year": 2024,
    "venue": "BMC Infectious Diseases",
    "authors": [
        "Ya-meng Li",
        "Yang Shao",
        "Yifan Li",
        "Xiang-long Kong",
        "Ningning Tao",
        "Yawei Hou",
        "Ting-ting Wang",
        "Yingying Li",
        "Yao Liu",
        "Huaichen Li"
    ],
    "doi": "10.1186/s12879-024-10142-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4ca4073253fa1dab6195cdfb2eeb4fcc49656599",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s12879-024-10142-4",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background The emergence of Multidrug-Resistant Tuberculosis (MDR-TB) poses a significant threat to global tuberculosis control efforts. This study aimed to examine the influence of mutations in Toxin-Antitoxin system genes on the global transmission of MDR-TB caused by Mycobacterium tuberculosis (M. tuberculosis). Methods Whole-genome sequencing was conducted on 13,518 M. tuberculosis isolates. Genes of the Toxin-Antitoxin system were obtained from the National Center for Biotechnology Information (NCBI) Gene database. Techniques such as Random Forest, Gradient Boosting Decision Tree, and Generalized Linear Mixed Models were employed to identify mutation sites in Toxin-Antitoxin system-related genes that facilitated the transmission of MDR-TB. Results 4,066 (30.08%) were identified as MDR-TB strains of all analyzed isolates. We found significant associations between specific gene mutations and MDR-TB transmission clusters including mutations in Rv0298 (G213A), Rv1959c (parE1, C88T), Rv1960c (parD1, C134T), Rv1991A (maze, G156A), Rv2547 (vapB, C54G), Rv2862A (vapB23, T2C), and Rv3385c (vapB46, G70A). Additionally, several gene mutations associated with MDR-TB transmission clades such as Rv1956 (higA, G445T), Rv1960c (parD1, C134T), and Rv1962A (vapB35, G99A) were noted. Certain gene mutations including vapB35 (G99A), higA (G445T), and parD1 (C134T) correlated with cross-regional transmission clades. Conclusion This study highlights the significant association between specific gene mutations in the Toxin-Antitoxin system and the global transmission of MDR-TB, providing valuable insights for developing targeted interventions to control MDR-TB. Supplementary Information The online version contains supplementary material available at 10.1186/s12879-024-10142-4.",
    "citationCount": 1,
    "referenceCount": 38
}