{
    "paperId": "4cac090c5c497c55f46fa0187774865d1be78fa4",
    "title": "An Approach Based on Bayesian Networks for Query Selectivity Estimation",
    "year": 2019,
    "venue": "International Conference on Database Systems for Advanced Applications",
    "authors": [
        "Max Halford",
        "Philippe Saint-Pierre",
        "F. Morvan"
    ],
    "doi": "10.1007/978-3-030-18579-4_1",
    "arxivId": "1907.06295",
    "url": "https://www.semanticscholar.org/paper/4cac090c5c497c55f46fa0187774865d1be78fa4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The efficiency of a query execution plan depends on the accuracy of the selectivity estimates given to the query optimiser by the cost model. The cost model makes simplifying assumptions in order to produce said estimates in a timely manner. These assumptions lead to selectivity estimation errors that have dramatic effects on the quality of the resulting query execution plans. A convenient assumption that is ubiquitous among current cost models is to assume that attributes are independent with each other. However, it ignores potential correlations which can have a huge negative impact on the accuracy of the cost model. In this paper we attempt to relax the attribute value independence assumption without unreasonably deteriorating the accuracy of the cost model. We propose a novel approach based on a particular type of Bayesian networks called Chow-Liu trees to approximate the distribution of attribute values inside each relation of a database. Our results on the TPC-DS benchmark show that our method is an order of magnitude more precise than other approaches whilst remaining reasonably efficient in terms of time and space.",
    "citationCount": 19,
    "referenceCount": 41
}