{
    "paperId": "4d1ffff88fd9cd8b5cade150709f0e1339bf5d34",
    "title": "Lightweight Transmission Behavior Audit Scheme for NDN Industrial Internet Identity Resolution and Transmission Based on Blockchain",
    "year": 2023,
    "venue": "Electronics",
    "authors": [
        "Yunhua He",
        "Yuliang Ma",
        "Qing Hu",
        "Zhihao Zhou",
        "Ke Xiao",
        "Chao Wang"
    ],
    "doi": "10.3390/electronics12112538",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4d1ffff88fd9cd8b5cade150709f0e1339bf5d34",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/12/11/2538/pdf?version=1685938558",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Named Data Network (NDN) enables efficient content dissemination through interest-based retrieval, name-based routing, and content caching. In the industrial Internet architecture based on NDN, device identity distribution, identification, resolution, and routing rely on identification resolution technology. However, this approach presents challenges such as cache poisoning, interest packet flood attacks, and black hole attacks. Existing security schemes primarily focused on routing forwarding and verification fail to address critical concerns, including routing environment credibility and data leakage, while exhibiting poor time and space efficiency. To address these challenges, this paper proposes a lightweight behavior auditing scheme using blockchain technology. The scheme utilizes an improved Bloom filter to compress behavioral information like interest and data packets during the identification transmission process. The compressed data are subsequently uploaded to a blockchain for auditing, achieving efficient space and time utilization while maintaining feasibility.",
    "citationCount": 3,
    "referenceCount": 35
}