{
    "paperId": "4d9c17240d3374b62c2bb2d16eab212befa99914",
    "title": "LATPC: Accelerating GPU Address Translation Using Locality-Aware TLB Prefetching and MSHR Compression",
    "year": 2025,
    "venue": "Proceedings of the 2025 58th IEEE/ACM International Symposium on Microarchitecture",
    "authors": [
        "Yeonan Ha",
        "Ji-Hoon Park",
        "Hanna Cha",
        "Jiwon Lee",
        "Joonsung Kim",
        "Won Woo Ro",
        "Youngsok Kim"
    ],
    "doi": "10.1145/3725843.3756069",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4d9c17240d3374b62c2bb2d16eab212befa99914",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern Graphics Processing Units (GPUs) support virtual memory to ease programmability and concurrency, but still suffer from significant address translation overhead due to frequent Translation Lookaside Buffer (TLB) misses and limited TLB Miss-Status Holding Register (MSHR) capacity. These misses trigger long-latency page table walks and stall memory accesses, degrading overall performance. In this paper, we present LATPC, a novel mechanism that combines TLB prefetching with MSHR compression to accelerate GPU address translation. LATPC leverages the regularity of Virtual Page Numbers (VPNs) across threads within a warp to coalesce TLB misses at the warp instruction level. LATPC then compresses multiple TLB miss requests into a small number of MSHR entries, reducing contention and enabling more efficient resource use. LATPC further improves translation efficiency by batching page table walks based on the identified VPN patterns, which not only reduces the number of page table walk invocations but also increases off-chip DRAM row buffer locality, lowering the latency of memory accesses during translation. Our evaluation using 24 GPU workloads shows that LATPC effectively exploits regularities and localities in address translation requests within a warp, achieving a 1.47× geometric mean speedup over the baseline without TLB prefetching.",
    "citationCount": 0,
    "referenceCount": 110
}