{
    "paperId": "4d9fb4f3694ac473534ecd1ca1369b0e87cd2c41",
    "title": "A Weakly Supervised Academic Search Model Based on Knowledge-Enhanced Feature Representation",
    "year": 2021,
    "venue": "Wireless Communications and Mobile Computing",
    "authors": [
        "Mingying Xu",
        "Junping Du",
        "Feifei Kou",
        "M. Liang",
        "Xin Xu",
        "Jiaxin Yang"
    ],
    "doi": "10.1155/2021/4411524",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4d9fb4f3694ac473534ecd1ca1369b0e87cd2c41",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1155/2021/4411524",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Internet of Things search has great potential applications with the rapid development of Internet of Things technology. Combining Internet of Things technology and academic search to build academic search framework based on Internet of Things is an effective solution to realize massive academic resource search. Recently, the academic big data has been characterized by a large number of types and spanning many fields. The traditional web search technology is no longer suitable for the search environment of academic big data. Thus, this paper designs academic search framework based on Internet of Things Technology. In order to alleviate the pressure of the cloud server processing massive academic big data, the edge server is introduced to clean and remove the redundancy of the data to form a clean data for further analysis and processing by the cloud server. Edge computing network effectively makes up for the deficiency of cloud computing in the conditions of distributed and high concurrent access, reduces long-distance data transmission, and improves the quality of network user experience. For Academic Search, this paper proposes a novel weakly supervised academic search model based on knowledge-enhanced feature representation. The proposed model can relieve high cost of acquisition of manually labeled data by obtaining a lot of pseudolabeled data and consider word-level interactive matching and sentence-level semantic matching for more accurate matching in the process of academic search. The experimental result on academic datasets demonstrate that the performance of the proposed model is much better than that of the existing methods.",
    "citationCount": 1,
    "referenceCount": 43
}