{
    "paperId": "4dd2c5bbd9efff3198086a9e68b063e5cd4f676d",
    "title": "Implementing Agile Testing Methodologies in Banking Software Project",
    "year": 2022,
    "venue": "Journal for Research in Applied Sciences and Biotechnology",
    "authors": [
        "Ashwini Shivarudra"
    ],
    "doi": "10.55544/jrasb.1.4.32",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4dd2c5bbd9efff3198086a9e68b063e5cd4f676d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Agile software development has been increasingly popular in a number of sectors in recent years. Financial businesses are used to this tendency since it requires them to respond to changes in their business environments more swiftly. Agile approaches have emerged to address the limitations of old ones. In response to the ever-changing and dynamic nature of the business environment, software development businesses are increasingly implementing agile methodologies. The word \"Agile\" originally arose in the disciplines of software development and project management around thirty years ago. It is used to research with wide-ranging implications, and it is utilized at different levels and in different circumstances. Scrum, kanban, large-scale scrum (LeSS), spotify model, continuous integration, Scaled Agile Lean Development (SCALeD), and many more variations of the agile methodology have emerged. Initially implemented at the individual software development and team level, agile has developed into projects, programs, solutions, and portfolios over time, ultimately reaching full-service growth into an enterprise level framework. In order to examine agile methodologies, models, and practices in a less researched area of the banking and financial services industry—from software development and modelling to large-scale case study organization levels—a unique methodology to surveying the literature has been presented in this paper. The study's conclusion outlines the contributing variables, best practices, advantages, and lessons that professionals in the banking and financial services industries may apply to create a simplified, agile deployment.",
    "citationCount": 14,
    "referenceCount": 39
}