{
    "paperId": "4dd6501c526c9a74a0cf45b1777523325ec832af",
    "title": "TierBase: A Workload-Driven Cost-Optimized Key-Value Store",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Zhitao Shen",
        "Shiyu Yang",
        "Weibo Chen",
        "Kunming Wang",
        "Yue Li",
        "Jiabao Jin",
        "Wei Jia",
        "Junwei Chen",
        "Yuan Su",
        "Xiaoxia Duan",
        "Wei Chen",
        "Lei Wang",
        "Jie Song",
        "Ruoyi Ruan",
        "Xuemin Lin"
    ],
    "doi": "10.1109/ICDE65448.2025.00049",
    "arxivId": "2505.06556",
    "url": "https://www.semanticscholar.org/paper/4dd6501c526c9a74a0cf45b1777523325ec832af",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the current era of data-intensive applications, the demand for high-performance, cost-effective storage solutions is paramount. This paper introduces a Space-Performance Cost Model for key-value store, designed to guide cost-effective storage configuration decisions. The model quantifies the trade-offs between performance and storage costs, providing a framework for optimizing resource allocation in large-scale data serving environments. Guided by this cost model, we present Tier-Base, a distributed key-value store developed by Ant Group that optimizes total cost by strategically synchronizing data between cache and storage tiers, maximizing resource utilization and effectively handling skewed workloads. To enhance cost-efficiency, TierBase incorporates several optimization techniques, including pre-trained data compression, elastic threading mechanisms, and the utilization of persistent memory. We detail TierBase's architecture, key components, and the implementation of cost optimization strategies. Extensive evaluations using both synthetic benchmarks and real-world workloads demonstrate TierBase's superior cost-effectiveness compared to existing solutions. Furthermore, case studies from Ant Group's production environments showcase TierBase's ability to achieve up to 62% cost reduction in primary scenarios, highlighting its practical impact in large-scale online data serving.",
    "citationCount": 0,
    "referenceCount": 64
}