{
    "paperId": "4df2f4030c0515657d553a5a79bf7efbe204772b",
    "title": "Learnt representations of proteins can be used for accurate prediction of small molecule binding sites on experimentally determined and predicted protein structures",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "A. Carbery",
        "Martin Buttenschoen",
        "R. Skyner",
        "Frank von Delft",
        "Charlotte M. Deane"
    ],
    "doi": "10.1186/s13321-024-00821-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4df2f4030c0515657d553a5a79bf7efbe204772b",
    "isOpenAccess": true,
    "openAccessPdf": "https://jcheminf.biomedcentral.com/counter/pdf/10.1186/s13321-024-00821-4",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Protein-ligand binding site prediction is a useful tool for understanding the functional behaviour and potential drug-target interactions of a novel protein of interest. However, most binding site prediction methods are tested by providing crystallised ligand-bound (holo) structures as input. This testing regime is insufficient to understand the performance on novel protein targets where experimental structures are not available. An alternative option is to provide computationally predicted protein structures, but this is not commonly tested. However, due to the training data used, computationally-predicted protein structures tend to be extremely accurate, and are often biased toward a holo conformation. In this study we describe and benchmark IF-SitePred, a protein-ligand binding site prediction method which is based on the labelling of ESM-IF1 protein language model embeddings combined with point cloud annotation and clustering. We show that not only is IF-SitePred competitive with state-of-the-art methods when predicting binding sites on experimental structures, but it performs better on proxies for novel proteins where low accuracy has been simulated by molecular dynamics. Finally, IF-SitePred outperforms other methods if ensembles of predicted protein structures are generated.",
    "citationCount": 16,
    "referenceCount": 77
}