{
    "paperId": "4e3fc7cebd3127926f60ace85f15ab3354d5bd23",
    "title": "The Internet of Federated Things (IoFT)",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "R. Kontar",
        "Naichen Shi",
        "Xubo Yue",
        "Seokhyun Chung",
        "E. Byon",
        "Mosharaf Chowdhury",
        "Judy Jin",
        "Wissam Kontar",
        "Neda Masoud",
        "Maher",
        "Noueihed",
        "C. Okwudire",
        "Garvesh Raskutti",
        "R. Saigal",
        "Karandeep Singh",
        "Ye Zhisheng"
    ],
    "doi": "10.1109/ACCESS.2021.3127448",
    "arxivId": "2111.05326",
    "url": "https://www.semanticscholar.org/paper/4e3fc7cebd3127926f60ace85f15ab3354d5bd23",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2021.3127448",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet of Things (IoT) is on the verge of a major paradigm shift. In the IoT system of the future, IoFT, the “cloud” will be substituted by the “crowd” where model training is brought to the edge, allowing IoT devices to collaboratively extract knowledge and build smart analytics/models while keeping their personal data stored locally. This paradigm shift was set into motion by the tremendous increase in computational power on IoT devices and the recent advances in decentralized and privacy-preserving model training, coined as federated learning (FL). This article provides a vision for IoFT and a systematic overview of current efforts towards realizing this vision. Specifically, we first introduce the defining characteristics of IoFT and discuss FL data-driven approaches, opportunities, and challenges that allow decentralized inference within three dimensions: (i) a global model that maximizes utility across all IoT devices, (ii) a personalized model that borrows strengths across all devices yet retains its own model, (iii) a meta-learning model that quickly adapts to new devices or learning tasks. We end by describing the vision and challenges of IoFT in reshaping different industries through the lens of domain experts. Those industries include manufacturing, transportation, energy, healthcare, quality & reliability, business, and computing.",
    "citationCount": 55,
    "referenceCount": 375
}