{
    "paperId": "4ea785b9673072cefe68adc6f84849b3b768770f",
    "title": "Agent Centric Operating System - a Comprehensive Review and Outlook for Operating System",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Shian Jia",
        "Xinbo Wang",
        "Mingli Song",
        "Gang Chen"
    ],
    "doi": "10.48550/arXiv.2411.17710",
    "arxivId": "2411.17710",
    "url": "https://www.semanticscholar.org/paper/4ea785b9673072cefe68adc6f84849b3b768770f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The operating system (OS) is the backbone of modern computing, providing essential services and managing resources for computer hardware and software. This review paper offers an in-depth analysis of operating systems' evolution, current state, and prospects. We begin with an overview of the concept and significance of operating systems in the digital era. In the second section, we delve into the existing released operating systems, examining their architectures, functionalities, and the ecosystems they support. We then explore recent advances in OS evolution, highlighting innovations in real-time processing, distributed computing, and security. The third section focuses on the new era of operating systems, discussing emerging trends like the Internet of Things (IoT), cloud computing, and artificial intelligence (AI) integration. We also consider the challenges and opportunities presented by these developments. This review concludes with a synthesis of the current landscape and a forward-looking discussion on the future trajectories of operating systems, including open issues and areas ripe for further research and innovation. Finally, we put forward a new OS architecture.",
    "citationCount": 1,
    "referenceCount": 78
}