{
    "paperId": "4eb8239fca2f0d6b9b4e364324d23716dc0f6e1d",
    "title": "AutoML in The Wild: Obstacles, Workarounds, and Expectations",
    "year": 2023,
    "venue": "International Conference on Human Factors in Computing Systems",
    "authors": [
        "Yuan Sun",
        "Qiurong Song",
        "Xinning Gui",
        "Fenglong Ma",
        "Ting Wang"
    ],
    "doi": "10.1145/3544548.3581082",
    "arxivId": "2302.10827",
    "url": "https://www.semanticscholar.org/paper/4eb8239fca2f0d6b9b4e364324d23716dc0f6e1d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2302.10827",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automated machine learning (AutoML) is envisioned to make ML techniques accessible to ordinary users. Recent work has investigated the role of humans in enhancing AutoML functionality throughout a standard ML workflow. However, it is also critical to understand how users adopt existing AutoML solutions in complex, real-world settings from a holistic perspective. To fill this gap, this study conducted semi-structured interviews of AutoML users (N = 19) focusing on understanding (1) the limitations of AutoML encountered by users in their real-world practices, (2) the strategies users adopt to cope with such limitations, and (3) how the limitations and workarounds impact their use of AutoML. Our findings reveal that users actively exercise user agency to overcome three major challenges arising from customizability, transparency, and privacy. Furthermore, users make cautious decisions about whether and how to apply AutoML on a case-by-case basis. Finally, we derive design implications for developing future AutoML solutions.",
    "citationCount": 22,
    "referenceCount": 95
}