{
    "paperId": "4eb8bb576a5603b82c27d7f40e508b7dc8c1c0cc",
    "title": "PAL: a position-bias aware learning framework for CTR prediction in live recommender systems",
    "year": 2019,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Huifeng Guo",
        "Jinkai Yu",
        "Qing Liu",
        "Ruiming Tang",
        "Yuzhou Zhang"
    ],
    "doi": "10.1145/3298689.3347033",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4eb8bb576a5603b82c27d7f40e508b7dc8c1c0cc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predicting Click-Through Rate (CTR) accurately is crucial in recommender systems. In general, a CTR model is trained based on user feedback which is collected from traffic logs. However, position-bias exists in user feedback because a user clicks on an item may not only because she favors it but also because it is in a good position. One way is to model position as a feature in the training data, which is widely used in industrial applications due to its simplicity. Specifically, a default position value has to be used to predict CTR in online inference since the actual position information is not available at that time. However, using different default position values may result in completely different recommendation results. As a result, this approach leads to sub-optimal online performance. To address this problem, in this paper, we propose a Position-bias Aware Learning framework (PAL) for CTR prediction in a live recommender system. It is able to model the position-bias in offline training and conduct online inference without position information. Extensive online experiments are conducted to demonstrate that PAL outperforms the baselines by 3% - 35% in terms of CTR and CVR (ConVersion Rate) in a three-week AB test.",
    "citationCount": 84,
    "referenceCount": 20
}