{
    "paperId": "4ec8f24acb44260fa0b4c5cee943d925dac0eee1",
    "title": "Opportunities and Challenges in Data-Centric AI",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Sushant Kumar",
        "S. Datta",
        "Vishakha Singh",
        "Sanjay Kumar Singh",
        "Ritesh Sharma"
    ],
    "doi": "10.1109/ACCESS.2024.3369417",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4ec8f24acb44260fa0b4c5cee943d925dac0eee1",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10444552.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence (AI) systems are trained to solve complex problems and learn to perform specific tasks by using large volumes of data, such as prediction, classification, recognition, decision-making, etc. In the past three decades, AI research has focused mostly on the model-centric approach compared to the data-centric approach. In the model-centric approach, the focus is to improve the code or model architecture to enhance performance, whereas in data-centric AI, the focus is to improve the dataset to enhance performance. Data is food for AI. As a result, there has been a recent push in the AI community toward data-centric AI from model-centric AI. This paper provides a comprehensive and critical analysis of the current state of research in data-centric AI, presenting insights into the latest developments in this rapidly evolving field. By emphasizing the importance of data in AI, the paper identifies the key challenges and opportunities that must be addressed to improve the effectiveness of AI systems. Finally, this paper gives some recommendations for research opportunities in data-centric AI.",
    "citationCount": 19,
    "referenceCount": 126
}