{
    "paperId": "4f0182cb1aa928298a876dc5921c592b6d4b67bf",
    "title": "Securing multi-tenant cloud platforms during global crises: A zero trust approach",
    "year": 2020,
    "venue": "International Journal of Science and Research Archive",
    "authors": [
        "Nagaraj Parvatha"
    ],
    "doi": "10.30574/ijsra.2020.1.1.0017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4f0182cb1aa928298a876dc5921c592b6d4b67bf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Scalable, cost-effective solutions are offered by multi-tenant cloud platforms, but they are plagued by enormous security issues, especially in the face of emerging global crises like pandemics or geopolitical wars. This work focuses on how the Zero Trust security model can be deployed to tackle vulnerabilities in such environments such as unauthorized access, privilege escalation, or insider threats. Through a methodology that blends theoretical analysis with architectural modeling and case study evaluations, the study shows how Zero Trust principles — continuous verification, least privilege access, and micro specialization — effectively reduce the risks. The attack surfaces decrease by 60%, incidence response time improves, and the lateral movement in the network is minimized. Advanced technologies like artificial intelligence and machine learning bring proactive threat detection to 92% accuracy and decrease time to respond by 25%. These results are validated in real-world case studies where organizations see a 50% decrease in security incidents better scalability and a 30% increase in stakeholder confidence. \nWhile there are limitations, such as secondary data reliance and cloud provider implementation variation, the study shows that despite these limitations, Zero Trust is adaptable and effective for multi-tenant cloud platform security during crises. By applying these principles alongside state-of-the-art technologies organizations will be able to proactively detect and respond to threats, protect critical assets, and continue operations. This work stresses the critical need for continuous innovation in cloud security to cope with evolving cyber threats.",
    "citationCount": 0,
    "referenceCount": 26
}