{
    "paperId": "4f03688df8997e1f4b5aeaf81f44242390ea5c27",
    "title": "Information Retrieval Meets Large Language Models: A Strategic Report from Chinese IR Community",
    "year": 2023,
    "venue": "AI Open",
    "authors": [
        "Qingyao Ai",
        "Ting Bai",
        "Zhao Cao",
        "Yi Chang",
        "Jiawei Chen",
        "Zhumin Chen",
        "Zhiyong Cheng",
        "Shoubin Dong",
        "Zhicheng Dou",
        "Fuli Feng",
        "Shengling Gao",
        "J. Guo",
        "Xiangnan He",
        "Yanyan Lan",
        "Chenliang Li",
        "Yiqun Liu",
        "Ziyu Lyu",
        "Weizhi Ma",
        "Jun Ma",
        "Z. Ren",
        "Pengjie Ren",
        "Zhiqiang Wang",
        "Min Wang",
        "Jirong Wen",
        "Lei Wu",
        "Xin Xin",
        "Jun Xu",
        "Dawei Yin",
        "Peng Zhang",
        "Fan Zhang",
        "Wei-na Zhang",
        "M. Zhang",
        "Xiaofei Zhu"
    ],
    "doi": "10.48550/arXiv.2307.09751",
    "arxivId": "2307.09751",
    "url": "https://www.semanticscholar.org/paper/4f03688df8997e1f4b5aeaf81f44242390ea5c27",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2307.09751",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The research field of Information Retrieval (IR) has evolved significantly, expanding beyond traditional search to meet diverse user information needs. Recently, Large Language Models (LLMs) have demonstrated exceptional capabilities in text understanding, generation, and knowledge inference, opening up exciting avenues for IR research. LLMs not only facilitate generative retrieval but also offer improved solutions for user understanding, model evaluation, and user-system interactions. More importantly, the synergistic relationship among IR models, LLMs, and humans forms a new technical paradigm that is more powerful for information seeking. IR models provide real-time and relevant information, LLMs contribute internal knowledge, and humans play a central role of demanders and evaluators to the reliability of information services. Nevertheless, significant challenges exist, including computational costs, credibility concerns, domain-specific limitations, and ethical considerations. To thoroughly discuss the transformative impact of LLMs on IR research, the Chinese IR community conducted a strategic workshop in April 2023, yielding valuable insights. This paper provides a summary of the workshop's outcomes, including the rethinking of IR's core values, the mutual enhancement of LLMs and IR, the proposal of a novel IR technical paradigm, and open challenges.",
    "citationCount": 74,
    "referenceCount": 126
}