{
    "paperId": "4f32f3145a10033e289b91914e0726d10afaad6c",
    "title": "Online Caching With no Regret: Optimistic Learning via Recommendations",
    "year": 2022,
    "venue": "IEEE Transactions on Mobile Computing",
    "authors": [
        "Naram Mhaisen",
        "G. Iosifidis",
        "D. Leith"
    ],
    "doi": "10.1109/TMC.2023.3317943",
    "arxivId": "2204.09345",
    "url": "https://www.semanticscholar.org/paper/4f32f3145a10033e289b91914e0726d10afaad6c",
    "isOpenAccess": true,
    "openAccessPdf": "https://repository.tudelft.nl/file/File_bf08c410-c271-4291-9c7f-ef3005edb6cb",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The design of effective online caching policies is an increasingly important problem for content distribution networks, online social networks and edge computing services, among other areas. This paper proposes a new algorithmic toolbox for tackling this problem through the lens of <italic>optimistic</italic> online learning. We build upon the Follow-the-Regularized-Leader (FTRL) framework, which is developed further here to include predictions for the file requests, and we design online caching algorithms for bipartite networks with pre-reserved or dynamic storage subject to time-average budget constraints. The predictions are provided by a content recommendation system that influences the users viewing activity and hence can naturally reduce the caching network's uncertainty about future requests. We also extend the framework to learn and utilize the best request predictor in cases where many are available. We prove that the proposed optimistic learning caching policies can achieve <italic>sub-zero</italic> performance loss (regret) for perfect predictions, and maintain the sub-linear regret bound <inline-formula><tex-math notation=\"LaTeX\">$O(\\sqrt{T})$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>O</mml:mi><mml:mo>(</mml:mo><mml:msqrt><mml:mi>T</mml:mi></mml:msqrt><mml:mo>)</mml:mo></mml:mrow></mml:math><inline-graphic xlink:href=\"mhaisen-ieq1-3317943.gif\"/></alternatives></inline-formula>, which is the best achievable bound for policies that do not use predictions, even for arbitrary-bad predictions. The performance of the proposed algorithms is evaluated with detailed trace-driven numerical tests.",
    "citationCount": 10,
    "referenceCount": 74
}