{
    "paperId": "4f6a877ba569f5ff61a56a026ce1895fb718a08b",
    "title": "Co-linear Chaining with Overlaps and Gap Costs",
    "year": 2021,
    "venue": "bioRxiv",
    "authors": [
        "Chirag Jain",
        "Daniel Gibney",
        "Sharma V. Thankachan"
    ],
    "doi": "10.1101/2021.02.03.429492",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4f6a877ba569f5ff61a56a026ce1895fb718a08b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1101/2021.02.03.429492",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Co-linear chaining has proven to be a powerful heuristic for finding near-optimal alignments of long DNA sequences (e.g., long reads or a genome assembly) to a reference. It is used as an intermediate step in several alignment tools that employ a seed-chain-extend strategy. Despite this popularity, efficient subquadratic-time algorithms for the general case where chains support anchor overlaps and gap costs are not currently known. We present algorithms to solve the co-linear chaining problem with anchor overlaps and gap costs in Õ(n) time, where n denotes the count of anchors. We also establish the first theoretical connection between co-linear chaining cost and edit distance. Specifically, we prove that for a fixed set of anchors under a carefully designed chaining cost function, the optimal ‘anchored’ edit distance equals the optimal co-linear chaining cost. Finally, we demonstrate experimentally that optimal co-linear chaining cost under the proposed cost function can be computed orders of magnitude faster than edit distance, and achieves correlation coefficient above 0.9 with edit distance for closely as well as distantly related sequences.",
    "citationCount": 21,
    "referenceCount": 35
}