{
    "paperId": "4f9e6682e3f8c34b218fa01a1a47a5a01fd9dac2",
    "title": "Artificial intelligence for dermatopathology: Current trends and the road ahead.",
    "year": 2022,
    "venue": "Seminars in diagnostic pathology",
    "authors": [
        "Simon B. Chen",
        "R. Novoa"
    ],
    "doi": "10.1053/j.semdp.2022.01.003",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/4f9e6682e3f8c34b218fa01a1a47a5a01fd9dac2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence (AI), including deep learning methods that leverage neural network-based algorithms, hold significant promise for dermatopathology and other areas of diagnostic pathology in research and clinical practice. There has been significant progress over past several years in applying AI to analyzing digital histopathology images for diagnosis. While much work in AI analysis of histopathology data remains investigational, recent regulatory agency approval in Europe and United States of AI-assisted tools for clinical use in histopathologic diagnosis of prostate and breast cancer herald broader movement of AI into the clinical diagnostic realm of anatomic pathology, including dermatopathology. However, significant challenges remain in translating AI from research into clinical practice, including algorithmic real-world performance, robustness to variation in data sets and practice settings, effective integration into clinical workflows, and cost effectiveness. This review introduces core concepts and terminology in AI, and assesses current progress and challenges in applying AI to dermatopathology.",
    "citationCount": 20,
    "referenceCount": 102
}