{
    "paperId": "4ff9ae519bd9084af922479955b53674afcdb3fb",
    "title": "Meta-learning Optimizers for Communication-Efficient Learning",
    "year": 2023,
    "venue": "Trans. Mach. Learn. Res.",
    "authors": [
        "Charles-'Etienne Joseph",
        "Benjamin Th'erien",
        "A. Moudgil",
        "Boris Knyazev",
        "Eugene Belilovsky"
    ],
    "doi": null,
    "arxivId": "2312.02204",
    "url": "https://www.semanticscholar.org/paper/4ff9ae519bd9084af922479955b53674afcdb3fb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Communication-efficient variants of SGD, specifically local SGD, have received a great deal of interest in recent years. These approaches compute multiple gradient steps locally on each worker, before averaging model parameters, helping relieve the critical communication bottleneck in distributed deep learning training. Although many variants of these approaches have been proposed, they can sometimes lag behind state-of-the-art adaptive optimizers for deep learning. In this work, we investigate if the recent progress in the emerging area of learned optimizers can potentially close this gap in homogeneous data and homogeneous device settings while remaining communication-efficient. Specifically, we meta-learn how to perform global updates given an update from local SGD iterations. Our results demonstrate that learned optimizers can substantially outperform local SGD and its sophisticated variants while maintaining their communication efficiency. Our learned optimizers can even generalize to unseen and much larger datasets and architectures, including ImageNet and ViTs, and to unseen modalities such as language modeling. We therefore show the potential of learned optimizers for improving communication-efficient distributed learning.",
    "citationCount": 3,
    "referenceCount": 46
}