{
    "paperId": "500aae53f3c3947aa649265bcb4805b826aaf5b6",
    "title": "MagicScaler: Uncertainty-aware, Predictive Autoscaling",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Zhicheng Pan",
        "Yihang Wang",
        "Yingying Zhang",
        "Sean Bin Yang",
        "Yunyao Cheng",
        "Peng Chen",
        "Chenjuan Guo",
        "Qingsong Wen",
        "Xiduo Tian",
        "Yunliang Dou",
        "Zhiqiang Zhou",
        "Chengcheng Yang",
        "Aoying Zhou",
        "Bin Yang"
    ],
    "doi": "10.14778/3611540.3611566",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/500aae53f3c3947aa649265bcb4805b826aaf5b6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Predictive autoscaling is a key enabler for optimizing cloud resource allocation in Alibaba Cloud's computing platforms, which dynamically adjust the\n Elastic Compute Service\n (ECS) instances based on predicted user demands to ensure Quality of Service (QoS). However, user demands in the cloud are often highly complex, with high\n uncertainty\n and\n scale-sensitive\n temporal dependencies, thus posing great challenges for accurate prediction of future demands. These in turn make autoscaling challenging---autoscaling needs to properly account for demand uncertainty while maintaining a reasonable trade-off between two contradictory factors, i.e., low instance running costs vs. low QoS violation risks.\n \n \n To address the above challenges, we propose a novel predictive autoscaling framework\n MagicScaler\n , consisting of a Multi-scale attentive Gaussian process based predictor and an uncertainty-aware scaler. First, the predictor carefully bridges the best of two successful prediction methodologies---multi-scale attention mechanisms, which are good at capturing complex, multi-scale features, and stochastic process regression, which can quantify prediction uncertainty, thus achieving accurate demand prediction with quantified uncertainty. Second, the scaler takes the quantified future demand uncertainty into a judiciously designed loss function with stochastic constraints, enabling flexible trade-off between running costs and QoS violation risks. Extensive experiments on three clusters of Alibaba Cloud in different Chinese cities demonstrate the effectiveness and efficiency of\n MagicScaler\n , which outperforms other commonly adopted scalers, thus justifying our design choices.\n",
    "citationCount": 31,
    "referenceCount": 51
}