{
    "paperId": "500eedee8812ec902f7d90aba1a662ab58b43d26",
    "title": "Exploring the Effect of Social Accommodation and Informal Input in Second Language Acquisition",
    "year": 2024,
    "venue": "Language, Technology, and Social Media",
    "authors": [
        "Borendra Lal Tripura",
        "Risala Ahmed",
        "Prodhan Mahbub Ibna Seraj"
    ],
    "doi": "10.70211/ltsm.v3i1.69",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/500eedee8812ec902f7d90aba1a662ab58b43d26",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accommodation and input both are essential parts of acquiring a second or first language. This study examined the effect of social accommodation and informal input in acquiring a second language in two different contexts namely Bangladeshi and Thai contexts. For obtaining the purpose of the research objectives, the researchers employed a qualitative case study design through observation and interview of two six grader Thai students and three Bangladeshi first-year students of tertiary level. This study employed the lens of input hypothesis and speech accommodation theory to achieve the objectives. The results found that besides the formal schooling system, some other underlying factors might have enhanced the learners’ L2 acquisition. The factors are categorized as informal comprehensible input and social accommodation. The twofold resources at home played two different roles. TV, the Internet, newspapers, magazines, movies, music, books of stories, and comics all have provided them with comprehensible inputs. In parallel, parental care, and participation in conversation with parents, relatives, teachers, peers, and other interlocutors in the society, school environment, and social setting provided informal social accommodation. Based on the findings, this study will provide some insights and recommendations for teachers, students, and policymakers.",
    "citationCount": 0,
    "referenceCount": 19
}