{
    "paperId": "5049102bfb9cf8af67d9523c1f7a31d5f9d14224",
    "title": "Learning-Based Sample Tuning for Approximate Query Processing in Interactive Data Exploration",
    "year": 2024,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Hanbing Zhang",
        "Yinan Jing",
        "Zhenying He",
        "Kai Zhang",
        "X. Wang"
    ],
    "doi": "10.1109/TKDE.2023.3341451",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5049102bfb9cf8af67d9523c1f7a31d5f9d14224",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For interactive data exploration, approximate query processing (AQP) is a useful approach that usually uses samples to provide a timely response for queries by trading query accuracy. Existing AQP systems often materialize samples in the memory for reuse to speed up query processing. How to tune the samples according to the workload is one of the key problems in AQP. However, since the data exploration workload is so complex that it cannot be accurately predicted, existing sample tuning approaches cannot adapt to the changing workload very well. To address this problem, this paper proposes a deep reinforcement learning-based sample tuner, RL-STuner. When tuning samples, RL-STuner considers the workload changes from a global perspective and uses a Deep Q-learning Network (DQN) model to select an optimal sample set that has the maximum utility for the current workload. In addition, this paper proposes a set of optimization mechanisms to reduce the sample tuning cost. Experimental results on both real-world and synthetic datasets show that RL-STuner outperforms the existing sample tuning approaches and achieves 1.6×-5.2× improvements on query accuracy with a low tuning cost.",
    "citationCount": 2,
    "referenceCount": 56
}