{
    "paperId": "507f671a9b6044de909a559bda80722cf8e8ad4b",
    "title": "Epigenetic Regulation of Anthocyanin Biosynthesis in Betula pendula ‘Purple Rain’",
    "year": 2024,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "Chenrui Gu",
        "Huan Xu",
        "Qihang Yuan",
        "Jinbo Huang",
        "Kunying Yuan",
        "Yihan Zhao",
        "Guifeng Liu",
        "Qingzhu Zhang",
        "Jing Jiang"
    ],
    "doi": "10.3390/ijms252212030",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/507f671a9b6044de909a559bda80722cf8e8ad4b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Betula pendula ‘Purple Rain’ is characterized by its purple leaves and has ornamental applications. A green mutant line NL, which was mutated by line NZ of B. pendula ‘Purple Rain’ during tissue culture, shows green leaves instead of the typical purple color of B. pendula ‘Purple Rain’. This study quantified the leaf color traits of NL and a normal B. pendula ‘Purple Rain’ line NZ, and uncovered differentially expressed genes involved in flavonoid biosynthesis pathway genes in NL through RNA-Seq analysis. Compared to NZ, reduced levels of six anthocyanins contained in NL were revealed via flavonoids-targeted metabolomics. Sequence mutations in transcription factors that could explain NL’s phenotype failed to be screened via whole-genome resequencing, suggesting an epigenetic basis for this variant. Therefore, a key gene, BpMYB113, was identified in NL via the combined analysis of small RNA sequencing, whole-genome methylation sequencing, and transcriptomics. In NL, this gene features a hyper CHH context methylation site and a lower transcription level compared to NZ, disrupting the expression of downstream genes in the phenylalanine metabolism pathway, and thereby reducing flavonoid biosynthesis. Our study elucidates an epigenetic mechanism underlying color variation in variegated trees, providing pivotal insights for the breeding and propagation of colored-leaf tree species.",
    "citationCount": 2,
    "referenceCount": 58
}