{
    "paperId": "50a4d0fca2316e1d5a24e170117f9e855bf13717",
    "title": "Frequency-Aware Feature Fusion for Dense Image Prediction",
    "year": 2024,
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "authors": [
        "Linwei Chen",
        "Ying Fu",
        "Lin Gu",
        "Chenggang Yan",
        "Tatsuya Harada",
        "Gao Huang"
    ],
    "doi": "10.1109/TPAMI.2024.3449959",
    "arxivId": "2408.12879",
    "url": "https://www.semanticscholar.org/paper/50a4d0fca2316e1d5a24e170117f9e855bf13717",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2408.12879",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dense image prediction tasks demand features with strong category information and precise spatial boundary details at high resolution. To achieve this, modern hierarchical models often utilize feature fusion, directly adding upsampled coarse features from deep layers and high-resolution features from lower levels. In this paper, we observe rapid variations in fused feature values within objects, resulting in intra-category inconsistency due to disturbed high-frequency features. Additionally, blurred boundaries in fused features lack accurate high frequency, leading to boundary displacement. Building upon these observations, we propose Frequency-Aware Feature Fusion (FreqFusion), integrating an Adaptive Low-Pass Filter (ALPF) generator, an offset generator, and an Adaptive High-Pass Filter (AHPF) generator. The ALPF generator predicts spatially-variant low-pass filters to attenuate high-frequency components within objects, reducing intra-class inconsistency during upsampling. The offset generator refines large inconsistent features and thin boundaries by replacing inconsistent features with more consistent ones through resampling, while the AHPF generator enhances high-frequency detailed boundary information lost during downsampling. Comprehensive visualization and quantitative analysis demonstrate that FreqFusion effectively improves feature consistency and sharpens object boundaries. Extensive experiments across various dense prediction tasks confirm its effectiveness.",
    "citationCount": 90,
    "referenceCount": 103
}