{
    "paperId": "50ee579d975756ff9aeceb87d2fc5af627d7c2b1",
    "title": "Konsep Pendidikan Islam di Era Society 5.0 Perspektif Hadist",
    "year": 2024,
    "venue": "Jurnal Pendidikan Agama Islam",
    "authors": [
        "M. S. Hadi",
        "Muhammad Arif Robbani",
        "Taufiqurrahman Siddiq"
    ],
    "doi": "10.58353/jak.v3i01.193",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/50ee579d975756ff9aeceb87d2fc5af627d7c2b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Society 5.0 era where society and more specifically students are required to use technology, world developments are very fast so that advanced technology such as IoT, artificial intelligence, big data can contribute to Islamic education and at the same time help implement the concept of Islamic education. The method used is a qualitative approach in the form of living hadith and library research. This research investigates how the educational values ??in the Tarbawi hadith can be applied and adapted to the context of an increasingly digitally connected era. As a result, the educational values ??in the Tarbawi hadith remain relevant and can be applied in the context of the digital era by making several adaptations. Values ??such as adab, ethics, knowledge, and balance between worldly life and the afterlife need to continue to be applied, taking into account the conditions and challenges faced in a world that is increasingly digitally connected. The use of technology must not only refer to efficiency and convenience, but also to how Islamic values ??can be maintained and practiced in every aspect of life in the era of society 5.0.\n ",
    "citationCount": 0,
    "referenceCount": 48
}