{
    "paperId": "50f4301936abf7eb8f7dbf9906f44ec5ea58fa2a",
    "title": "Influential Billboard Slot Selection using Spatial Clustering and Pruned Submodularity Graph",
    "year": 2023,
    "venue": "Data Science and Engineering",
    "authors": [
        "Dildar Ali",
        "Suman Banerjee",
        "Yamuna Prasad"
    ],
    "doi": "10.48550/arXiv.2305.08949",
    "arxivId": "2305.08949",
    "url": "https://www.semanticscholar.org/paper/50f4301936abf7eb8f7dbf9906f44ec5ea58fa2a",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.08949",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n \n Billboard Advertisement is a popular out-of-home advertising technique adopted by commercial houses. Companies own billboards and offer them to commercial houses on a payment basis. Given a database of billboards with slot information, we want to determine which k slots to choose to maximize the influence. We call this the Influential Billboard Slot Selection (\n \n $$\\textsc {IBSS}$$\n \n IBSS\n \n \n ) Problem and pose it as a combinatorial optimization problem. We show that the influence function considered in this paper is non-negative, monotone, and submodular. The incremental greedy approach based on the marginal gain computation leads to a constant factor approximation guarantee. However, this method scales very poorly when the size of the problem instance is very large. To address this, we propose a spatial partitioning and pruned submodularity graph-based approach divided into the following three steps: pre-processing, pruning, and selection. We analyze the proposed solution approaches to understand their time, space requirements, and performance guarantees. We conduct extensive experiments with real-world datasets and compare the performance of the proposed solution approaches with the available baseline methods. We observe that the proposed approaches lead to more influence than all the baseline methods within a reasonable computational time.",
    "citationCount": 10,
    "referenceCount": 43
}