{
    "paperId": "51294a30cad5d747df455a56a9730d658fc32743",
    "title": "Adaptive Background Matting Using Background Matching",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Jinlin Liu"
    ],
    "doi": "10.48550/arXiv.2203.05193",
    "arxivId": "2203.05193",
    "url": "https://www.semanticscholar.org/paper/51294a30cad5d747df455a56a9730d658fc32743",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2203.05193",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the difficulty of solving the matting problem, lots of methods use some kinds of assistance to acquire high quality alpha matte. Green screen matting methods rely on physical equipment. Trimap-based methods take manual interactions as external input. Background-based methods require a pre-captured, static background. The methods are not flexible and convenient enough to use widely. Trimap-free methods are flexible but not stable in complicated video applications. To be stable and flexible in real applications, we propose an adaptive background matting method. The user first captures their videos freely, moving the cameras. Then the user captures the background video afterwards, roughly covering the previous captured regions. We use dynamic background video instead of static background for accurate matting. The proposed method is convenient to use in any scenes as the static camera and background is no more the limitation. To achieve this goal, we use background matching network to find the best-matched background frame by frame from dynamic backgrounds. Then, robust semantic estimation network is used to estimate the coarse alpha matte. Finally, we crop and zoom the target region according to the coarse alpha matte, and estimate the final accurate alpha matte. In experiments, the proposed method is able to perform comparably against the state-of-the-art matting methods.",
    "citationCount": 1,
    "referenceCount": 34
}