{
    "paperId": "517070cba5beb3086066c7d721a7dd301fa3947d",
    "title": "Software assistants in software engineering: A systematic mapping study",
    "year": 2022,
    "venue": "Software, Practice & Experience",
    "authors": [
        "Maxime Savary-Leblanc",
        "Lola Burgueño",
        "Jordi Cabot",
        "Xavier Le Pallec",
        "S. Gérard"
    ],
    "doi": "10.1002/spe.3170",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/517070cba5beb3086066c7d721a7dd301fa3947d",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/spe.3170",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing essential complexity of software systems makes current software engineering methods and practices fall short in many occasions. Software assistants have the ability to help humans achieve a variety of tasks, including the development of software. Such assistants, which show human‐like competences such as autonomy and intelligence, help software engineers do their job by empowering them with new knowledge. This article investigates the research efforts that have been conducted on the creation of assistants for software design, construction and maintenance paying special attention to the user‐assistant interactions. To this end, we followed the standard systematic mapping study method to identify and classify relevant works in the state of the art. Out of the 7580 articles resulting from the automatic search, we identified 112 primary studies that present works which qualify as software assistants. We provide all the resources needed to reproduce our study. We report on the trends and goals of the assistants, the tasks they perform, how they interact with users, the technologies and mechanisms they exploit to embed intelligence and provide knowledge, and their level of automation. We propose a classification of software assistants based on interactions and present an analysis of the different automation patterns. As outcomes of our study, we provide a classification of software assistants dealing with the design, construction and maintenance phases of software development, we discuss the results, identify open lines of work and challenges and call for new innovative and rigorous research efforts in this field.",
    "citationCount": 18,
    "referenceCount": 189
}