{
    "paperId": "517f8f11ee266edfceac2d131738881b20a356d5",
    "title": "Performance and accuracy assessments of an incompressible fluid solver coupled with a deep convolutional neural network",
    "year": 2021,
    "venue": "Data-Centric Engineering",
    "authors": [
        "Ekhi Ajuria Illarramendi",
        "M. Bauerheim",
        "B. Cuenot"
    ],
    "doi": "10.1017/dce.2022.2",
    "arxivId": "2109.09363",
    "url": "https://www.semanticscholar.org/paper/517f8f11ee266edfceac2d131738881b20a356d5",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/8BBFEBD61125921CB05EB2E076A4686F/S2632673622000028a.pdf/div-class-title-performance-and-accuracy-assessments-of-an-incompressible-fluid-solver-coupled-with-a-deep-convolutional-neural-network-div.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract The resolution of the Poisson equation is usually one of the most computationally intensive steps for incompressible fluid solvers. Lately, DeepLearning, and especially convolutional neural networks (CNNs), has been introduced to solve this equation, leading to significant inference time reduction at the cost of a lack of guarantee on the accuracy of the solution.This drawback might lead to inaccuracies, potentially unstable simulations and prevent performing fair assessments of the CNN speedup for different network architectures. To circumvent this issue, a hybrid strategy is developed, which couples a CNN with a traditional iterative solver to ensure a user-defined accuracy level. The CNN hybrid method is tested on two flow cases: (a) the flow around a 2D cylinder and (b) the variable-density plumes with and without obstacles (both 2D and 3D), demonstrating remarkable generalization capabilities, ensuring both the accuracy and stability of the simulations. The error distribution of the predictions using several network architectures is further investigated in the plume test case. The introduced hybrid strategy allows a systematic evaluation of the CNN performance at the same accuracy level for various network architectures. In particular, the importance of incorporating multiple scales in the network architecture is demonstrated, since improving both the accuracy and the inference performance compared with feedforward CNN architectures. Thus, in addition to the pure networks’ performance evaluation, this study has also led to numerous guidelines and results on how to build neural networks and computational strategies to predict unsteady flows with both accuracy and stability requirements.",
    "citationCount": 22,
    "referenceCount": 104
}