{
    "paperId": "51853078cf9b1a2d78d2d4af44fb4e4e448d3135",
    "title": "On EDA Solutions for Reconfigurable Memory-Centric AI Edge Applications",
    "year": 2020,
    "venue": "2020 IEEE/ACM International Conference On Computer Aided Design (ICCAD)",
    "authors": [
        "Hung-Ming Chen",
        "Chia-Lin Hu",
        "Kang-Yu Chang",
        "Alexandra Küster",
        "Yu-Hsien Lin",
        "Po-Shen Kuo",
        "Wei-Tung Chao",
        "B. Lai",
        "C. Liu",
        "S. Jou"
    ],
    "doi": "10.1145/3400302.3415772",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/51853078cf9b1a2d78d2d4af44fb4e4e448d3135",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Memory-centric designs deploy computation to storage and enable efficient in-memory computation while avoiding massive amount of data movement. The in-memory-computing schemes have shown distinct advantages and concerns when applying to different types of memory technologies, from conventional SRAM, DRAM to emerging ReRAM. Moreover, the next-generation smart edge systems are expected to support various intelligent applications by employing multi-task machine learning models which would be dynamically activated. To attain an efficient design within short design cycle, it is imperative to have an integrated design framework with automated tools to support hybrid memory systems and perform effective optimization across design stages. This work will introduce a unified framework which integrates EDA solutions to address the design and optimization challenges at different aspects of next-generation memory-centric designs, including fast reconfiguring in-memory/near-memory computing designs to provide optimized solutions (behavioral models and APR cell layouts) for designers to choose the best suitable architectures for their applications.",
    "citationCount": 5,
    "referenceCount": 15
}