{
    "paperId": "51ad0ec6eede7a725d695afd9fb644457ab4db9b",
    "title": "Mapple: A Domain-Specific Language for Mapping Distributed Heterogeneous Parallel Programs",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Anjiang Wei",
        "Rohan Yadav",
        "Hang Song",
        "Wonchan Lee",
        "Ke Wang",
        "Alex Aiken"
    ],
    "doi": "10.48550/arXiv.2507.17087",
    "arxivId": "2507.17087",
    "url": "https://www.semanticscholar.org/paper/51ad0ec6eede7a725d695afd9fb644457ab4db9b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimizing parallel programs for distributed heterogeneous systems remains a complex task, often requiring significant code modifications. Task-based programming systems improve modularity by separating performance decisions from core application logic, but their mapping interfaces are often too low-level. In this work, we introduce Mapple, a high-level, declarative programming interface for mapping distributed applications. Mapple provides transformation primitives to resolve dimensionality mismatches between iteration and processor spaces, including a key primitive, decompose, that helps minimize communication volume. We implement Mapple on top of the Legion runtime by translating Mapple mappers into its low-level C++ interface. Across nine applications, including six matrix multiplication algorithms and three scientific computing workloads, Mapple reduces mapper code size by 14X and enables performance improvements of up to 1.34X over expert-written C++ mappers. In addition, the decompose primitive achieves up to 1.83X improvement over existing dimensionality-resolution heuristics. These results demonstrate that Mapple simplifies the development of high-performance mappers for distributed applications.",
    "citationCount": 2,
    "referenceCount": 67
}