{
    "paperId": "51c818da1ffef3e703ab1f5143c9b9ddfd820412",
    "title": "RobustScaler: QoS-Aware Autoscaling for Complex Workloads",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Huajie Qian",
        "Qingsong Wen",
        "Liang Sun",
        "Jing Gu",
        "Qi Niu",
        "Zhimin Tang"
    ],
    "doi": "10.48550/arXiv.2204.07197",
    "arxivId": "2204.07197",
    "url": "https://www.semanticscholar.org/paper/51c818da1ffef3e703ab1f5143c9b9ddfd820412",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2204.07197",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Autoscaling is a critical component for efficient resource utilization with satisfactory quality of service (QoS) in cloud computing. This paper investigates proactive autoscaling for widely-used scaling-per-query applications where scaling is required for each query, such as container registry and function-as-a-service (FaaS). In these scenarios, the workload often exhibits high uncertainty with complex temporal patterns like periodicity, noises and outliers. Conservative strategies that scale out unnecessarily many instances lead to high resource costs whereas aggressive strategies may result in poor QoS. We present RobustScaler to achieve superior trade-off between cost and QoS. Specifically, we design a novel autoscaling framework based on non-homogeneous Poisson processes (NHPP) modeling and stochastically constrained optimization. Furthermore, we develop a specialized alternating direction method of multipliers (ADMM) to efficiently train the NHPP model, and rigorously prove the QoS guarantees delivered by our optimization-based proactive strategies. Extensive experiments show that RobustScaler out-performs common baseline autoscaling strategies in various real-world traces, with large margins for complex workload patterns.",
    "citationCount": 25,
    "referenceCount": 55
}