{
    "paperId": "51e2aaa9a4e477e6fec52c9c4fb79efdfd575d63",
    "title": "PFVnet, a feature enhancement network for low recognition coal and rock images",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Cai Han",
        "Zhenwen Liu",
        "Shenglei Zhao",
        "Yubo Li",
        "Yanwei Duan",
        "Xinzhou Yang",
        "Chuanbo Hao"
    ],
    "doi": "10.1038/s41598-025-00016-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/51e2aaa9a4e477e6fec52c9c4fb79efdfd575d63",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-025-00016-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The existing coal-rock identification technology based on machine vision makes it difficult to accurately identify coal-rock images with low distinguishability. To solve this problem, a special coal-rock environment simulation experimental device was used to conduct simulations, considering various influencing factors such as illumination, air flow, coal dust, and water mist concentration. We characterized the grayscale and texture feature patterns of coal-rock media under varying degrees of interference and established a comprehensive multi-element image training sample library. The simulation experiment results show that illumination, dust, and fog can reduce the distinguishability of coal-rock images, which seriously affects the recognition performance of the network. Based on this, the convolution operation was combined with the Vision Transformer network and the deep convolution algorithm was applied to design a parallel hybrid vision network model, PFVnet. Subsequently, enhanced recognition tests were carried out in combination with the DeepLabV3 + network. The test results show that PFVnet can enhance the features of coal and rock, and achieve a PSNR of 18.90 and an SSIM of 0.58 on the multi-element image training sample library. It can effectively reduce the misjudgment of the DeepLabV3 + network, increasing its accuracy by 0.95%, the mean Intersection over Union (mIoU) by 2.15%, and the mean Pixel Accuracy (mPA) by 2.12%. This research provides new ideas and feasible technical solutions for the improvement of coal-rock identification technology and helps to promote the development of this field.",
    "citationCount": 0,
    "referenceCount": 17
}