{
    "paperId": "51f0c3b06861c79fbb283022df109818ce4ebe51",
    "title": "Unleashing the Power of Data Tsunami: A Comprehensive Survey on Data Assessment and Selection for Instruction Tuning of Language Models",
    "year": 2024,
    "venue": "Trans. Mach. Learn. Res.",
    "authors": [
        "Yulei Qin",
        "Yuncheng Yang",
        "Pengcheng Guo",
        "Gang Li",
        "Hang Shao",
        "Yuchen Shi",
        "Zihan Xu",
        "Yun Gu",
        "Ke Li",
        "Xing Sun"
    ],
    "doi": "10.48550/arXiv.2408.02085",
    "arxivId": "2408.02085",
    "url": "https://www.semanticscholar.org/paper/51f0c3b06861c79fbb283022df109818ce4ebe51",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Instruction tuning plays a critical role in aligning large language models (LLMs) with human preference. Despite the vast amount of open instruction datasets, naively training a LLM on all existing instructions may not be optimal and practical. To pinpoint the most beneficial datapoints, data assessment and selection methods have been proposed in the fields of natural language processing (NLP) and deep learning. However, under the context of instruction tuning, there still exists a gap in knowledge on what kind of data evaluation metrics can be employed and how they can be integrated into the selection mechanism. To bridge this gap, we present a comprehensive review on existing literature of data assessment and selection especially for instruction tuning of LLMs. We systematically categorize all applicable methods into quality-based, diversity-based, and importance-based ones where a unified, fine-grained taxonomy is structured. For each category, representative methods are elaborated to describe the landscape of relevant research. In addition, comparison between the latest methods is conducted on their officially reported results to provide in-depth discussions on their limitations. Finally, we summarize the open challenges and propose the promosing avenues for future studies. All related contents are available at https://github.com/yuleiqin/fantastic-data-engineering.",
    "citationCount": 19,
    "referenceCount": 387
}