{
    "paperId": "520694ce338f4e418270d66dc3cc6a5872b8b451",
    "title": "Ship Speed Optimization Method in Canal Environments Considering Waiting Times for Crossing Locks",
    "year": 2024,
    "venue": "Journal of Marine Science and Engineering",
    "authors": [
        "Wen Xie",
        "Sudong Xu",
        "Nini Zhang",
        "Jun Liu",
        "Kai Yin",
        "Liuyan Mao"
    ],
    "doi": "10.3390/jmse12030375",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/520694ce338f4e418270d66dc3cc6a5872b8b451",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The shipping industry faces a pressing challenge with carbon emissions, prompting a focus on speed optimization for energy conservation and emission reduction. While much research has centered on optimizing speeds in oceans and rivers, canals have received less attention, despite their unique challenges of narrow waterways and busy locks. This study fills this gap by establishing a fuel consumption prediction model integrating key environmental factors such as water depth, width, and flow velocity. Drawing upon established methodologies in speed optimization, this study augments these models with waiting time limits for each canal segment. To validate the efficacy of the model, three representative ships are selected as case studies. The findings reveal a high predictive capability of the fuel consumption model, as evidenced by R2 values exceeding 0.97 across all cases. Notably, the optimization approach yields a fuel consumption reduction ranging from 4% to 5% for short waiting times. Furthermore, compared to conventional methods, the proposed optimization strategy achieves an 8.19% enhancement in fuel consumption and carbon emission reduction for long waiting times, culminating in an overall optimization rate of 11.54%. These results underscore the significance of employing the proposed speed optimization methodology, particularly during peak periods of canal congestion.",
    "citationCount": 4,
    "referenceCount": 36
}