{
    "paperId": "52281d6445b9a1f119a49e39d68854206796d396",
    "title": "A design space for RDF data representations",
    "year": 2022,
    "venue": "The VLDB journal",
    "authors": [
        "Tomer Sagi",
        "Matteo Lissandrini",
        "T. Pedersen",
        "K. Hose"
    ],
    "doi": "10.1007/s00778-021-00725-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/52281d6445b9a1f119a49e39d68854206796d396",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00778-021-00725-x.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "RDF triplestores’ ability to store and query knowledge bases augmented with semantic annotations has attracted the attention of both research and industry. A multitude of systems offer varying data representation and indexing schemes. However, as recently shown for designing data structures, many design choices are biased by outdated considerations and may not result in the most efficient data representation for a given query workload. To overcome this limitation, we identify a novel three-dimensional design space. Within this design space, we map the trade-offs between different RDF data representations employed as part of an RDF triplestore and identify unexplored solutions. We complement the review with an empirical evaluation of ten standard SPARQL benchmarks to examine the prevalence of these access patterns in synthetic and real query workloads. We find some access patterns, to be both prevalent in the workloads and under-supported by existing triplestores. This shows the capabilities of our model to be used by RDF store designers to reason about different design choices and allow a (possibly artificially intelligent) designer to evaluate the fit between a given system design and a query workload.",
    "citationCount": 23,
    "referenceCount": 96
}