{
    "paperId": "5241c59d9bb04eb00f2b27793f011f891d0c8470",
    "title": "Unlocking the power of AI models: exploring protein folding prediction through comparative analysis",
    "year": 2024,
    "venue": "Journal of Integrative Bioinformatics",
    "authors": [
        "Paloma Tejera-Nevado",
        "Emilio Serrano",
        "Ana González-Herrero",
        "Rodrigo Bermejo-Moreno",
        "Alejandro Rodríguez González"
    ],
    "doi": "10.1515/jib-2023-0041",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5241c59d9bb04eb00f2b27793f011f891d0c8470",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.degruyter.com/document/doi/10.1515/jib-2023-0041/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Protein structure determination has made progress with the aid of deep learning models, enabling the prediction of protein folding from protein sequences. However, obtaining accurate predictions becomes essential in certain cases where the protein structure remains undescribed. This is particularly challenging when dealing with rare, diverse structures and complex sample preparation. Different metrics assess prediction reliability and offer insights into result strength, providing a comprehensive understanding of protein structure by combining different models. In a previous study, two proteins named ARM58 and ARM56 were investigated. These proteins contain four domains of unknown function and are present in Leishmania spp. ARM refers to an antimony resistance marker. The study’s main objective is to assess the accuracy of the model’s predictions, thereby providing insights into the complexities and supporting metrics underlying these findings. The analysis also extends to the comparison of predictions obtained from other species and organisms. Notably, one of these proteins shares an ortholog with Trypanosoma cruzi and Trypanosoma brucei, leading further significance to our analysis. This attempt underscored the importance of evaluating the diverse outputs from deep learning models, facilitating comparisons across different organisms and proteins. This becomes particularly pertinent in cases where no previous structural information is available.",
    "citationCount": 0,
    "referenceCount": 35
}