{
    "paperId": "525989aece33c6a6abb41bca1935781144efad15",
    "title": "NLP-Driven Academic Research Management: A Catalyst for Organizational Research Information Retrieval",
    "year": 2025,
    "venue": "Journal of Information Systems Engineering & Management",
    "authors": [
        "Dr.M. Madhu Bala",
        "K. Akanksha",
        "Pooja Jain",
        "K. Gayatri",
        "L. S. Prasad"
    ],
    "doi": "10.52783/jisem.v10i30s.4781",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/525989aece33c6a6abb41bca1935781144efad15",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.52783/jisem.v10i30s.4781",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The expeditious increase in research activities has resulted in the publication of a colossal amount of articles, papers, and journals authored by various researchers from diverse fields. The paper aims to build an efficient search engine that skilfully retrieves bibliographic information. The authorship recognition is critical in identifying the author for the given organization or institute and tracing out their contributions. This research acts as a catalyst to efficiently provide authors’ and organization’s contributions in the area of research in a systematic order. It involves the use of API scraping to extract data from websites and the application of data pre-processing techniques to facilitate data cleaning while a keyword-based matching method was employed to retrieve information based on context, the similarity is computed to know the relevance between the user query and the results given. The search engine is designed to aid in authorship recognition, enabling the identification of authors affiliated with specific organizations or institutes also while presenting their contributions to the field of research. The search engine successfully utilizes API scraping, pre-processing, and Natural Language Processing to efficiently retrieve bibliographic information enabling simplified access to relevant research information, becoming a valuable tool for institutes and organizations",
    "citationCount": 0,
    "referenceCount": 20
}