{
    "paperId": "52677adf64e307d56a7a4536ee1c4cab68c4cd4b",
    "title": "Cross-Transportation-Mode Knowledge Transfer for Trajectory Recovery With Meta Learning",
    "year": 2025,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Chenxing Wang",
        "Fang Zhao",
        "Haiyong Luo",
        "P. Z. Sun",
        "Yuchen Fang"
    ],
    "doi": "10.1109/TITS.2025.3537038",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/52677adf64e307d56a7a4536ee1c4cab68c4cd4b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Transportation mode-aware trajectory recovery is the fundamental for individual oriented downstream tasks in intelligent transportation systems. Different from vehicle based trajectory recovery, it suffers from the heterogeneity and sparsity issues arising from the insufficient data labelled for distinct transportation modes (e.g., obtaining limited individual trajectories from modes like walking or cycling due to privacy concerns while obtaining rich vehicle trajectories from the mode like driving). To alleviate this, we develop a novel Cross-trAnsportation-mode Knowledge transfEr method with meta learning, coined as Cake, to first learn generalized parameters from source modes (i.e., the relatively dense modes) and then share the meta knowledge with the targets (i.e., more sparse modes), which significantly improve the recovery performance for the sparse. To achieve this, we first develop an efficient fine-GRAined Personalized trajectory rEcovery model called Grape, to incorporate the cross-granularity features with coarse-centered and fine-centered subgraph learning and learn the intrinsic characteristics of transportation modes with auto-correlation efficiently. Then we design a personalized memory to store distinct parameters for diverse interests of individual groups and read the memory for predictor’s input features according to the previous learnt features. At last, we employ the feature reuse strategy based on meta learning to iteratively make adaptions from the source to the target. Extensive experimental results on real-world dataset demonstrate that our proposed method significantly outperforms the state-of-arts for the sparse modes.",
    "citationCount": 0,
    "referenceCount": 54
}