{
    "paperId": "52883e3e32cb463237fbed98b1733adee93a87c5",
    "title": "Chromatin context-dependent effects of epigenetic drugs on CRISPR-Cas9 editing",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "R. Schep",
        "Max Trauernicht",
        "B. Morris",
        "Xabier Vergara",
        "R. Beijersbergen",
        "B. Steensel"
    ],
    "doi": "10.1093/nar/gkae570",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/52883e3e32cb463237fbed98b1733adee93a87c5",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/nar/advance-article-pdf/doi/10.1093/nar/gkae570/58478598/gkae570.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The efficiency and outcome of CRISPR/Cas9 editing depends on the chromatin state at the cut site. It has been shown that changing the chromatin state can influence both the efficiency and repair outcome, and epigenetic drugs have been used to improve Cas9 editing. However, because the target proteins of these drugs are not homogeneously distributed across the genome, the efficacy of these drugs may be expected to vary from locus to locus. Here, we systematically analyzed this chromatin context-dependency for 160 epigenetic drugs. We used a human cell line with 19 stably integrated reporters to induce a double-stranded break (DSB) in different chromatin environments. We then measure Cas9 editing efficiency and repair pathway usage by sequencing the mutational signatures. We identified 67 drugs that modulate Cas9 editing efficiency and/or repair outcome dependent on the local chromatin environment. For example, we find a subset of histone deacetylase inhibitors that improve Cas9 editing efficiency throughout all types of heterochromatin (e.g., PCI-24781), while others were only effective in H3K27me3-marked regions (e.g., Vorinostat). In summary, this study reveals that most epigenetic drugs alter CRISPR editing in a chromatin-dependent manner, and provides a detailed guide to improve Cas9 editing more selectively at the desired location. HIGHLIGHTS A screen identifies dozens of drugs that alter Cas9 editing in a chromatin context-dependent manner Many HDAC inhibitors boost Cas9 editing efficiency throughout all types of heterochromatin The DNMT inhibitor Decitabine completely blocks resection-dependent repair across the genome",
    "citationCount": 6,
    "referenceCount": 79
}