{
    "paperId": "52933817fd102120c845247e7f43975bfc3f32db",
    "title": "Fixed-Point Automatic Differentiation of Forward-Backward Splitting Algorithms for Partly Smooth Functions",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Sheheryar Mehmood",
        "Peter Ochs"
    ],
    "doi": "10.48550/arXiv.2208.03107",
    "arxivId": "2208.03107",
    "url": "https://www.semanticscholar.org/paper/52933817fd102120c845247e7f43975bfc3f32db",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2208.03107",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A large class of non-smooth practical optimization problems can be written as minimization of a sum of smooth and partly smooth functions. We examine such structured problems which also depend on a parameter vector and study the problem of differentiating its solution mapping with respect to the parameter which has far reaching applications in sensitivity analysis and parameter learning problems. Under partial smoothness and other mild assumptions, we apply Implicit (ID) and Automatic Differentiation (AD) to the fixed-point iterations of proximal splitting algorithms. We show that AD of the sequence generated by these algorithms converges (linearly under further assumptions) to the derivative of the solution mapping. For a variant of automatic differentiation, which we call Fixed-Point Automatic Differentiation (FPAD), we remedy the memory overhead problem of the Reverse Mode AD and moreover provide faster convergence theoretically. We numerically illustrate the convergence and convergence rates of AD and FPAD on Lasso and Group Lasso problems and demonstrate the working of FPAD on prototypical image denoising problems by learning the regularization term.",
    "citationCount": 3,
    "referenceCount": 92
}