{
    "paperId": "529a51793857fc95fb6e5cd2a42be33a4fbbc763",
    "title": "Members Testing based Data Analysis with Structuring Query Processing using Deep Learning Techniques",
    "year": 2025,
    "venue": "2025 2nd International Conference on Research Methodologies in Knowledge Management, Artificial Intelligence and Telecommunication Engineering (RMKMATE)",
    "authors": [
        "R. Jeevitha",
        "L. Ramesh"
    ],
    "doi": "10.1109/RMKMATE64874.2025.11042788",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/529a51793857fc95fb6e5cd2a42be33a4fbbc763",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rate at which data is created is extraordinary and beyond our capacity for analysis. Finding the precise solution by searching through all of the data is frequently impractical in real-world situations. Because of this, Approximate Query Processing (AQP), which finds an approximate answer quickly at the expense of a little amount of accuracy, is becoming quite popular. This research proposes novel technique query processing with structuring-based data analysis and member testing by deep learning model. The query processing with structuring based data analysis has been carried out using adversarial VGG-16 kernel vector perceptron neural network and member testing analysis using binary grey swarm colony optimization. Proposed method of enhancing traditional database query processing by leveraging deep learning techniques to extract meaningful structure from complex or unstructured data, allowing for more accurate and insightful analysis, particularly when dealing with large datasets where traditional methods might struggle to identify patterns effectively. Experimental analysis has been carried out in terms of detection accuracy, mean precision, QUERY PROCESSING TIME, scalability, convergence efficiency. Proposed technique Mean precision 95%, CONVERGENCE EFFICIENCY 93%, SCALABILITY 97%, detection accuracy 96%, QUERY PROCESSING TIME 93%.",
    "citationCount": 0,
    "referenceCount": 18
}