{
    "paperId": "529e7cc11ddff87638227f7ad67f061600f620ba",
    "title": "CARE: Contextual Adaptation of Recommenders for LLM-based Conversational Recommendation",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Chuang Li",
        "Yang Deng",
        "Hengchang Hu",
        "See-Kiong Ng",
        "Min-Yen Kan",
        "Haizhou Li"
    ],
    "doi": "10.48550/arXiv.2508.13889",
    "arxivId": "2508.13889",
    "url": "https://www.semanticscholar.org/paper/529e7cc11ddff87638227f7ad67f061600f620ba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We tackle the challenge of integrating large language models (LLMs) with external recommender systems to enhance domain expertise in conversational recommendation (CRS). Current LLM-based CRS approaches primarily rely on zero- or few-shot methods for generating item recommendations based on user queries, but this method faces two significant challenges: (1) without domain-specific adaptation, LLMs frequently recommend items not in the target item space, resulting in low recommendation accuracy; and (2) LLMs largely rely on dialogue context for content-based recommendations, neglecting the collaborative relationships among entities or item sequences. To address these limitations, we introduce the CARE (Contextual Adaptation of Recommenders) framework. CARE customizes LLMs for CRS tasks, and synergizes them with external recommendation systems. CARE (a) integrates external recommender systems as domain experts, producing recommendations through entity-level insights, and (b) enhances those recommendations by leveraging contextual information for more accurate and unbiased final recommendations using LLMs. Our results demonstrate that incorporating external recommender systems with entity-level information significantly enhances recommendation accuracy of LLM-based CRS by an average of 54% and 25% for ReDial and INSPIRED datasets. The most effective strategy in the CARE framework involves LLMs selecting and reranking candidate items that external recommenders provide based on contextual insights. Our analysis indicates that the CARE framework effectively addresses the identified challenges and mitigates the popularity bias in the external recommender.",
    "citationCount": 0,
    "referenceCount": 48
}