{
    "paperId": "52fb310e8b90f2120cf04a5bc6c96c4b41918409",
    "title": "The Role of Image Processing and Deep Learning in IoT-Based Systems: A Comprehensive Review",
    "year": 2025,
    "venue": "European Journal of Applied Science, Engineering and Technology",
    "authors": [
        "Isamadeen A. Khalifa",
        "Faris Keti"
    ],
    "doi": "10.59324/ejaset.2025.3(1).15",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/52fb310e8b90f2120cf04a5bc6c96c4b41918409",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rates at which IoT is expanding are tremendous, literally touching our daily life experiences through various applications such as smart city, healthcare, agriculture and industrial automation among-couple others. From amongst a number of diverse types of data produced by IoT devices, image data has risen to the forefront as one of the most useful tools for real-time identification and decision making. The critical contribution of image processing and deep learning in improving IoT systems are discussed in this paper. Image acquisition, preprocessing, segmentation and feature extraction procedures form the basis for acquiring significant information from raw imagery data. The deep learning approaches such as CNNs, RNNs, transfer learning, makes classification feature extraction, object detection more accurate fully automated. These technologies have been incorporated and used in traffic monitoring application, medical diagnosis, environmental monitoring, and fault diagnosis in industries. Nonetheless, issues of resource availability, temporal delay and data security act as barriers to the adoption of microservices especially in the edges and fogs of computing. To overcome these constraints, enhancement on lightweight deep Learning, Edge AI and privacy protection methodologies are being advanced for efficient, secure and real time performance. Hence, such trends as federated learning and 5G technologies can also define the future of image processing based on IoT systems. This paper systematically and critically reviews recent advances towards the application of image processing and deep learning on IoT based architectures by providing insight into its profile, challenges and future trends. It is meant to guide researchers and industry experts who are working on building smarter scalable and efficient IoT systems.",
    "citationCount": 1,
    "referenceCount": 84
}