{
    "paperId": "530938f8cfbb3de745b36bf1527a3711ca63c81d",
    "title": "Forbidden Subgraph Problems with Predictions",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Hans-Joachim Böckenhauer",
        "Melvin Jahn",
        "D. Komm",
        "Moritz Stocker"
    ],
    "doi": "10.48550/arXiv.2501.14537",
    "arxivId": "2501.14537",
    "url": "https://www.semanticscholar.org/paper/530938f8cfbb3de745b36bf1527a3711ca63c81d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the Online Delayed Connected H-Node-Deletion Problem, an unweighted graph is revealed vertex by vertex and it must remain free of any induced copies of a specific connected induced forbidden subgraph H at each point in time. To achieve this, an algorithm must, upon each occurrence of H, identify and irrevocably delete one or more vertices. The objective is to delete as few vertices as possible. We provide tight bounds on the competitive ratio for forbidden subgraphs H that do not contain two true twins or that do not contain two false twins. We further consider the problem within the model of predictions, where the algorithm is provided with a single bit of advice for each revealed vertex. These predictions are considered to be provided by an untrusted source and may be incorrect. We present a family of algorithms solving the Online Delayed Connected H-Node-Deletion Problem with predictions and show that it is Pareto-optimal with respect to competitivity and robustness for the online vertex cover problem for 2-connected forbidden subgraphs that do not contain two true twins or that do not contain two false twins, as well as for forbidden paths of length greater than four. We also propose subgraphs for which a better algorithm might exist.",
    "citationCount": 0,
    "referenceCount": 15
}