{
    "paperId": "5345da0c9b20ca534b3eadf5ae764e513359cb5a",
    "title": "Revisiting Data Prefetching for Database Systems with Machine Learning Techniques",
    "year": 2021,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Yu Chen",
        "Yong Zhang",
        "Jiacheng Wu",
        "Jin Wang",
        "Chunxiao Xing"
    ],
    "doi": "10.1109/ICDE51399.2021.00218",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5345da0c9b20ca534b3eadf5ae764e513359cb5a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Among diverse parts in database systems, database prefetching, which aims at predicting future page access patterns and fetching pages to be accessed ahead of time to mitigate blocked I/O operations, plays a crucial role in the overall performance tuning. Existing approaches just use simple heuristic-based methods and suffer from the low hit rate and extra I/O overhead. Recently, with the emerging success of machine learning in different applications, attempts using learning-based models to augment or improve components for database systems have shed some light on this tough problem. Impressed by the enormous potential of machine learning in data management, we present an end-to-end deep learning-based framework to predict page access patterns. We model the prediction of page access as a classification problem and evaluate several variants of neural networks on the accuracy of prediction. On the basis of it, we propose a new Multi-Model framework to construct an accurate model for prefetching. On a suite of real-world database benchmarks, our neural network based prefetching model consistently outperforms existing widely used solutions in real-world database systems.",
    "citationCount": 4,
    "referenceCount": 14
}