{
    "paperId": "535f0d6892bd0ac9e4ef695a657db1e46e62dca7",
    "title": "TransMatting: Tri-token Equipped Transformer Model for Image Matting",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Huanqia Cai",
        "Fanglei Xue",
        "Lele Xu",
        "Lili Guo"
    ],
    "doi": "10.48550/arXiv.2303.06476",
    "arxivId": "2303.06476",
    "url": "https://www.semanticscholar.org/paper/535f0d6892bd0ac9e4ef695a657db1e46e62dca7",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2303.06476",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image matting aims to predict alpha values of elaborate uncertainty areas of natural images, like hairs, smoke, and spider web. However, existing methods perform poorly when faced with highly transparent foreground objects due to the large area of uncertainty to predict and the small receptive field of convolutional networks. To address this issue, we propose a Transformer-based network (TransMatting) to model transparent objects with long-range features and collect a high-resolution matting dataset of transparent objects (Transparent-460) for performance evaluation. Specifically, to utilize semantic information in the trimap flexibly and effectively, we also redesign the trimap as three learnable tokens, named tri-token. Both Transformer and convolution matting models could benefit from our proposed tri-token design. By replacing the traditional trimap concatenation strategy with our tri-token, existing matting methods could achieve about 10% improvement in SAD and 20% in MSE. Equipped with the new tri-token design, our proposed TransMatting outperforms current state-of-the-art methods on several popular matting benchmarks and our newly collected Transparent-460.",
    "citationCount": 3,
    "referenceCount": 53
}