{
    "paperId": "536b9296f9f02048241645ec72bba8ad02d3cff9",
    "title": "Meta-Learning Adversarial Bandits",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Maria-Florina Balcan",
        "Keegan Harris",
        "M. Khodak",
        "Zhiwei Steven Wu"
    ],
    "doi": "10.48550/arXiv.2205.14128",
    "arxivId": "2205.14128",
    "url": "https://www.semanticscholar.org/paper/536b9296f9f02048241645ec72bba8ad02d3cff9",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2205.14128",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study online learning with bandit feedback across multiple tasks, with the goal of improving average performance across tasks if they are similar according to some natural task-similarity measure. As the first to target the adversarial setting, we design a unified meta-algorithm that yields setting-specific guarantees for two important cases: multi-armed bandits (MAB) and bandit linear optimization (BLO). For MAB, the meta-algorithm tunes the initialization, step-size, and entropy parameter of the Tsallis-entropy generalization of the well-known Exp3 method, with the task-averaged regret provably improving if the entropy of the distribution over estimated optima-in-hindsight is small. For BLO, we learn the initialization, step-size, and boundary-offset of online mirror descent (OMD) with self-concordant barrier regularizers, showing that task-averaged regret varies directly with a measure induced by these functions on the interior of the action space. Our adaptive guarantees rely on proving that unregularized follow-the-leader combined with multiplicative weights is enough to online learn a non-smooth and non-convex sequence of affine functions of Bregman divergences that upper-bound the regret of OMD.",
    "citationCount": 7,
    "referenceCount": 40
}