{
    "paperId": "53ad4b59dbef3ca2ab3e8a4e26827c27a18b5664",
    "title": "Application of Face Recognition Algorithm Based on Deep Learning in Artificial Intelligence Security System",
    "year": 2025,
    "venue": "2025 5th Asia-Pacific Conference on Communications Technology and Computer Science (ACCTCS)",
    "authors": [
        "Richard Ma"
    ],
    "doi": "10.1109/ACCTCS66275.2025.00173",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/53ad4b59dbef3ca2ab3e8a4e26827c27a18b5664",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To tackle the problem of inaccurate face recognition in complex environments within the traditional security area, a face recognition algorithm relying on deep learning is brought in to increase the precision of face recognition in such complex circumstances. This paper delves into the basic principles of deep learning, applies the face recognition algorithm, and devises experiments to assess the algorithm's performance. The algorithm is capable of efficiently dealing with complex situations like lighting alterations, various facial poses, and obstructions, strengthening the practicality and trustworthiness of artificial intelligence security systems, and conducting a comprehensive and indepth verification of the recognition performance of the proposed algorithm in complex situations including notable lighting changes, abundant and diverse facial poses, and obstructions. The experimental results reveal that the algorithm can keep a high recognition accuracy rate in all sorts of complex environments, reaching up to 89%; the false recognition rate and rejection rate can be as low as 0%. This indicates that the face recognition algorithm using deep learning has outstanding performance in artificial intelligence security systems and can fulfill the security protection requirements in complex environments.",
    "citationCount": 0,
    "referenceCount": 18
}