{
    "paperId": "53cd10b135da7673bbff8933a5b5fff8a5e7cfd4",
    "title": "Teaching Networks to Solve Optimization Problems",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Xinran Liu",
        "Yuzhe Lu",
        "Ali Abbasi",
        "Meiyi Li",
        "J. Mohammadi",
        "Soheil Kolouri"
    ],
    "doi": "10.1109/ACCESS.2024.3358724",
    "arxivId": "2202.04104",
    "url": "https://www.semanticscholar.org/paper/53cd10b135da7673bbff8933a5b5fff8a5e7cfd4",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10414092.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Leveraging machine learning to facilitate the optimization process is an emerging field that holds the promise to bypass the fundamental computational bottleneck caused by classic iterative solvers in critical applications requiring near-real-time optimization. The majority of existing approaches focus on learning data-driven optimizers that lead to fewer iterations in solving an optimization. In this paper, we take a different approach and propose to replace the iterative solvers altogether with a trainable parametric set function, that outputs the optimal arguments/parameters of an optimization problem in a single feed forward. We denote our method as Learning to Optimize the Optimization Process ( ${\\mathcal{LOOP}}$ ). We show the feasibility of learning such parametric (set) functions to solve various classic optimization problems including linear/nonlinear regression, principal component analysis, transport-based coreset, and quadratic programming in supply management applications. In addition, we propose two alternative approaches for learning such parametric functions, with and without a solver in the ${\\mathcal{LOOP}}$ . Finally, through various numerical experiments, we show that the trained solvers could be orders of magnitude faster than the classic iterative solvers while providing near optimal solutions.",
    "citationCount": 12,
    "referenceCount": 43
}