{
    "paperId": "54107eb46d2aa02daab982c2182335afa02df9b4",
    "title": "Comparing Differentiable Logics for Learning Systems: A Research Preview",
    "year": 2023,
    "venue": "FMAS@iFM",
    "authors": [
        "Thomas Flinkow",
        "Barak A. Pearlmutter",
        "Rosemary Monahan"
    ],
    "doi": "10.4204/EPTCS.395.3",
    "arxivId": "2311.09809",
    "url": "https://www.semanticscholar.org/paper/54107eb46d2aa02daab982c2182335afa02df9b4",
    "isOpenAccess": true,
    "openAccessPdf": "https://eptcs.web.cse.unsw.edu.au/paper.cgi?FMAS2023.3.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Extensive research on formal verification of machine learning (ML) systems indicates that learning from data alone often fails to capture underlying background knowledge. A variety of verifiers have been developed to ensure that a machine-learnt model satisfies correctness and safety properties, however, these verifiers typically assume a trained network with fixed weights. ML-enabled autonomous systems are required to not only detect incorrect predictions, but should also possess the ability to self-correct, continuously improving and adapting. A promising approach for creating ML models that inherently satisfy constraints is to encode background knowledge as logical constraints that guide the learning process via so-called differentiable logics. In this research preview, we compare and evaluate various logics from the literature in weakly-supervised contexts, presenting our findings and highlighting open problems for future work. Our experimental results are broadly consistent with results reported previously in literature; however, learning with differentiable logics introduces a new hyperparameter that is difficult to tune and has significant influence on the effectiveness of the logics.",
    "citationCount": 2,
    "referenceCount": 15
}