{
    "paperId": "54503c6b32fe27ce75e11c68fe0f5cb6318fb865",
    "title": "Multi-Scale Fire Dynamics Modeling: Integrating Predictive Algorithms for Synthetic Material Combustion in Compartment Fires",
    "year": 2024,
    "venue": "Journal of Management World",
    "authors": [
        "Dalower Hossain",
        "Md Asrafuzzaman",
        "Shubhashish Dash",
        "Suborna Rani"
    ],
    "doi": "10.53935/jomw.v2024i4.1133",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54503c6b32fe27ce75e11c68fe0f5cb6318fb865",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, multi-scale fire modeling has revealed serious shortcomings in determining synthetic material combustion in the context of compartment fires. Predictive algorithms were combined with experimental validation to address the non-uniform dynamics associated with modern fires fueled by synthetic materials. In this thesis, we developed a hybrid framework that couples material-scale pyrolysis kinetics with compartment-scale heat transfer using computational fluid dynamics (CFD) and machine learning-augmented flame detection. Full-scale fire experiments were used for validation and showed an improvement of 22–37% in structural failure prediction accuracy over uniform fire models. The methodology bridges the gap between fire chemistry, turbulent plume dynamics, and structural thermomechanical response, providing actionable information for performance-based fire protection design. In addition, this framework extends our knowledge of fire behavior in modern buildings and affords us a strong tool for engineers to design safer structures and develop effective retrofit strategies. The study contributed to the advancement of fire safety engineering by integrating advanced modeling techniques with experimental data that served to improve public safety and reduce economic loss due to fire.",
    "citationCount": 3,
    "referenceCount": 50
}