{
    "paperId": "5454461f68e0ff323cd1ee648620b1106a719e16",
    "title": "Curriculum Management in Deep Work Model at English Education Department Universitas Panca Sakti Bekasi",
    "year": 2024,
    "venue": "Jurnal Studi Guru dan Pembelajaran",
    "authors": [
        "Rita Aryani",
        "Leroy Holman Siahaan"
    ],
    "doi": "10.30605/jsgp.7.1.2024.3104",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5454461f68e0ff323cd1ee648620b1106a719e16",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The problem that often occurs in this era of technological progress is gadget addiction, a student cannot be separated from a gadget and is always spoiled with features/applications on the gadget, making it difficult for many students to concentrate, and their thinking is not critical like the young people of old. Indonesia's educational needs in terms of increasing excellent graduates needed by developing a Deep Work model curriculum is the goal of this research. This Deep Work model curriculum refers to how students can work focused by avoiding distractions around them. In this Deep Work model curriculum, students are expected to have high skills according to their ability to produce new values ​​in higher education, especially English Education. In this study, researchers used the Research and Development (R&D) method, which refers to the 4-D model (Define, Design, Develop, Disseminate). This method is expected to produce a product, namely the In-depth Work Model Curriculum. The instruments used in this study were validation instruments, student response questionnaires before and after using the module, observation sheets, and test questions to determine students' abilities and focus tests. From the 4 stages carried out, the results obtained were 72.5%, it was stated that the Deep Work curriculum had a high success rate in increasing graduation in English education study programs.",
    "citationCount": 0,
    "referenceCount": 31
}