{
    "paperId": "545863b0a66b3f4cfd1b31c9f7f1348dbbd72126",
    "title": "Combined Rough Sets and Rule-Based Expert System to Support Environmentally Oriented Sandwich Pallet Loading Problem",
    "year": 2025,
    "venue": "Energies",
    "authors": [
        "Piotr Sawicki",
        "H. Sawicka",
        "Marek Karkula",
        "Krzysztof Zajda"
    ],
    "doi": "10.3390/en18020268",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/545863b0a66b3f4cfd1b31c9f7f1348dbbd72126",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/en18020268",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A sandwich pallet loading problem represents a significant challenge in the logistics of fast-moving consumer goods (FMCG), requiring optimisation of load units (LUs) arrangements to minimise their number in transportation and warehousing processes, leading to an environmental responsibility of organisations. This study introduces an innovative approach combining Dominance-Based Rough Set Theory (DRST) with a rule-based expert system to improve the efficiency of the pallet loading and to provide sustainable development. Key criteria and attributes for the LU assessment, such as weight, height, and fragility, are defined. DRST is utilised to classify these units, leveraging its capability to handle imprecise and vague information. The rule-based system ensures an optimal arrangement of LUs by considering critical control parameters, thereby reducing LU numbers and mitigating the environmental impact of logistics operations, as measured by energy consumption. The proposed approach is validated using real-world data from the FMCG distribution company. Results demonstrate that integrating DRST with an expert system improves decision-making consistency and significantly reduces the number of LUs. This study shows a way to increase the level of environmental responsibility of the organisation by cutting energy consumption and delivering economic and social benefits through fewer shipments. For example, the approach reduces energy consumption for a customer order delivery by 40%, from 0.60 to 0.36 (kWh/pskm).",
    "citationCount": 1,
    "referenceCount": 111
}