{
    "paperId": "54633753e2246eccdd0ac06009342b10da749ea7",
    "title": "Crop-specific hyperspectral band selection method using limited ground-truth data",
    "year": 2022,
    "venue": "International Journal of Remote Sensing",
    "authors": [
        "Kinjal Dave",
        "Y. Trivedi"
    ],
    "doi": "10.1080/01431161.2022.2155085",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54633753e2246eccdd0ac06009342b10da749ea7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Hyperspectral imaging plays a significant role in crop classification and aims to separate various crop pixels from the imagery. It aids the government in deciding agricultural policies. However, high spectral dimensions in hyperspectral data require high computing power and time. This paper presents a new band selection method based on spectral information divergence and correlation ( ), which selects optimum bands to classify the crops. The requires only single ground-truth pixels having the least spectral information divergence value to select the bands. This method requires not only minimum ground truth data but also gives reduced computational complexity. We have evaluated the proposed method on three hyperspectral datasets, AVIRIS-NG, Indian Pines and Salinas. We have used overall accuracy and kappa coefficient as performance parameters from the support vector machine and k-nearest neighbours classifiers. The experimental findings reveal that the proposed band selection method achieves maximum overall accuracy of about 84.79% for Indian Pines and 93.08% for Salinas dataset. The proposed methodology exhibits an improvement in overall accuracy when the number of selected bands ranges from 35 to 50 when compared with the other competitive band selection approaches.",
    "citationCount": 1,
    "referenceCount": 29
}