{
    "paperId": "5464f9001af9b1e6375503225c306adce5d4afce",
    "title": "Utilization of extremely precise analytics: A State-of-the-Art Approach and Future Potentials",
    "year": 2022,
    "venue": "2022 IEEE Globecom Workshops (GC Wkshps)",
    "authors": [
        "P. Katrakazas"
    ],
    "doi": "10.1109/GCWkshps56602.2022.10008477",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5464f9001af9b1e6375503225c306adce5d4afce",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Critical decisions are now taken with the assistance or relying exclusively on the analysis of massive amounts of complex, volatile, diverse, inconsistent, partially erroneous data, requiring extensive pre/post processing for curation and harmonization, often challenged by privacy considerations and resource/technology limitations. Although many commercial and open-source frameworks were deployed to tackle these challenges, new techniques need to be developed to optimize the prediction accuracy and robustness of artificial intelligence/machine learning and simulation models and validate them in constrained settings. In this paper, progress beyond the state-of-the-art is discussed in the context of extremely precise predictions, simulations, human-centered personalized user interactions, trustworthy artificial intelligence and automated decision-making. The idea of AI-empowered user models that encapsulate parameters such as domain expertise and experience is also presented under the blueprints presentation of a platform that will provide human-centered adaptive data visualizations, facilitating data exploration and enabling effective decision-making.",
    "citationCount": 1,
    "referenceCount": 40
}