{
    "paperId": "54816339b8d99cd996d2083d073ca5020209e85c",
    "title": "A Machine Learning Framework to Improve Storage System Performance",
    "year": 2021,
    "venue": "USENIX Workshop on Hot Topics in Storage and File Systems",
    "authors": [
        "I. Akgun",
        "A. Aydin",
        "Aadil Shaikh",
        "L. Velikov",
        "E. Zadok"
    ],
    "doi": "10.1145/3465332.3470875",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54816339b8d99cd996d2083d073ca5020209e85c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Storage systems and their OS components are designed to accommodate a wide variety of applications and dynamic workloads. Storage components inside the OS contain various heuristic algorithms to provide high performance and adaptability for different workloads. These heuristics may be tunable via parameters, and some system calls allow users to optimize their system performance. These parameters are often predetermined based on experiments with limited applications and hardware. Thus, storage systems often run with these predetermined and possibly suboptimal values. Tuning these parameters manually is impractical: one needs an adaptive, intelligent system to handle dynamic and complex workloads. Machine learning (ML) techniques are capable of recognizing patterns, abstracting them, and making predictions on new data. ML can be a key component to optimize and adapt storage systems. In this position paper, we propose KML, an ML framework for storage systems. We implemented a prototype and demonstrated its capabilities on the well-known problem of tuning optimal readahead values. Our results show that KML has a small memory footprint, introduces negligible overhead, and yet enhances throughput by as much as 2.3x.",
    "citationCount": 24,
    "referenceCount": 72
}