{
    "paperId": "548b0d232cc3b0293ea99f7b339a4d1e39c8d3e1",
    "title": "On the Use of Embedding Techniques for Modeling User Navigational Behavior in Intelligent Prefetching Strategies",
    "year": 2025,
    "venue": "Concurrency and Computation",
    "authors": [
        "Tolga Büyüktanir",
        "Mehmet S. Aktas"
    ],
    "doi": "10.1002/cpe.8356",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/548b0d232cc3b0293ea99f7b339a4d1e39c8d3e1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In today's data‐intensive client‐server systems, traditional caching methods often fail to meet the demands of modern applications, especially in mobile environments with unstable network conditions. This research addresses the challenge of improving data delivery by proposing an advanced prefetching framework that utilizes various embedding techniques. We explore how to model user navigation using graph‐based, autoencoder‐based, and sequence‐to‐sequence‐based embedding methods and assess their impact on prefetching accuracy and efficiency. Our study shows that utilizing these embedding techniques with supervised learning models improves prefetching performance. We also present a software architecture that blends supervised and unsupervised learning approaches, along with user‐specific and collective learning models, to create a robust prefetching mechanism. The contributions of this study include developing a scalable prefetching solution using machine learning/deep learning algorithms and providing an open‐source prototype of the proposed architecture. This paper offers a significant improvement over previous research and provides valuable insights for enhancing the performance of data‐intensive applications.",
    "citationCount": 0,
    "referenceCount": 41
}