{
    "paperId": "54dca0cfcc8b4b70ccc4c2cce3247b3e122a68b4",
    "title": "Robustly interrogating machine learning-based scoring functions: what are they learning?",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "Guy Durant",
        "Fergus Boyles",
        "Kristian Birchall",
        "Brian D. Marsden",
        "Charlotte M. Deane"
    ],
    "doi": "10.1093/bioinformatics/btaf040",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54dca0cfcc8b4b70ccc4c2cce3247b3e122a68b4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Motivation Machine learning-based scoring functions (MLBSFs) have been found to exhibit inconsistent performance on different benchmarks and be prone to learning dataset bias. For the field to develop MLBSFs that learn a generalisable understanding of physics, a more rigorous understanding of how they perform is required. Results In this work, we compared the performance of a diverse set of popular MLBSFs (RFScore, SIGN, OnionNet-2, Pafnucy, and PointVS) to our proposed baseline models that can only learn dataset biases on a range of benchmarks. We found that these baseline models were competitive in accuracy to these MLBSFs in almost all proposed benchmarks, indicating these models only learn dataset biases. Our tests and provided platform, ToolBoxSF, will enable researchers to robustly interrogate MLBSF performance and determine the effect of dataset biases on their predictions. Availability and Implementation https://github.com/guydurant/toolboxsf Contact deane@stats.ox.ac.uk Supplementary information Supplementary data are available at Bioinformatics online.",
    "citationCount": 10,
    "referenceCount": 66
}