{
    "paperId": "54e73fc0c55644b1ba9e79473818896f00ead881",
    "title": "Perspectives on High-Performance Computing in a Big Data World",
    "year": 2019,
    "venue": "IEEE International Symposium on High-Performance Parallel Distributed Computing",
    "authors": [
        "G. Fox"
    ],
    "doi": "10.1145/3307681.3325410",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54e73fc0c55644b1ba9e79473818896f00ead881",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-Performance Computing (HPC) and Cyberinfrastructure have played a leadership role in computational science even since the start of the NSF computing centers program. Thirty years ago parallel computing was a centerpiece of computer science research. Naively Big Data surely requires HPC to be processed, and transformational Big Data technology such as Hadoop and Spark exploit parallelism to success. Nevertheless, the HPC community does not appear to be thriving as a leader in Data Science while parallel computing is no longer a centerpiece. Some reasons for this are the dominant presence of Industry in technology futures and the universal fascination with Artificial Intelligence and Machine Learning. Maybe the pendulum will swing back a bit, but I expect the \"AI first\" philosophy to dominate in the foreseeable future. Thus I describe a future where HPC thrives in collaboration with Industry and AI. In particular, I discuss the promise of MLforHPC (AI for systems) and HPCforML (systems for AI).",
    "citationCount": 1,
    "referenceCount": 1
}