{
    "paperId": "5550ae3b1831b50ba561d5f6c3c541069377684a",
    "title": "TorchSparse++: Efficient Point Cloud Engine",
    "year": 2023,
    "venue": "2023 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW)",
    "authors": [
        "Haotian Tang",
        "Shang Yang",
        "Zhijian Liu",
        "Ke Hong",
        "Zhongming Yu",
        "Xiuyu Li",
        "Guohao Dai",
        "Yu Wang",
        "Song Han"
    ],
    "doi": "10.1109/CVPRW59228.2023.00025",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5550ae3b1831b50ba561d5f6c3c541069377684a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Point cloud computation has become an increasingly more important workload for autonomous driving and other applications. Unlike dense 2D computation, point cloud convolution has sparse and irregular computation patterns and thus requires dedicated inference system support with specialized high-performance kernels. While existing point cloud deep learning libraries have developed different dataflows for convolution on point clouds, they assume a single dataflow throughout the execution of the entire model. In this work, we systematically analyze and improve existing dataflows. Our resulting system, TorchSparse++, achieves 2.9×, 3.3×, 2.2× and 1.8× measured end-to-end speedup on an NVIDIA A100 GPU over the state-of-the-art MinkowskiEngine, SpConv 1.2, TorchSparse and SpConv v2 in inference respectively. Furthermore, TorchSparse++ is the only system to date that supports all necessary primitives for 3D segmentation, detection, and reconstruction workloads in autonomous driving. Code is publicly released at https://github.com/mit-han-lab/torchsparse.",
    "citationCount": 15,
    "referenceCount": 49
}