{
    "paperId": "5573345167377635ad75448f246f2423512e4866",
    "title": "Investigating Expectations for Voice-based and Conversational Argument Search on the Web",
    "year": 2020,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Johannes Kiesel",
        "Kevin Lang",
        "Henning Wachsmuth",
        "E. Hornecker",
        "Benno Stein"
    ],
    "doi": "10.1145/3343413.3377978",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5573345167377635ad75448f246f2423512e4866",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Millions of arguments are shared on the web. Future information systems will be able to exploit this valuable knowledge source and to retrieve arguments relevant and convincing to our specific need---all with an interface as intuitive as asking your friend \"Why ...\". Although recent advancements in argument mining, conversational search, and voice recognition have put such systems within reach, many questions remain open, especially on the interface side. In this regard the paper at hand presents the first study of argument search behavior. We conduct an online-survey and a focused user study, putting emphasis on what people expect argument search to be like, rather than on what current first-generation systems provide. Our participants expected to use voice-based argument search mostly at home, but also together with others. Moreover, they expect such search systems to provide rich information on retrieved arguments, such as the source, supporting evidence, and background knowledge on entities or events mentioned. In observed interactions with a simulated system we found that the participants adapted their search behavior to different types of tasks, and that up-front categorization of the retrieved arguments is perceived as helpful if this is short. Our findings are directly applicable to the design of argument search systems, not only voice-based ones.",
    "citationCount": 9,
    "referenceCount": 37
}