{
    "paperId": "557427745dde06b1d2eb5b15ac8579d195f5b9a3",
    "title": "Artificial intelligence and ChatGPT are fostering knowledge sharing, ethics, academia and libraries",
    "year": 2024,
    "venue": "The international journal of information and learning technology",
    "authors": [
        "Ali Zeb",
        "Fazal ur Rehman",
        "Majed Bin Othayman",
        "Muhammad Rabnawaz"
    ],
    "doi": "10.1108/ijilt-03-2024-0046",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/557427745dde06b1d2eb5b15ac8579d195f5b9a3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeGiven the increasing attention on ChatGPT in academia due to its advanced features and capabilities, this study aims to examine the links among Artificial intelligence (AI), knowledge sharing, ethics, academia and libraries in educational institutions. Moreover, this study also aims to provide a literature base while discussing recent trends in AI and ChatGPT technologies, highlighting their specific uses in institutions.Design/methodology/approachThe paper involves a structured interview format where a human interviewer poses questions “Qs” in ChatGPT, related to knowledge sharing, ethics, academia and libraries. Moreover a literature base is also provide to discussed recent trends in AI and ChatGPT technologies, highlighting their specific uses in institutions.FindingsThe study find out that AI and ChatGPT technologies in educational institutions affect knowledge sharing, ethical consideration, academia and libraries. This study also highlights literature directions for the trends and proper use of the AI and ChatGPT among institutions, such as improving student-learning engagement.Originality/valueThis research contributes to the prior literature by offering an in-depth review of current uses and applications of AI and ChatGPT in educational institutions. It not only highlights key trends and innovations but also provides insights and guidelines for future research. This study also provides insights and guidelines for future research. Furthermore, the article emphasizes the potential impact of AI and ChatGPT on the future of education and technology.",
    "citationCount": 8,
    "referenceCount": 75
}