{
    "paperId": "55b9bcd9014bdbc6bb2f4fc34f7e3bf75562188d",
    "title": "PostgreSQL Data Warehouse Implementation and Performance Optimization For Energy Companies",
    "year": 2024,
    "venue": "IEEE Systems Conference",
    "authors": [
        "Dakota Joiner",
        "Mathias Clement",
        "Keegan Pereira",
        "Shek Chan",
        "Y. Khmelevsky",
        "Albert Wong",
        "Joe Mahony",
        "Michael Ferri"
    ],
    "doi": "10.1109/SysCon61195.2024.10553614",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/55b9bcd9014bdbc6bb2f4fc34f7e3bf75562188d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With smart grids replacing traditional energy grids in recent years, energy companies are facing a new challenge to efficiently manage and analyze the collected data. The use of sensors in smart grids has led to a surge in the data being collected. Due to its design, the classic relational Online Transaction Processing (OLTP) relational database management system (RDBMS) starts to become inefficient for queries against the RDBMS beyond a terabyte size. For data extraction efficiency on large volumes of data, OLAP along with data warehousing (DW) has become a popular solution. A Business Intelligence (BI) tools are often used on the top of DWs [1]. The adoption of big- data-driven technologies is still lagging among energy companies.In this paper, based on our previous research projects and research results [2]–[5], we show that, through an optimization process, a gain in performance that is up to 2800 times faster compared with that of the original OLTP DBMS using the same hardware and the same operating system is possible.The applied research project was funded by an NSERC grant and was conducted in 2020-2023 at Okanagan and Langara Colleges.",
    "citationCount": 0,
    "referenceCount": 30
}