{
    "paperId": "55c2583521faca87b5c96d4627e8e52e67e5819e",
    "title": "MemTunnel: A CXL-Based Rack-Scale Host Memory Pooling Architecture for Cloud Service",
    "year": 2025,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "Tianchan Guan",
        "Yijin Guan",
        "Zhaoyang Du",
        "Jiacheng Ma",
        "Boyu Tian",
        "Zhao Wang",
        "Teng Ma",
        "Zheng Liu",
        "Yang Kong",
        "Yuan Xie",
        "Mingyu Gao",
        "Guangyu Sun",
        "Hongzhong Zheng",
        "Dimin Niu"
    ],
    "doi": "10.1109/TPDS.2025.3598190",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/55c2583521faca87b5c96d4627e8e52e67e5819e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Memory underutilization poses a significant challenge in cloud services, leading to performance inefficiencies and resource wastage. The tightly coupled computing and memory resources in cloud servers are identified as the root cause of this problem. To address this issue, memory pooling has been the subject of extensive research for decades, providing centralized or distributed shared memory pools as flexible memory resources for various applications running on different servers. However, existing memory disaggregation solutions sacrifice memory resources, add extra hardware (such as memory boxes/blades/drives), and degrade memory performance to achieve flexibility. To overcome these limitations, this paper proposes MemTunnel, a rack-scale host memory pooling architecture that provides a low-cost memory pooling solution based on Compute Express Link (CXL). MemTunnel is the first hardware and software architecture to offer symmetric, memory-semantic memory pooling over CXL, with an FPGA-based platform to demonstrate its feasibility in a real implementation. MemTunnel is orthogonal to the existing CXL-based memory pool and provides an additional layer of abstraction for memory disaggregation. Evaluation results show that MemTunnel achieves comparable performance to the existing CXL-based memory pool for a single machine and provides better rack-scale performance with minor hardware overheads.",
    "citationCount": 0,
    "referenceCount": 50
}