{
    "paperId": "56224d31317101dbb154cf07d151803190eab249",
    "title": "Generative Retrieval and Alignment Model: A New Paradigm for E-commerce Retrieval",
    "year": 2025,
    "venue": "The Web Conference",
    "authors": [
        "Ming Pang",
        "Chunyuan Yuan",
        "Xiaoyu He",
        "Zheng Fang",
        "Donghao Xie",
        "Fanyi Qu",
        "Xue Jiang",
        "Changping Peng",
        "Zhangang Lin",
        "Zheng Luo",
        "Jingping Shao"
    ],
    "doi": "10.1145/3701716.3715228",
    "arxivId": "2504.01403",
    "url": "https://www.semanticscholar.org/paper/56224d31317101dbb154cf07d151803190eab249",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The retrieval module is a crucial component of search systems. Traditional sparse and dense retrieval methods struggle to leverage general world knowledge and often fail to capture the nuanced features of queries and products. With the advent of large language models (LLMs), industrial search systems have started to employ LLMs to generate identifiers for product retrieval. Commonly used identifiers include (1) static/semantic IDs and (2) product term sets. The first approach requires creating a product ID system from scratch, missing out on the world knowledge embedded within LLMs. While the second approach leverages this general knowledge, the significant difference in word distribution between queries and products means that product-based identifiers often do not align well with user search queries, leading to missed product recalls. Furthermore, when queries contain numerous attributes, these algorithms generate a large number of identifiers, making it difficult to assess their quality, which results in low overall recall efficiency. To address these challenges, this paper introduces a novel e-commerce retrieval paradigm: the Generative Retrieval and Alignment Model (GRAM). GRAM employs joint training on text information from both queries and products to generate shared text identifier codes, effectively bridging the gap between queries and products. This approach not only enhances the connection between queries and products but also improves inference efficiency. The model uses a co-alignment strategy to generate codes optimized for maximizing retrieval efficiency. Additionally, it introduces a query-product scoring mechanism to compare product values across different codes, further boosting retrieval efficiency. By integrating these scores, GRAM can replace the traditional recall and initial ranking stages, achieving an integrated retrieval and pre-ranking process. Extensive offline and online A/B testing was conducted. The results demonstrate that GRAM significantly outperforms traditional sparse and dense retrieval algorithms and the latest generative retrieval models, confirming its effectiveness and practicality.",
    "citationCount": 8,
    "referenceCount": 33
}