{
    "paperId": "565712c543e2443ff05edd87f3c1d20c07617a3a",
    "title": "Low-Resource Dense Retrieval for Open-Domain Question Answering: A Comprehensive Survey",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Xiaoyu Shen",
        "Svitlana Vakulenko",
        "Marco Del Tredici",
        "Gianni Barlacchi",
        "B. Byrne",
        "A. Gispert"
    ],
    "doi": "10.48550/arXiv.2208.03197",
    "arxivId": "2208.03197",
    "url": "https://www.semanticscholar.org/paper/565712c543e2443ff05edd87f3c1d20c07617a3a",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2208.03197",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dense retrieval (DR) approaches based on powerful pre-trained language models (PLMs) achieved significant advances and have become a key component for modern open-domain question-answering systems. However, they require large amounts of manual annotations to perform competitively, which is infeasible to scale. To address this, a growing body of research works have recently focused on improving DR performance under low-resource scenarios. These works differ in what resources they require for training and employ a diverse set of techniques. Understanding such differences is crucial for choosing the right technique under a specific low-resource scenario. To facilitate this understanding, we provide a thorough structured overview of mainstream techniques for low-resource DR. Based on their required resources, we divide the techniques into three main categories: (1) only documents are needed; (2) documents and questions are needed; and (3) documents and question-answer pairs are needed. For every technique, we introduce its general-form algorithm, highlight the open issues and pros and cons. Promising directions are outlined for future research.",
    "citationCount": 20,
    "referenceCount": 210
}