{
    "paperId": "56885cc3d261bd439a7798e8a509a1dec2a687af",
    "title": "GAN-Based Tabular Data Generator for Constructing Synopsis in Approximate Query Processing: Challenges and Solutions",
    "year": 2024,
    "venue": "Machine Learning and Knowledge Extraction",
    "authors": [
        "Mohammadali Fallahian",
        "Mohsen Dorodchi",
        "Kyle Kreth"
    ],
    "doi": "10.3390/make6010010",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/56885cc3d261bd439a7798e8a509a1dec2a687af",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2504-4990/6/1/10/pdf?version=1705409960",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In data-driven systems, data exploration is imperative for making real-time decisions. However, big data are stored in massive databases that are difficult to retrieve. Approximate Query Processing (AQP) is a technique for providing approximate answers to aggregate queries based on a summary of the data (synopsis) that closely replicates the behavior of the actual data; this can be useful when an approximate answer to queries is acceptable in a fraction of the real execution time. This study explores the novel utilization of a Generative Adversarial Network (GAN) for the generation of tabular data that can be employed in AQP for synopsis construction. We thoroughly investigate the unique challenges posed by the synopsis construction process, including maintaining data distribution characteristics, handling bounded continuous and categorical data, and preserving semantic relationships, and we then introduce the advancement of tabular GAN architectures that overcome these challenges. Furthermore, we propose and validate a suite of statistical metrics tailored for assessing the reliability of GAN-generated synopses. Our findings demonstrate that advanced GAN variations exhibit a promising capacity to generate high-fidelity synopses, potentially transforming the efficiency and effectiveness of AQP in data-driven systems.",
    "citationCount": 5,
    "referenceCount": 48
}