{
    "paperId": "56a662307d3fc11993b1300880e8205acb26893f",
    "title": "Data-Aware Training Quality Monitoring and Certification for Reliable Deep Learning",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Farhang Yeganegi",
        "Arian Eamaz",
        "M. Soltanalian"
    ],
    "doi": "10.48550/arXiv.2410.10984",
    "arxivId": "2410.10984",
    "url": "https://www.semanticscholar.org/paper/56a662307d3fc11993b1300880e8205acb26893f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning models excel at capturing complex representations through sequential layers of linear and non-linear transformations, yet their inherent black-box nature and multi-modal training landscape raise critical concerns about reliability, robustness, and safety, particularly in high-stakes applications. To address these challenges, we introduce YES training bounds, a novel framework for real-time, data-aware certification and monitoring of neural network training. The YES bounds evaluate the efficiency of data utilization and optimization dynamics, providing an effective tool for assessing progress and detecting suboptimal behavior during training. Our experiments show that the YES bounds offer insights beyond conventional local optimization perspectives, such as identifying when training losses plateau in suboptimal regions. Validated on both synthetic and real data, including image denoising tasks, the bounds prove effective in certifying training quality and guiding adjustments to enhance model performance. By integrating these bounds into a color-coded cloud-based monitoring system, we offer a powerful tool for real-time evaluation, setting a new standard for training quality assurance in deep learning.",
    "citationCount": 0,
    "referenceCount": 17
}