{
    "paperId": "56b9b1bbdfa0c6b6fb115bfb9970707b576f6fa1",
    "title": "Predictive Modeling and Data-Driven Optimization of CdFe2O4/p-Si Heterojunction Electrical Behavior",
    "year": 2025,
    "venue": "ACS Omega",
    "authors": [
        "N. Yahyaoui",
        "M. Hjiri",
        "S. Mansouri",
        "F. Yakuphanoğlu"
    ],
    "doi": "10.1021/acsomega.5c06499",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/56b9b1bbdfa0c6b6fb115bfb9970707b576f6fa1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study investigates the electrical characteristics of a CdFe2O4/p-Si diode by integrating experimental techniques with machine learning (ML) approaches. The CdFe2O4 thin films were synthesized using the sol–gel spin coating method and deposited on a chemically treated p-Si substrate. Structural and morphological characterizations confirmed the formation of a polycrystalline film with randomly distributed grains. Electrical measurements were performed using the Fytronix 9000 Semiconductor Characterization System. Traditional analysis methods were complemented by ML models, including Artificial Neural Networks (ANN), and hybrid techniques, to enhance data interpretation and uncover complex, nonlinear behaviors within the device. The results demonstrate that ML techniques significantly improve parameter extraction and behavioral prediction accuracy and efficiency compared to conventional methods. The coefficient of determination is equal to 0.9999, indicating a perfect correlation between experimental and predicted values. The optimal power and transition frequency were determined using an ANN model, demonstrating strong consistency with experimental data.",
    "citationCount": 0,
    "referenceCount": 38
}