{
    "paperId": "56d954a19560c72b48f13f389c5f889e927319b9",
    "title": "ECFO: An Efficient Edge Classification-Based Fusion Optimizer for Deep Learning Compilers",
    "year": 2024,
    "venue": "IEEE International Conference on Systems, Man and Cybernetics",
    "authors": [
        "Wei Li",
        "Pengcheng Wang",
        "Yutong Wu",
        "Kangcheng Liu",
        "Lide Xue",
        "Zidong Du",
        "Xishan Zhang",
        "Xuehai Zhou"
    ],
    "doi": "10.1109/SMC54092.2024.10831989",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/56d954a19560c72b48f13f389c5f889e927319b9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Operation fusion is a critical technique in optimizing deep learning compilers as it enhances computational efficiency by integrating multiple operations into a single computational graph. However, finding an effective fusion strategy is challenging, requiring the definition of an optimization search space and identification of the best strategy within this space. Existing methods, such as heuristic searches and learning-based searches, have significant limitations. Heuristic searches are complex, labor-intensive, and often lack generalizability across different network architectures. On the other hand, learning-based methods demand extensive training and pro-longed search time. To address these challenges, we introduce the Edge Classification-Based Fusion Optimizer (ECFO), a novel approach that reconceptualizes operation fusion as an edge classification problem. By leveraging Graph Neural Networks (GNNs) for efficient graph feature encoding, ECFO streamline the optimization process and significantly reduces computational overhead. Comprehensive evaluations across diverse neural networks demonstrate that ECFO decrease search time by up to 23x and improves inference performance by 3.2%, representing a substantial advancement over existing strategies.",
    "citationCount": 0,
    "referenceCount": 18
}