{
    "paperId": "57321de7a27fe10372bad24e25d43d5ec5f00059",
    "title": "Convolutional Transformer Neural Collaborative Filtering",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Pang Li",
        "S. Noah",
        "Hafiz Mohd Sarim"
    ],
    "doi": "10.48550/arXiv.2412.01376",
    "arxivId": "2412.01376",
    "url": "https://www.semanticscholar.org/paper/57321de7a27fe10372bad24e25d43d5ec5f00059",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this study, we introduce Convolutional Transformer Neural Collaborative Filtering (CTNCF), a novel approach aimed at enhancing recommendation systems by effectively capturing high-order structural information in user?item interactions. CTNCF represents a significant advancement over the traditional Neural Collaborative Filtering (NCF) model by seamlessly integrating Convolutional Neural Networks (CNNs) and Transformer layers. This sophisticated integration enables the model to adeptly capture and understand complex interaction patterns inherent in recommendation systems. Specifically, CNNs are employed to extract local features from user and item embeddings, allowing the model to capture intricate spatial dependencies within the data. Furthermore, the utilization of Transformer layers enables the model to capture long-range dependencies and interactions among user and item features, thereby enhancing its ability to understand the underlying relationships in the data. To validate the effectiveness of our proposed CTNCF framework, we conduct extensive experiments on two real-world datasets. The results demonstrate that CTNCF significantly outperforms state-of-the-art approaches, highlighting its efficacy in improving recommendation system performance.",
    "citationCount": 0,
    "referenceCount": 22
}