{
    "paperId": "5760315d2084371409d3a7eb87d0b73a611c16f6",
    "title": "Major Facilitator Superfamily transporters balance sugar metabolism in peach",
    "year": 2025,
    "venue": "Plant Physiology",
    "authors": [
        "Xuanwen Yang",
        "Wenhua Yang",
        "Jiacui Li",
        "Changwen Chen",
        "Siyu Chen",
        "Huan Wang",
        "Jinlong Wu",
        "Hui Xue",
        "Yuting Liu",
        "Jianzhong Lu",
        "Yiwen Wang",
        "Mengrui Du",
        "Yong Li",
        "W. Fang",
        "Ruirui Liu",
        "Yanling Peng",
        "Qiang Xu",
        "Yongfeng Zhou",
        "Lirong Wang",
        "Ke Cao"
    ],
    "doi": "10.1093/plphys/kiaf192",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5760315d2084371409d3a7eb87d0b73a611c16f6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Sugar content is a key determinant of peach (Prunus persica) fruit quality, influencing taste, consumer preferences, and market value. However, the roles of Major Facilitator Superfamily (MFS) transporters in sugar metabolism and regulation remain largely unexplored. This study employed a combination of spatial metabolomics, quantitative genetics, transcriptomics, comparative genomics, and functional genomics to investigate the role of 67 MFS members in balancing sugar metabolism during peach fruit development. Spatial metabolomics revealed dynamic sugar distribution patterns, with ERD6-like transporters (PpERDL16-1) and tonoplastic sugar transporters 1 (PpTST1) promoting sucrose accumulation and polyol/monosaccharide transporters 5 (PpPMT5-1) and sucrose transporters 4 (PpSUT4) reducing sucrose transport during fruit ripening. Functional studies confirmed these roles: PpERDL16-1 overexpression enhanced sucrose transport, and PpPMT5-1 or PpSUT4 silencing reduced sugar levels in peach fruit. Quantitative trait locus (QTL) mapping identified a major locus on chromosome 5, upstream of PpTST1, forming distinct haplotypes (Hap1 and Hap2). Hap1 was associated with lower PpTST1 expression and higher sugar and soluble solids content (SSC), while Hap2 was linked to higher PpTST1 expression and lower sugar content. This inverse relationship suggests that upstream genetic variants fine-tune PpTST1 expression in a context-dependent manner, potentially through interactions with transcription factors or epigenetic modifiers. Notably, PpTST1 overexpression increased sugar content but did not alter SSC, indicating compensatory mechanisms such as changes in organic acid metabolism or water content. These results illuminate the molecular mechanisms regulating sugar homeostasis in peach fruits, providing valuable targets for the genetic improvement of fruit quality through breeding programs.",
    "citationCount": 1,
    "referenceCount": 72
}