{
    "paperId": "5767982459c1df82ea107fc61c5f1a10e759114f",
    "title": "Decoding Attack Behaviors by Analyzing Patterns in Instruction-Based Attacks using gem5",
    "year": 2024,
    "venue": "RSP",
    "authors": [
        "Muhammad Awais",
        "Maria Mushtaq",
        "Lirida Naviner",
        "F. Bruguier",
        "Jawad Haj-Yahya",
        "Pascal Benoit"
    ],
    "doi": "10.1109/RSP64122.2024.10871078",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5767982459c1df82ea107fc61c5f1a10e759114f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The diversity of Instruction Set Architectures (ISAs), each with its unique constraints and optimization strategies, presents significant opportunities and challenges in processor design. Modern processor vendors exploit these ISAs to enhance security, reliability, and performance. Recent security vulnerabilities, notably Spectre and Meltdown, have highlighted the critical need for robust hardware security measures. In this paper, we employ gem5, a state-of-the-art cycle-accurate simulation tool, to simulate the Spectre attack. We developed and modified scripts for both x86 and ARM architectures to ensure compatibility with gem5 version 23.1. Our simulation setup involved running attack scenarios under various configurations to gather comprehensive data on cache misses, cache hits, mispredicted branches, and level 2 cache hits and misses. In the simulation, we analyzed the trace files generated by gem5, utilizing a range of debug flags such as Exec for disassembly (dasm) insights. By detailed analysis of cache and branch prediction using detailed debug data revealed by gem5 traces, we identify some specific attack patterns that are useful for automating the detection of the attacks. Our future work aims to expand this analysis to include additional attack vectors and find more attack patterns, thereby strengthening our attack pattern recognition capabilities.",
    "citationCount": 1,
    "referenceCount": 10
}