{
    "paperId": "5768efacf6dfc6303825cabad20d169256c96576",
    "title": "Exploring the Integration of Reinforcement Learning for Enhancing Game Performance: A Comprehensive Review",
    "year": 2024,
    "venue": "International Conference on Computing Communication and Networking Technologies",
    "authors": [
        "Munugapati Bhavana",
        "Yerra Anjali Satyavathi",
        "Vijay Krupa Vatsal",
        "Navyatha Ravi",
        "Dr.J.Kavitha",
        "Dr.V.Thrimurthulu"
    ],
    "doi": "10.1109/ICCCNT61001.2024.10725576",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5768efacf6dfc6303825cabad20d169256c96576",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Reinforcement learning, a subset of machine learning, encompasses the process by which an agent learns through trial-and-error feedback to anticipate its subsequent actions. Its versatility extends across various domains, with gaming being a prominent application. Success in gaming often pivots on the formulation of effective strategies, a task that necessitates repetitive game play, consuming valuable time, energy, and resources. This study aims tointegrate a reinforcement learning agent into gaming scenarios, replicating game dynamics and progressively refining outcomes with each iteration. By mimicking the agent’s performance, human players can augment their likelihood of success. This document highlights the utilization of reinforcement learning techniques, focusing on the application of Value-based methods (Q-learning, Deep Q Network (DQN)), and Model-based methods(State-Action-Reward-State-Action (SARSA)). Q-learning from Value-based methodis designed as an off-policy algorithm, whereas SARSA from Model-based methods functions as anon-policyalgorithm.The outcomes presented encompass insights from previous research on Q-learning and SARSA across diverse test fields or settings. Furthermore, the proposed reinforcement learning methodologies address key facets such as data comprehension, problem categorization, algorithm identification, and algorithm implementation.",
    "citationCount": 1,
    "referenceCount": 23
}