{
    "paperId": "576e652e36f539b13c7d17cb5bba8cd22be279a9",
    "title": "Effective and General Distance Computation for Approximate Nearest Neighbor Search",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Mingyu Yang",
        "Wentao Li",
        "Jiabao Jin",
        "Xiaoyao Zhong",
        "Xiangyu Wang",
        "Zhitao Shen",
        "Wei Jia",
        "Wei Wang"
    ],
    "doi": "10.1109/ICDE65448.2025.00087",
    "arxivId": "2404.16322",
    "url": "https://www.semanticscholar.org/paper/576e652e36f539b13c7d17cb5bba8cd22be279a9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Approximate K Nearest Neighbor (AKNN) search in high-dimensional spaces is a critical yet challenging problem. In AKNN search, distance computation is the core task that dominates the runtime. Existing approaches typically use approx-imate distances to improve computational efficiency, often at the cost of reduced search accuracy. To address this issue, the state-of-the-art method, ADSampling, employs random projections to estimate approximate distances and introduces an additional distance correction process to mitigate accuracy loss. However, ADSampling has limitations in both effectiveness and generality, primarily due to its heavy reliance on random projections for distance approximation and correction. Motivated by this, we leverage data distribution to improve distance approximation via orthogonal projection, thereby ad-dressing the effectiveness limitation of ADSampling; we also adopt a data-driven approach to distance correction, decoupling the correction process from the distance approximation process, thereby overcoming the generality limitation of ADSampling. Ex-tensive experiments demonstrate the superiority and effectiveness of our method. In particular, compared to ADSampling, our method achieves a speedup of 1.6 to 2.1 times on real-world datasets while providing higher accuracy. In addition, our method shows superior performance in Ant Group image search scenarios and has been integrated into their search engine.",
    "citationCount": 5,
    "referenceCount": 47
}