{
    "paperId": "57b5c40987fd67b00c46b3b3fe6af7cc6741a435",
    "title": "ENDN: An Enhanced NDN Architecture with a P4-programmabIe Data Plane",
    "year": 2020,
    "venue": "Information-Centric Networking",
    "authors": [
        "Ouassim Karrakchou",
        "N. Samaan",
        "A. Karmouch"
    ],
    "doi": "10.1145/3405656.3418720",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/57b5c40987fd67b00c46b3b3fe6af7cc6741a435",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Named data networking (NDN) is a content-centric future Internet architecture that uses routable content names instead of IP addresses to achieve location-independent forwarding. Nevertheless, NDN's design is limited to offering hosted applications a simple content pull mechanism. As a result, increased complexity is needed in developing applications that require more sophisticated content delivery functionalities (e.g., push, publish/subscribe, streaming, generalized forwarding, and dynamic content naming). In this paper, we introduce a novel Enhanced NDN (ENDN) architecture that offers an extensible catalog of content delivery services (e.g., adaptive forwarding, customized monitoring, and in-network caching control) that can be programmed in the data plane using customizable P4 programs. More precisely, the proposed architecture allows hosted applications to associate their content namespaces with a set of services offered by the ENDN control plane. The controller then configures the data plane, which is comprised of two main modules: the enhanced packet processing and the forwarding logic modules. The former parses the packets and queries the enhanced content-based forwarding tables to generate a set of metadata fields used by P4 functions. The latter module is a novel P4 target architecture that executes these P4 functions on the arriving packets. The new architecture extends existing P4 models to overcome their limitations with respect to processing string-based content names. It also allows running independent P4 functions in isolation, thus enabling P4 code run-time pluggability. Experimental results demonstrate the ability of ENDN to achieve network efficiency with low latency.",
    "citationCount": 19,
    "referenceCount": 49
}