{
    "paperId": "57b6d5d80a1caadb47aa19ebed886ada3fa9f829",
    "title": "Search Games with Predictions",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Spyros Angelopoulos",
        "Thomas Lidbetter",
        "Konstantinos Panagiotou"
    ],
    "doi": "10.48550/arXiv.2401.01149",
    "arxivId": "2401.01149",
    "url": "https://www.semanticscholar.org/paper/57b6d5d80a1caadb47aa19ebed886ada3fa9f829",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We introduce the study of search games between a mobile Searcher and an immobile Hider in a new setting in which the Searcher has some potentially erroneous information, i.e., a prediction on the Hider's position. The objective is to establish tight tradeoffs between the consistency of a search strategy (i.e., its worst case expected payoff assuming the prediction is correct) and its robustness (i.e., the worst case expected payoff with no assumptions on the quality of the prediction). Our study is the first to address the full power of mixed (randomized) strategies; previous work focused only on deterministic strategies, or relied on stochastic assumptions that do not guarantee worst-case robustness in adversarial situations. We give Pareto-optimal strategies for three fundamental problems, namely searching in discrete locations, searching with stochastic overlook, and searching in the infinite line. As part of our contribution, we provide a novel framework for proving optimal tradeoffs in search games which is applicable, more broadly, to any two-person zero-sum games in learning-augmented settings.",
    "citationCount": 2,
    "referenceCount": 62
}