{
    "paperId": "57d01802b461c0063c32e519f015336c51a42f49",
    "title": "Lindorm-UWC: An Ultra-Wide-Column Database for Internet of Vehicles",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Qianyu Ouyang",
        "Chunhui Shen",
        "Wenlong Yang",
        "Peng Yu",
        "Qiang Xiao",
        "Jianhui Lei",
        "Yadong Chen",
        "Qilu Zhong",
        "Xiang Wang",
        "Yong Lin",
        "Qingyi Meng",
        "Zhicheng Ji",
        "Wei Meng",
        "Cen Zheng",
        "Sheng Wang",
        "Dan Pei",
        "Wei Zhang",
        "Feifei Li",
        "Jingren Zhou"
    ],
    "doi": "10.14778/3685800.3685831",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/57d01802b461c0063c32e519f015336c51a42f49",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the Internet of Vehicle (IoV) systems, intelligent vehicles generate huge amounts of data that supports diverse services and applications. In practice, database systems are deployed in the cloud to manage data uploaded from the vehicle side and provide real-time query capacities. However, existing database systems are ill-suited because IoV data contains a large number of metrics and is written at an extremely high throughput. To better understand IoV data and corresponding challenges to underlying database systems, we conduct the first extensive empirical study of real-world IoV workloads. According to our findings from the study, we design Lindorm-UWC as a superior database for IoV systems. It implements a distributed architecture and a cold/hot data separation mechanism to accommodate massive amounts of IoV data. In each data partition, it deploys an ultra-wide-column storage engine to efficiently handle the query and ingestion of multi-metric data. We evaluate Lindorm-UWC under different data scales and various types of query. Our experimental results show that it can always achieve higher write throughput (over 79% increase) and competitive query performance compared to various alternative solutions. Lindorm-UWC has been serving IoV enterprise customers on Alibaba Cloud since 2019, managing tens of petabytes of IoV data.",
    "citationCount": 0,
    "referenceCount": 33
}