{
    "paperId": "580415767f0aa8df49fe7501cf4ddc69bed5e164",
    "title": "GPE: Global Position Embedding for Trajectory Similarity Computation",
    "year": 2025,
    "venue": "Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.2",
    "authors": [
        "Yuanjun Liu",
        "Guanfeng Liu",
        "Qingzhi Ma",
        "Zhixu Li",
        "Lei Zhao",
        "An Liu"
    ],
    "doi": "10.1145/3711896.3736986",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/580415767f0aa8df49fe7501cf4ddc69bed5e164",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Trajectory similarity computation is a fundamental functionality in trajectory data mining, with wide-ranging applications in location-based services. Position embedding, which transforms GPS points into embedding vectors, plays a critical role in learning-based trajectory similarity models. The quality of these embeddings significantly impacts the performance of the models on downstream tasks. Existing methods fail to satisfy all good properties, i.e., global, continuous, unique, and dynamic, thereby limiting the development of trajectory similarity computation in both local and global scenarios. Inspired by linear counting systems, such as the decimal system, we first propose the łambda-base circular system to embed positions on the circle, then introduce the multi-base global embedding method GPE to encode global positions into vectors. Experiments conducted on five real-world datasets with nine baseline methods demonstrate that the GPE achieves state-of-the-art performance across four key evaluations in downstream tasks.",
    "citationCount": 0,
    "referenceCount": 58
}