{
    "paperId": "580b8ce8be2ae36f806620664c1a8d8f47846c69",
    "title": "A Systematic Review of the Impact of Auxiliary Information on Recommender Systems",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Matthew O. Ayemowa",
        "Roliana Ibrahim",
        "Yunusa Adamu Bena"
    ],
    "doi": "10.1109/ACCESS.2024.3462750",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/580b8ce8be2ae36f806620664c1a8d8f47846c69",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3462750",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender systems are essential tools that provide personalized user experiences across various domains such as e-commerce, entertainment, social media, education and content streaming. The integration of auxiliary information, including user demographics, item attributes, and contextual data has shown significant promise in enhancing the performance of recommender systems. This systematic review investigates the impact of incorporating auxiliary information into various types of recommender systems, examining recent advancements, methodologies, datasets, evaluation metrics, and to equally examine its significance on generative artificial intelligence. Similarly, five (5) reputable online databases were used to identify the relevant studies for answering our research questions. To obtain effective results of our findings, we focus more on the recent studies published between (2019 - June 2024) to ensure that of our findings up-to-date. After filtering the selected primary papers that solely focused on auxiliary information recommender systems a total of 37 papers were identified and analyzed. Our analysis shows the most utilized datasets, metrics, models, addressed issues and future works. Research limitations and future scope are also highlighted to assist researchers and practitioners for their future studies.",
    "citationCount": 0,
    "referenceCount": 99
}