{
    "paperId": "5815075c70bf5113d4ab2ab4fc078913674a27ce",
    "title": "Machine Learning and Physics: A Survey of Integrated Models",
    "year": 2023,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Azra Seyyedi",
        "M. Bohlouli",
        "Seyedehsan Nedaaee Oskoee"
    ],
    "doi": "10.1145/3611383",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5815075c70bf5113d4ab2ab4fc078913674a27ce",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predictive modeling of various systems around the world is extremely essential from the physics and engineering perspectives. The recognition of different systems and the capacity to predict their future behavior can lead to numerous significant applications. For the most part, physics is frequently used to model different systems. Using physical modeling can also very well help the resolution of complexity and achieve superior performance with the emerging field of novel artificial intelligence and the challenges associated with it. Physical modeling provides data and knowledge that offer a meaningful and complementary understanding about the system. So, by using enriched data and training phases, the overall general integrated model achieves enhanced accuracy. The effectiveness of hybrid physics-guided or machine learning-guided models has been validated by experimental results of diverse use cases. Increased accuracy, interpretability, and transparency are the results of such hybrid models. In this article, we provide a detailed overview of how machine learning and physics can be integrated into an interactive approach. Regarding this, we propose a classification of possible interactions between physical modeling and machine learning techniques. Our classification includes three types of approaches: (1) physics-guided machine learning (2) machine learning-guided physics, and (3) mutually-guided physics and ML. We studied the models and specifications for each of these three approaches in-depth for this survey.",
    "citationCount": 19,
    "referenceCount": 202
}