{
    "paperId": "581cb261b7015b2237d6c8195208554b1dac84a7",
    "title": "A High-Efficiency SoC for Next-Generation Mobile DNA Sequencing",
    "year": 2025,
    "venue": "",
    "authors": [
        "Abel Beyene",
        "Zhongpan Wu",
        "Yunus Dawji",
        "Karim Hammad",
        "Ebrahim Ghafar-Zadeh",
        "S. Magierowski"
    ],
    "doi": null,
    "arxivId": "2510.08940",
    "url": "https://www.semanticscholar.org/paper/581cb261b7015b2237d6c8195208554b1dac84a7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hand-sized Deoxyribonucleic acid (DNA) sequencing machines are of growing importance in several life sciences fields as their small footprints enable a broader range of use cases than their larger, stationary counterparts. However, as currently designed, they lack sufficient embedded computing to process the large volume of measurements generated by their internal sensory system. As a consequence, they rely on external devices for additional processing capability. This dependence on external processing places a significant communication burden on the sequencer's embedded electronics. Moreover, it also prevents a truly mobile solution for sequencing in real-time. Anticipating next-generation machines that include suitably advanced processing, we present a System-on-Chip (SoC) fabricated in 22-nm complementary metal-oxide semiconductor (CMOS). Our design, based on a general-purpose reduced instruction set computing (RISC-V) core, also includes accelerators for DNA detection that allow our system to demonstrate a 13X performance improvement over commercial embedded multicore processors combined with a near 3000X boost in energy efficiency.",
    "citationCount": 0,
    "referenceCount": 57
}