{
    "paperId": "58bc47f751054111f64de2c5b5d17985f457a2be",
    "title": "Deep Learning-accelerated MRI in Body and Chest.",
    "year": 2025,
    "venue": "Journal of computer assisted tomography",
    "authors": [
        "Naveen Rajamohan",
        "Barun Bagga",
        "Bhavik Bansal",
        "Luke Ginocchio",
        "Amit Gupta",
        "H. Chandarana"
    ],
    "doi": "10.1097/RCT.0000000000001762",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/58bc47f751054111f64de2c5b5d17985f457a2be",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning reconstruction (DLR) provides an elegant solution for MR acceleration while preserving image quality. This advancement is crucial for body imaging, which is frequently marred by the increased likelihood of motion-related artifacts. Multiple vendor-specific models focusing on T2, T1, and diffusion-weighted imaging have been developed for the abdomen, pelvis, and chest, with the liver and prostate being the most well-studied organ systems. Variational networks with supervised DL models, including data consistency layers and regularizers, are the most common DLR methods. The common theme for all single-center studies on this subject has been noninferior or superior image quality metrics and lesion conspicuity to conventional sequences despite significant acquisition time reduction. DLR also provides a potential for denoising, artifact reduction, increased resolution, and increased signal-noise ratio (SNR) and contrast-to-noise ratio (CNR) that can be balanced with acceleration benefits depending on the imaged organ system. Some specific challenges faced by DLR include slightly reduced lesion detection, cardiac motion-related signal loss, regional SNR variations, and variabilities in ADC measurements as reported in different organ systems. Continued investigations with large-scale multicenter prospective clinical validation of DLR to document generalizability and demonstrate noninferior diagnostic accuracy with histopathologic correlation are the need of the hour. The creation of vendor-neutral solutions, open data sharing, and diversifying training data sets are also critical to strengthening model robustness.",
    "citationCount": 0,
    "referenceCount": 81
}