{
    "paperId": "58bca4b4f4f4af953befdef63b76c22ed88c6472",
    "title": "Genetic Cache: A Machine Learning Approach to Designing DRAM Cache Controllers in HBM Systems",
    "year": 2024,
    "venue": "ACM Journal on Emerging Technologies in Computing Systems",
    "authors": [
        "Morteza Amouzegar",
        "Morteza Rezaalipour",
        "M. Dehyadegari"
    ],
    "doi": "10.1145/3676966",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/58bca4b4f4f4af953befdef63b76c22ed88c6472",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "DRAM memory controller plays a critical role in maximizing the performance of high bandwidth memory by efficiently managing data transfers between the CPU and the memory modules. Thus, they are suitable for low-power data-intensive applications. However, the complexity of DRAM command scheduling combined with tag management overheads in the cache makes the design of in-package cache controllers significantly challenging. Traditional memory controllers often face challenges with static, inflexible access scheduling designed for general applications, leading to suboptimal performance in dynamic environments. On the other hand, while some advanced controllers employing reinforcement learning offer adaptability to workload fluctuations, they tend to introduce hardware complexity and incur longer training latencies. Our approach aims to design low-power and efficient DRAM cache controllers using a machine learning model that dynamically adjusts to workload changes with optimized hardware efficiency and reduced training time. Therefore, we propose a machine learning approach to design low-power and efficient DRAM cache controllers that will leverage the trained model to produce optimal cache command schedules at runtime. The model considers several conditions for each request queue and chooses the best response among the options. The simulation results show the superiority of our proposed design over the previous algorithms in a set of twelve data-intensive applications; our model is able to improve the performance by up to 40% in some cases and an average of 15% in performance and 10% in power consumption.",
    "citationCount": 0,
    "referenceCount": 72
}