{
    "paperId": "58d8eb7452e1831c0b3765987988c488a93a766b",
    "title": "An Efficient and Privacy-Preserving Biometric Identification Scheme Based on the FITing-Tree",
    "year": 2021,
    "venue": "Security and Communication Networks",
    "authors": [
        "Xiaopeng Yang",
        "Hui Zhu",
        "Songnian Zhang",
        "Rongxing Lu",
        "Xuesong Gao"
    ],
    "doi": "10.1155/2021/2313389",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/58d8eb7452e1831c0b3765987988c488a93a766b",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/scn/2021/2313389.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Biometric identification services have been applied to almost all aspects of life. However, how to securely and efficiently identify an individual in a huge biometric dataset is still very challenging. For one thing, biometric data is very sensitive and should be kept secure during the process of biometric identification. On the other hand, searching a biometric template in a large dataset can be very time-consuming, especially when some privacy-preserving measures are adopted. To address this problem, we propose an efficient and privacy-preserving biometric identification scheme based on the FITing-tree, iDistance, and a symmetric homomorphic encryption (SHE) scheme with two cloud servers. With our proposed scheme, the privacy of the user’s identification request and service provider’s dataset is guaranteed, while the computational costs of the cloud servers in searching the biometric dataset can be kept at an acceptable level. Detailed security analysis shows that the privacy of both the biometric dataset and biometric identification request is well protected during the identification service. In addition, we implement our proposed scheme and compare it to a previously reported M-Tree based privacy-preserving identification scheme in terms of computational and communication costs. Experimental results demonstrate that our proposed scheme is indeed efficient in terms of computational and communication costs while identifying a biometric template in a large dataset.",
    "citationCount": 1,
    "referenceCount": 35
}