{
    "paperId": "58f7cfe5293e0721bd20e8f2aca0e9617449d725",
    "title": "“What Can I Cook with these Ingredients?” - Understanding Cooking-Related Information Needs in Conversational Search",
    "year": 2021,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Alexander Frummet",
        "David Elsweiler",
        "Bernd Ludwig"
    ],
    "doi": "10.1145/3498330",
    "arxivId": "2112.04788",
    "url": "https://www.semanticscholar.org/paper/58f7cfe5293e0721bd20e8f2aca0e9617449d725",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3498330",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As conversational search becomes more pervasive, it becomes increasingly important to understand the users’ underlying information needs when they converse with such systems in diverse domains. We conduct an in situ study to understand information needs arising in a home cooking context as well as how they are verbally communicated to an assistant. A human experimenter plays this role in our study. Based on the transcriptions of utterances, we derive a detailed hierarchical taxonomy of diverse information needs occurring in this context, which require different levels of assistance to be solved. The taxonomy shows that needs can be communicated through different linguistic means and require different amounts of context to be understood. In a second contribution, we perform classification experiments to determine the feasibility of predicting the type of information need a user has during a dialogue using the turn provided. For this multi-label classification problem, we achieve average F1 measures of 40% using BERT-based models. We demonstrate with examples which types of needs are difficult to predict and show why, concluding that models need to include more context information in order to improve both information need classification and assistance to make such systems usable.",
    "citationCount": 22,
    "referenceCount": 113
}