{
    "paperId": "592736b0a23240cca8423ea5753df838bbfe4cd0",
    "title": "Leopard: Hardware Pass-Through Remote Storage Access with Queue Concurrency for Edge Intelligent Workstations",
    "year": 2025,
    "venue": "Design Automation Conference",
    "authors": [
        "Wenjie Wang",
        "Bo Peng",
        "Jianguo Yao",
        "Haibing Guan"
    ],
    "doi": "10.1109/DAC63849.2025.11133404",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/592736b0a23240cca8423ea5753df838bbfe4cd0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Edge intelligent workstations load (store) massive empirical data from (to) remote cloud storage due to limited local storage. However, current remote storage access frameworks are complex. They use expensive computing resources to manipulate multiple concurrent request queues in modern high-speed storage devices for saturating performance. Complex software stacks and limited CPUs on edge intelligent workstations hinder saturating concurrent request queues, thus resulting in up to $75 \\%$ performance degradation for remote storage. We propose Leopard, a hardware pass-through remote storage access framework with queue concurrency, which provides lossless remote storage access for edge intelligence. Leopard proposes a custom NVMe controller using SmartNIC’s FPGA core to emulate it as an NVMe device, which eliminates complex remote storage stacks for edge workstations. Operations for remote storage access are implemented as hardware circuits inside the controller to eliminate CPU cycles. Parallelized and pipelined workflows are proposed for hardware circuits to accelerate remote storage access operations. Our evaluation presents that Leopard exhibits $1.09 \\times \\sim 6.04 \\times$ lower remote storage access latency than SOTA solutions for realistic workloads in edge intelligent workstations.",
    "citationCount": 0,
    "referenceCount": 39
}