{
    "paperId": "596ac0423a24e4735a629b1372e8a69cec7c5077",
    "title": "Algorithm Generation via Creative Ideation",
    "year": 2025,
    "venue": "",
    "authors": [
        "Ruiying Ma",
        "Chieh-Jan Mike Liang",
        "Yanjie Gao",
        "Francis Y. Yan"
    ],
    "doi": null,
    "arxivId": "2510.03851",
    "url": "https://www.semanticscholar.org/paper/596ac0423a24e4735a629b1372e8a69cec7c5077",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Designing system algorithms remains challenging, where the discontinuous nature of the solution space often forces system engineers to rely on generic heuristics at the expense of performance. We study whether LLMs can practically drive algorithm generation, and find that they are biased towards well-known generic designs, rather than making the creative leaps needed to navigate the discontinuous solution space. To address this limitation, we introduce MetaMuse, a framework for creative ideation built on three self-reflection principles: (1) quantifying solution diversity and usefulness in measurable performance space, rather than abstract idea space, (2) steering ideation through external stimuli, rather than internal randomness, and (3) constructing executable solutions using waypoint reasoning, rather than free-form chain-of-thought. Extensive evaluation shows that MetaMuse can generate high-performing solutions for two critical problems at a global cloud provider: cache replacement (reducing cache misses by up to 35.76%) and online bin packing (reducing bin usage by up to 30.93%).",
    "citationCount": 1,
    "referenceCount": 54
}