{
    "paperId": "598d455c622abefcebc0b5b98f68d81324d57c7e",
    "title": "Flexible Interactive Guided Image Matting",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Hang Cheng",
        "Shugong Xu",
        "Fengjun Guo"
    ],
    "doi": "10.1109/ACCESS.2023.3281985",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/598d455c622abefcebc0b5b98f68d81324d57c7e",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/10005208/10141564.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image matting is an important computer vision problem. Many existing matting methods leverage a hand-made trimap to provide auxiliary information, which is expensive and time-consuming for real-world applications. In recent years, some trimap-free methods have been proposed, which completely get rid of any user input. However, their performance lag far behind trimap-based methods due to the ambiguity problem. This paper proposes a matting method that uses flexible interactive guidance as user hints, which means the proposed method can use trimap, scribblemap, clickmap, and bounding box as guidance information or can even work without any guidance input. Our goal is to maintain accuracy while simplifying input. To achieve this, we propose Progressive Trimap Deformation (PTD) scheme that gradually transforms the input trimaps into scribblemaps during training. To enable bounding box input, based on the same network, this paper proposes Progressive Bounding Box Deformation (PBD) scheme that gradually turns trimaps into bounding box masks during training. To further ensure the stability of training and enhance performance, this paper also introduces the Random Deformation Degree scheme. Experiments show that the proposed method can achieve competitive results compared with existing trimap-based and trimap-free methods.",
    "citationCount": 0,
    "referenceCount": 34
}