{
    "paperId": "5997a1a3b6d6b182bcdfa08280f6bfe9b0c83ea9",
    "title": "Integrated multi-omics analysis and functional validation uncovers RPL26 roles in regulating growth traits of Asian water buffaloes (Bubalus bubalis)",
    "year": 2025,
    "venue": "BMC Genomics",
    "authors": [
        "Yangyang Shen",
        "Zhenjiang An",
        "Linna Gao",
        "Mingfa Gu",
        "Shuwen Xia",
        "Qiang Ding",
        "Yinxia Li",
        "Shaoxian Cao",
        "Jianbin Li",
        "Jinming Huang",
        "Jifeng Zhong",
        "Kunlin Chen",
        "Xiao Wang",
        "Huili Wang"
    ],
    "doi": "10.1186/s12864-025-11618-6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5997a1a3b6d6b182bcdfa08280f6bfe9b0c83ea9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Asian water buffaloes (Bubalus bubalis) in the Yangtze River Basin of China are the important meat provider for local residents because of its outstanding body size. Several previous studies have highlighted their genetic basis of growth characteristics, but the crucial genes regulating growth traits via multi-layer omics are still rarely investigated. Results We conducted a comprehensive multi-omics analysis integrating blood and muscle transcriptome, plasma metabolome, rumen fluid metagenome, and genome of Haizi water buffaloes. Of note, ribosomal protein L26 (RPL26) located in the evolutionary selection regions associated with body sizes is the top differentially expressed gene (DEG) in both blood and muscle tissues. Further metabolomics and metagenomics identified growth-related molecular biomarkers (myristicin and Bacteroidales) and microbiological composition (Bacteroides and Prevotella). Leveraging cattle quantitative trait loci (QTLs) and genotype-tissue expression (CattleGTEx) databases, we found the significant correlations of QTL_180979 on RPL26 and two identified cis-eQTLs in muscle tissue in the upstream of RPL26 with weight gain. The follow-up cell assay validations confirmed the regulation roles of RPL26 in cell cycle, apoptosis, and differentiation, where the low RPL26 expressions enhanced the antiapoptotic ability and promoted the differentiation of myoblasts into myotubes markedly. Conclusions Our study illustrates RPL26 roles in regulating growth traits via both integrated multi-omics analysis and functional validations that suggests the further applications of RPL26 for growth trait selection of water buffaloes. Supplementary Information The online version contains supplementary material available at 10.1186/s12864-025-11618-6.",
    "citationCount": 0,
    "referenceCount": 57
}