{
    "paperId": "59a0f375675fbe69e7fe8838cd72e411c5864cfd",
    "title": "ByteComp: Revisiting Gradient Compression in Distributed Training",
    "year": 2022,
    "venue": "",
    "authors": [
        "Zhuang Wang",
        "Haibin Lin",
        "Yibo Zhu",
        "T. Ng"
    ],
    "doi": null,
    "arxivId": "2205.14465",
    "url": "https://www.semanticscholar.org/paper/59a0f375675fbe69e7fe8838cd72e411c5864cfd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Gradient compression (GC) is a promising approach to addressing the communication bottleneck in distributed deep learning (DDL). However, it is challenging to find the optimal compression strategy for applying GC to DDL because of the intricate interactions among tensors. To fully unleash the benefits of GC, two questions must be addressed: 1) How to express all compression strategies and the corresponding interactions among tensors of any DDL training job? 2) How to quickly select a near-optimal compression strategy? In this paper, we propose ByteComp to answer these questions. It first designs a decision tree abstraction to express all the compression strategies and develops empirical models to timeline tensor computation, communication, and compression to enable ByteComp to derive the intricate interactions among tensors. It then designs a compression decision algorithm that analyzes tensor interactions to eliminate and prioritize strategies and optimally offloads compression to CPUs. Experimental evaluations show that ByteComp can improve the training throughput over the start-of-the-art compression-enabled system by up to 77% for representative DDL training jobs. Moreover, the computational time needed to select the compression strategy is measured in milliseconds, and the selected strategy is only a few percent from optimal.",
    "citationCount": 2,
    "referenceCount": 76
}