{
    "paperId": "59a5441d96f6e876b01ff5488e4e4f324a95f2d7",
    "title": "Joint Item Embedding Dual-view Exploration and Adaptive Local-Global Fusion for Federated Recommendation",
    "year": 2025,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Pengyang Zhou",
        "Chaochao Chen",
        "Weiming Liu",
        "Wenkai Shen",
        "Xinting Liao",
        "Huarong Deng",
        "Zhihui Fu",
        "Jun Wang",
        "Wu Wen",
        "Xiaolin Zheng"
    ],
    "doi": "10.1145/3726302.3730016",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59a5441d96f6e876b01ff5488e4e4f324a95f2d7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Federated Recommendation (FedRec) enables joint training across a large number of clients without centralizing user interaction data. However, existing FedRec methods overlook two key challenges, i.e. (1) sufficiently explore the global item embedding space, and (2) effectively achieve local and global collaboration. The former is caused by client sparsity, which leads to suboptimal item embeddings and subsequently impacts the global item embedding in both the dimension and sample views. The latter arises from the lack of modeling the relative importance of local and global contributions to personalized user preferences. To address the above challenges, we propose FedIAR which contains two modules, i.e., item embedding dual-view exploration and adaptive local-global fusion. The first module enhances the global item embedding by reducing redundancy in the dimension view and capturing latent item relationships in the sample view, improving representational capacity. The second module enables the adaptive fusion of local and global item embeddings based on the user preference representation, achieving personalized optimum for recommendation. Extensive experiments on six datasets demonstrate the effectiveness of FedIAR in improving federated recommendation performance.",
    "citationCount": 1,
    "referenceCount": 56
}