{
    "paperId": "59b3c1c74cd803b620742d34429d4e8e4b73cf1c",
    "title": "Revolutionizing Data Exchange Through Intelligent Automation: Insights and Trends",
    "year": 2025,
    "venue": "De Computis",
    "authors": [
        "Yeison Nolberto Cardona-Álvarez",
        "A. Álvarez-Meza",
        "G. Castellanos-Domínguez"
    ],
    "doi": "10.3390/computers14050194",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59b3c1c74cd803b620742d34429d4e8e4b73cf1c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This review paper presents a comprehensive analysis of the evolving landscape of data exchange, with a particular focus on the transformative role of emerging technologies such as blockchain, field-programmable gate arrays (FPGAs), and artificial intelligence (AI). We explore how the integration of these technologies into data management systems enhances operational efficiency, precision, and security through intelligent automation and advanced machine learning techniques. The paper also critically examines the key challenges facing data exchange today, including issues of interoperability, the demand for real-time processing, and the stringent requirements of regulatory compliance. Furthermore, it underscores the urgent need for robust ethical frameworks to guide the responsible use of AI and to protect data privacy. In addressing these challenges, the paper calls for innovative research aimed at overcoming current limitations in scalability and security. It advocates for interdisciplinary approaches that harmonize technological innovation with legal and ethical considerations. Ultimately, this review highlights the pivotal role of collaboration among researchers, industry stakeholders, and policymakers in fostering a digitally inclusive future—one that strengthens data exchange practices while upholding global standards of fairness, transparency, and accountability.",
    "citationCount": 1,
    "referenceCount": 90
}