{
    "paperId": "59b8f0406c307eca30064c07135747ef982452be",
    "title": "Towards Label-Efficient Human Matting: A Simple Baseline for Weakly Semi-Supervised Trimap-Free Human Matting",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Beomyoung Kim",
        "Myeong Yeon Yi",
        "Joonsang Yu",
        "Y. Yoo",
        "Sung Ju Hwang"
    ],
    "doi": "10.48550/arXiv.2404.00921",
    "arxivId": "2404.00921",
    "url": "https://www.semanticscholar.org/paper/59b8f0406c307eca30064c07135747ef982452be",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a new practical training method for human matting, which demands delicate pixel-level human region identification and significantly laborious annotations. To reduce the annotation cost, most existing matting approaches often rely on image synthesis to augment the dataset. However, the unnaturalness of synthesized training images brings in a new domain generalization challenge for natural images. To address this challenge, we introduce a new learning paradigm, weakly semi-supervised human matting (WSSHM), which leverages a small amount of expensive matte labels and a large amount of budget-friendly segmentation labels, to save the annotation cost and resolve the domain generalization problem. To achieve the goal of WSSHM, we propose a simple and effective training method, named Matte Label Blending (MLB), that selectively guides only the beneficial knowledge of the segmentation and matte data to the matting model. Extensive experiments with our detailed analysis demonstrate our method can substantially improve the robustness of the matting model using a few matte data and numerous segmentation data. Our training method is also easily applicable to real-time models, achieving competitive accuracy with breakneck inference speed (328 FPS on NVIDIA V100 GPU). The implementation code is available at \\url{https://github.com/clovaai/WSSHM}.",
    "citationCount": 2,
    "referenceCount": 61
}