{
    "paperId": "59c5582d5b4e1f20059e91cedfcb8c24eab85662",
    "title": "Stochastic compact model for memory and threshold switching memristors",
    "year": 2025,
    "venue": "APL Machine Learning",
    "authors": [
        "J. Suñé",
        "Enrique Miranda"
    ],
    "doi": "10.1063/5.0255043",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59c5582d5b4e1f20059e91cedfcb8c24eab85662",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Memristors are electron devices whose resistance changes according to the history of electrical signals applied to their two terminals. These resistance changes can remain for very long times or relax after a short time. Thus, memristors can be used as electronic synapses and neurons in artificial neural networks implemented in hardware. These fully memristive neuromorphic circuits are mainly intended for artificial intelligence applications. In this work, we explore the properties of a stochastic compact model for the electrical behavior of memristors in the two regimes of long-time (non-volatile) and short-time (volatile) memory for synapse and neuron functions, respectively. In the case of non-volatile memristors, we focus on potentiation/depression transients, programming energy, programming time, and power requirements for writing conductance weights in artificial network crossbars. As for volatile memristors, we consider the modeling of their behavior in the context of a leaky-integrate-and-fire neuron, demonstrating how the model captures the threshold activation function and the input signal frequency dependence.",
    "citationCount": 0,
    "referenceCount": 36
}