{
    "paperId": "59d6705eecb832c1dd75ba156977e107a0e7c677",
    "title": "Harnessing Principal Component Analysis and Artificial Neural Networks for Accurate Solar Radiation Prediction",
    "year": 2025,
    "venue": "International Journal of Energy Research",
    "authors": [
        "Oussama Khouili",
        "Mohamed Hanine",
        "M. Louzazni"
    ],
    "doi": "10.1155/er/5846114",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59d6705eecb832c1dd75ba156977e107a0e7c677",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate solar radiation prediction is essential for optimizing renewable energy systems and supporting grid stability. This study investigates the use of principal component analysis (PCA) for dimensionality reduction in solar radiation prediction models, followed by an evaluation of the models’ performance across varying feature sets. A series of case studies were conducted, comparing models using raw meteorological inputs with those employing reduced principal components (PCs) as inputs. Results demonstrate that while retaining fewer PCs reduces computational complexity, it can significantly affect model performance. The model with all meteorological inputs achieved the best results with an R2 of 0.99198, MSE of 562.612, and MAPE of 0.1899%. By contrast, the single‐PC model exhibited an R2 of 0.11699 and MAPE of 64.5897%, highlighting the trade‐off between dimensionality reduction and prediction accuracy. The study also emphasizes the computational efficiency gained through PCA, particularly in high‐dimensional datasets. Future directions include integrating hybrid feature extraction techniques, leveraging advanced deep learning architectures, and exploring temporal and spatial dynamics to further refine prediction accuracy. The findings provide a roadmap for developing scalable and interpretable solar radiation prediction models, advancing their integration into real‐time renewable energy systems.",
    "citationCount": 5,
    "referenceCount": 20
}