{
    "paperId": "59d8797d4ff56ca4289a03026e9e84ce99372131",
    "title": "A General-Purpose Self-Supervised Model for Computational Pathology",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Richard J. Chen",
        "Tong Ding",
        "Ming Y. Lu",
        "Drew F. K. Williamson",
        "Guillaume Jaume",
        "Bowen Chen",
        "Andrew Zhang",
        "Daniel Shao",
        "Andrew H. Song",
        "M. Shaban",
        "Mane Williams",
        "Anurag Vaidya",
        "S. Sahai",
        "Lukas Oldenburg",
        "Luca L. Weishaupt",
        "Judy J. Wang",
        "Walt Williams",
        "L. Le",
        "G. Gerber",
        "Faisal Mahmood"
    ],
    "doi": "10.48550/arXiv.2308.15474",
    "arxivId": "2308.15474",
    "url": "https://www.semanticscholar.org/paper/59d8797d4ff56ca4289a03026e9e84ce99372131",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2308.15474",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tissue phenotyping is a fundamental computational pathology (CPath) task in learning objective characterizations of histopathologic biomarkers in anatomic pathology. However, whole-slide imaging (WSI) poses a complex computer vision problem in which the large-scale image resolutions of WSIs and the enormous diversity of morphological phenotypes preclude large-scale data annotation. Current efforts have proposed using pretrained image encoders with either transfer learning from natural image datasets or self-supervised pretraining on publicly-available histopathology datasets, but have not been extensively developed and evaluated across diverse tissue types at scale. We introduce UNI, a general-purpose self-supervised model for pathology, pretrained using over 100 million tissue patches from over 100,000 diagnostic haematoxylin and eosin-stained WSIs across 20 major tissue types, and evaluated on 33 representative CPath clinical tasks in CPath of varying diagnostic difficulties. In addition to outperforming previous state-of-the-art models, we demonstrate new modeling capabilities in CPath such as resolution-agnostic tissue classification, slide classification using few-shot class prototypes, and disease subtyping generalization in classifying up to 108 cancer types in the OncoTree code classification system. UNI advances unsupervised representation learning at scale in CPath in terms of both pretraining data and downstream evaluation, enabling data-efficient AI models that can generalize and transfer to a gamut of diagnostically-challenging tasks and clinical workflows in anatomic pathology.",
    "citationCount": 49,
    "referenceCount": 208
}