{
    "paperId": "59e1b3896d7905b3962ca06363a6a4d9df186d30",
    "title": "A review on prediction of diabetes type 2 by machine learning techniques",
    "year": 2021,
    "venue": "",
    "authors": [
        "Alka Singh"
    ],
    "doi": "10.17762/TURCOMAT.V12I3.2238",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59e1b3896d7905b3962ca06363a6a4d9df186d30",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.17762/turcomat.v12i3.2238",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning is considered to be one of the most promising tools when it comes to working with heterogeneous data. It provides a new dimension which enables one to extract relevant data and take decision for the effective functioning of the network, making use of network generated data. Every sphere of our life is now dependent on machine learning. It has flourished in every dimension. Making it versatile and ever demanding. Department of healthcare contains very abundant and sensitive information which is needed to be carefully handled. Diabetes mellitus is increasing exponentially and is spreading like anything in the world. A reliable prediction system should be present for diagnosing diabetes. Variety of machine learning techniques find their use in the examination of data from variant perspectives and summarizing it into effective information. Usage of new patterns is done to elucidate these patterns in order to deliver relevant information for their users. By making use of techniques such as SVM, random forest, logistic regression, naïve bayes etc the prediction of diabetes can be done easily and accurately. In this study we will make use of different machine learning techniques and try to find accurate prediction regarding the same.",
    "citationCount": 0,
    "referenceCount": 37
}