{
    "paperId": "59f7b992399fee9c998ea6c51523a807a8b6f967",
    "title": "Genomic and Transcriptomic Analyses Revealed DdSTE2 Play a Role in Constricting Ring Formation in the Nematode-Trapping Fungi Drechslerella dactyloides",
    "year": 2024,
    "venue": "Microorganisms",
    "authors": [
        "Cheng-Lin Wu",
        "Ren-Qiao Wang",
        "Jin-Ting Yang",
        "Jia-Mei Sun",
        "Yan-Rui Xu",
        "Jianping Xu",
        "Ke-Qin Zhang",
        "L. Liang"
    ],
    "doi": "10.3390/microorganisms12112190",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/59f7b992399fee9c998ea6c51523a807a8b6f967",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The carnivorous fungus Drechslerella dactyloides can form constricting rings through hyphal specialization to capture nematodes. The formation of constricting rings is a prerequisite for capturing nematodes and a characteristic of entering the carnivorous stage. Currently, there is limited research on the molecular mechanism of constricting ring formation. In this study, two D. dactyloides mutants unable to form constricting rings were obtained through UV irradiation mutagenesis, and their growth and development phenotypes were compared with the wild-type strain. Transcriptome comparisons revealed differences between the mutants and the wild-type strain in metabolic pathways related to cell wall structure, peroxisomes, lipid metabolism, and MAPK signal transduction, which we validated through qPCR. We further deleted one differentially expressed gene, DdSTE2, of the MAPK pathway and confirmed its role in conidiogenesis and trap formation in D. dactyloides. Together, our results indicate that the remodeling of cell wall structure, peroxisomes, lipid metabolism, and MAPK signal transduction pathways are involved in the formation and maturation of D. dactyloides constricting rings. We discuss the implications of these results for utilizing these fungi to control animal and plant parasitic nematodes.",
    "citationCount": 0,
    "referenceCount": 42
}