{
    "paperId": "5a281e09c0d106825afada8d5cfcbe7cddc3a836",
    "title": "Challenges and Solutions in Testing Mainframe Applications in Modern Banking",
    "year": 2024,
    "venue": "Journal for Research in Applied Sciences and Biotechnology",
    "authors": [
        "Ashwini Shivarudra"
    ],
    "doi": "10.55544/jrasb.3.5.13",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5a281e09c0d106825afada8d5cfcbe7cddc3a836",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Because the foundation of their operations is still housed in legacy systems, banks continue to use them. Banks must modify their systems to remain competitive in light of the swift changes in technology and customer needs. Mainframe systems have been an integral part of corporate computing for many years, enabling critical applications across a range of industries, including banking, retail, and healthcare. There is rising interest in leveraging Application Programming Interfaces (APIs) to expose these old apps' data and features, hence accelerating the construction of new applications and maximising their capability and enabling their reuse. Nonetheless, there are several obstacles to overcome in the process of locating and making available APIs for various business use cases. In this study, we examine the difficulties involved in developing APIs for mainframe systems that are no longer in use and suggest a unique architecture to enable communication for a range of use cases. We performed a qualitative poll with nine mainframe developers, whose average experience was fifteen years, to evaluate the efficacy of our methodology. We were able to determine which APIs were candidates and how long it would take to implement them for two industry mainframe applications and the public mainframe application GENAPP thanks to the poll. We create a list of artefacts, such as screens, transactions, business rules, inter-micro service calls, control flow blocks, and data accesses, in order to identify APIs. IBM Watsonx Code Assistant for Z Refactoring Assistant includes an implementation for computing API signatures. We proved the practicality of our technique by running the discovered APIs on an IBM Z mainframe system to assess their accuracy.",
    "citationCount": 2,
    "referenceCount": 72
}