{
    "paperId": "5a88c069e7fcb0451e389748df586c99d8281add",
    "title": "THE ROLE OF DATABASE SYSTEMS ON INNOVATION TOURISM: E-TOURISM IN INDONESIA",
    "year": 2021,
    "venue": "International Journal of Business Management and Economic Review",
    "authors": [
        "Khairun Mansyah",
        "Kaslim Sugiono",
        "Iskandar Muda"
    ],
    "doi": "10.35409/ijbmer.2021.3283",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5a88c069e7fcb0451e389748df586c99d8281add",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.35409/ijbmer.2021.3283",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Business",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet was designed to provide a simple and transparent end-to-end transfer service across a heterogeneous wired network infrastructure, allowing the exchange of information between two or more communication endpoints. A database is a system used to manage data on a computer system. There are several database work systems that have their own laws and ways of working. Data are arranged in various levels. In computer data are classified in a hierarchy. Modern data processing systems are designed to be general-purpose, in that they can handle a wide variety of different schemas, data types, and data distributions, and aim to provide efficient access to that data via the use of optimizers and cost models. This general purpose nature results in systems that do not take advantage of the characteristics of the particular application and data of the user. In general, E-Tourism is an application of information technology in the field of tourism in order to achieve effectiveness and efficiency in promoting the tourism sectors in Indonesia. By applying E-Tourism tourists and prospective ones are able to access tourism information fast and accurately.",
    "citationCount": 0,
    "referenceCount": 19
}