{
    "paperId": "5a8978c3608277bec5ef5df9a0aa712bc08298c7",
    "title": "Models for sustainable management of livestock waste based on neural network architectures",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Anatoliy Tryhuba",
        "Krzysztof Mudryk",
        "Inna Tryhuba",
        "Marian Kotsylovskyi",
        "D. Sorokin",
        "Olena Bezaltychna",
        "Pawel Pysz",
        "Taras Hutsol"
    ],
    "doi": "10.1038/s41598-025-13150-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5a8978c3608277bec5ef5df9a0aa712bc08298c7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study addresses the problem of minimizing the environmental impact of livestock production while improving the efficiency of livestock waste-to-energy conversion. A sustainable management approach based on neural network models is proposed and substantiated, focusing on predicting livestock waste generation and optimizing farm configurations. The novelty of this work lies in the development and validation of a multilayer perceptron (MLP) neural network model tailored to regional and production characteristics of cattle farms in western Ukraine. The approach includes 11 stages, from data preprocessing and feature selection to multiobjective optimization and emission assessment. The optimized MLP model demonstrated high predictive performance, achieving a mean squared error (MSE) of 0.0005 and a mean absolute percentage error (MAPE) of 6.51%, compared to 8.01% for the baseline model. The study confirms that feeding rations significantly affect both waste generation and greenhouse gas emissions. Farms using protein-rich or concentrated diets show increased biogas production potential but also higher CO₂-equivalent emissions (kg/year), while roughage-based diets reduce methane (CH₄) and nitrous oxide (N₂O) emissions, lowering environmental impact. Optimization results reveal a non-linear relationship between herd size and sustainability indicators. The most effective emission reduction was achieved on farms with 900 cattle, where CO₂-equivalent emissions decreased from 4,560,590 to 3,830,100 kg/year. Simultaneously, biogas production increased by 7–16%, exceeding 1,100,002 m3/year on large farms. These findings support the use of anaerobic digestion technologies and intelligent modelling for planning farm modernization. The proposed approach can inform decision-making at the farm and policy levels, contributing to climate resilience and the sustainable development of livestock farming.",
    "citationCount": 0,
    "referenceCount": 67
}