{
    "paperId": "5aa1045136814bbff763c9897d116ac4177d1f94",
    "title": "Explainable reinforcement learning in production control of job shop manufacturing system",
    "year": 2021,
    "venue": "International Journal of Production Research",
    "authors": [
        "Andreas Kuhnle",
        "M. May",
        "L. Schäfer",
        "G. Lanza"
    ],
    "doi": "10.1080/00207543.2021.1972179",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5aa1045136814bbff763c9897d116ac4177d1f94",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Manufacturing in the age of Industry 4.0 can be characterised by a high product variety and complex material flows. The increasing individualisation of products requires adaptive production planning and control systems. Research in the area of Machine Learning demonstrates the applicability and potential of Reinforcement Learning (RL) systems for the control of complex manufacturing. However, a major disadvantage of RL-methods is that they are usually considered as ‘black box’ models. For this reason, this paper investigates methods of explainable reinforcement learning in production control. Based on a comprehensive literature review an approach to increase the plausibility of RL-based control strategies is presented. The approach combines the advantages of high prediction accuracy (e.g. neural networks) and high explainability (e.g. decision trees). In doing so, understandable control strategies such as heuristics can be generated, and an advanced RL-system can be designed including specific domain expertise. The results are demonstrated based on a real-world system, taken from semiconductor manufacturing, which is investigated in a simulated approach.",
    "citationCount": 51,
    "referenceCount": 87
}