{
    "paperId": "5aa5994d8cc7f2e59ac3127810165580c2f6611a",
    "title": "Impact of NFV resources distribution on inter-subnetwork latency",
    "year": 2023,
    "venue": "Telfor Journal",
    "authors": [
        "G. Ilievski",
        "P. Latkoski"
    ],
    "doi": "10.5937/telfor2301014i",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5aa5994d8cc7f2e59ac3127810165580c2f6611a",
    "isOpenAccess": true,
    "openAccessPdf": "https://scindeks-clanci.ceon.rs/data/pdf/1821-3251/2023/1821-32512301014I.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "5G networks are already being implemented around the globe. One of the most important enablers of their penetration are the Software Defined Networking (SDN) technologies and the Network Functions Virtualization (NFV) architecture, which allow the needed flexibility of the network and the composing elements. In such circumstances, the Internet-of-Things (IoT), which has been long awaited, is becoming feasible and economically reasonable. This setup has its challenges, especially due to the network expansion toward the edge, where the number of networking elements and service consumers is rapidly rising. The compute resources and the storage have to be brought in the network proximity of the access network, so that the latency of the service is kept under 1ms, which is one of the base 5G requirements. For our research, we have made an experimental setup of a distributed NFV architecture on a multiple geo-location, with a main objective to review the network latency caused by the architectural distribution of the services that are built in it. The results can be used by researchers and network architects to build reliable and costeffective distributed services with the lowest possible latency, as well as to plan possible disaster recovery scenarios when some physical location is unavailable.",
    "citationCount": 0,
    "referenceCount": 35
}