{
    "paperId": "5ae9014b9e3db740629c16fb7cc47970d8b5bdca",
    "title": "Byte vSwitch: A High-Performance Virtual Switch for Cloud Networking",
    "year": 2025,
    "venue": "European Conference on Computer Systems",
    "authors": [
        "Xin Wang",
        "Deguo Li",
        "Zhihong Wang",
        "Lidong Jiang",
        "Shubo Wen",
        "Daxiang Kang",
        "Engin Arslan",
        "Peng He",
        "Xinyu Qian",
        "Bin Niu",
        "Jianwen Pi",
        "Xiaoning Ding",
        "Ke Lin",
        "Hao Luo"
    ],
    "doi": "10.1145/3689031.3717479",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5ae9014b9e3db740629c16fb7cc47970d8b5bdca",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Virtual switch is a fundamental component of cloud computing as it provides core networking functionalities for VMs and containers. Open vSwitch (OVS) is widely adopted in cloud environments due to its open-source nature, programmability, and rich set of features. At ByteDance, we initially adopted OVS in our public cloud, but as our cloud business grew, its generic design along with its complex code-base quickly became obstacles to improvements. Hence, we developed Byte vSwitch (BVS), a high-performance virtual switch that was specifically designed to address the performance, scalability, serviceability, and operational efficiency needs of our cloud services. More specifically, BVS adopts a simple architecture with an optimized hash table to maximize forwarding performance. In addition, we introduced several optimizations to improve BVS scalability, operability, and serviceability in cloud environments. Our evaluations show that BVS achieves up to 3.3× higher PPS and 25% lower latency compared to OVS. BVS has been deployed at scale across all regions of the ByteDance public cloud for over four years, and this paper presents our experience in designing, deploying, and operating BVS in production.",
    "citationCount": 1,
    "referenceCount": 57
}