{
    "paperId": "5b7776c89a85232a1cf83996393fd7c8a8143cc4",
    "title": "BioVDB: biological vector database for high-throughput gene expression meta-analysis",
    "year": 2024,
    "venue": "Frontiers Artif. Intell.",
    "authors": [
        "Michał J. Winnicki",
        "Chase A. Brown",
        "Hunter L Porter",
        "Cory B. Giles",
        "Jonathan D. Wren"
    ],
    "doi": "10.3389/frai.2024.1366273",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5b7776c89a85232a1cf83996393fd7c8a8143cc4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/frai.2024.1366273/pdf?isPublishedV2=False",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-throughput sequencing has created an exponential increase in the amount of gene expression data, much of which is freely, publicly available in repositories such as NCBI's Gene Expression Omnibus (GEO). Querying this data for patterns such as similarity and distance, however, becomes increasingly challenging as the total amount of data increases. Furthermore, vectorization of the data is commonly required in Artificial Intelligence and Machine Learning (AI/ML) approaches. We present BioVDB, a vector database for storage and analysis of gene expression data, which enhances the potential for integrating biological studies with AI/ML tools. We used a previously developed approach called Automatic Label Extraction (ALE) to extract sample labels from metadata, including age, sex, and tissue/cell-line. BioVDB stores 438,562 samples from eight microarray GEO platforms. We show that it allows for efficient querying of data using similarity search, which can also be useful for identifying and inferring missing labels of samples, and for rapid similarity analysis.",
    "citationCount": 2,
    "referenceCount": 20
}