{
    "paperId": "5b93a26257c0ccfa34050385c31006a18b0c2538",
    "title": "ConDiff: A Challenging Dataset for Neural Solvers of Partial Differential Equations",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Vladislav Trifonov",
        "Alexander Rudikov",
        "Oleg Iliev",
        "Ivan Oseledets",
        "E. Muravleva"
    ],
    "doi": "10.48550/arXiv.2406.04709",
    "arxivId": "2406.04709",
    "url": "https://www.semanticscholar.org/paper/5b93a26257c0ccfa34050385c31006a18b0c2538",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present ConDiff, a novel dataset for scientific machine learning. ConDiff focuses on the parametric diffusion equation with space dependent coefficients, a fundamental problem in many applications of partial differential equations (PDEs). The main novelty of the proposed dataset is that we consider discontinuous coefficients with high contrast. These coefficient functions are sampled from a selected set of distributions. This class of problems is not only of great academic interest, but is also the basis for describing various environmental and industrial problems. In this way, ConDiff shortens the gap with real-world problems while remaining fully synthetic and easy to use. ConDiff consists of a diverse set of diffusion equations with coefficients covering a wide range of contrast levels and heterogeneity with a measurable complexity metric for clearer comparison between different coefficient functions. We baseline ConDiff on standard deep learning models in the field of scientific machine learning. By providing a large number of problem instances, each with its own coefficient function and right-hand side, we hope to encourage the development of novel physics-based deep learning approaches, such as neural operators, ultimately driving progress towards more accurate and efficient solutions of complex PDE problems.",
    "citationCount": 0,
    "referenceCount": 58
}