{
    "paperId": "5b9608e4f56a947e6130579a9249c1e99e31af7e",
    "title": "TransTuple: Toward Fast Packet Classification via Adaptive Tuple Replacement",
    "year": 2024,
    "venue": "Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks",
    "authors": [
        "Jiashuo Yu",
        "Longlong Zhu",
        "Rongbang Wu",
        "Linying Zheng",
        "Hongyan Liu",
        "Dong Zhang",
        "Chunming Wu"
    ],
    "doi": "10.1109/SECON64284.2024.10934909",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5b9608e4f56a947e6130579a9249c1e99e31af7e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Open vSwitch (OVS) is a widely used software switch in virtualized environments and software-defined networks. OVS uses tuple space search (TSS) for packet classification in the datapath, allowing fast network rule updates, but the increasing number of rules poses a classification performance challenge. To address this, existing methods incorporate decision trees with TSS to form a hybrid structure, enhancing classification speed. However, decision trees tend to overfit the initial ruleset, becoming unbalanced after rule updates and leading to a sharp decline in classification performance. In this paper, we propose TransTuple, a framework to optimize hybrid structures for fast packet classification under rule updates. The core idea of TransTuple is to identify bottleneck branches in decision trees that degrade performance and to replace them with lightweight tuples, providing better throughput under rule updates. These tuples maintain rules using hash tables, enabling fast updating and packet matching on bottleneck branches. We use TransTuple to optimize three state-of-the-art hybrid structured methods, i.e., CutTSS, TabTree, and MBitTree, achieving up to a 3.1x improvement in classification speed during rule updates.",
    "citationCount": 0,
    "referenceCount": 30
}