{
    "paperId": "5ba6e84ace3a9ba1ab6a212997bf771b81f62810",
    "title": "On the Convergence of Decentralized Adaptive Gradient Methods",
    "year": 2021,
    "venue": "Asian Conference on Machine Learning",
    "authors": [
        "Xiangyi Chen",
        "Belhal Karimi",
        "Weijie Zhao",
        "Ping Li"
    ],
    "doi": null,
    "arxivId": "2109.03194",
    "url": "https://www.semanticscholar.org/paper/5ba6e84ace3a9ba1ab6a212997bf771b81f62810",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Adaptive gradient methods including Adam, AdaGrad, and their variants have been very successful for training deep learning models, such as neural networks. Meanwhile, given the need for distributed computing, distributed optimization algorithms are rapidly becoming a focal point. With the growth of computing power and the need for using machine learning models on mobile devices, the communication cost of distributed training algorithms needs careful consideration. In this paper, we introduce novel convergent decentralized adaptive gradient methods and rigorously incorporate adaptive gradient methods into decentralized training procedures. Specifically, we propose a general algorithmic framework that can convert existing adaptive gradient methods to their decentralized counterparts. In addition, we thoroughly analyze the convergence behavior of the proposed algorithmic framework and show that if a given adaptive gradient method converges, under some specific conditions, then its decentralized counterpart is also convergent. We illustrate the benefit of our generic decentralized framework on a prototype method, i.e., AMSGrad, both theoretically and numerically.",
    "citationCount": 27,
    "referenceCount": 51
}