{
    "paperId": "5bcbc3bbd21985457c8cd9832562cea9cd9b58f3",
    "title": "A Survey of Long-Document Retrieval in the PLM and LLM Era",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Minghan Li",
        "Miyang Luo",
        "Tianrui Lv",
        "Yishuai Zhang",
        "Siqi Zhao",
        "Ercong Nie",
        "Guodong Zhou"
    ],
    "doi": "10.48550/arXiv.2509.07759",
    "arxivId": "2509.07759",
    "url": "https://www.semanticscholar.org/paper/5bcbc3bbd21985457c8cd9832562cea9cd9b58f3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The proliferation of long-form documents presents a fundamental challenge to information retrieval (IR), as their length, dispersed evidence, and complex structures demand specialized methods beyond standard passage-level techniques. This survey provides the first comprehensive treatment of long-document retrieval (LDR), consolidating methods, challenges, and applications across three major eras. We systematize the evolution from classical lexical and early neural models to modern pre-trained (PLM) and large language models (LLMs), covering key paradigms like passage aggregation, hierarchical encoding, efficient attention, and the latest LLM-driven re-ranking and retrieval techniques. Beyond the models, we review domain-specific applications, specialized evaluation resources, and outline critical open challenges such as efficiency trade-offs, multimodal alignment, and faithfulness. This survey aims to provide both a consolidated reference and a forward-looking agenda for advancing long-document retrieval in the era of foundation models.",
    "citationCount": 0,
    "referenceCount": 96
}