{
    "paperId": "5bff9f338034ccfa19b76ed298e825bfabedfdaa",
    "title": "Multistage Approach for Securing Data of Returned Disk On Data Center Environment",
    "year": 2023,
    "venue": "Jurnal Elektronik Ilmu Komputer Udayana",
    "authors": [
        "L. R. Emakarim"
    ],
    "doi": "10.24843/jlk.2023.v12.i01.p24",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5bff9f338034ccfa19b76ed298e825bfabedfdaa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Once disk was either proactively or correctively replaced in a data center, it still contained data. With warranty or contractual agreement, the disk will be sent back to disk vendor outside of data center. Data with sensitive and confidential information will be risky leaved on disk sent outside data center without any effort to anticipate. By using sophisticated and latest technique, this information can be extracted for misused or criminal activity.  We propose RAID striping, disk encryption, and dedicated shredding machine as multistage approach to secure the information. RAID striping will augment data while encryption will scramble information. Dedicated shredding machine will erase data by implementing simple machine and universal adaptor. By applying these combined multistage approaches, stakeholder will be no worried about the replaced disk sent outside their data center. By applying these three methods, accessible replaced disk’s data will be meaningless, unreadable then erased. Hence leaving disk with useless bits. For customer’s view on inaccessible disk, RAID striping and encryption will be more enough without erasing due to limited access on it. This approach shows three of four simulation which data on disk sent outside data center is secured.",
    "citationCount": 0,
    "referenceCount": 18
}