{
    "paperId": "5c03bfd5e8a9b32e84e3a77055db4c0705d4d325",
    "title": "RecoWorld: Building Simulated Environments for Agentic Recommender Systems",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Fei Liu",
        "Xinyu Lin",
        "Hanchao Yu",
        "Mingyuan Wu",
        "Jianyu Wang",
        "Qiang Zhang",
        "Zhuokai Zhao",
        "Yinglong Xia",
        "Yao Zhang",
        "Weiwei Li",
        "Mingze Gao",
        "Qifan Wang",
        "Lizhu Zhang",
        "Benyu Zhang",
        "Xiangjun Fan"
    ],
    "doi": "10.48550/arXiv.2509.10397",
    "arxivId": "2509.10397",
    "url": "https://www.semanticscholar.org/paper/5c03bfd5e8a9b32e84e3a77055db4c0705d4d325",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present RecoWorld, a blueprint for building simulated environments tailored to agentic recommender systems. Such environments give agents a proper training space where they can learn from errors without impacting real users. RecoWorld distinguishes itself with a dual-view architecture: a simulated user and an agentic recommender engage in multi-turn interactions aimed at maximizing user retention. The user simulator reviews recommended items, updates its mindset, and when sensing potential user disengagement, generates reflective instructions. The agentic recommender adapts its recommendations by incorporating these user instructions and reasoning traces, creating a dynamic feedback loop that actively engages users. This process leverages the exceptional reasoning capabilities of modern LLMs. We explore diverse content representations within the simulator, including text-based, multimodal, and semantic ID modeling, and discuss how multi-turn RL enables the recommender to refine its strategies through iterative interactions. RecoWorld also supports multi-agent simulations, allowing creators to simulate the responses of targeted user populations. It marks an important first step toward recommender systems where users and agents collaboratively shape personalized information streams. We envision new interaction paradigms where\"user instructs, recommender responds,\"jointly optimizing user retention and engagement.",
    "citationCount": 2,
    "referenceCount": 45
}