{
    "paperId": "5c0f4b04652dd4175c72170a29f80b05d7067ad5",
    "title": "Integration of NoSQL and Relational Databases for Efficient Data Management in Hybrid Cloud Architectures",
    "year": 2025,
    "venue": "Journal of Machine and Computing",
    "authors": [
        "Aravindhan Ragunathan",
        "Bhavani K",
        "Archana Sasi",
        "S. R"
    ],
    "doi": "10.53759/7669/jmc202505100",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c0f4b04652dd4175c72170a29f80b05d7067ad5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "NoSQL and relational databases have been integrated in response to the increasing demand for scalable and efficient data management in hybrid cloud environments. The differences in data structures and query processing methods between these databases present both challenges and opportunities when designing an optimized hybrid system. This study explores the integration of NoSQL and relational databases to maximize data storage, retrieval, and processing efficiency across multiple cloud systems. NoSQL databases excel in handling unstructured and semi-structured data, offering flexibility and scalability, whereas relational databases provide robust consistency and structured query capabilities. Despite the wide availability of relational databases, certain applications require the dynamic adaptability of NoSQL systems, making integration a viable solution. The research evaluates key performance parameters, including query execution speed, scalability, data consistency, and resource utilization. Cloudsim is used for simulation, allowing for an in-depth comparison between standalone and hybrid database models. Experimental results indicate that the proposed hybrid model improves query performance by 30%, reduces latency by 20%, and enhances scalability by 40% compared to using relational or NoSQL databases alone. The novelty of this approach lies in its ability to overcome the limitations of each database type by their strengths in a dynamic cloud environment. The results highlight the effectiveness of hybrid database integration in optimizing cloud-based data management while ensuring seamless operation, adaptability, and resource efficiency.",
    "citationCount": 0,
    "referenceCount": 22
}