{
    "paperId": "5c338172c6a350118b5df0c46e0df4a5cdd7532a",
    "title": "Allelic hierarchy for USH2A influences auditory and visual phenotypes in South Korean patients",
    "year": 2023,
    "venue": "Scientific Reports",
    "authors": [
        "Dong Woo Nam",
        "Yong Keun Song",
        "Jeong Hun Kim",
        "Eun Kyoung Lee",
        "Kyu Hyung Park",
        "J. Cha",
        "B. Y. Choi",
        "Jun Ho Lee",
        "S. Oh",
        "D. Jo",
        "Sang-Yeon Lee"
    ],
    "doi": "10.1038/s41598-023-47166-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c338172c6a350118b5df0c46e0df4a5cdd7532a",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41598-023-47166-w.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "When medical genetic syndromes are influenced by allelic hierarchies, mutant alleles have distinct effects on clinical phenotypes. Genotype–phenotype correlations for Usher syndrome type 2 (USH2) suggest that the USH2A gene exhibits an allelic hierarchy. Here, we analyzed the phenotypes and genotypes of 16 South Korean patients with USH2A biallelic variants to investigate an allelic hierarchy from audiological and ophthalmological perspectives. Using whole exome and genome sequencing, 18 mutant alleles, including 4 novel alleles, were identified and implicated in USH2A -related disorders. Truncated alleles were linked to earlier onset of subjective hearing loss and more severe thresholds; biallelic truncated alleles had more severe effects. Truncated alleles were also associated with retinal structure degeneration and severe functional deterioration. However, younger patients (aged < 16 years) did not exhibit overt retinitis pigmentosa even when they had biallelic truncated alleles, suggesting that USH2A -related USH2 can mimic nonsyndromic hearing loss. For truncated alleles, there was a clear correlation between mean hearing threshold and 30-Hz flicker electroretinography implicit time. This study provides the first evidence of an USH2A -related allelic hierarchy among South Korean patients; our data yield valuable insights concerning the natural courses of clinical phenotypes and how genotype-based therapies may be used.",
    "citationCount": 3,
    "referenceCount": 58
}