{
    "paperId": "5c5102d6d752244edb704d084b120f8c7303feea",
    "title": "Whole-genome relaxed selection and molecular constraints in Triplophysa under adapted Qinghai-Tibetan Plateau",
    "year": 2025,
    "venue": "BMC Genomics",
    "authors": [
        "Qingyuan Zhao",
        "Fei Xie",
        "Qiuyue He",
        "Lulu Wang",
        "Kenan Guo",
        "Cong Zhang",
        "Yong Wang"
    ],
    "doi": "10.1186/s12864-025-11290-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c5102d6d752244edb704d084b120f8c7303feea",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s12864-025-11290-w",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-altitude environments are inhospitable, but Triplophysa, the largest taxon among the three major fish groups in the Qinghai-Tibetan Plateau (QTP), is an exception. However, the evolutionary profiling of the common ancestor and its contribution to the adaptation of existing QTP native species is unclear.We researched the comparative genomics of Triplophysa species and found that the genome-wide genes of Triplophysa and its ancestry have the characteristics of rapid evolution.Moreover, the rapid evolution of the ancestral genes was caused by relaxed selection. Natural selection analysis showed that more ancestral relaxed selection genes were under strongly purifying selection and showed higher expression in QTP endemic Triplophysa species.The change in natural selection might be associated with the adaptation to QTP. It should be noted that SPT5 homolog, DSIF elongation factor subunit (supt5h) experienced relaxed selection in common ancestral populations of Triplophysa but under purifying selection in extant species, which might be related to hypoxia adaptation of QTP. In summary, the extant species in different environments were used to infer the evolutionary profile of the common ancestor and to identify candidate genes based on changes in natural selection. Our work might provide new clues for understanding adaptation to extreme environments. Supplementary Information The online version contains supplementary material available at 10.1186/s12864-025-11290-w.",
    "citationCount": 0,
    "referenceCount": 91
}