{
    "paperId": "5c5eb8511ccd95bfe9453c55cabbb4cf37930bae",
    "title": "Genetic Risk Factors for Early-Onset Merkel Cell Carcinoma.",
    "year": 2024,
    "venue": "JAMA dermatology",
    "authors": [
        "Noreen Mohsin",
        "Devin Hunt",
        "Jia Yan",
        "A. Jabbour",
        "Paul Nghiem",
        "Jaehyuk Choi",
        "Yue Zhang",
        "Alexandra F. Freeman",
        "J. Bergerson",
        "Stefania Dell’Orso",
        "K. Lachance",
        "R. Kulikauskas",
        "L. Collado",
        "Wenjia Cao",
        "Justin Lack",
        "Morgan Similuk",
        "Bryce A. Seifert",
        "Rajarshi Ghosh",
        "Magdalena A. Walkiewicz",
        "Isaac Brownell"
    ],
    "doi": "10.1001/jamadermatol.2023.5362",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c5eb8511ccd95bfe9453c55cabbb4cf37930bae",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Importance\nMerkel cell carcinoma (MCC) is a rare, aggressive neuroendocrine skin cancer. Of the patients who develop MCC annually, only 4% are younger than 50 years.\n\n\nObjective\nTo identify genetic risk factors for early-onset MCC via genomic sequencing.\n\n\nDesign, Setting, and Participants\nThe study represents a multicenter collaboration between the National Institute of Arthritis and Musculoskeletal and Skin Diseases (NIAMS), the National Institute of Allergy and Infectious Diseases (NIAID), and the University of Washington. Participants with early-onset and later-onset MCC were prospectively enrolled in an institutional review board-approved study at the University of Washington between January 2003 and May 2019. Unrelated controls were enrolled in the NIAID Centralized Sequencing Program (CSP) between September 2017 and September 2021. Analysis was performed from September 2021 and March 2023. Early-onset MCC was defined as disease occurrence in individuals younger than 50 years. Later-onset MCC was defined as disease occurrence at age 50 years or older. Unrelated controls were evaluated by the NIAID CSP for reasons other than familial cancer syndromes, including immunological, neurological, and psychiatric disorders.\n\n\nResults\nThis case-control analysis included 1012 participants: 37 with early-onset MCC, 45 with later-onset MCC, and 930 unrelated controls. Among 37 patients with early-onset MCC, 7 (19%) had well-described variants in genes associated with cancer predisposition. Six patients had variants associated with hereditary cancer syndromes (ATM = 2, BRCA1 = 2, BRCA2 = 1, and TP53 = 1) and 1 patient had a variant associated with immunodeficiency and lymphoma (MAGT1). Compared with 930 unrelated controls, the early-onset MCC cohort was significantly enriched for cancer-predisposing pathogenic or likely pathogenic variants in these 5 genes (odds ratio, 30.35; 95% CI, 8.89-106.30; P < .001). No germline disease variants in these genes were identified in 45 patients with later-onset MCC. Additional variants in DNA repair genes were also identified among patients with MCC.\n\n\nConclusions and Relevance\nBecause variants in certain DNA repair and cancer predisposition genes are associated with early-onset MCC, genetic counseling and testing should be considered for patients presenting at younger than 50 years.",
    "citationCount": 7,
    "referenceCount": 51
}