{
    "paperId": "5c650d1cdfee5092d469e057dc757513211622f2",
    "title": "Hybrid Optimized Feature Selection and Deep Learning Method for Emotion Recognition That Uses EEG Data",
    "year": 2024,
    "venue": "Iraqi Journal for Computers and Informatics",
    "authors": [
        "Asmaa Bashar Hmaza",
        "Rajaa K. Hasoun"
    ],
    "doi": "10.25195/ijci.v51i1.545",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c650d1cdfee5092d469e057dc757513211622f2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.25195/ijci.v51i1.545",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction: This study represents an important development in human–machine interactions. It aims to utilize the potential of electroencephalograms (EEGs) in recognizing emotions, which is a complex and variable task. This study presents a complete framework for enhancing emotion identification. It provides an intuitive way for humans to interact with machines emotionally by understanding the emotion machine. The process begins with collecting and preprocessing EEG information to use the data for training and testing the proposed system. Optimization, machine learning, and deep learning algorithms are applied in this study. First, particle swarm optimization (PSO) identifies and optimizes critical functions and reduces feature dimensionality. Thereafter, long short-term memory (LSTM), gated recurrent unit (GRU), and simple recurrent neural network (RNN) architectures are used in emotion identification. All the applied models are evaluated using common evaluation metrics, such as accuracy, precision, and the F1 score. From various implementations of the different models applied to identify EEG emotion, the LSTM model achieved good results with an accuracy of 98.13%, a precision of 98.15%, and an F1 score of 98.13%. Although the GRU and simple RNN models exhibit good performance in emotion identification, their measurements are less than those of LSTM, which outperforms all the other models. This study incorporates the concepts of the PSO algorithm into a feature selection and deep learning model by using LSTM to enhance EEG emotion identification. The proposed model overcomes difficulties and issues related to EEG signals, leading to an accurate emotion detection system and providing enhanced machine understanding of human–machine interactions.",
    "citationCount": 0,
    "referenceCount": 41
}