{
    "paperId": "5c778e1f7467e20894bf308e5465779fef8c47cb",
    "title": "GTS-LUM: Reshaping User Behavior Modeling with LLMs in Telecommunications Industry",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Liu Shi",
        "Tianwu Zhou",
        "Wei Xu",
        "Li Liu",
        "Zhexin Cui",
        "Shaoyi Liang",
        "Haoxing Niu",
        "Yichong Tian",
        "Jianwei Guo"
    ],
    "doi": "10.48550/arXiv.2504.06511",
    "arxivId": "2504.06511",
    "url": "https://www.semanticscholar.org/paper/5c778e1f7467e20894bf308e5465779fef8c47cb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As telecommunication service providers shifting their focus to analyzing user behavior for package design and marketing interventions, a critical challenge lies in developing a unified, end-to-end framework capable of modeling long-term and periodic user behavior sequences with diverse time granularities, multi-modal data inputs, and heterogeneous labels. This paper introduces GTS-LUM, a novel user behavior model that redefines modeling paradigms in telecommunication settings. GTS-LUM adopts a (multi-modal) encoder-adapter-LLM decoder architecture, enhanced with several telecom-specific innovations. Specifically, the model incorporates an advanced timestamp processing method to handle varying time granularities. It also supports multi-modal data inputs -- including structured tables and behavior co-occurrence graphs -- and aligns these with semantic information extracted by a tokenizer using a Q-former structure. Additionally, GTS-LUM integrates a front-placed target-aware mechanism to highlight historical behaviors most relevant to the target. Extensive experiments on industrial dataset validate the effectiveness of this end-to-end framework and also demonstrate that GTS-LUM outperforms LLM4Rec approaches which are popular in recommendation systems, offering an effective and generalizing solution for user behavior modeling in telecommunications.",
    "citationCount": 0,
    "referenceCount": 30
}