{
    "paperId": "5c8cf6588c2df5ffcbba8b86a8e84ce068e9934b",
    "title": "From Learning Science to Computer Science: A Scientometric Review of Deeper Learning in Foreign Languages (1993–2024)",
    "year": 2025,
    "venue": "SAGE Open",
    "authors": [
        "Zhao Wanli",
        "Youjun Tang",
        "Xiaomei Ma"
    ],
    "doi": "10.1177/21582440251322564",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5c8cf6588c2df5ffcbba8b86a8e84ce068e9934b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1177/21582440251322564",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deeper learning (DL) is firmly rooted in learning science and computer science. However, a dearth of review studies has probed its trajectory in DL in foreign languages(DLFL). Utilizing SSCI from the Web of Science Core Collection, we employ Citespace and Vosviewer to analyze the scientific knowledge graph of DLFL literature. Our analysis elucidates its geographical spread over time, highlights critical areas for further research, and identifies current trends in its evolution. The results show that DLFL research advances with the United States, China, the United Kingdom, Spain, and Australia ranking in the top five in terms of the number of articles published; the research hotspots focus on factors influencing DLFL, learners’ cognitive processes through language acquisition and information technology intervention in DLFL. The field of DLFL pertains to learning science, which is dedicated to enhancing learners’ performance, while computer science emphasizes utilizing advanced educational technologies as intervention tools. From learning science to computer science, both fields have followed distinct paths in their respective developments with a trend of integration, and the latter provided the former with a continuous supply of technology-mediated educational tools, including the future uses of computational thinking and ChatGPTs. As for future research directions, the development trajectory of DLFL will focus on natural language processing, cognitive neuroscience, and artificial intelligence. The findings will offer insights for future research on DLFL by enhancing the informational and computational literacy of both instructors and learners, empowering them to navigate and leverage the transformative potential of DLFL. Plain language summary A systematic review of deeper learning in foreign languages Deeper learning is a concept familiar to learning science and computer science. Despite the growing interest in foreign languages’ deeper learning (FLDL), few literature review studies have focused on its landscape and trajectory in these two fields. To address the problem, we analyze the scientific knowledge mapping of FLDL literature by utilizing the Web of Science Core Collection as the key data source (deliberately selecting the high-quality SSCI) and explore the spatial and temporal distribution, hotspots, and development trends of FLDL research through Citespace and Vosviewer visualization software. The results show that FLDL experiences seven stages (language perception, students’ FLDL strategies, children’s classroom acquisition model, FLDL motivation and performance, the debut of computer science, computer science embedding learning science, and the fast development of computer science); FLDL related to learning science focuses on improving learners’ performance, while that of computer science highlights the intervention tools of advanced educational technologies; FLDL research advances with the United States, China, the United Kingdom, Spain, and Australia ranking in the top five in terms of the number of articles published; the research hotspots focus on factors influencing FLDL, learners’ cognitive processes through language acquisition and information technology intervention in FLDL. Both learning science and computer science have had their distinctive development paths. However, there is a current trend toward intermingling, and the latter has provided the former with a steady stream of educational technology-mediated tools, including the future use of computational thinking and ChatGPTs. The development trend of FLDL will concentrate on computer science. The result of the study will provide some insights into future research on FLDL by improving the informational and computational literacy of FLDL instructors and learners.",
    "citationCount": 1,
    "referenceCount": 105
}