{
    "paperId": "5cc97e14475e749955f4d4450fdbee2e158e6b0a",
    "title": "A Distributed Authentication Scheme Based on Smart Contract for Roaming Service in Mobile Vehicular Networks",
    "year": 2022,
    "venue": "IEEE Transactions on Vehicular Technology",
    "authors": [
        "Kaiping Xue",
        "Xin Luo",
        "Yongjin Ma",
        "Jian Li",
        "Jianqing Liu",
        "David S. L. Wei"
    ],
    "doi": "10.1109/TVT.2022.3148303",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5cc97e14475e749955f4d4450fdbee2e158e6b0a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Secure and real-time communication is an essential condition in mobile vehicular networks, and this requires secure authentication and seamless access enabled by roaming services. As a security inspector, roaming authentication ensures that legitimate users can access the network securely. However, today’s roaming authentication protocols authenticate users with the help of centralized authentication servers, leading to the risk of the single point of failure and roaming fraud. The massive device access in 5G networks further exacerbates the losses when problems occur. In light of it, we propose a decentralized fraud-proof roaming authentication framework based on blockchain. We leverage smart contracts to implement a roaming authentication protocol, including user/AP registration, authentication, and revocation. For higher efficiency, we utilize the Bloom filter for the revocation process. In addition, we design an unforgeable and undeniable billing scheme based on hash chain technology. Security and performance analysis show that the proposed roaming authentication scheme can provide the required security features while incurring an acceptable authentication delay.",
    "citationCount": 39,
    "referenceCount": 50
}