{
    "paperId": "5cdb3e82e75d7d94af943d44726aeb5de6b21adf",
    "title": "Explainable Edge AI Framework for IoD-Assisted Aerial Surveillance in Extreme Scenarios",
    "year": 2025,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Hailong Zhu",
        "Umit Demirbaga",
        "G. Aujla",
        "Lei Shi",
        "Peiying Zhang"
    ],
    "doi": "10.1109/JIOT.2024.3411528",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5cdb3e82e75d7d94af943d44726aeb5de6b21adf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Drones are sophisticated machines that can hover over extreme locations, conduct aerial surveillance, collect surveillance data, and disseminate it to the distributed edge for processing and analysis. The distributed edge deploys advanced artificial intelligence (AI) models to detect any unwarranted activity or object based on surveillance data. However, these lightweight and low-power unmanned aerial vehicles (UAVs) may experience faults due to unprecedented workload when deployed in extreme surveillance domains. In this article, we have designed an AI framework to detect any safety concerns with drones deployed for aerial surveillance in extreme locations based on real-time drone critical parameters. We also propose a MapReduce-based object recognition and classification module to process large-scale images captured by drones efficiently. However, conventional AI systems behave like black box systems, leading to a lack of trust and transparency. Thus, we convert the traditional framework of AI into an explainable edge AI framework using Shapley additive explanations (SHAPs) that opens Pandora’s black box. The experimental results show the effectiveness of the proposed framework in detecting drone safety concerns through explainable health status tracking alongside ensuring an effective object detection mechanism.",
    "citationCount": 5,
    "referenceCount": 26
}