{
    "paperId": "5cf8a902a5b4b96c8cf66d89d66fa29d95ebc7c5",
    "title": "NStore: A High-Performance NUMA-Aware Key-Value Store for Hybrid Memory",
    "year": 2025,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Zhonghua Wang",
        "Kai Lu",
        "Jiguang Wan",
        "Hong Jiang",
        "Zeyang Zhao",
        "Peng Xu",
        "Biliang Lai",
        "Guokuan Li",
        "Changsheng Xie"
    ],
    "doi": "10.1109/TC.2024.3504269",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5cf8a902a5b4b96c8cf66d89d66fa29d95ebc7c5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Emerging persistent memory (PM) promises near-DRAM performance, larger capacity, and data persistence, attracting researchers to design PM-based key-value stores. However, existing PM-based key-value stores lack awareness of the Non-Uniform Memory Access (NUMA) architecture on PM, where accessing PM on remote NUMA sockets is considerably slower than accessing local PM. This NUMA-unawareness results in sub-optimal performance when scaling on NUMA. Although DRAM caching alleviates this issue, existing cache policies ignore the performance disparity between remote and local PM accesses, keeping remote PM access as a performance bottleneck when scaling PM stores on NUMA. Furthermore, creating hot data views in each socket's PM fails to eliminate remote PM writes and, worse, induces additional local PM writes. This paper presents NStore, a high-performance NUMA-aware key-value store for the PM-DRAM hybrid memory. NStore introduces a NUMA-aware cache replacement strategy, called Remote Access First (RAF) cache in DRAM, to minimize remote PM accesses. In addition, NStore deploys Nlog, a write-optimized log-structured persistent storage, purposed to eliminate remote PM writes. NStore further mitigates the NUMA impacts through localized scan operations, efficient garbage collection, and multi-thread recovery for Nlog. Evaluations show that NStore outperforms state-of-the-art PM-based key-value stores, achieving up to 13.9<inline-formula><tex-math notation=\"LaTeX\">$\\times$</tex-math><alternatives><mml:math><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"wang-ieq1-3504269.gif\"/></alternatives></inline-formula> and 11.2<inline-formula><tex-math notation=\"LaTeX\">$\\times$</tex-math><alternatives><mml:math><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"wang-ieq2-3504269.gif\"/></alternatives></inline-formula> higher write and read throughput, respectively.",
    "citationCount": 1,
    "referenceCount": 32
}