{
    "paperId": "5cfd2f25f146151c564063638c9fed65f70ddad8",
    "title": "AGO: Boosting Mobile AI Inference Performance by Removing Constraints on Graph Optimization",
    "year": 2022,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Zhiying Xu",
        "H. Peng",
        "Wei Wang"
    ],
    "doi": "10.1109/INFOCOM53939.2023.10228858",
    "arxivId": "2212.01005",
    "url": "https://www.semanticscholar.org/paper/5cfd2f25f146151c564063638c9fed65f70ddad8",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.01005",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional deep learning compilers rely on heuristics for subgraph generation, which impose extra constraints on graph optimization, e.g., each subgraph can only contain at most one complex operator. In this paper, we propose AGO, a framework for graph optimization with arbitrary structures to boost the inference performance of deep models by removing such constraints. To create new optimization opportunities for complicated subgraphs, we propose intensive operator fusion, which effectively stitches multiple complex operators together for better performance. Further, we design a graph partitioning scheme that allows an arbitrary structure for each subgraph while guaranteeing the acyclic property among all generated subgraphs. Additionally, to enable efficient performance tuning for complicated subgraphs, we devise a divide-and-conquer tuning mechanism to orchestrate different system components. Through extensive experiments on various neural networks and mobile devices, we show that our system can improve the inference performance by up to 3.3× when compared with state-of-the-art vendor libraries and deep compilers.",
    "citationCount": 3,
    "referenceCount": 52
}