{
    "paperId": "5d0832d5d85073012329e3f274d309aaa95dc228",
    "title": "Towards Building a Faster and Incentive Enabled Privacy-Preserving Proof of Location Scheme from GTOTP",
    "year": 2024,
    "venue": "Electronics",
    "authors": [
        "Cong Ma",
        "Yuhan Liu",
        "Zheng Yang",
        "Juan Ma"
    ],
    "doi": "10.3390/electronics13081443",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5d0832d5d85073012329e3f274d309aaa95dc228",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/13/8/1443/pdf?version=1712829805",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, there has been significant growth in location-based services (LBSs) and applications. These services empower users to transmit their location data to location service providers, thereby facilitating the provisioning of pertinent resources and services. However, in order to prevent malicious users from sending fake location data, users must attest to their location for service providers, namely, through a proof of location (PoL). Such a proof should additionally prevent attackers from being able to obtain users’ identity and location information through it. In this paper, we propose an efficient privacy-preserving proof of location (PPPoL) scheme. The scheme is based on the standard cryptographic primitives, including Group Time-based One-Time Password (GTOTP) and public key encryption, which achieves entity privacy, location privacy, and traceability. Unlike the previous GTOTP-based PPPoL scheme, our scheme enables instant location verification with additional hash operations. To encourage the active participation of witnesses in location proofs, we propose an incentive mechanism based on smart contracts. Additionally, we implement a proof of concept of our PPPoL scheme on an Android device. Our experimental results show that proof generation and verification time are on the order of milliseconds. Meanwhile, the total overhead for the incentive mechanism amounts to 0.0011 ETH. This result is practical for mobile device-based LBSs.",
    "citationCount": 1,
    "referenceCount": 26
}