{
    "paperId": "5d084fc08872d5fc03f2b799bf6bfb431ece3d39",
    "title": "Lab-Ai: Using Retrieval Augmentation to Enhance Language Models for Personalized Lab Test Interpretation in Clinical Medicine",
    "year": 2024,
    "venue": "IEEE International Conference on Healthcare Informatics",
    "authors": [
        "Xiaoyu Wang",
        "Haoyong Ouyang",
        "Balu Bhasuran",
        "Xiao Luo",
        "Karim Hanna",
        "M. Lustria",
        "Zhe He"
    ],
    "doi": "10.1109/ichi64645.2025.00025",
    "arxivId": "2409.18986",
    "url": "https://www.semanticscholar.org/paper/5d084fc08872d5fc03f2b799bf6bfb431ece3d39",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate interpretation of lab results is crucial in clinical medicine, yet most patient portals use universal normal ranges, ignoring conditional factors like age and gender. This study introduces Lab-AI, an interactive system that offers personalized normal ranges using retrieval-augmented generation (RAG) from credible health sources. Lab-AI has two modules: factor retrieval and normal range retrieval. We tested these on 122 lab tests: 40 with conditional factors and 82 without. For tests with factors, normal ranges depend on patient-specific information. Our results show GPT-4-turbo with RAG achieved a 0.948 F1 score for factor retrieval and 0.995 accuracy for normal range retrieval. GPT-4-turbo with RAG outperformed the best non-RAG system by 33.5% in factor retrieval and showed 132% and 100% improvements in question-level and lab-level performance, respectively, for normal range retrieval. These findings highlight Lab-AI's potential to enhance patient understanding of lab results.",
    "citationCount": 0,
    "referenceCount": 26
}