{
    "paperId": "5d34241591410d29a13abe7db63c38b01dbd5a51",
    "title": "Revisiting Online Algorithms: A Survey of Set Cover Solutions Beyond Competitive Analysis",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Christine Markarian",
        "Claude Fachkha",
        "Noura Yassine"
    ],
    "doi": "10.1109/ACCESS.2024.3504541",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5d34241591410d29a13abe7db63c38b01dbd5a51",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3504541",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online algorithms are crucial for real-time decision-making and adaptability across diverse fields, such as operations research, computer science, and combinatorics. These algorithms handle data incrementally and make decisions without prior knowledge of future inputs, thereby effectively addressing complex challenges. This study provides a comprehensive survey of online algorithms, focusing on the Set Cover problem (SC). SC is one of the most extensively studied NP-complete problems, contributing significantly to advancements in approximation techniques, complexity theory, and online algorithms research. It involves selecting a minimal-weight subset from a collection of subsets to cover all elements. This survey examines online algorithms for Set Cover in multiple contexts, including competitive analysis, stochastic models, advice complexity, predictive algorithms, and recourse strategies. While competitive analysis, which compares online algorithms to the best possible offline solutions, remains a key evaluation method, this paper aims to extend the understanding beyond traditional worst-case scenarios. By providing in-depth insights into algorithm design, analytical methods, and practical applications, it seeks to advance the field and stimulate further research in evolving contexts. Additionally, it underscores the intersection of online algorithms with broader domains such as machine learning and predictive analytics, establishing new benchmarks for exploring their broader implications.",
    "citationCount": 1,
    "referenceCount": 64
}