{
    "paperId": "5d7b7ddf5e6352c748e110be40c7060a29631e19",
    "title": "Analyzing Mobility Indicators Using Machine Learning to Detect Mild Cognitive Impairment: A Systematic Scoping Review",
    "year": 2025,
    "venue": "Applied Clinical Informatics",
    "authors": [
        "Salamah Alshammari",
        "Munirah Alsubaie",
        "Mathieu Figeys",
        "A. R. Rios Rincon",
        "Victor E Ezeugwu",
        "S. Esmail",
        "C. Daum",
        "Lili Liu",
        "Antonio Miguel Cruz"
    ],
    "doi": "10.1055/a-2657-8212",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5d7b7ddf5e6352c748e110be40c7060a29631e19",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Background The global aging population is rapidly increasing, and the prevalence of age-related cognitive conditions, such as mild cognitive impairment (MCI), is becoming more common. This condition, which represents intermediate stages between normal aging and dementia, underscores the importance of early detection and timely intervention to address the growing demand for health services. Traditional cognitive assessments have limitations, such as the consistency of results, prompting the need for innovative technology-based solutions. Objective This study aimed to examine how technology-based mobility data collection methods and machine learning algorithms are used to detect MCI in adults. Methods A systematic scoping review was conducted to identify papers that analyzed mobility-related data using machine learning algorithms, focusing on adults aged 18 or older with MCI. Seven databases were searched: MEDLINE, EMBASE, IEEE Xplore, PsycINFO, Scopus, Web of Science, and ACM Digital Library, yielding 2,901 papers. Results Twenty-four papers met the inclusion criteria, highlighting 116 mobility indicators used to classify or indicate MCI. Wearable devices were the most common data collection method, with mobile applications being the least utilized. The most frequently reported mobility indicator for walking was walking speed. For driving, indicators included the number of hard braking events, the number of night trips, and speed. Logistic regression, random forest, and neural networks were the most used machine learning algorithms. Overall, the mean accuracy, sensitivity, and specificity of all the algorithms were 86.1% (standard deviation [SD] = 6.7%), 84% (SD = 6.5%), and 72.8% (SD = 12%), respectively. The mean area under the curve and the harmonic mean of precision and recall scores (F1) were 0.77 (SD = 0.08) and 0.83 (SD = 0.16), respectively. Conclusion This review highlights the use of technology-based methods, particularly wearable devices, in assessing mobility and applying machine learning algorithms to detect MCI. However, a notable gap in research on mobile app-based mobility monitoring suggests a promising direction for future studies.",
    "citationCount": 0,
    "referenceCount": 85
}