{
    "paperId": "5d8d16b2518286351136e01da84bdb773726246c",
    "title": "GeoT: Tensor Centric Library for Graph Neural Network via Efficient Segment Reduction on GPU",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Zhongming Yu",
        "Genghan Zhang",
        "Hanxian Huang",
        "Xin Chen",
        "Jishen Zhao"
    ],
    "doi": "10.48550/arXiv.2404.03019",
    "arxivId": "2404.03019",
    "url": "https://www.semanticscholar.org/paper/5d8d16b2518286351136e01da84bdb773726246c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, Graph Neural Networks (GNNs) have ignited a surge of innovation, significantly enhancing the processing of geometric data structures such as graphs, point clouds, and meshes. As the domain continues to evolve, a series of frameworks and libraries are being developed to push GNN efficiency to new heights. While graph-centric libraries have achieved success in the past, the advent of efficient tensor compilers has highlighted the urgent need for tensor-centric libraries. Yet, efficient tensor-centric frameworks for GNNs remain scarce due to unique challenges and limitations encountered when implementing segment reduction in GNN contexts. We introduce GeoT, a cutting-edge tensor-centric library designed specifically for GNNs via efficient segment reduction. GeoT debuts innovative parallel algorithms that not only introduce new design principles but also expand the available design space. Importantly, GeoT is engineered for straightforward fusion within a computation graph, ensuring compatibility with contemporary tensor-centric machine learning frameworks and compilers. Setting a new performance benchmark, GeoT marks a considerable advancement by showcasing an average operator speedup of 1.80x and an end-to-end speedup of 1.68x.",
    "citationCount": 0,
    "referenceCount": 88
}