{
    "paperId": "5d97c5d83b84cd343badbfedc9362c6d184fd9da",
    "title": "Unveiling the frontiers of deep learning: innovations shaping diverse domains",
    "year": 2023,
    "venue": "Applied intelligence (Boston)",
    "authors": [
        "Shams Forruque Ahmed",
        "Md. Sakib Bin Alam",
        "Maliha Kabir",
        "Shaila Afrin",
        "Sabiha Jannat Rafa",
        "Aanushka Mehjabin",
        "Amir H. Gandomi"
    ],
    "doi": "10.1007/s10489-025-06259-x",
    "arxivId": "2309.02712",
    "url": "https://www.semanticscholar.org/paper/5d97c5d83b84cd343badbfedc9362c6d184fd9da",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s10489-025-06259-x",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Deep learning (DL) allows computer models to learn, visualize, optimize, refine, and predict data. To understand its present state, examining the most recent advancements and applications of deep learning across various domains is essential. However, prior reviews focused on DL applications in only one or two domains. The current review thoroughly investigates the use of DL in four different broad fields due to the plenty of relevant research literature in these domains. This wide range of coverage provides a comprehensive and interconnected understanding of DL’s influence and opportunities, which is lacking in other reviews. The study also discusses DL frameworks and addresses the benefits and challenges of utilizing DL in each field, which is only occasionally available in other reviews. DL frameworks like TensorFlow and PyTorch make it easy to develop innovative DL applications across diverse domains by providing model development and deployment platforms. This helps bridge theoretical progress and practical implementation. Deep learning solves complex problems and advances technology in many fields, demonstrating its revolutionary potential and adaptability. CNN-LSTM models with attention mechanisms can forecast traffic with 99% accuracy. Fungal-diseased mango leaves can be classified with 97.13% accuracy by the multi-layer CNN model. However, deep learning requires rigorous data collection to analyze and process large amounts of data because it is independent of training data. Thus, large-scale medical, research, healthcare, and environmental data compilation are challenging, reducing deep learning effectiveness. Future research should address data volume, privacy, domain complexity, and data quality issues in DL datasets.\n \n Graphical Abstract\n",
    "citationCount": 6,
    "referenceCount": 361
}