{
    "paperId": "5da360cf6decfe5ab885cd6cd3a63bf684bc1f78",
    "title": "The Effects of Task Complexity on the Use of Different Types of Information in a Search Assistance Tool",
    "year": 2019,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Bogeum Choi",
        "Austin R. Ward",
        "Yuan Li",
        "Jaime Arguello",
        "Robert G. Capra"
    ],
    "doi": "10.1145/3371707",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5da360cf6decfe5ab885cd6cd3a63bf684bc1f78",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3371707",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In interactive information retrieval, an important research question is: How do task characteristics influence users’ needs and behaviors? We report on a laboratory study (N=32) that investigated the effects of task complexity on the types of information used by participants while searching. Participants completed tasks of four complexity levels and had access to four different types of information provided through a search-assistance tool referred to as the InfoBoxes (IB). The IB tool presented the following types of task-related information (info-types) on different tabs: (1) facts, (2) concepts, (3) opinions, and (4) insights. Facts (and opinions) were defined as objective (and subjective) statements relevant to the task. Concepts were defined as important ideas, principles, or entities related to the task. Insights were defined as tips or advice about the task. The study investigated six research questions that considered the effects of task complexity on: (RQ1) participants’ pre-/post-task perceptions about useful info-types; (RQ2) use of different info-types during the task; (RQ3) motivations for engaging with the IB; (RQ4) gains from using it; (RQ5) the search stage participants were in while engaging with the IB; and (RQ6) motivations for sometimes avoiding the IB. Our results suggest that task complexity influenced all six types of outcomes. We discuss implications of our results for designing search assistance tools and systems that favor certain types of content based on task characteristics.",
    "citationCount": 17,
    "referenceCount": 55
}