{
    "paperId": "5dbb0963c203ad5ea5c3acd98ee62b70521d9cf6",
    "title": "Practical planning and execution of groupjoin and nested aggregates",
    "year": 2022,
    "venue": "The VLDB journal",
    "authors": [
        "Philipp Fent",
        "Altan Birler",
        "Thomas Neumann"
    ],
    "doi": "10.1007/s00778-022-00765-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5dbb0963c203ad5ea5c3acd98ee62b70521d9cf6",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00778-022-00765-x.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Groupjoins combine execution of a join and a subsequent group-by. They are common in analytical queries and occur in about of the queries in TPC-H and TPC-DS. While they were originally invented to improve performance, efficient parallel execution of groupjoins can be limited by contention in many-core systems. Efficient implementations of groupjoins are highly desirable, as groupjoins are not only used to fuse group-by and join, but are also useful to efficiently execute nested aggregates. For these, the query optimizer needs to reason over the result of aggregation to optimally schedule it. Traditional systems quickly reach their limits of selectivity and cardinality estimations over computed columns and often treat group-by as an optimization barrier. In this paper, we present techniques to efficiently estimate, plan, and execute groupjoins and nested aggregates. We propose four novel techniques, aggregate estimates to predict the result distributions of aggregates, parallel groupjoin execution for scalable execution of groupjoins, index groupjoins, and a greedy eager aggregation optimization technique that introduces nested preaggregations to significantly improve execution plans. The resulting system has improved estimates, better execution plans, and a contention-free evaluation of groupjoins, which speeds up TPC-H and TPC-DS queries significantly.",
    "citationCount": 7,
    "referenceCount": 83
}