{
    "paperId": "5dbdc0a3b6c8c5e9ef7a65c50927e9b9eceee2fc",
    "title": "CONCERTO: Complex Query Execution Mechanism-Aware Learned Cost Estimation",
    "year": 2024,
    "venue": "",
    "authors": [
        "Kaixin Zhang",
        "Hongzhi Wang",
        "Kunkai Gu",
        "Ziqi Li",
        "Chunyu Zhao",
        "Yingze Li",
        "Yu Yan"
    ],
    "doi": null,
    "arxivId": "2412.00749",
    "url": "https://www.semanticscholar.org/paper/5dbdc0a3b6c8c5e9ef7a65c50927e9b9eceee2fc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growing demand for massive data analysis, many DBMSs have adopted complex underlying query execution mechanisms, including vectorized operators, parallel execution, and dynamic pipeline modifications. However, there remains a lack of targeted Query Performance Prediction (QPP) methods for these complex execution mechanisms and their interactions, as most existing approaches focus on traditional tree-shaped query plans and static serial executors. To address this challenge, this paper proposes CONCERTO, a Complex query executiON meChanism-awaE leaRned cosT estimatiOn method. CONCERTO first establishes independent resource cost models for each physical operator. It then constructs a Directed Acyclic Graph (DAG) consisting of a dataflow tree backbone and resource competition relationships among concurrent operators. After calibrating the cost impact of parallel operator execution using Graph Attention Networks (GATs) with additional attention mechanisms, CONCERTO extracts and aggregates cost vector trees through Temporal Convolutional Networks (TCNs), ultimately achieving effective query performance prediction. Experimental results demonstrate that CONCERTO achieves higher prediction accuracy than existing methods.",
    "citationCount": 0,
    "referenceCount": 39
}