{
    "paperId": "5dc4710e0ee76217093f1a3dcc9c719171e81aa6",
    "title": "Uncovering rearrangements in the Tibetan antelope via population-derived genome refinement and comparative analysis with homologous species",
    "year": 2024,
    "venue": "Frontiers in Genetics",
    "authors": [
        "Jiarui Chen",
        "Shuwen Wang",
        "Dong Wang",
        "Yunkang Chiu",
        "Nan Yang",
        "Xinming Lian",
        "Zicheng Zhao",
        "Qing Wei"
    ],
    "doi": "10.3389/fgene.2024.1302554",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5dc4710e0ee76217093f1a3dcc9c719171e81aa6",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/genetics/articles/10.3389/fgene.2024.1302554/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction: The Tibetan antelope (Pantholops hodgsonii) is a remarkable mammal thriving in the extreme Qinghai-Tibet Plateau conditions. Despite the availability of its genome sequence, limitations in the scaffold-level assembly have hindered a comprehensive understanding of its genomics. Moreover, comparative analyses with other Bovidae species are lacking, along with insights into genome rearrangements in the Tibetan antelope. Methods: Addressing these gaps, we present a multifaceted approach by refining the Tibetan Antelope genome through linkage disequilibrium analysis with data from 15 newly sequenced samples. Results: The scaffold N50 of the refined reference is 3.2 Mbp, surpassing the previous version by 1.15-fold. Our annotation analysis resulted in 50,750 genes, encompassing 29,324 novel genes not previously study. Comparative analyses reveal 182 unique rearrangements within the scaffolds, contributing to our understanding of evolutionary dynamics and species-specific adaptations. Furthermore, by conducting detailed genomic comparisons and reconstructing rearrangements, we have successfully pioneered the reconstruction of the X-chromosome in the Tibetan antelope. Discussion: This effort enhances our comprehension of the genomic landscape of this species.",
    "citationCount": 0,
    "referenceCount": 34
}