{
    "paperId": "5dce8dd0ddc81536f1248f91bd4c72358a3a5a62",
    "title": "DSDP: Dual Stream Data Prefetcher",
    "year": 2022,
    "venue": "International Conference on Parallel Architectures and Compilation Techniques",
    "authors": [
        "Mingjian He",
        "Hua Wang",
        "Ke Zhou",
        "Kaichao Cui",
        "Huabing Yan",
        "Chang Guo",
        "Rongfeng He"
    ],
    "doi": "10.1145/3559009.3569677",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5dce8dd0ddc81536f1248f91bd4c72358a3a5a62",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3559009.3569677",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hardware prefetching is an important DRAM latency hiding technology. Designing prefetchers to maximize system performance often requires a delicate balance between coverage and accuracy. As the number of cores increases, the accuracy of the prefetching algorithm becomes more important. Separating streams based on memory access instructions is an effective way to improve accuracy. However, this technique may lose prefetch opportunities by losing cross-PC relationships, and even reduce algorithm coverage. In this paper, we propose a spatial prefetcher called Dual Stream Data Prefetcher (DSDP). DSDP achieves high coverage and accuracy with two designs. First, DSDP improves prefetching accuracy by PC localizing. Second, DSDP simultaneously learns cross-PC relationships from the spatial localized stream to compensate for the loss of prefetching opportunities brought by PC localization. Our experimental results show that, DSDP improves system performance by 41.9% over a baseline with no data prefetcher and 4.1% over the state-of-the-art spatial data prefetcher.",
    "citationCount": 3,
    "referenceCount": 31
}