{
    "paperId": "5dd7e04dc7d5e3510108dc2757adb4f22c2f6980",
    "title": "Data Partitioning and Storage Strategies for Artificial Intelligence and Machine Learning Applications: A Review of Techniques",
    "year": 2024,
    "venue": "International Conferences on Computing Advancements",
    "authors": [
        "Kingsley C. Nwosu",
        "Ibrahim Kamara",
        "M. Abdulgader",
        "Y. Hu"
    ],
    "doi": "10.1109/ICCA62237.2024.10927845",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5dd7e04dc7d5e3510108dc2757adb4f22c2f6980",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a review of data partitioning and storage strategies critical for optimizing the performance and scalability of Artificial Intelligence (AI) and Machine Learning (ML) applications. As the volume and complexity of data continue to grow, effective data management becomes increasingly essential for ensuring the efficiency and accuracy of AI/ML models. The review categorizes and evaluates various data partitioning techniques, including hash-based, range-based and graph-based algorithms, highlighting their strengths, weaknesses, and suitability for different types of datasets and applications. It also explores the data processing challenges with AI/ML applications, data access patterns for AI/ML algorithms; and implementation techniques and evaluation metrics. By identifying key factors that influence the choice of partitioning and storage strategies, this review provides valuable insights for researchers and practitioners seeking to enhance the performance of AI/ML systems. The review also serves as a foundation for future research and development, guiding the design of more efficient and scalable data management solutions in artificial intelligence.",
    "citationCount": 0,
    "referenceCount": 93
}