{
    "paperId": "5df08d9f1769c173bf07d696c9ca7ed22944e959",
    "title": "Learned Index Benefits: Machine Learning Based Index Performance Estimation",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Jiachen Shi",
        "Gao Cong",
        "Xiaoli Li"
    ],
    "doi": "10.14778/3565838.3565848",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5df08d9f1769c173bf07d696c9ca7ed22944e959",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Index selection remains one of the most challenging problems in relational database management systems. To find an optimum index configuration for a workload,\n accurately and efficiently quantifying the benefits of each candidate index configuration is indispensable.\n As materializing each index configuration candidate and physically executing queries are infeasible, most of index tuners rely on the cost estimations from optimizer with \"what-if\" API. However, \"what-if\" based index benefit estimations have the following two limitations. Firstly, they generate significant errors, which compromise index recommendation quality. Secondly, generating query plans and benefit estimations for each candidate index configuration takes a considerable amount of time. To address the two challenges in index selection, we propose\n an effective end-to-end machine learning based index benefit estimator.\n In particular, we propose novel feature extraction and encoding techniques that do not rely on \"what-if\" call to generate query plan for each index configuration candidate. In addition, we design an attention mechanism to address index interaction issue and aggregate the impacts of different query operations. Finally, we leverage transfer learning technique to improve the estimator's learning ability for adaption to new database. Comprehensive experiments are conducted on different workloads, and extensive experimental results show that our proposed method outperforms \"what-if\" based index benefit estimations in terms of accuracy and efficiency. In addition, integrating our method into existing index selection algorithms can significantly improve index recommendation quality.\n",
    "citationCount": 34,
    "referenceCount": 50
}