{
    "paperId": "5df2878e5f788c5a63ba692337246c2eb2e8b7cd",
    "title": "Prompt-Layered Architecture: A New Stack for AI-First Product Design",
    "year": 2024,
    "venue": "International Journal of Scientific Research and Management",
    "authors": [
        "Savi Khatri"
    ],
    "doi": "10.18535/ijsrm/v12i09.ec09",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5df2878e5f788c5a63ba692337246c2eb2e8b7cd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the advancement of large language models powering next-generation applications, there is an increasing demand for architectural frameworks that treat prompts as modular, orchestratable, and extendible parts of a software system. The traditional methods of AI integration have treated prompt engineering as some kind of ad hoc or application-specific task with no connection to systematic design principles or software architecture standards. The paper introduces the Prompt-Layered Architecture (PLA), a new architectural style where prompts have been elevated into first-class citizens of the software stack. PLA provides composition, management, and orchestration of prompts through modularized layers, thus allowing the building of AI-first products that are scalable, testable, and extendible.\nWe formalize the PLA model as four core layers: the Prompt Composition Layer, the Prompt Orchestration Layer, the Response Interpretation Layer, and the Domain Memory Layer, which together support reuse of prompt templates, structured routing of model outputs, persistence of memories across interaction chains, and resonance to business logic and user context. Inspired by traditional layered software architectures, PLA brings versioning to LLMs, API-driven abstraction of prompts, and test scaffolding for verifying LLM behavior.\nTo validate the design, we develop a prototype implementation on top of the OpenAI GPT APIs and evaluate the PLA versus flat prompt-based systems on modularity metrics, reusability benchmarks, and cognitive load for prompt engineers. The results evidence the benefits of PLA in improving maintainability while fast-tracking the integration of AI capabilities across various distributed services. The paper also illustrates several SmartArt diagrams and examples of orchestration in Python and discusses how PLA fills the gap between emerging frameworks such as LangChain, AutoGPT, and prompt programming compilers.\nBy formalizing prompts as copiable units of architecture, this research lays the blueprint for building scalable AI-first applications with structured reasoning, state awareness, and prompt governance.",
    "citationCount": 0,
    "referenceCount": 19
}