{
    "paperId": "5e2d898f8b24fdb718641aca9aec66bc08976071",
    "title": "Text Semantics-Driven Data Classification Storage Optimization",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Zhu Yuan",
        "Xueqiang Lv",
        "Yunchao Gong",
        "Boshan Liu",
        "Haixiang Yang",
        "Xindong You"
    ],
    "doi": "10.3390/app14031159",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5e2d898f8b24fdb718641aca9aec66bc08976071",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/14/3/1159/pdf?version=1706616549",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data classification storage has emerged as an effective strategy, harnessing the diverse performance attributes of storage devices to orchestrate a harmonious equilibrium between energy consumption, cost considerations, and user accessibility. The traditional strategy of solely relying on access frequency for data classification is no longer suitable for today’s complex storage environment. Diverging from conventional methods, we explore from the perspective of text semantics to address this issue and propose an effective data classification storage method using text semantic similarity to extract seasonal features. First, we adopt a dual-layer strategy based on semantic similarity to extract seasonal features. Second, we put forward a cost-effective data classification storage framework based on text seasonal features. We compare our work with the data classification approach AS-H, which runs at full high performance. In addition, we also compare it with K-ear, which adopts K-means as the classification algorithm. The experimental results show that compared with AS-H and K-ear, our method reduces energy consumption by 9.51–13.35% and operating costs by 13.20–22.17%.",
    "citationCount": 0,
    "referenceCount": 37
}