{
    "paperId": "5e335d4d79c0036369f201c5f1689896b4cddb63",
    "title": "KU-DMIS at EHRSQL 2024 : Generating SQL query via question templatization in EHR",
    "year": 2024,
    "venue": "Clinical Natural Language Processing Workshop",
    "authors": [
        "Hajung Kim",
        "Chanhwi Kim",
        "Hoonick Lee",
        "Kyochul Jang",
        "Jiwoo Lee",
        "Kyungjae Lee",
        "Gangwoo Kim",
        "Jaewoo Kang"
    ],
    "doi": "10.48550/arXiv.2406.00014",
    "arxivId": "2406.00014",
    "url": "https://www.semanticscholar.org/paper/5e335d4d79c0036369f201c5f1689896b4cddb63",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Transforming natural language questions into SQL queries is crucial for precise data retrieval from electronic health record (EHR) databases. A significant challenge in this process is detecting and rejecting unanswerable questions that request information outside the database’s scope or exceed the system’s capabilities. In this paper, we introduce a novel text-to-SQL framework that focuses on standardizing the structure of questions into a templated format. Our framework begins by fine-tuning GPT-3.5-turbo, a powerful large language model (LLM), with detailed prompts involving the table schemas of the EHR database system. Our approach shows promising results on the EHRSQL-2024 benchmark dataset, part of the ClinicalNLP shared task. Although fine-tuning GPT achieves third place on the development set, it struggled with the diverse questions in the test set. With our framework, we improve our system’s adaptability and achieve fourth position in the official leaderboard of the EHRSQL-2024 challenge.",
    "citationCount": 0,
    "referenceCount": 35
}