{
    "paperId": "5e5e6573c07119eb7327912995df237c89acf535",
    "title": "Distance, Origin and Category Constrained Paths",
    "year": 2023,
    "venue": "ACM Trans. Spatial Algorithms Syst.",
    "authors": [
        "Xu Teng",
        "Goce Trajcevski",
        "Andreas Züfle"
    ],
    "doi": "10.1145/3596601",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5e5e6573c07119eb7327912995df237c89acf535",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3596601",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommending a Point of Interest (PoI) or a sequence of PoIs to visit based on user’s preferences and geo-locations has been one of the most popular applications of Location-Based Services (LBS). Variants have also been considered which take other factors into consideration, such as broader (implicit or explicit) semantic constraints as well as the limitations on the length of the trip. In this work, we present an efficient algorithmic solution to a novel query – PaDOC (Paths with Distance, Origin, and Category constraints) – which combines the generation of a path that (a) can be traversed within a user-specified budget (e.g., limit on distance), (b) starts at one of the user-specified origin locations (e.g., a hotel), and (c) contains PoIs from a user-specified list of PoI categories. We show that the problem of deciding whether such a path exists is an NP-hard problem. Based on a novel indexing structure, we propose two efficient algorithms for approximate PaDOC query processing based on both conservative and progressive distance estimations. We conducted extensive experiments over real, publicly available datasets, demonstrating the benefits of the proposed methodologies over straightforward solutions.",
    "citationCount": 3,
    "referenceCount": 57
}