{
    "paperId": "5e8fdfa2ed2cfdf4fe002c5afe083d33993dd1b6",
    "title": "Uniform Machine Scheduling with Predictions",
    "year": 2022,
    "venue": "International Conference on Automated Planning and Scheduling",
    "authors": [
        "Tianming Zhao",
        "Wei Li",
        "Albert Y. Zomaya"
    ],
    "doi": "10.1609/icaps.v32i1.19827",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5e8fdfa2ed2cfdf4fe002c5afe083d33993dd1b6",
    "isOpenAccess": true,
    "openAccessPdf": "https://ojs.aaai.org/index.php/ICAPS/article/download/19827/19586",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The revival in learning theory has provided us with improved capabilities for accurate predictions. This work contributes to an emerging research agenda of online scheduling with predictions by studying the makespan minimization in uniformly related machine non-clairvoyant scheduling with job size predictions. Our task is to design online algorithms that effectively use predictions and have performance guarantees with varying prediction quality. We first propose a simple algorithm-independent prediction error measurement to quantify prediction quality. To effectively use the predicted job sizes, we design an offline improved 2-relaxed decision procedure approximating the optimal schedule. With this decision procedure, we propose an online O(min{log eta, log m})-competitive algorithm that assumes a known prediction error. Finally, we extend this algorithm to construct a robust O(min{log eta, log m})-competitive algorithm that does not assume a known error. Both algorithms require only moderate predictions to improve the well-known Omega(log m) lower bound, showing the potential of using predictions in managing uncertainty.",
    "citationCount": 3,
    "referenceCount": 26
}