{
    "paperId": "5ea56c536b00a2c3857d7b73df527627765494ea",
    "title": "Justin: Hybrid CPU/Memory Elastic Scaling for Distributed Stream Processing",
    "year": 2025,
    "venue": "IFIP International Conference on Distributed Applications and Interoperable Systems",
    "authors": [
        "Donatien Schmitz",
        "Guillaume Rosinosky",
        "Etienne Rivière"
    ],
    "doi": "10.48550/arXiv.2505.19739",
    "arxivId": "2505.19739",
    "url": "https://www.semanticscholar.org/paper/5ea56c536b00a2c3857d7b73df527627765494ea",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Distributed Stream Processing (DSP) engines analyze continuous data via queries expressed as a graph of operators. Auto-scalers adjust the number of parallel instances of these operators to support a target rate. Current auto-scalers couple CPU and memory scaling, allocating resources as one-size-fits-all packages. This contrasts with operators' high diversity of requirements. We present Justin, an auto-scaler that enables hybrid CPU and memory scaling of DSP operators. Justin monitors both CPU usage and the performance of operators' storage operations. Its mechanisms enable finegrain memory allocation for tasks upon a query reconfiguration. The Justin policy identifies individual operators' memory pressure and decides between adjusting parallelism and/or memory assignment. We implement Justin in Apache Flink, extending the Flink Kubernetes Operator and the DS2 CPU-only auto-scaler. Using the Nexmark benchmark, our evaluation shows that Justin identifies suitable resource allocation in as many or fewer reconfiguration steps as DS2 and supports a target rate with significantly fewer CPU and memory resources.",
    "citationCount": 0,
    "referenceCount": 35
}