{
    "paperId": "5eb68ce52871c46f2f2c3707b6942706322497c1",
    "title": "Orion: A Centralized Blockchain Database with Multi-Party Data Access Control",
    "year": 2023,
    "venue": "International Conference on Blockchain",
    "authors": [
        "Artem Barger",
        "Liran Funaro",
        "Gennady Laventman",
        "Hagar Meir",
        "Dany Moshkovich",
        "Senthilnathan Natarajan",
        "Yoav Tock"
    ],
    "doi": "10.1109/ICBC56567.2023.10174914",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5eb68ce52871c46f2f2c3707b6942706322497c1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Blockchain databases were designed to improve trust in centralized ecosystems, which dominate the market today, by introducing tamper-evidence features on top of a classical database. Compared to decentralized ledger technologies, blockchain databases are easier to use, and they can significantly reduce the operational and development costs. However, the existing blockchain databases do not equip multiple parties with tools to efficiently control common data written to the ledger. This paper describes Orion, a new open source blockchain database that introduces multi-sig and proof capabilities with extensive key-level access control, which enable parties to mutually control and validate a value written to the database. These unique capabilities, together with additional blockchain properties, provide users with features such as tamper-evidence, provenance, data lineage, authenticity, and non-repudiation, while using a standard data model and transactional APIs. We found our technology to be extremely useful in improving the integrity of a system and reducing mistakes, disputes, and fraud.",
    "citationCount": 2,
    "referenceCount": 29
}