{
    "paperId": "5ec33402a4d9c632afee3c36625118970c843e6d",
    "title": "Revenue Forecasting Using Distributed Machine Learning In Online Advertising Systems",
    "year": 2023,
    "venue": "2023 International Conference on Research Methodologies in Knowledge Management, Artificial Intelligence and Telecommunication Engineering (RMKMATE)",
    "authors": [
        "Murugan P",
        "Esakkiammal S",
        "N. Kanagavalli",
        "P. K. Priya",
        "J. Martis",
        "P. Kavitha"
    ],
    "doi": "10.1109/RMKMATE59243.2023.10369815",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5ec33402a4d9c632afee3c36625118970c843e6d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research delves into the utilization of distributed machine learning methods for revenue forecasting in the realm of online advertising systems. As the domain of digital advertising continues to expand rapidly, the accurate prediction of revenue becomes indispensable for optimizing resource allocation and making well-informed decisions. Conventional approaches frequently encounter difficulties in managing the sheer volume and intricacy of advertising data. In contrast, distributed machine learning harnesses the capabilities of parallel processing and distributed computing to efficiently process and analyze large datasets. This investigation explores diverse distributed machine learning algorithms, including gradient boosting, random forests, and neural networks, within the context of revenue forecasting. The research assesses their performance, scalability, and precision in comparison to traditional techniques. Through empirical experiments and case studies, we showcase the potential of distributed machine learning to elevate the accuracy of revenue forecasting in online advertising systems, ultimately contributing to more informed business strategies and enhanced revenue generation.",
    "citationCount": 0,
    "referenceCount": 18
}