{
    "paperId": "5ed86bca9695075834ae85eff99b45422d00a884",
    "title": "Research on Battery Safety Evaluation System of Energy Storage Power Station Based on Fuzzy Comprehensive Evaluation Method",
    "year": 2024,
    "venue": "2024 7th International Conference on Power and Energy Applications (ICPEA)",
    "authors": [
        "Zhijun Guo",
        "Xiaorong Huang",
        "Canlun Ye",
        "Weibiao Xiong",
        "Subin Cai",
        "Jun He"
    ],
    "doi": "10.1109/ICPEA63589.2024.10784584",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5ed86bca9695075834ae85eff99b45422d00a884",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the new power system, the energy storage station using lithium ion battery plays an important role in the peak and frequency modulation on the grid side, or in suppressing the power fluctuation of the new energy station on the power generation side. However, how to apply the appropriate evaluation index system to evaluate the safety risk of the battery in the operation stage is becoming more and more important. This paper first build a multi-source information fusion safety assessment system, the level of indicators including energy storage battery, battery aging degree, power condition, battery operating status, grid structure, and then based on the fuzzy comprehensive evaluation method for energy storage power station battery safety risk assessment, and gives the current risk level evaluation score. Through the calculation case of an electrochemical energy storage power station in Guangdong Province, China, according to the field information data of the energy storage power station, the actual operation state is judged to be “normal”, which is consistent with the evaluation results of this model, and proves the feasibility and accuracy of this evaluation model.",
    "citationCount": 0,
    "referenceCount": 11
}