{
    "paperId": "5edeb58c5362d677e1f44f37f2187511bb71b8c0",
    "title": "Named Data Networking: A Survey on Routing Strategies",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "F. A. Karim",
        "A. Aman",
        "Rosilah Hassan",
        "Kashif Nisar",
        "Mueen Uddin"
    ],
    "doi": "10.1109/ACCESS.2022.3201083",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5edeb58c5362d677e1f44f37f2187511bb71b8c0",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09864583.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the Internet grows in popularity, data become an increasingly crucial component. People now care more about the data than the data location. Named data network (NDN) takes this concept and pairs it with the idea of making data a core component rather than host addresses. As data traffic increases exponentially, NDN offers three main advantages over current Transmission Control Protocol and Internet Protocol-based networks. These advantages are in-network caching, smooth mobility, and robust content dissemination. NDN-related challenges are open for investigation as NDN becomes more invaluable. Routing in NDN is another essential domain that needs to be addressed, and several approaches are presented to address routing concerns in NDN. In this study, we discuss and highlight NDN and its routing strategies comprehensively. In addition, this research compares important routing paradigms to emphasize the breadth of routing research in NDN. Moreover, we investigate the routing attributes of NDN and expose the latest literature on this critical topic. Finally, this study provides useful insights into the emerging areas of guidance in NDN to assist future studies in addressing challenges and open research issues.",
    "citationCount": 24,
    "referenceCount": 135
}