{
    "paperId": "5eee6ba59eb4dff7c5ea15ca0ff082cc0b5af5a7",
    "title": "Psychological stress in mothers of neonates admitted to an intensive care unit",
    "year": 2021,
    "venue": "Salud mental (Mexico)",
    "authors": [
        "Susana Mesa Mesa",
        "Alejandra Gómez García",
        "Luisa Fernanda Naranjo Pérez",
        "Laura Montoya",
        "María Victoria Ocampo Saldarriaga",
        "Juan David Velásquez Tirado",
        "Gustavo Adolfo Constaín González",
        "Carmenza Ricardo Ramírez",
        "Yeison Felipe Gutiérrez Vélez",
        "J. G. F. Vásquez"
    ],
    "doi": "10.17711/sm.0185-3325.2021.031",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5eee6ba59eb4dff7c5ea15ca0ff082cc0b5af5a7",
    "isOpenAccess": true,
    "openAccessPdf": "http://revistasaludmental.mx/index.php/salud_mental/article/download/SM.0185-3325.2021.031/4022",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction. The admission of the newborn to a neonatal intensive care unit (NICU) leads to maternal stress. This stress has deleterious consequences on the mother and the appropriate attachment with her child. Objective. To assess the relationship of mothers’ sociodemographic, clinical, psychological, and psychiatric factors, as well as neonates’ clinical aspects with the level of psychological stress perceived by mothers of neonates admitted to the NICU. Method. Cross-sectional study with 47 women over the age of 18, whose infants had been admitted to a NICU during the last 72 hours. Bivariate correlations and a multivariate linear model with the significant variables in the bivariate analyses where performed. Results. According to the multivariate model, the perception of loneliness and the presence of at least one psychiatric diagnosis (depressive episode, dysthymia, generalized anxiety disorder, adjustment disorder, acute stress disorder, or substance use disorder) were associated with maternal stress. Problem-focused coping strategies were relevant within the model and could have protective value against stress. The model explained 73.5% of the stress severity variance (F 38.848; p",
    "citationCount": 2,
    "referenceCount": 49
}