{
    "paperId": "5f1e0777fc54bb4c66b50498dce2f1ac0b84b09d",
    "title": "G&L: An Attention-based Model for Improving Prefetching in Solid-state Drives",
    "year": 2023,
    "venue": "IEEE International Joint Conference on Neural Network",
    "authors": [
        "Chenxu Yang",
        "Xin Man",
        "Jie Shao"
    ],
    "doi": "10.1109/IJCNN54540.2023.10191741",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5f1e0777fc54bb4c66b50498dce2f1ac0b84b09d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Solid-state drives (SSDs) have become the storage device for many personal computers and enterprise servers. However, the access speed of SSDs is still a bottleneck for computer systems. With prefetching, SSDs are able to predict future requests before moving data to a faster storage unit. Nevertheless, the interleaved access flow of applications poses challenges for existing prefetchers. We propose a model named G&L consisting of two components, namely a generative pre-training (GPT) prefetcher and a logical block address (LBA)-I/O size table. The GPT prefetcher applies a decoder-only framework with a self-attention mechanism to forecast the next LBA. The LBA-I/O size table maps LBAs to their most frequently appeared I/Osize for prediction. To evaluate the entire performance of the G&L model, we propose an algorithm to simulate the buffer when the I/O size changes dynamically. Experiments show that the accuracy, coverage, and f1 score of the GPT prefetcher surpass the baselines in most cases. The prediction accuracy of the LBA-I/O size table exceeds the baseline on all datasets. The G&L model's prefetching accuracy, coverage, and f1 score also outperform the baseline considering variable I/O size.",
    "citationCount": 1,
    "referenceCount": 25
}