{
    "paperId": "5f384435e85ae1c0c1fd57760c6f807626e1bd18",
    "title": "Transduction of Lentiviral Vectors and ADORA3 in HEK293T Cells Modulated in Gene Expression and Alternative Splicing",
    "year": 2025,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "Yongqi Qian",
        "Zhaoyu Liu",
        "Qingqing Liu",
        "Xiaojuan Tian",
        "Jing Mo",
        "Liang Leng",
        "Can Wang",
        "Guoqing Xu",
        "Sanyin Zhang",
        "Jiang Xie"
    ],
    "doi": "10.3390/ijms26094431",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5f384435e85ae1c0c1fd57760c6f807626e1bd18",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/ijms26094431",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For steady transgenic expression, lentiviral vector-mediated gene delivery is a commonly used technique. One question that needs to be explored is how external lentiviral vectors and overexpressed genes perturb cellular homeostasis, potentially altering transcriptional networks. In this study, two Human Embryonic Kidney 293T (HEK293T)-derived cell lines were established via lentiviral transduction, one overexpressing green fluorescent protein (GFP) and the other co-overexpressing GFP and ADORA3 following puromycin selection to ensure stable genomic integration. Genes with differentially transcript utilization (gDTUs) and differentially expressed genes (DEGs) across cell lines were identified after short-read and long-read RNA-seq. Only 31 genes were discovered to have changed in expression when GFP was expressed, although hundreds of genes showed variations in transcript use. In contrast, even when co-overexpression of GFP and ADORA3 alters the expression of more than 1000 genes, there are still less than 1000 gDTUs. Moreover, DEGs linked to ADORA3 overexpression play a major role in RNA splicing, whereas gDTUs are highly linked to a number of malignancies and the molecular mechanisms that underlie them. For the analysis of gene expression data from stable cell lines derived from HEK293T, our findings provide important insights into changes in gene expression and alternative splicing.",
    "citationCount": 1,
    "referenceCount": 76
}