{
    "paperId": "5f3f574e9adddd5f034df386b821d15df86298b1",
    "title": "dugMatting: Decomposed-Uncertainty-Guided Matting",
    "year": 2023,
    "venue": "International Conference on Machine Learning",
    "authors": [
        "Jiawei Wu",
        "Changqing Zhang",
        "Zuoyong Li",
        "H. Fu",
        "Xi Peng",
        "Joey Tianyi Zhou"
    ],
    "doi": "10.48550/arXiv.2306.01452",
    "arxivId": "2306.01452",
    "url": "https://www.semanticscholar.org/paper/5f3f574e9adddd5f034df386b821d15df86298b1",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2306.01452",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cutting out an object and estimating its opacity mask, known as image matting, is a key task in image and video editing. Due to the highly ill-posed issue, additional inputs, typically user-defined trimaps or scribbles, are usually needed to reduce the uncertainty. Although effective, it is either time consuming or only suitable for experienced users who know where to place the strokes. In this work, we propose a decomposed-uncertainty-guided matting (dugMatting) algorithm, which explores the explicitly decomposed uncertainties to efficiently and effectively improve the results. Basing on the characteristic of these uncertainties, the epistemic uncertainty is reduced in the process of guiding interaction (which introduces prior knowledge), while the aleatoric uncertainty is reduced in modeling data distribution (which introduces statistics for both data and possible noise). The proposed matting framework relieves the requirement for users to determine the interaction areas by using simple and efficient labeling. Extensively quantitative and qualitative results validate that the proposed method significantly improves the original matting algorithms in terms of both efficiency and efficacy.",
    "citationCount": 5,
    "referenceCount": 54
}