{
    "paperId": "5f5897e9419609e5c6307f4a23528fa640a5c00a",
    "title": "Whole genome sequence of petroleum hydrocarbon degrading novel strain Microbacter sp. EMBS2025 isolated from Chilika Lake, Odisha, India",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Anuraj Nayarisseri",
        "Khushboo Sharma",
        "Arshiya Khan",
        "Radhika Swami",
        "Rinku Chaudhary",
        "Juhi Sharma",
        "Navpreet Kaur",
        "Jyotsana Kharate",
        "Vasudha Rathore",
        "Leena Prajapati",
        "S. Bandaru",
        "Francisco Jaime Bezerra Mendonça Junior",
        "M. Scotti",
        "L. Scotti"
    ],
    "doi": "10.1038/s41598-025-13545-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5f5897e9419609e5c6307f4a23528fa640a5c00a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bioremediation offers a sustainable and eco-friendly approach for addressing petroleum contamination. In this study, we investigated the hydrocarbon-degrading potential of Microbacter sp. EMBS2025, a strain previously isolated and characterized for its biosurfactant-producing capabilities. The strain was cultivated using varying concentrations of crude oil as the sole carbon source, where it demonstrated robust growth and efficient degradation of both alkanes and aromatic hydrocarbons. Whole-genome sequencing was performed using the Illumina Novaseq 6000 platform, yielding approximately 33.4 million high-quality reads with a sequencing depth (~ 1482 ×). The assembled genome spans 3.52 Mb and comprises 3237 coding sequences (CDS), 19 miscellaneous RNAs, 3 rRNAs, 51 tRNAs, and 1 tmRNA. The genome assembly achieved 100% completeness, providing a fully reconstructed genome. Functional annotation revealed a metabolically versatile profile, including key genes involved in biosurfactant synthesis (ppsC, treS, treY, mmpL3, otsA, and rhlG_1/rhlG_2) and hydrocarbon degradation (alkB, sadH, yghA, nuo, gap, BVMO, cat, pca, and ben), highlighting its strong oxidation potential. Orthogroup analysis identified unique orthologous groups within the strain, while Average Nucleotide Identity (ANI) analysis suggests that Microbacter sp. EMBS2025 may represent a novel species within the Microbacterium genus. Variant annotation revealed a genome enriched with high-impact variants, with SNPs accounting for 66–68% of the total. The demonstrated bioremediation potential of Microbacter sp. EMBS2025 offers a sustainable solution for oil pollution, contributing to cleaner environments, reduced health risks, and enhanced water quality. The application of this strain in oil-contaminated environments holds significant promise for protecting public health by reducing toxic exposure risks, restoring clean water sources, and supporting agricultural and economic activities in affected communities.",
    "citationCount": 1,
    "referenceCount": 83
}