{
    "paperId": "5f5d0387c14cd44def66d352acba1013494fffd0",
    "title": "Finding Logic Bugs in Spatial Database Engines via Affine Equivalent Inputs",
    "year": 2024,
    "venue": "Proc. ACM Manag. Data",
    "authors": [
        "Wenjing Deng",
        "Qiuyang Mang",
        "Chengyu Zhang",
        "Manuel Rigger"
    ],
    "doi": "10.1145/3698810",
    "arxivId": "2410.12496",
    "url": "https://www.semanticscholar.org/paper/5f5d0387c14cd44def66d352acba1013494fffd0",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2410.12496",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Spatial Database Management Systems (SDBMSs) aim to store, manipulate, and retrieve\n spatial data\n . SDBMSs are employed in various modern applications, such as geographic information systems, computer-aided design tools, and location-based services. However, the presence of logic bugs in SDBMSs can lead to incorrect results, substantially undermining the reliability of these applications. Detecting logic bugs in SDBMSs is challenging due to the lack of ground truth for identifying incorrect results. In this paper, we propose an automated\n geometry-aware generator\n to generate high-quality SQL statements for SDBMSs and a novel concept named\n Affine Equivalent Inputs (AEI)\n to validate the results of SDBMSs. We implemented them as a tool named Spatter (\n Spat\n ial DBMS Tes\n ter\n ) for finding logic bugs in four popular SDBMSs: PostGIS, DuckDB Spatial, MySQL, and SQL Server. Our testing campaign detected 34 previously unknown and unique bugs in these SDBMSs, of which 30 have been confirmed, and 18 have already been fixed. Our testing efforts have been well appreciated by the developers. Experimental results demonstrate that the\n geometry-aware generator\n significantly outperforms a naive random-shape generator in detecting unique bugs, and\n AEI\n can identify 14 logic bugs in SDBMSs that were totally overlooked by previous methodologies.\n",
    "citationCount": 2,
    "referenceCount": 48
}