{
    "paperId": "5f686b80f912d24051c847f4e7e651be07ea0729",
    "title": "A Survey of Machine Learning-Based Ride-Hailing Planning",
    "year": 2023,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Dacheng Wen",
        "Yupeng Li",
        "F. Lau"
    ],
    "doi": "10.1109/TITS.2023.3345174",
    "arxivId": "2303.14646",
    "url": "https://www.semanticscholar.org/paper/5f686b80f912d24051c847f4e7e651be07ea0729",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2303.14646",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ride-hailing is a sustainable transportation paradigm where riders access door-to-door traveling services through a mobile phone application, which has attracted a colossal amount of usage. There are two major planning tasks in a ride-hailing system: 1) matching, i.e., assigning available vehicles to pick up the riders; and 2) repositioning, i.e., proactively relocating vehicles to certain locations to balance the supply and demand of ride-hailing services. Recently, many studies of ride-hailing planning that leverage machine learning techniques have emerged. In this article, we present a comprehensive overview on latest developments of machine learning-based ride-hailing planning. To offer a clear and structured review, we introduce a taxonomy into which we carefully fit the different categories of related works according to the types of their planning tasks and solution schemes, which include collective matching, distributed matching, collective repositioning, distributed repositioning, and joint matching and repositioning. We further shed light on many real-world data sets and simulators that are indispensable for empirical studies on machine learning-based ride-hailing planning strategies. At last, we propose several promising research directions for this rapidly growing research and practical field.",
    "citationCount": 9,
    "referenceCount": 264
}