{
    "paperId": "5f9386cb9b2a05fdd0cd3f1a8edb60c9e41250a2",
    "title": "Development of an AI Model for Predicting Methacholine Bronchial Provocation Test Results Using Spirometry",
    "year": 2025,
    "venue": "Diagnostics",
    "authors": [
        "SangJee Park",
        "Yehyeon Yi",
        "Seon-Sook Han",
        "Tae-Hoon Kim",
        "So Jeong Kim",
        "Young Soon Yoon",
        "Suhyun Kim",
        "H. Lee",
        "Yeonjeong Heo"
    ],
    "doi": "10.3390/diagnostics15040449",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5f9386cb9b2a05fdd0cd3f1a8edb60c9e41250a2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/diagnostics15040449",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background/Objectives: The methacholine bronchial provocation test (MBPT) is a diagnostic test frequently used to evaluate airway hyper-reactivity. MBPT is essential for diagnosing asthma; however, it can be time-consuming and resource-intensive. This study aimed to develop an artificial intelligence (AI) model to predict the MBPT results using forced expiratory volume in one second (FEV1) and bronchodilator test measurements from spirometry. Methods: a dataset of spirometry measurements, including Pre- and Post-bronchodilator FEV1, was used to train and validate the model. Results: Among the evaluated models, the multilayer perceptron (MLP) achieved the highest area under the curve (AUC) of 0.701 (95% CI: 0.676–0.725), accuracy of 0.758, and an F1-score of 0.853. Logistic regression (LR) and a support vector machine (SVM) demonstrated comparable performance with AUC values of 0.688, while random forest (RF) and extreme gradient boost (XGBoost) achieved slightly lower AUC values of 0.669 and 0.672, respectively. Feature importance analysis of the MLP model identified key contributing features, including Pre-FEF25–75 (%), Pre-FVC (L), Post FEV1/FVC, Change-FEV1 (L), and Change-FEF25–75 (%), providing insight into the interpretability and clinical applicability of the model. Conclusions: These results highlight the potential of the model to utilize readily available spirometry data, particularly FEV1 and bronchodilator responses, to accurately predict MBPT results. Our findings suggest that AI-based prediction can improve asthma diagnostic workflows by minimizing the reliance on MBPT and enabling faster and more accessible assessments.",
    "citationCount": 1,
    "referenceCount": 40
}