{
    "paperId": "5f9ebcddd3981b1b7f3300353d1e684d9e34dcdc",
    "title": "Regular Polytope Networks",
    "year": 2021,
    "venue": "IEEE Transactions on Neural Networks and Learning Systems",
    "authors": [
        "F. Pernici",
        "Matteo Bruni",
        "C. Baecchi",
        "A. Bimbo"
    ],
    "doi": "10.1109/TNNLS.2021.3056762",
    "arxivId": "2103.15632",
    "url": "https://www.semanticscholar.org/paper/5f9ebcddd3981b1b7f3300353d1e684d9e34dcdc",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2103.15632",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks are widely used as a model for classification in a large variety of tasks. Typically, a learnable transformation (i.e., the classifier) is placed at the end of such models returning a value for each class used for classification. This transformation plays an important role in determining how the generated features change during the learning process. In this work, we argue that this transformation not only can be fixed (i.e., set as nontrainable) with no loss of accuracy and with a reduction in memory usage, but it can also be used to learn stationary and maximally separated embeddings. We show that the stationarity of the embedding and its maximal separated representation can be theoretically justified by setting the weights of the fixed classifier to values taken from the coordinate vertices of the three regular polytopes available in <inline-formula> <tex-math notation=\"LaTeX\">$\\mathbb {R}^{d}$ </tex-math></inline-formula>, namely, the <inline-formula> <tex-math notation=\"LaTeX\">$d$ </tex-math></inline-formula>-Simplex, the <inline-formula> <tex-math notation=\"LaTeX\">$d$ </tex-math></inline-formula>-Cube, and the <inline-formula> <tex-math notation=\"LaTeX\">$d$ </tex-math></inline-formula>-Orthoplex. These regular polytopes have the maximal amount of symmetry that can be exploited to generate stationary features angularly centered around their corresponding fixed weights. Our approach improves and broadens the concept of a fixed classifier, recently proposed by Hoffer <italic>et al.</italic>, to a larger class of fixed classifier models. Experimental results confirm the theoretical analysis, the generalization capability, the faster convergence, and the improved performance of the proposed method. Code will be publicly available.",
    "citationCount": 28,
    "referenceCount": 74
}