{
    "paperId": "5fa35cf58719b97c70bcf4a725f11e4799e5c0a8",
    "title": "Automatic View Generation with Deep Learning and Reinforcement Learning",
    "year": 2020,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Haitao Yuan",
        "Guoliang Li",
        "Ling Feng",
        "Ji Sun",
        "Yue Han"
    ],
    "doi": "10.1109/ICDE48307.2020.00133",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5fa35cf58719b97c70bcf4a725f11e4799e5c0a8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Materializing views is an important method to reduce redundant computations in DBMS, especially for processing large scale analytical queries. However, many existing methods still need DBAs to manually generate materialized views, which are not scalable to a large number of database instances, especially on the cloud database. To address this problem, we propose an automatic view generation method which judiciously selects \"highly beneficial\" subqueries to generate materialized views. However, there are two challenges. (1) How to estimate the benefit of using a materialized view for a queryƒ (2) How to select optimal subqueries to generate materialized viewsƒ To address the first challenge, we propose a neural network based method to estimate the benefit of using a materialized view to answer a query. In particular, we extract significant features from different perspectives and design effective encoding models to transform these features into hidden representations. To address the second challenge, we model this problem to an ILP (Integer Linear Programming) problem, which aims to maximize the utility by selecting optimal subqueries to materialize. We design an iterative optimization method to select subqueries to materialize. However, this method cannot guarantee the convergence of the solution. To address this issue, we model the iterative optimization process as an MDP (Markov Decision Process) and use the deep reinforcement learning model to solve the problem. Extensive experiments show that our method outperforms existing solutions by 28.4%, 8.8% and 31.7% on three real-world datasets.",
    "citationCount": 68,
    "referenceCount": 46
}