{
    "paperId": "5fe7e7b117c572722d89e6f66e44596111bb701f",
    "title": "ELAKT: Enhancing Locality for Attentive Knowledge Tracing",
    "year": 2024,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Yanjun Pu",
        "Fang Liu",
        "Rongye Shi",
        "Haitao Yuan",
        "Ruibo Chen",
        "Tianhao Peng",
        "Wenjun Wu"
    ],
    "doi": "10.1145/3652601",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5fe7e7b117c572722d89e6f66e44596111bb701f",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3652601",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Knowledge tracing models based on deep learning can achieve impressive predictive performance by leveraging attention mechanisms. However, there still exist two challenges in attentive knowledge tracing (AKT): First, the mechanism of classical models of AKT demonstrates relatively low attention when processing exercise sequences with shifting knowledge concepts (KC), making it difficult to capture the comprehensive state of knowledge across sequences. Second, classical models do not consider stochastic behaviors, which negatively affects models of AKT in terms of capturing anomalous knowledge states. This article proposes a model of AKT, called Enhancing Locality for Attentive Knowledge Tracing (ELAKT), that is a variant of the deep KT model. The proposed model leverages the encoder module of the transformer to aggregate knowledge embedding generated by both exercises and responses over all timesteps. In addition, it uses causal convolutions to aggregate and smooth the states of local knowledge. The ELAKT model uses the states of comprehensive KCs to introduce a prediction correction module to forecast the future responses of students to deal with noise caused by stochastic behaviors. The results of experiments demonstrated that the ELAKT model consistently outperforms state-of-the-art baseline KT models.",
    "citationCount": 10,
    "referenceCount": 48
}