{
    "paperId": "5fe86f05d8f723ed957a5b3c46d8e4831eacda25",
    "title": "The LDBC Financial Benchmark: Transaction Workload",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Shipeng Qi",
        "Bing Tong",
        "Jiatao Hu",
        "Heng Lin",
        "Yue Pang",
        "Wei Yuan",
        "Songlin Lyu",
        "Zhihui Guo",
        "Ke Huang",
        "Xujin Ba",
        "Qiang Yin",
        "Youren Shen",
        "Yan-min Zhou",
        "Tao Lv",
        "Jia Li",
        "Lei Zou",
        "Yongwei Wu",
        "Gábor Szárnyas",
        "Xiaowei Zhu",
        "Wenguang Chen",
        "Chuntao Hong"
    ],
    "doi": "10.14778/3746405.3746424",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5fe86f05d8f723ed957a5b3c46d8e4831eacda25",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph databases play a pivotal role in the FinTech industry. However, existing graph benchmarks fail to capture the unique characteristics of financial datasets and workloads, rendering them inadequate for evaluating graph databases in financial scenarios. This paper presents the LDBC Financial Benchmark (FinBench) Transaction Workload, a novel benchmark that adopts a choke point-driven design methodology, emphasizing performance bottlenecks, and incorporates distinct features such as dataset skewness, edge multiplicity, temporal window filtering, recursive path filtering, read-write query patterns, and truncation on hub vertices. Key contributions include a scalable data generator that synthesizes datasets with financial-specific features, a parameter generator that leverages bucketed data statistics for runtime consistency across queries, and a scalable benchmark driver that biases query execution by time windows. Experimental evaluations on graph databases demonstrate the benchmark's capability to reveal novel choke points and provide insights into system performance in financial scenarios.",
    "citationCount": 0,
    "referenceCount": 51
}