{
    "paperId": "5ff091aec8c8f6383d5c20f954a736ff409ca21a",
    "title": "Control method for the ship track and speed in curved channels",
    "year": 2024,
    "venue": "Brodogradnja",
    "authors": [
        "He Yanru",
        "Xingya Zhao",
        "Huang Liwen",
        "Luping Xu",
        "Jinlai Liu"
    ],
    "doi": "10.21278/brod75307",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/5ff091aec8c8f6383d5c20f954a736ff409ca21a",
    "isOpenAccess": true,
    "openAccessPdf": "https://brodogradnja.fsb.hr/wp-content/uploads/sites/25/2024/07/No3_7.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to natural and external influences in curved channels, ships frequently require adjustments in course and speed, posing challenges for existing control methods. Particularly lacking are speed control methods suitable for curved channel navigation. This study initially developed a three-degree-of-freedom MMG model incorporating external interference. It introduced an OP-PID heading controller merging optimal control strategies with traditional PID, adaptable to both external conditions and ship speed, validated through heading control simulations. The study analysed the ship's speed change process, deriving a mathematical expression for advance distance, and proposed a dichotomy-based speed control method to determine speed change points, addressing differential equations with unknown integrands. To mitigate uncertainty errors like parameter inaccuracies in ship maneuvering models and dynamic environmental disturbances, the study proposed a comprehensive control approach. This approach integrates model predictive control, feedback compensation, segment identification, and an enhanced line-of-sight (LOS) guidance method alongside the OP-PID course controller and dichotomy-based speed control. Simulation experiments in the Dongboliao Channel compared the proposed and existing methods. Results demonstrate the proposed method's capability to handle frequent course and speed adjustments effectively, even under model errors and external interference, showcasing superior track deviation and course control accuracy over existing methods.",
    "citationCount": 5,
    "referenceCount": 23
}