{
    "paperId": "6063e3a657af9efd09f13df1e146f0b5fd03771c",
    "title": "TianMen: a DPU-based storage network offloading structure for disaggregated datacenters",
    "year": 2024,
    "venue": "ACM Symposium on Cloud Computing",
    "authors": [
        "Weiyue Zhao",
        "Jingya Wu",
        "Wenyan Lu",
        "Xiaowei Li",
        "Guihai Yan"
    ],
    "doi": "10.1145/3698038.3698528",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6063e3a657af9efd09f13df1e146f0b5fd03771c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In modern disaggregated datacenters, the storage network which interconnects the compute and memory pools becomes the performance bottleneck. The high-end RDMA devices cannot meet the complex requirements of storage networks, due to the limited RDMA semantics and throughput. Existing solutions essentially follow the monolithic design, so they suffer from underutilized resources and high scaling costs. In this paper, we design TianMen, which offloads the storage network by extending RDMA semantics and customizing communication hardware structure. Specifically, we use DPU as the infrastructure, leveraging the rich storage and compute resources. TianMen enables fully disaggregated storage system that bypasses the server-side CPU, and supports elastic resource pools. Experimental results show that, compared with state-of-the-art solutions: 1) Tian-Men achieves 1 RTT for GET/PUT operations and up to 6× access acceleration; 2) TianMen provides CPU bypass storage network management, including 3.2× speedup of metadata consistency management, per-request load balancing, and 10s microsecond-level fault recovery latency; 3) TianMen saturates the communication bandwidth when processing small payload, increasing the bandwidth utilization by 34.2%. And TianMen achieves 2.27× throughput compared to the commercial RNICs.",
    "citationCount": 3,
    "referenceCount": 31
}