{
    "paperId": "606b284045e1ad2615839bb2d4fc175e4c97e00e",
    "title": "Anomalous vehicle recognition in smart cities using persistent bloom filter: Memory efficient and intelligent monitoring",
    "year": 2023,
    "venue": "Transactions on Emerging Telecommunications Technologies",
    "authors": [
        "Mandeep Kumar",
        "Amritpal Singh"
    ],
    "doi": "10.1002/ett.4896",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/606b284045e1ad2615839bb2d4fc175e4c97e00e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Globally, there is a rapid and significant change in the distribution of the urban population. Concerning which there is an increase in traffic rule violations in smart cities, resulting in traffic congestion and accidents. Anomalous vehicle recognition in smart cities is a critical issue that demands prompt and real‐time responsive solutions to address such situations. This article proposes an effective technique utilizing a persistent bloom filter to store and retrieve vehicle data, to improve road safety in urban locations. The technique employs distinct bloom filters to store vehicle data based on the hour, day, month, and year, which enables effective temporal membership queries on vast data. The proposed approach of anomalous vehicle recognition in smart cities using a persistent bloom filter is a memory‐efficient and intelligent monitoring technique. According to experimental analysis on large datasets such as “Montgomery County 911 Calls\", “EMS and Fire Calls\", “Seattle Fire Dept: 911\", and “Traffic Violations in Montgomery County\", the approach has the potential to boost query efficiency by up to 80% in comparison to conventional methods, in addition to decreasing storage space demands by up to 60%. The proposed approach has the potential to bridge the gap between research and practice in the field of urban safety and to enhance road safety while considering the dynamic changes in the road network. Employing traditional approaches to detect violations and monitor real‐time changes in a vast dataset of vehicles can be a laborious undertaking. The proposed technique provides a reliable and efficient approach to handling big data and improving traffic safety in smart cities.",
    "citationCount": 0,
    "referenceCount": 22
}