{
    "paperId": "608103904129bf4e921cea63c6f27180ef38e2d7",
    "title": "Enhanced precipitation prediction through the integration of gauge observations with satellite-based precipitation prediction models utilizing the Bayesian model averaging (BMA) technique in Kelantan, Malaysia",
    "year": 2025,
    "venue": "Asia-Pacific Remote Sensing",
    "authors": [
        "Husniyah Binti Mahmud",
        "Takahiro Osawa"
    ],
    "doi": "10.1117/12.3038111",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/608103904129bf4e921cea63c6f27180ef38e2d7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study aimed to merge monthly precipitation from remote sensing products and rain gauge observations to provide high-quality long-term historical precipitation data to support climate change studies. In this study, two satellite precipitation products, the TRMM 3B43V7 and GPM-3IMERGM Final Level 3 precipitation analysis, were used as input datasets. This study used Autoregressive Integrated Moving Average (ARIMA) and Long Short-Term Memory (LSTM) prediction models to train a monthly satellite precipitation dataset from 1998 to 2018 and predict precipitation from 2019 to 2023. The Bayesian Model Averaging (BMA) method was employed to combine the modeled predicted precipitation dataset with 28 rain gauge data in Kelantan, Malaysia to consider each input impact and enhance the precipitation prediction. The BMA weights were assigned to three models: model_0 with the input variable ARIMA and rain gauge, model_1 with LSTM and rain gauge input, and model_2 with ARIMA, LSTM, and rain gauge as input variables. After assigning weights to each model, new ensemble datasets were calculated using the weight sum method and averaged to obtain the ensemble average model. The performance of the merged precipitation products was evaluated using RMSE, R2, and NSE. The ensemble using the weighted average of all precipitation prediction models demonstrated an increase in R2 to 18.70% and a reduction in RMSE of 3.56%. Another significant finding is that increasing the input variable does not enhance the accuracy of rainfall prediction, meanwhile by using ensemble averaging the gap between merged precipitation products and rain gauge data able to be reduced.",
    "citationCount": 0,
    "referenceCount": 19
}