{
    "paperId": "60a2996af2e755cfcaf6733cf238d11281d3ef07",
    "title": "LPR: learning-based page replacement scheme for scientific applications",
    "year": 2022,
    "venue": "Middleware Industry",
    "authors": [
        "Hwajung Kim",
        "Heon-Yeong Yeom"
    ],
    "doi": "10.1145/3564695.3564777",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/60a2996af2e755cfcaf6733cf238d11281d3ef07",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advances in machine learning techniques open up new opportunities for solving problems in other domains. One of these problems, the page replacement system, attempts to use machine learning techniques since they have a significant impact on application performance. Specifically, scientific applications show certain data access patterns, such as iterative memory access through loops or linked lists, while performing arithmetic operations. For such applications, providing self-tunable page replacement systems can improve application performance. In this paper, we present a Learning-based Page Replacement (LPR) scheme for scientific applications. We propose a model that learns the memory reference patterns of a given application and determines the best-fit page replacement policy online. Using two least/most-recently used (LRU/MRU)-based replacement policies, LPR gives a reward or penalty to each policy according to its previous decisions. LPR evolves its own page replacement policy that can minimize cumulative regrets for each decision. Our scheme provides efficient memory management without explicitly detecting application-specific memory access patterns through self-learning. The experimental results show that our scheme properly detects the changes in memory access patterns and handles page replacement online using the best-fit policy with little overhead.",
    "citationCount": 2,
    "referenceCount": 28
}