{
    "paperId": "60a98b63ab2d6a4cbb966c3d391911e37e249259",
    "title": "A Smart Robotic Walker With Intelligent Close-Proximity Interaction Capabilities for Elderly Mobility Safety",
    "year": 2020,
    "venue": "Frontiers in Neurorobotics",
    "authors": [
        "Xiaoyang Zhao",
        "Zhi Zhu",
        "Mingshan Liu",
        "Chongyu Zhao",
        "Yafei Zhao",
        "Jia Pan",
        "Zheng Wang",
        "Chuan Wu"
    ],
    "doi": "10.3389/fnbot.2020.575889",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/60a98b63ab2d6a4cbb966c3d391911e37e249259",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fnbot.2020.575889/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The elderly population has rapidly increased in past years, bringing huge demands for elderly serving devices, especially for those with mobility impairment. Present assistant walkers designed for elderly users are primitive with limited user interactivity and intelligence. We propose a novel smart robotic walker that targets a convenient-to-use indoor walking aid for the elderly. The walker supports multiple modes of interactions through voice, gait or haptic touch, and allows intelligent control via learning-based methods to achieve mobility safety. Our design enables a flexible, initiative and reliable walker due to the following: (1) we take a hybrid approach by combining the conventional mobile robotic platform with the existing rollator design, to achieve a novel robotic system that fulfills expected functionalities; (2) our walker tracks users in front by detecting lower limb gait, while providing close-proximity walking safety support; (3) our walker can detect human intentions and predict emergency events, e.g., falling, by monitoring force pressure on a specially designed soft-robotic interface on the handle; (4) our walker performs reinforcement learning-based sound source localization to locate and navigate to the user based on his/her voice signals. Experiment results demonstrate the sturdy mechanical structure, the reliability of multiple novel interactions, and the efficiency of the intelligent control algorithms implemented. The demonstration video is available at: https://sites.google.com/view/smart-walker-hku.",
    "citationCount": 45,
    "referenceCount": 40
}