{
    "paperId": "60f4350d44cba05d1e9adf990bda69257156473f",
    "title": "Flame: A Self-Adaptive Auto-Labeling System for Heterogeneous Mobile Processors",
    "year": 2020,
    "venue": "IFIP International Information Security Conference",
    "authors": [
        "Jie Liu",
        "Jiawen Liu",
        "Zhen Xie",
        "Dong Li"
    ],
    "doi": "10.1145/3453142.3493611",
    "arxivId": "2003.01762",
    "url": "https://www.semanticscholar.org/paper/60f4350d44cba05d1e9adf990bda69257156473f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "How to accurately and efficiently label data on a mobile device is critical for the success of training machine learning models on mobile devices. Auto-labeling data on mobile devices is challenging, because data is incrementally generated and there is a possibility of having unknown labels among new coming data. Furthermore, the rich hardware heterogeneity on mobile devices creates challenges on efficiently executing the auto-labeling workload. In this paper, we introduce Flame, an auto-labeling system that can label dynamically generated data with unknown labels. Flame includes an execution engine that efficiently schedules and executes auto-labeling workloads on heterogeneous mobile processors. Evaluating Flame with six datasets on two mobile devices, we demonstrate that the labeling accuracy of Flame is 11.8%, 16.1%, 18.5%, and 25.2% higher than a state-of-the-art labeling method, transfer learning, semi-supervised learning, and boosting methods respectively. Flame is also energy efficient, it consumes only 328.65mJ and 414.84mJ when labeling 500 data instances on Samsung S9 and Google Pixel2 respectively. Furthermore, running Flame on mobile devices only brings about 0.75 ms additional frame latency which is imperceivable by the users.",
    "citationCount": 5,
    "referenceCount": 85
}