{
    "paperId": "61225addf5d7c762cf68a14444ffb328ebfc6f6d",
    "title": "Refined ADME Profiles for ATC Drug Classes",
    "year": 2025,
    "venue": "Pharmaceutics",
    "authors": [
        "Luca Menestrina",
        "Raquel Parrondo-Pizarro",
        "Ismael Gómez",
        "Ricard García-Serna",
        "Scott Boyer",
        "Jordi Mestres"
    ],
    "doi": "10.3390/pharmaceutics17030308",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61225addf5d7c762cf68a14444ffb328ebfc6f6d",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/pharmaceutics17030308",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Modern generative chemistry initiatives aim to produce potent and selective novel synthetically feasible molecules with suitable pharmacokinetic properties. General ranges of physicochemical properties relevant for the absorption, distribution, metabolism, and excretion (ADME) of drugs have been used for decades. However, the therapeutic indication, dosing route, and pharmacodynamic response of the individual drug discovery program may ultimately define a distinct desired property profile. Methods: A methodological pipeline to build and validate machine learning (ML) models on physicochemical and ADME properties of small molecules is introduced. Results: The analysis of publicly available data on several ADME properties presented in this work reveals significant differences in the property value distributions across the various levels of the anatomical, therapeutic, and chemical (ATC) drug classification. For most properties, the predicted data distributions agree well with the corresponding distributions derived from experimental data across fourteen drug classes. Conclusions: The refined ADME profiles for ATC drug classes should be useful to guide the de novo generation of advanced lead structures directed toward specific therapeutic indications.",
    "citationCount": 2,
    "referenceCount": 102
}