{
    "paperId": "61374a9fb6566a155d65ae679b0e9a760d4938b3",
    "title": "Recent progress in machine learning approaches for predicting carcinogenicity in drug development",
    "year": 2024,
    "venue": "Expert Opinion on Drug Metabolism & Toxicology",
    "authors": [
        "N. Le",
        "Thi-Xuan Tran",
        "Phung-Anh Nguyen",
        "Trang-Thi Ho",
        "Van-Nui Nguyen"
    ],
    "doi": "10.1080/17425255.2024.2356162",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61374a9fb6566a155d65ae679b0e9a760d4938b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Introduction This review explores the transformative impact of machine learning (ML) on carcinogenicity prediction within drug development. It discusses the historical context and recent advancements, emphasizing the significance of ML methodologies in overcoming challenges related to data interpretation, ethical considerations, and regulatory acceptance. Areas covered The review comprehensively examines the integration of ML, deep learning, and diverse artificial intelligence (AI) approaches in various aspects of drug development safety assessments. It explores applications ranging from early-phase compound screening to clinical trial optimization, highlighting the versatility of ML in enhancing predictive accuracy and efficiency. Expert opinion Through the analysis of traditional approaches such as in vivo rodent bioassays and in vitro assays, the review underscores the limitations and resource intensity associated with these methods. It provides expert insights into how ML offers innovative solutions to address these challenges, revolutionizing safety assessments in drug development.",
    "citationCount": 8,
    "referenceCount": 62
}