{
    "paperId": "61397e03157f500c4f80dcf972692bb10b4ac4a7",
    "title": "Small Agricultural Phenotype Robot and Its Navigation and Obstacle Avoidance in Parallel Walls",
    "year": 2020,
    "venue": "International Conference on Crowd Science and Engineering",
    "authors": [
        "Li Qin",
        "Ci Zhang",
        "Bo-Xuan Fang",
        "Tian Wu",
        "Chong-Zhi Shong"
    ],
    "doi": "10.1109/ICCSE49874.2020.9201679",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61397e03157f500c4f80dcf972692bb10b4ac4a7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of robotics, computer vision and artificial intelligence, the study of Plant phenotyping has entered a stage of rapid growth. For robots can be used for a large-scale, automatic and sustainable phenotype collection and data processing, it has also been followed closely by more and more research institutions and international seed giants, but currently the more mature phenotype robots are huge in size and expensive in configuration. Although their accuracy are high, but the popularity are poor, so it is difficult to popularize on a large scale, which is not conducive to collect plant phenotype data in a wider space and for the more plant varieties. On the other side, the small phenotype robots have low cost, simple operation, and are more suitable for large-scale promotion. The current research on plant phenotype small robots is mainly based on small wheeled robots. The robot is equipped with visual and optical sensors for collecting plant information, and uses machine vision and various sensors to achieve the robot's movement, positioning and obstacle avoidance. This paper uses the small wheeled mobile robot to simulate the navigation and obstacle avoidance of the phenotype collecting robot in parallel walls, and its effectiveness is proved by simulation experiment and real machine test.",
    "citationCount": 1,
    "referenceCount": 35
}