{
    "paperId": "615740cbdbe92ab3898f78aeadc0336b2fc0efa3",
    "title": "Self-Supervised Penalty-Based Learning for Robust Constrained Optimization",
    "year": 2025,
    "venue": "Integration of AI and OR Techniques in Constraint Programming",
    "authors": [
        "Wyame Benslimane",
        "Paul Grigas"
    ],
    "doi": "10.48550/arXiv.2503.05175",
    "arxivId": "2503.05175",
    "url": "https://www.semanticscholar.org/paper/615740cbdbe92ab3898f78aeadc0336b2fc0efa3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose a new methodology for parameterized constrained robust optimization, an important class of optimization problems under uncertainty, based on learning with a self-supervised penalty-based loss function. Whereas supervised learning requires pre-solved instances for training, our approach leverages a custom loss function derived from the exact penalty method in optimization to learn an approximation, typically defined by a neural network model, of the parameterized optimal solution mapping. Additionally, we adapt our approach to robust constrained combinatorial optimization problems by incorporating a surrogate linear cost over mixed integer domains, and a smooth approximations thereof, into the final layer of the network architecture. We perform computational experiments to test our approach on three different applications: multidimensional knapsack with continuous variables, combinatorial multidimensional knapsack with discrete variables, and an inventory management problem. Our results demonstrate that our self-supervised approach is able to effectively learn neural network approximations whose inference time is significantly smaller than the computation time of traditional solvers for this class of robust optimization problems. Furthermore, our results demonstrate that by varying the penalty parameter we are able to effectively balance the trade-off between sub-optimality and robust feasibility of the obtained solutions.",
    "citationCount": 0,
    "referenceCount": 26
}