{
    "paperId": "617dac350cbb1cb8e1c7eb1266c69149e3c10b66",
    "title": "The Genomic Variation and Differentially Expressed Genes on the 6P Chromosomes in Wheat–Agropyron cristatum Addition Lines 5113 and II-30-5 Confer Different Desirable Traits",
    "year": 2023,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "Wenjing Yang",
        "Haiming Han",
        "B. Guo",
        "Kai Qi",
        "Jinpeng Zhang",
        "Shenghui Zhou",
        "Xin-ming Yang",
        "Xiuquan Li",
        "Yuqing Lu",
        "Weihua Liu",
        "Xu Liu",
        "Lihui Li"
    ],
    "doi": "10.3390/ijms24087056",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/617dac350cbb1cb8e1c7eb1266c69149e3c10b66",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1422-0067/24/8/7056/pdf?version=1681205644",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Wild relatives of wheat are essential gene pools for broadening the genetic basis of wheat. Chromosome rearrangements and genomic variation in alien chromosomes are widespread. Knowledge of the genetic variation between alien homologous chromosomes is valuable for discovering and utilizing alien genes. In this study, we found that 5113 and II-30-5, two wheat–A. cristatum 6P addition lines, exhibited considerable differences in heading date, grain number per spike, and grain weight. Genome resequencing and transcriptome analysis revealed significant differences in the 6P chromosomes of the two addition lines, including 143,511 single-nucleotide polymorphisms, 62,103 insertion/deletion polymorphisms, and 757 differentially expressed genes. Intriguingly, genomic variations were mainly distributed in the middle of the chromosome arms and the proximal centromere region. GO and KEGG analyses of the variant genes and differentially expressed genes showed the enrichment of genes involved in the circadian rhythm, carbon metabolism, carbon fixation, and lipid metabolism, suggesting that the differential genes on the 6P chromosome are closely related to the phenotypic differences. For example, the photosynthesis-related genes PsbA, PsbT, and YCF48 were upregulated in II-30-5 compared with 5113. ACS and FabG are related to carbon fixation and fatty acid biosynthesis, respectively, and both carried modification variations and were upregulated in 5113 relative to II-30-5. Therefore, this study provides important guidance for cloning desirable genes from alien homologous chromosomes and for their effective utilization in wheat improvement.",
    "citationCount": 2,
    "referenceCount": 80
}