{
    "paperId": "6195511abd8076da27caaac34ec7bba9d07aa6b3",
    "title": "Where Do Queries Come From?",
    "year": 2022,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Marwah Alaofi",
        "L. Gallagher",
        "Dana Mckay",
        "L. L. Saling",
        "M. Sanderson",
        "Falk Scholer",
        "Damiano Spina",
        "Ryen W. White"
    ],
    "doi": "10.1145/3477495.3531711",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6195511abd8076da27caaac34ec7bba9d07aa6b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Where do queries -- the words searchers type into a search box -- come from? The Information Retrieval community understands the performance of queries and search engines extensively, and has recently begun to examine the impact of query variation, showing that different queries for the same information need produce different results. In an information environment where bad actors try to nudge searchers toward misinformation, this is worrisome. The source of query variation -- searcher characteristics, contextual or linguistic prompts, cognitive biases, or even the influence of external parties -- while studied in a piecemeal fashion by other research communities has not been studied by ours. In this paper we draw on a variety of literatures (including information seeking, psychology, and misinformation), and report some small experiments to describe what is known about where queries come from, and demonstrate a clear literature gap around the source of query variations in IR. We chart a way forward for IR to research, document and understand this important question, with a view to creating search engines that provide more consistent, accurate and relevant search results regardless of the searcher's framing of the query.",
    "citationCount": 17,
    "referenceCount": 119
}