{
    "paperId": "61a912322b70be5b29920a8f9dde47254e364a5a",
    "title": "Vector Database Management Techniques and Systems",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "J. Pan",
        "Jianguo Wang",
        "Guoliang Li"
    ],
    "doi": "10.1145/3626246.3654691",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61a912322b70be5b29920a8f9dde47254e364a5a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Feature vectors are now mission-critical for many applications, including retrieval-based large language models (LLMs). Traditional database management systems are not equipped to deal with the unique characteristics of feature vectors, such as the vague notion of semantic similarity, large size of vectors, expensive similarity comparisons, lack of indexable structure, and difficulty of answering \"hybrid\" queries that combine structured attributes with feature vectors. A number of vector database management systems (VDBMSs) have been developed to address these challenges, combining novel techniques for query processing, storage and indexing, and query optimization and execution and culminating in a spectrum of performance and accuracy characteristics and capabilities. In this tutorial, we review the existing vector database management techniques and systems. For query processing, we review similarity score design and selection, vector query types, and vector query interfaces. For storage and indexing, we review various indexes and discuss compression as well as disk-resident indexes. For query optimization and execution, we review hybrid query processing, hardware acceleration, and distibuted search. We then review existing systems, search engines and libraries, and benchmarks. Finally, we present research challenges and open problems.",
    "citationCount": 38,
    "referenceCount": 29
}