{
    "paperId": "61c54e47d6bfc6978567375fe08f084d01ced430",
    "title": "Personalized Decision Supports based on Theory of Mind Modeling and Explainable Reinforcement Learning",
    "year": 2023,
    "venue": "IEEE International Conference on Systems, Man and Cybernetics",
    "authors": [
        "Huao Li",
        "Yao Fan",
        "Keyang Zheng",
        "Michael Lewis",
        "Katia P. Sycara"
    ],
    "doi": "10.1109/SMC53992.2023.10394414",
    "arxivId": "2312.08397",
    "url": "https://www.semanticscholar.org/paper/61c54e47d6bfc6978567375fe08f084d01ced430",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we propose a novel personalized decision support system that combines Theory of Mind (ToM) modeling and explainable Reinforcement Learning (XRL) to provide effective and interpretable interventions. Our method leverages DRL to provide expert action recommendations while incorporating ToM modeling to understand users' mental states and predict their future actions, enabling appropriate timing for intervention. To explain interventions, we use counterfactual explanations based on RL's feature importance and users' ToM model structure. Our proposed system generates accurate and personalized interventions that are easily interpretable by end-users. We demonstrate the effectiveness of our approach through a series of crowd-sourcing experiments in a simulated team decision-making task, where our system outperforms control baselines in terms of task performance. Our proposed approach is agnostic to task environment and RL model structure, therefore has the potential to be generalized to a wide range of applications.",
    "citationCount": 0,
    "referenceCount": 34
}