{
    "paperId": "61dbb19b37e24f2018940c2ab2f9d3c8afe25ec3",
    "title": "EGA-V2: An End-to-end Generative Framework for Industrial Advertising",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zuowu Zheng",
        "Ze Wang",
        "Fan Yang",
        "Jiangke Fan",
        "Teng Zhang",
        "Yongkang Wang",
        "Xingxing Wang"
    ],
    "doi": "10.48550/arXiv.2505.17549",
    "arxivId": "2505.17549",
    "url": "https://www.semanticscholar.org/paper/61dbb19b37e24f2018940c2ab2f9d3c8afe25ec3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional online industrial advertising systems suffer from the limitations of multi-stage cascaded architectures, which often discard high-potential candidates prematurely and distribute decision logic across disconnected modules. While recent generative recommendation approaches provide end-to-end solutions, they fail to address critical advertising requirements of key components for real-world deployment, such as explicit bidding, creative selection, ad allocation, and payment computation. To bridge this gap, we introduce End-to-End Generative Advertising (EGA-V2), the first unified framework that holistically models user interests, point-of-interest (POI) and creative generation, ad allocation, and payment optimization within a single generative model. Our approach employs hierarchical tokenization and multi-token prediction to jointly generate POI recommendations and ad creatives, while a permutation-aware reward model and token-level bidding strategy ensure alignment with both user experiences and advertiser objectives. Additionally, we decouple allocation from payment using a differentiable ex-post regret minimization mechanism, guaranteeing approximate incentive compatibility at the POI level. Through extensive offline evaluations we demonstrate that EGA-V2 significantly outperforms traditional cascaded systems in both performance and practicality. Our results highlight its potential as a pioneering fully generative advertising solution, paving the way for next-generation industrial ad systems.",
    "citationCount": 3,
    "referenceCount": 42
}