{
    "paperId": "61eb14c93a9d8520d9eb5763cdae51f4773ea9a2",
    "title": "Clustering at the Disposal of Industry 4.0: Automatic Extraction of Plant Behaviors",
    "year": 2022,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Dylan Molinié",
        "K. Madani",
        "V. Amarger"
    ],
    "doi": "10.3390/s22082939",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61eb14c93a9d8520d9eb5763cdae51f4773ea9a2",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/22/8/2939/pdf?version=1649754801",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For two centuries, the industrial sector has never stopped evolving. Since the dawn of the Fourth Industrial Revolution, commonly known as Industry 4.0, deep and accurate understandings of systems have become essential for real-time monitoring, prediction, and maintenance. In this paper, we propose a machine learning and data-driven methodology, based on data mining and clustering, for automatic identification and characterization of the different ways unknown systems can behave. It relies on the statistical property that a regular demeanor should be represented by many data with very close features; therefore, the most compact groups should be the regular behaviors. Based on the clusters, on the quantification of their intrinsic properties (size, span, density, neighborhood) and on the dynamic comparisons among each other, this methodology gave us some insight into the system’s demeanor, which can be valuable for the next steps of modeling and prediction stages. Applied to real Industry 4.0 data, this approach allowed us to extract some typical, real behaviors of the plant, while assuming no previous knowledge about the data. This methodology seems very promising, even though it is still in its infancy and that additional works will further develop it.",
    "citationCount": 4,
    "referenceCount": 77
}