{
    "paperId": "61f2964f50c285da206b7ce3cfabd037d347acf7",
    "title": "Assessing Explainable Recommendations from Knowledge Graph-based in an International Streaming Platform",
    "year": 2023,
    "venue": "Brazilian Symposium on Multimedia and the Web",
    "authors": [
        "Claudia Suarez Mariscal",
        "Bruno Santana Massena de Lima",
        "Renata Galante",
        "Weverton Cordeiro"
    ],
    "doi": "10.1145/3617023.3617052",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/61f2964f50c285da206b7ce3cfabd037d347acf7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Explainable recommendations can increase users’ confidence in the results provided by recommendation systems by providing justifications of why a certain item is recommended. In this way, the use of the Knowledge Graph (KG) guarantees an optimal organization of the data enabling one to trace the relationships between entities (users, recommended items, item attributes and features, and so on). Current proposals use different approaches such as embedding, connection, and propagation to deal with common problems that persist when generating recommendations, such as cold start or data lake. However, the complexity of recommendation models seems to increase when there is a large amount of data. In this work, we propose an analysis of the applicability of different frameworks based on knowledge graphs to obtain explanatory recommendations using a large dataset from an international streaming platform, with the idea of knowing the advantages and limitations of each approach to validate if complex models should really be used to obtain the best results. Through the experimentation of RippleNet, KGCN, KGAT, ECFKG, and DSKE, we focus on dataset structure, category-based, and refinement type of each framework. To conclude, we provide details on some general points of the evaluation of all frameworks using our dataset.",
    "citationCount": 1,
    "referenceCount": 23
}