{
    "paperId": "6202e73dae6a63aae9c0db15639958263ddfc7f6",
    "title": "Pan-genomic characterization and structural variant analysis reveal insights into spore development and species diversity in Ganoderma",
    "year": 2024,
    "venue": "Microbial Genomics",
    "authors": [
        "Hang Yu",
        "Shasha Wang",
        "Lina Wang",
        "Weixin Wu",
        "Wei Xu",
        "Shuisheng Wu",
        "Xiaoyan Li",
        "Wen Xu",
        "Zehao Huang",
        "Yu Lin",
        "Haifeng Wang"
    ],
    "doi": "10.1099/mgen.0.001328",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6202e73dae6a63aae9c0db15639958263ddfc7f6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Understanding the genomic diversity and functional implications of Ganoderma species is crucial for elucidating their evolutionary history and biotechnological potential. Here, we present the first pan-genomic analysis of Ganoderma spp., combining five newly sequenced genomes with ten publicly available genomes. Our comprehensive comparative study unveiled a rich genomic landscape, identifying core genes shared among all Ganoderma strains and species-specific gene sets. Additionally, we identified structural variants impacting the expression of key genes, including insights into the MSH4 gene involved in DNA repair and recombination processes, which exhibits a 440 bp insertion in the promoter region and a leucine-to-serine mutation in the gene body, potentially increasing spore production in the S3 strain. Overall, our study provides valuable insights into the genomic architecture and functional diversity of Ganoderma, paving the way for further research on its evolutionary dynamics, biotechnological applications and pharmaceutical potential.",
    "citationCount": 2,
    "referenceCount": 52
}