{
    "paperId": "6240bab1b1350a827bdefe92c6587161cf452624",
    "title": "SNC: A Framework for Verification and Generation of Spatial NLQ Corpora",
    "year": 2025,
    "venue": "International Symposium on Spatial and Temporal Databases",
    "authors": [
        "Weijia Yi",
        "Xieyang Wang",
        "Mengyi Liu",
        "Jianqiu Xu"
    ],
    "doi": "10.1145/3748777.3748780",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6240bab1b1350a827bdefe92c6587161cf452624",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spatial databases are garnering considerable attention due to their extensive applications in location-based services, urban planning, and intelligent transportation. However, natural language interfaces for spatial databases (NLIDBs) continue to encounter significant challenges, particularly in processing complex and diverse user queries. A high-quality natural language query (NLQ) corpus is essential to train robust NLIDB models. Existing corpora often suffer from a lack of diversity and syntactic accuracy, which restricts the generalization capabilities of NLIDBs. To address this issue, we propose a query detection and repair method tailored to spatial databases and construct a high-quality spatial NLQ corpus. This approach consists of (i) a verification module for spatial NLQ corpora (SNC-V), which leverages spatial entity and relation knowledge bases to identify and correct errors in NLQs, and (ii) a generation module for spatial NLQ corpora (SNC-G), which generates structured and diverse queries. Experimental results show that the SNC-V improves the conversion rate and accuracy of spatial NLIDB models, while the SNC-G achieves a query generation speed of 1,424 queries per second, a diversity score of 0.87, and an accuracy of 95.2%.",
    "citationCount": 0,
    "referenceCount": 29
}