{
    "paperId": "625b6af4a59162d52ac8b1d9505428bc0f270481",
    "title": "Path‐flow matching: Two‐sided matching and multiobjective evolutionary algorithm for traffic scheduling in cloud data* center network",
    "year": 2019,
    "venue": "Transactions on Emerging Telecommunications Technologies",
    "authors": [
        "Li-Zhuang Tan",
        "Wei Su",
        "Shuai Gao",
        "Jingying Miao",
        "Yuan Cheng",
        "Peng Cheng"
    ],
    "doi": "10.1002/ett.3809",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/625b6af4a59162d52ac8b1d9505428bc0f270481",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Improving the operational efficiency of data center has always been an important direction for the development of ICT. In this paper, we apply two‐sided matching decision‐making process in game theory to traffic scheduling problem in data center network. From the perspective of matching between flow and path, the traffic scheduling is properly arranged. We first propose and model the path‐flow matching problem, considering the preference ordering, then formulate the problem as a multiobjective optimization problem with the target to ensure the stability and satisfaction from the matching scheme, and design a preference‐based path‐flow ordering method Extended PIAS, and finally propose a lightweight scheduling algorithm LinkGame based on multiobjective evolutionary algorithm. Compared with the previous scheduling methods (ECMP, Hedera, and Fincher), experiment results demonstrate that LinkGame can simultaneously consider the stability and satisfaction of the matching results, with improved bandwidth utilization and flow completion time.",
    "citationCount": 4,
    "referenceCount": 53
}