{
    "paperId": "62cf15742fc531310311a2a50afab34e96b3819b",
    "title": "Technology-Enhanced Learning for User Security Awareness Using AI-based Naive RAG: A Design and Prototype",
    "year": 2025,
    "venue": "International Conference Advancement Data Science, E-learning and Information Systems",
    "authors": [
        "I. P. A. E. Pratama",
        "I. M. Widyantara",
        "Linawati",
        "Nyoman Gunantara",
        "Sinung Suakanto",
        "Eka Tresna Irawan"
    ],
    "doi": "10.1109/ICADEIS65852.2025.10933283",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/62cf15742fc531310311a2a50afab34e96b3819b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing use of Information Technology (IT) in all areas of life, followed by increasing cybersecurity threats on the user side, makes cybersecurity awareness among users an obligation that must be met. Several solutions currently available (guides, discussion forums, workshops) have not been able to provide good results and are lacking in terms of user engagement, adaptability, and optimizing available resources, so technology-based learning is needed, especially AI. This paper introduces the design and prototype of an AI-based learning system, especially with the Naive Retrieval-Augmented Generation (Naive RAG) method with three steps, including Retrieval, Augmented, and Generation. The system combines contextual user questions and answers with internal and domain knowledge systems to explain cybersecurity awareness to users dynamically and personally. The prototype that has been developed is then tested using the Black Box Testing method to evaluate functionality and usability. The test results show that the functionality of the system built has run well with a percentage of success of 100%, so it can be used as a technologybased learning medium for education and learning of user security awareness.",
    "citationCount": 0,
    "referenceCount": 36
}