{
    "paperId": "62e8ec0391e9e38de142969260ebcf7a4f9294d5",
    "title": "AlphaEvolve: A Learning Framework to Discover Novel Alphas in Quantitative Investment",
    "year": 2021,
    "venue": "SIGMOD Conference",
    "authors": [
        "Can Cui",
        "Wen Wang",
        "Meihui Zhang",
        "Gang Chen",
        "Zhaojing Luo",
        "B. Ooi"
    ],
    "doi": "10.1145/3448016.3457324",
    "arxivId": "2103.16196",
    "url": "https://www.semanticscholar.org/paper/62e8ec0391e9e38de142969260ebcf7a4f9294d5",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3448016.3457324",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Alphas are stock prediction models capturing trading signals in a stock market. A set of effective alphas can generate weakly correlated high returns to diversify the risk. Existing alphas can be categorized into two classes: Formulaic alphas are simple algebraic expressions of scalar features, and thus can generalize well and be mined into a weakly correlated set. Machine learning alphas are data-driven models over vector and matrix features. They are more predictive than formulaic alphas, but are too complex to mine into a weakly correlated set. In this paper, we introduce a new class of alphas to model scalar, vector, and matrix features which possess the strengths of these two existing classes. The new alphas predict returns with high accuracy and can be mined into a weakly correlated set. In addition, we propose a novel alpha mining framework based on AutoML, called AlphaEvolve, to generate the new alphas. To this end, we first propose operators for generating the new alphas and selectively injecting relational domain knowledge to model the relations between stocks. We then accelerate the alpha mining by proposing a pruning technique for redundant alphas. Experiments show that AlphaEvolve can evolve initial alphas into the new alphas with high returns and weak correlations.",
    "citationCount": 37,
    "referenceCount": 25
}