{
    "paperId": "62f2666ee99a9a8f6a98430eae012d3ef3068700",
    "title": "MultiFDF: Multi-Community Clustering for Fairness-Aware Recommendation",
    "year": 2023,
    "venue": "IEEE Transactions on Computational Social Systems",
    "authors": [
        "Bang Wang",
        "Shipeng Song",
        "Shenghao Liu",
        "Xianjun Deng"
    ],
    "doi": "10.1109/TCSS.2023.3280567",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/62f2666ee99a9a8f6a98430eae012d3ef3068700",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The fairness consideration has received increasing attention in artificial intelligence (AI), especially in the significant application, recommender system. One kind of fairness issue is to balance the exposure of popular items and less popular items. Existing works mainly compensate the less popular items when predicting their ratings. However, the compensation for the items may result in a loss of recommendation accuracy, as the compensated items may not match user’s preference. For this problem, we propose a multi-community clustering recommendation with fair decision fusion (MultiFDF) framework to compensate less popular items locally, which can reduce the negative impact on user’s preferred popular item. We first design an experiment and deliver a causal graph-based mathematical proof to demonstrate the feasibility of local compensation. It proves that there is a discrete tendency of ratings predicted by a recommendation algorithm and a recommendation algorithm gives a higher rating to the popular item than the less popular item. The MultiFDF consists of three parts, community exploration module, local recommendation module, and fair decision fusion module. The community exploration module outputs several communities for local recommendation module to generate local recommendation lists, respectively. The fair decision fusion module then computes the discrete ratings of items based on local recommendation lists and designs an edge reranking strategy based on their discrete ratings to obtain the final fair top- $N$ recommendation list. To verify the superiority of our proposed MultiFDF, we conduct experiments on three real world datasets and the results demonstrate that MultiFDF can improve fairness at the cost of lower accuracy than the state-of the-art algorithms.",
    "citationCount": 6,
    "referenceCount": 49
}