{
    "paperId": "6331fb540e5ad75193808c5c13d1afc1e79af323",
    "title": "Advancements in Machine Learning in Sensor Systems: Insights from Sensys-ML and TinyML Communities",
    "year": 2024,
    "venue": "2024 IEEE 3rd Workshop on Machine Learning on Edge in Sensor Systems (SenSys-ML)",
    "authors": [
        "Poonam Yadav"
    ],
    "doi": "10.1109/SenSys-ML62579.2024.00009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6331fb540e5ad75193808c5c13d1afc1e79af323",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The integration of machine learning (ML) algorithms with edge sensor systems has fundamentally transformed numerous industries. This convergence empowers real-time data processing, analysis, and decision-making at the network’s periphery. This paper investigates the latest advancements in this domain by examining two key communities: Sensys-ML and TinyML. While Sensys-ML concentrates on optimizing ML for sensor systems, TinyML prioritizes deploying ML models on resource-constrained devices. Through a critical analysis of these communities’ contributions and interactions, this work aims to provide a comprehensive overview of cutting-edge methodologies, persistent challenges, and promising future directions for ML at the edge within sensor systems. By tracing the trajectory of advancements in this field, we offer a critical reflection on the broader research landscape and its scope. Additionally, we identify emerging research areas as reflected in prominent forums and underscore persisting knowledge gaps that call for further investigation.",
    "citationCount": 0,
    "referenceCount": 83
}