{
    "paperId": "6390c33631021628b61a21a17aaa42f30f5b20bf",
    "title": "A Metaverse Platform for Air Pollution Analysis in Supporting Smart and Sustainable City Development",
    "year": 2024,
    "venue": "International Conference on Data Science and Advanced Analytics",
    "authors": [
        "Juan C. Armijos",
        "Garik Avagyan",
        "C. Leung",
        "Jasmine J. Tabuzo",
        "Aivee F. Teodocio"
    ],
    "doi": "10.1109/DSAA61799.2024.10722772",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6390c33631021628b61a21a17aaa42f30f5b20bf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In today's data-centric world, analyzing vast volumes of diverse and complex information has paved the way for uncovering valuable insights. These extensive datasets are often known as big data. Big data find application in various fields such as healthcare, gaming, financial markets, and business intelligence. Additionally, analyzing big data can contribute to enhancing environmental sustainability, as well as city planning and development. On the one hand, air pollution in urban areas is frequently identified as a major factor negatively affecting human health, with vehicle emissions being a significant contributor to poor air quality. On the other hand, increased greenspace and vegetation positively contribute to better air quality. In this paper, we present a data science and advanced analytics solution—specifically, a metaverse platform—to examine the relationship between urban factors and air quality. Our solution leverages data mining and visualization techniques in a metaverse platform to extract meaningful insights. Moreover, we analyze real traffic data from a mid-size Canadian city to guide our study. The findings from this data science research can inform practical strategies—such as promoting green infrastructure and implementing zoning policies—towards building and development of smart and sustainable cities.",
    "citationCount": 1,
    "referenceCount": 27
}