{
    "paperId": "63a253cb9594ef7da588b0f80529ef5e34654e28",
    "title": "Research of Optical Interconnection Technology in Datacenter Networks",
    "year": 2020,
    "venue": "Journal of Physics: Conference Series",
    "authors": [
        "Tianchun Hao"
    ],
    "doi": "10.1088/1742-6596/1710/1/012001",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/63a253cb9594ef7da588b0f80529ef5e34654e28",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1088/1742-6596/1710/1/012001",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, with rapid development of cloud computing, the business volume of datacenter has increased unprecedentedly and the development of datacenter is facing great challenges. At this point, more efficient interconnection schemes are needed to maintain the increasing demand for communication bandwidth. With its great bandwidth advantage, optical fiber provides low-loss and low-cost solutions for telecom networks. At the same time, compared with the electric interconnection based on copper wire, optical switching technology greatly improves the transmission rate of the communication network. In this paper, the interconnection structure of the datacenter network is studied. Aiming at the interconnection for different top-of-racks (ToR), the c-Through and Helios structures based on photoelectric hybrid technology are reported. Moreover, some structures based on all-optical interconnection such as Proteus, OSMOSIS and IRIS are mentioned. For the interconnection in ToR, arrayed waveguide grating (AWG) based passive optical interconnection and the passive optical couplers-based interconnection schemes are described. Meantime, the main principles, advantages and disadvantages of various structures are analyzed. Finally, the future development of optical interconnection applications is stated.",
    "citationCount": 3,
    "referenceCount": 18
}