{
    "paperId": "63b0adf5b42157f839acf472c3d0eb9c88ba1fc9",
    "title": "Limited predictive power of known resistance genes for phenotypic drug resistance in clinical Mycobacterium abscessus complex from Beijing in China",
    "year": 2025,
    "venue": "Antimicrobial Agents and Chemotherapy",
    "authors": [
        "Yue Hou",
        "Rui Pi",
        "J. Jia",
        "Zhaojun Wu",
        "F. Huo",
        "Yu Zhou",
        "Hui Jiang",
        "Howard E. Takiff",
        "Chendi Zhu",
        "Wei Wang",
        "Weimin Li"
    ],
    "doi": "10.1128/aac.01847-24",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/63b0adf5b42157f839acf472c3d0eb9c88ba1fc9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Mycobacterium abscessus complex (MABC) is an emerging pathogen with intrinsic multidrug resistance. Genomic sequencing technology has been widely applied to predict bacterial resistance in other bacteria, but the catalog of known resistance-determining genes to explain phenotypic resistance in the MABC is incomplete for many antibiotics. Eighty-one MABC strains were isolated from sputum samples of patients with pulmonary disease in the Beijing Chest Hospital. All isolates were tested for minimum inhibitory concentrations (MICs) to eight antibiotics and underwent whole-genome sequencing (WGS). Of the total 81 MABC isolates, six strains exhibited clarithromycin (CLM) resistance by day 3 in culture, but only one (16.7%, 1/6) contained a mutation in the rrl gene. All M. abscessus strains contained the erm (41)28T (100.0%, 49/49) polymorphism and exhibited CLM-induced resistance after 14 days in culture. Of the 61 imipenem-resistant strains, 12 (19.7%, 12/61) had mutations in the bla gene. Although there were four (4.9%) amikacin-resistant, nine (11.1%) linezolid-resistant, eight (9.9%) clofazimine-resistant, 23 (28.4%) bedaquiline-resistant, and 27 (33.3%) cefoxitin-resistant strains, no known mutations associated with resistance to these antibiotics were found. These results suggest that the explanatory power of known resistance genes for clinical MABC resistance is limited and that other unidentified genes or novel resistance mechanisms may be involved.",
    "citationCount": 0,
    "referenceCount": 42
}