{
    "paperId": "63ba27fd720990b925276cf155707db6715d50bf",
    "title": "Adversarial Deep Learning for Online Resource Allocation",
    "year": 2021,
    "venue": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems",
    "authors": [
        "Bingqian Du",
        "Zhiyi Huang",
        "Chuan Wu"
    ],
    "doi": "10.1145/3494526",
    "arxivId": "2111.10285",
    "url": "https://www.semanticscholar.org/paper/63ba27fd720990b925276cf155707db6715d50bf",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2111.10285",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online algorithms are an important branch in algorithm design. Designing online algorithms with a bounded competitive ratio (in terms of worst-case performance) can be hard and usually relies on problem-specific assumptions. Inspired by adversarial training from Generative Adversarial Net and the fact that the competitive ratio of an online algorithm is based on worst-case input, we adopt deep neural networks (NNs) to learn an online algorithm for a resource allocation and pricing problem from scratch, with the goal that the performance gap between offline optimum and the learned online algorithm can be minimized for worst-case input. Specifically, we leverage two NNs as the algorithm and the adversary, respectively, and let them play a zero sum game, with the adversary being responsible for generating worst-case input while the algorithm learns the best strategy based on the input provided by the adversary. To ensure better convergence of the algorithm network (to the desired online algorithm), we propose a novel per-round update method to handle sequential decision making to break complex dependency among different rounds so that update can be done for every possible action instead of only sampled actions. To the best of our knowledge, our work is the first using deep NNs to design an online algorithm from the perspective of worst-case performance guarantee. Empirical studies show that our updating methods ensure convergence to Nash equilibrium and the learned algorithm outperforms state-of-the-art online algorithms under various settings.",
    "citationCount": 10,
    "referenceCount": 46
}