{
    "paperId": "63d5d7b32a2fada23930ecc3aae9ef9ba750263e",
    "title": "Learning-augmented streaming codes for variable-size messages under partial burst losses",
    "year": 2023,
    "venue": "International Symposium on Information Theory",
    "authors": [
        "Michael Rudow",
        "K. V. Rashmi"
    ],
    "doi": "10.1109/ISIT54713.2023.10206559",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/63d5d7b32a2fada23930ecc3aae9ef9ba750263e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recovering bursts of lost packets in real-time is crucial to multimedia live-streaming applications’ quality-of-experience (QoE). Streaming codes optimally handle the unique aspects of loss recovery for live streaming, including (a) variable-size messages, (b) a real-time playback deadline, and (c) burst losses across multiple frames. However, existing models for streaming codes in this setting only apply to bursts that drop all data sent for each message. Yet in many real-world applications only some packets are lost for each message in what we call a \"partial burst.\" We introduce a new streaming model to accommodate partial bursts. We then design a building block to construct a streaming code given any choice of how much parity to allocate for each message. Next, we present a streaming code in an offline setting (i.e., where the sizes of future messages are known) by combining (a) the building block with (b) a linear program to set the number of parity symbols per message. We then design a streaming code in an online setting (i.e., without knowledge of the future) by combining (a) the building block with (b) a learning-augmented algorithm to set the number of parity symbols per message. The constructions are approximately rate-optimal under a natural condition on the nature of feedback.",
    "citationCount": 2,
    "referenceCount": 28
}