{
    "paperId": "63ee3cc9d718966c9c7b0c619e29b9ef95f181f9",
    "title": "Comprehensive Investigation Of Join Query Optimization Using Dqn (Deep Q-Network), Ddqn (Double Deep Q-Network), Genetic Algorithms And Hybrid Dqn-Ga And Ddqn –Ga",
    "year": 2024,
    "venue": "African Journal of Biomedical Research",
    "authors": [
        "Karthikeyan M P"
    ],
    "doi": "10.53555/ajbr.v27i4s.4185",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/63ee3cc9d718966c9c7b0c619e29b9ef95f181f9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Effective query optimization is essential for improving database management system performance. Using a variety of cutting-edge approaches, including Deep Q-Networks (DQN), Double Deep Q-Networks (DDQN), Genetic Algorithms (GA), and Hybrid DQN-GA and DDQN-GA, we present a thorough examination of join query optimization in this research article. In relational databases, join queries are frequently used to merge data from several tables. The issue of optimizing join queries to reduce response time and resource use is still difficult. The reinforcement learning-inspired DQN and DDQN algorithms offer a framework for teaching agents to make the best judgments possible in dynamic situations. In order to discover effective query execution techniques, we use the power of DQN and DDQN to formulate join query optimization as a Markov Decision Process (MDP). We also present genetic algorithms as a different strategy for searching the space of join query plans. In this study, we examine the query execution times and resource use of DQN, DDQN, GA, and hybrid DQN-GA and DDQN-GA approaches. The efficacy of each strategy is evaluated experimentally on a wide range of Join Order benchmark (JOB) datasets. Our findings show that as compared to conventional methods, hybrid DDQN-GA based techniques significantly enhance query optimization. In order to maximize the benefits of both algorithms, we also explore the pairing of DQN and GA. The hybrid DQN-GA technique outperforms individual algorithms in terms of Query Execution Time, Query Latency, Resource Utilization, Optimization Latency, and Join Query Performance; demonstrating greater performance in optimizing joins queries. Similarly, the hybrid DDQN-GA approach also presents promising results.",
    "citationCount": 0,
    "referenceCount": 26
}