{
    "paperId": "63ef90c5e022f58ee9843ee3caa0076470f42a48",
    "title": "Photocatalytic degradation of drugs and dyes using a maching learning approach",
    "year": 2024,
    "venue": "RSC Advances",
    "authors": [
        "G. Anandhi",
        "M. Iyapparaja"
    ],
    "doi": "10.1039/d4ra00711e",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/63ef90c5e022f58ee9843ee3caa0076470f42a48",
    "isOpenAccess": true,
    "openAccessPdf": "https://pubs.rsc.org/en/content/articlepdf/2024/ra/d4ra00711e",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The waste management industry uses an increasing number of mathematical prediction models to accurately forecast the behavior of organic pollutants during catalytic degradation. With the increasing quantity of waste generated, these models are critical for reinforcing the efficiency of wastewater treatment strategies. The application of machine-learning techniques in recent years has notably improved predictive models for waste management, which are essential for mitigating the impact of toxic commercial waste on global water supply. Organic contaminants, dyes, pesticides, surfactants, petroleum by-products, and prescription drugs pose risks to human health. Because traditional techniques face challenges in ensuring water quality, modern strategies are vital. Machine learning has emerged as a valuable tool for predicting the photocatalytic degradation of medicinal drugs and dyes, providing a promising avenue for addressing urgent demands in removing organic pollutants from wastewater. This research investigates the synergistic application of photocatalysis and machine learning for pollutant degradation, showcasing a sustainable solution with promising effects on environmental remediation and computational efficiency. This study contributes to green chemistry by providing a clever framework for addressing present-day water pollution challenges and achieving era-driven answers.",
    "citationCount": 20,
    "referenceCount": 141
}