{
    "paperId": "6406b7220ea0ba742fc53256d540b402df689cd5",
    "title": "Towards Sustainable Serverless Processing of Massive Graphs on the Computing Continuum",
    "year": 2023,
    "venue": "International Conference on Performance Engineering",
    "authors": [
        "Reza Farahani",
        "Dragi Kimovski",
        "S. Ristov",
        "A. Iosup",
        "R.-C. Prodan"
    ],
    "doi": "10.1145/3578245.3585331",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6406b7220ea0ba742fc53256d540b402df689cd5",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3578245.3585331",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the ever-increasing volume of data and the demand to analyze and comprehend it, graph processing has become an essential approach for solving complex problems in various domains, like social networks, bioinformatics, and finance. Despite the potential benefits of current graph processing platforms, they often encounter difficulties supporting diverse workloads, models, and languages. Moreover, existing platforms suffer from limited portability and interoperability, resulting in redundant efforts and inefficient resource and energy utilization due to vendor and even platform lock-in. To bridge the aforementioned gaps, the Graph-Massivizer project, funded by the Horizon Europe research and innovation program, conducts research and develops a high-performance, scalable, and sustainable platform for information processing and reasoning based on the massive graph (MG) representation of extreme data. In this paper, we briefly introduce the Graph-Massivizer platform. We explore how the emerging serverless computing paradigm can be leveraged to devise a scalable graph analytics tool over a codesigned computing continuum infrastructure. Finally, we sketch seven crucial research questions in our design and outline three ongoing and future research directions for addressing them.",
    "citationCount": 8,
    "referenceCount": 41
}