{
    "paperId": "641da7893fecea72012dfc2ba4b273e80d95804a",
    "title": "Chromosome-level genome assembly of an endoparasitoid Cotesia ruficrus",
    "year": 2025,
    "venue": "Scientific Data",
    "authors": [
        "Xianxin Zhao",
        "Yuanyuan Liu",
        "Xinhai Ye",
        "Fang Wang",
        "Qi Fang",
        "Gong-yin Ye"
    ],
    "doi": "10.1038/s41597-025-04837-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/641da7893fecea72012dfc2ba4b273e80d95804a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Dataset"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cotesia ruficrus is a gregarious larval endoparasitoid of many important agricultural pest moths, such as the fall armyworm, northern armyworm and rice leaffolder. While eight of Cotesia genomes had been reported, high-quality genomic data of C. ruficrus has yet to be performed. This study presents a chromosome-scale genome assembly of C. ruficrus, utilizing both PacBio HiFi-reads and Hi-C reads. The genome size is about 185.3 Mb harboring 10 chromosomes, and 209 unanchored scaffolds with a scaffold N50 length of 15.81 Mb. The anchored rate of sequences to chromosomes is 95.55%. A total of 14,001 genes have been annotated. This work delivers a first high-quality, chromosome-scale genome for C. ruficrus, enriching the datasets for comparative evolutionary studies within the Cotesia genus. Additionally, it offers a valuable genomic resource for future biological and genetic research, as well as for enhancing pest management strategies, such as biological control.",
    "citationCount": 0,
    "referenceCount": 64
}