{
    "paperId": "6469f13d08165f11ad95e4ba92d8c36e8bdacb4c",
    "title": "Design of Innovation and Entrepreneurship Education Ecosystem in Universities Based on User Experience",
    "year": 2022,
    "venue": "Mathematical Problems in Engineering",
    "authors": [
        "Dan Sheng",
        "Yulong Wang"
    ],
    "doi": "10.1155/2022/3266326",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6469f13d08165f11ad95e4ba92d8c36e8bdacb4c",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/mpe/2022/3266326.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The conventional college innovation and entrepreneurship education ecosystem is not considered to be designed for low energy consumption, and there is confusion in function switching, which leads to a large value of packet loss rate in system transmission. In this paper, we analyze the construction of college innovation and entrepreneurship education ecosystem and construct the scientific ecosystem of college innovation and entrepreneurship education based on user experience so as to realize college. At the same time, it takes into account the principle of green and low energy consumption of system hardware and software design, in which the hardware part selects S3C6410 RISC microcontroller as the core component to build the structure of educational ecological controller, connects a 16 bit buffer in parallel outside the controller, uses the buffer as the actual conversion port, specifies the function switching bearing interface, uses a protocol conversion chip, and designs the data acquisition circuit structure. The software part builds a model of user experience elements, sets to get an ecological interaction interface under the interoperability between the model and information data, and uses JAVA programming to realize functional modules according to the deviation of educational information shown by users. The experimental results show that the educational ecosystem designed in this paper has high data throughput, high fault tolerance, and low packet loss rate and system energy consumption, which verifies the effectiveness of the system.",
    "citationCount": 16,
    "referenceCount": 30
}