{
    "paperId": "6471ccd8c54ad663d19fe153fd6747b43b4b0325",
    "title": "Should my Blockchain Learn to Drive? A Study of Hyperledger Fabric",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Jeeta Ann Chacko",
        "R. Mayer",
        "Hans-Arno Jacobsen"
    ],
    "doi": "10.48550/arXiv.2406.06318",
    "arxivId": "2406.06318",
    "url": "https://www.semanticscholar.org/paper/6471ccd8c54ad663d19fe153fd6747b43b4b0325",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Similar to other transaction processing frameworks, blockchain systems need to be dynamically reconfigured to adapt to varying workloads and changes in network conditions. However, achieving optimal reconfiguration is particularly challenging due to the complexity of the blockchain stack, which has diverse configurable parameters. This paper explores the concept of self-driving blockchains, which have the potential to predict workload changes and reconfigure themselves for optimal performance without human intervention. We compare and contrast our discussions with existing research on databases and highlight aspects unique to blockchains. We identify specific parameters and components in Hyperledger Fabric, a popular permissioned blockchain system, that are suitable for autonomous adaptation and offer potential solutions for the challenges involved. Further, we implement three demonstrative locally autonomous systems, each targeting a different layer of the blockchain stack, and conduct experiments to understand the feasibility of our findings. Our experiments indicate up to 11% improvement in success throughput and a 30% decrease in latency, making this a significant step towards implementing a fully autonomous blockchain system in the future.",
    "citationCount": 3,
    "referenceCount": 63
}