{
    "paperId": "64e365d7ab6529b43bf9a1cc2d2ed4e7137f1076",
    "title": "Genome-wide association studies reveal potential candidate genes associated with amino acid in tea plants",
    "year": 2025,
    "venue": "PeerJ",
    "authors": [
        "Qidi Wu",
        "Li Song",
        "Ding-hua Bai",
        "Yihan Wang",
        "Yuting OuYang",
        "Kaixin Rao",
        "Qinfei Song",
        "Juanying Wang",
        "S. Niu",
        "Yujie Ai"
    ],
    "doi": "10.7717/peerj.18969",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/64e365d7ab6529b43bf9a1cc2d2ed4e7137f1076",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Amino acids, as the main flavor substances of umami in tea, are also the primary components determining the taste of tea, which is positively correlated with the quality and grade of tea. The Guizhou Plateau is located in the core area of the origin of the tea plant and has abundant tea germplasm. However, there are relatively few studies using genome-wide association studies (GWAS) to mine genes related to amino acid content in tea plants in the Guizhou Plateau. Results In this study, 78,819 high-quality single nucleotide polymorphisms (SNPs) markers were identified from 212 tea accessions composed by our group in the previous study by genotyping sequencing technology (GBS), and the population structure, genetic diversity, and GWAS of 212 tea accessions resources of tea were analysed. Phylogenetic tree and population structure analysis divided all germplasm into four inferred groups (Q1, Q2, Q3, Q4). By analysing the eight SNPs associated with amino acids obtained by GWAS, four candidate genes that may be related to amino acids were identified. Reverse transcription quantitative polymerase chain reaction (RT-qPCR) was used to verify the expression levels of four candidate genes, suggesting that there may be a potential gene that is important for the accumulation of amino acid content. Conclusions This study provides new information for the in-depth analysis of the genetic mechanism of amino acid content in tea plants and provides important genetic resources for accelerating the cultivation of new tea varieties with suitable amino acid content.",
    "citationCount": 0,
    "referenceCount": 93
}