{
    "paperId": "64edab8f7e67dbacdc5af82bf00878a0d7eaf6dd",
    "title": "Behavioural deficits of autism spectrum disorder and associations with different gene clusters: a study with the whole-genome transmission disequilibrium test",
    "year": 2023,
    "venue": "BMJ Paediatrics Open",
    "authors": [
        "Qi Guo",
        "L. Xia",
        "Ruolan Guo",
        "Wenjian Xu",
        "Yue Zhang",
        "Chunlin Zhao",
        "P. Zhang",
        "Ting Bai",
        "Xinxin Ni",
        "Chanjuan Hao",
        "K. Xia",
        "Wei Li"
    ],
    "doi": "10.1136/bmjpo-2023-001930",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/64edab8f7e67dbacdc5af82bf00878a0d7eaf6dd",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmjpaedsopen.bmj.com/content/bmjpo/7/1/e001930.full.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Autism spectrum disorder (ASD) is a diverse neurodevelopmental disease primarily distinguished by limited and stereotyped activities as well as impaired social interaction. Due to the high heritability of ASD, research on the disorder has emphasised on identifying the underlying genetic and epigenetic aetiology. Many ASD loci have been identified by genome-wide association studies (GWASs). However, GWASs are more susceptible to bias due to population stratification. Moreover, GWASs barely reflect the genetic aetiology of subtypes of behavioural deficits. Methods We applied whole-genome transmission disequilibrium test (TDT) to reveal the gene sets that are significantly associated with the four behavioural subtypes of restricted repetitive behaviours in 334 ASD trios. We further mapped the clustered genes to pathways and enriched the SFARI genes in these pathways. Results Four unique gene clusters (181 genes in total) that are related to four different behavioural subtypes in ASD were identified. 23 SFARI genes were enriched in these four clusters. Through pathway analysis, nine non-SFARI genes (CNDP1, ETNK1, ITPKB, KCNQ5, PDE4D, PDGFRA, PPARGC1A, ULK2, SYNJ2) were found to be linked to the SFARI genes, which may contribute to the development of ASD. Furthermore, we found that the mTOR pathway enriched with the CNDP1, PDE4D, ULK2 genes is associated with neurodevelopment. Conclusions Whole-genome TDT test is a unique tool in clustering genes related to ASD subtypes of behavioural deficits. Several new candidate genes for ASD are revealed by pathway analysis of the clustered genes. These findings are useful for understanding the underlying mechanism of ASD.",
    "citationCount": 3,
    "referenceCount": 27
}