{
    "paperId": "64eed1d1b88ebaa1ff5cb6e4fbc175456fe020ff",
    "title": "Locality-Aware Data Placement for NUMA Architectures: Data Decoupling and Asynchronous Replication",
    "year": 2025,
    "venue": "Design, Automation and Test in Europe",
    "authors": [
        "Shu-ren Bai",
        "Haowen Luo",
        "Burong Dong",
        "Jian Zhou",
        "Fei Wu"
    ],
    "doi": "10.23919/DATE64628.2025.10993285",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/64eed1d1b88ebaa1ff5cb6e4fbc175456fe020ff",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Non-Uniform Memory Access (NUMA) architectures bring new opportunities and challenges to bridge the gap between computing power and memory performance. Their complex memory hierarchies feature non-uniform access performance, known as NUMA locality, indicating data placement and access without NUMA-awareness significantly impact performance. Existing NUMA-aware solutions often prioritize fast local access but at the cost of heavy replication overhead, suffering a read-write performance tradeoff and limited scalability. To overcome these limitations, this paper presents Ladapa, a scalable and high-performance locality-aware data placement strategy. The key insight is decoupling data into metadata and data layers, allowing independent management with adaptive asynchronous replication for lower overhead. Additionally, Ladapa employs multi-level metadata management leveraging fast caches for efficient data location, further boosting performance. Experimental results show that Ladapa outperforms typical replication techniques by up to 27.37× in write performance and 1.63× in read performance.",
    "citationCount": 0,
    "referenceCount": 25
}