{
    "paperId": "6520581aa6393cc4487d0f534d6bf207ee436b15",
    "title": "A Theoretical Analysis of Recommendation Loss Functions under Negative Sampling",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Giulia Di Teodoro",
        "F. Siciliano",
        "Nicola Tonellotto",
        "Fabrizio Silvestri"
    ],
    "doi": "10.48550/arXiv.2411.07770",
    "arxivId": "2411.07770",
    "url": "https://www.semanticscholar.org/paper/6520581aa6393cc4487d0f534d6bf207ee436b15",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Loss functions like Categorical Cross Entropy (CCE), Binary Cross Entropy (BCE), and Bayesian Personalized Ranking (BPR) are commonly used in training Recommender Systems (RSs) to differentiate positive items - those interacted with by users - and negative items. While prior works empirically showed that CCE outperforms BCE and BPR when using the full set of negative items, we provide a theoretical explanation for this by proving that CCE offers the tightest lower bound on ranking metrics like Normalized Discounted Cumulative Gain (NDCG) and Mean Reciprocal Rank (MRR), followed by BPR and BCE. However, using the full set of negative items is computationally infeasible for large-scale RSs, prompting the use of negative sampling techniques. Under negative sampling, we reveal that BPR and CCE are equivalent when a single negative sample is drawn, and all three losses converge to the same global minimum. We further demonstrate that the sampled losses remain lower bounds for NDCG (MRR), albeit in a probabilistic sense. Our worst-case analysis shows that BCE offers the strongest bound on NDCG (MRR). Experiments on five datasets and four models empirically support these theoretical findings. Our code and supplementary material are available at https://github.com/federicosiciliano/recsys_losses.git.",
    "citationCount": 4,
    "referenceCount": 46
}