{
    "paperId": "65822aea56d29bfb969633caadda800f386e9003",
    "title": "Autism Spectrum Disorder Classification in Children Using Eye-tracking Technology and Convolutional Neural Networks",
    "year": 2025,
    "venue": "International Journal of Computational and Experimental Science and Engineering",
    "authors": [
        "AlHasan Sameh Gawish",
        "Sarah M. Ayyad",
        "S. Saraya",
        "Ahmed I. Saleh"
    ],
    "doi": "10.22399/ijcesen.3900",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/65822aea56d29bfb969633caadda800f386e9003",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Autism Spectrum Disorder (ASD) is a highly complex and difficult to treat neural developmental disorder that often manifests with distinct challenges in social abilities such as human interaction and communication, as well as causing children to exhibit behaviors repeatedly. A definitive one-size-fits-all treatment has yet to be developed for ASD, but early diagnosis and detection is critical for implementing effective interventions at an early age which allows children suffering from ASD to achieve greatly better outcomes in their development, pulling them closer to typically developing children. Traditional diagnostic methods are, most of the time, hard to access in undeveloped countries, consume a lot of time and are highly subjective. The most recent breakthroughs and developments in machine learning, particularly deep learning, have allowed for the creation of automated systems for ASD classification. This paper focuses on using a Convolutional Neural Network (CNN) utilizing transfer learning along with the pre-trained VGG16 augmented with further convolutional layers to classify ASD from eye-tracking scanpaths. The proposed method demonstrates high classification accuracy that reaches 98.4%, with precision and recall reaching 96.6% and 100% respectively, supported by robust preprocessing, augmentation and transfer learning techniques, the results emphasize the potential of CNNs as a reliable diagnostic tool, paving the way for integrating AI in clinical settings.",
    "citationCount": 0,
    "referenceCount": 31
}