{
    "paperId": "65df4e7b2895c57e904874aed4c82301b0f077e8",
    "title": "A Simple and Robust Protocol for Distributed Counting",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Edith Cohen",
        "M. Shechner",
        "Uri Stemmer"
    ],
    "doi": "10.48550/arXiv.2509.05870",
    "arxivId": "2509.05870",
    "url": "https://www.semanticscholar.org/paper/65df4e7b2895c57e904874aed4c82301b0f077e8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We revisit the distributed counting problem, where a server must continuously approximate the total number of events occurring across $k$ sites while minimizing communication. The communication complexity of this problem is known to be $\\Theta(\\frac{k}{\\epsilon}\\log N)$ for deterministic protocols. Huang, Yi, and Zhang (2012) showed that randomization can reduce this to $\\Theta(\\frac{\\sqrt{k}}{\\epsilon}\\log N)$, but their analysis is restricted to the {\\em oblivious setting}, where the stream of events is independent of the protocol's outputs. Xiong, Zhu, and Huang (2023) presented a robust protocol for distributed counting that removes the oblivious assumption. However, their communication complexity is suboptimal by a $polylog(k)$ factor and their protocol is substantially more complex than the oblivious protocol of Huang et al. (2012). This left open a natural question: could it be that the simple protocol of Huang et al. (2012) is already robust? We resolve this question with two main contributions. First, we show that the protocol of Huang et al. (2012) is itself not robust by constructing an explicit adaptive attack that forces it to lose its accuracy. Second, we present a new, surprisingly simple, robust protocol for distributed counting that achieves the optimal communication complexity of $O(\\frac{\\sqrt{k}}{\\epsilon} \\log N)$. Our protocol is simpler than that of Xiong et al. (2023), perhaps even simpler than that of Huang et al. (2012), and is the first to match the optimal oblivious complexity in the adaptive setting.",
    "citationCount": 0,
    "referenceCount": 65
}