{
    "paperId": "660e2c92ea4052cc1fed0fcd7edd164d54f25b7e",
    "title": "Towards Transfer Learning Techniques—BERT, DistilBERT, BERTimbau, and DistilBERTimbau for Automatic Text Classification from Different Languages: A Case Study",
    "year": 2022,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "R. S. Barbon",
        "A. T. Akabane"
    ],
    "doi": "10.3390/s22218184",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/660e2c92ea4052cc1fed0fcd7edd164d54f25b7e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/22/21/8184/pdf?version=1666772217",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet of Things is a paradigm that interconnects several smart devices through the internet to provide ubiquitous services to users. This paradigm and Web 2.0 platforms generate countless amounts of textual data. Thus, a significant challenge in this context is automatically performing text classification. State-of-the-art outcomes have recently been obtained by employing language models trained from scratch on corpora made up from news online to handle text classification better. A language model that we can highlight is BERT (Bidirectional Encoder Representations from Transformers) and also DistilBERT is a pre-trained smaller general-purpose language representation model. In this context, through a case study, we propose performing the text classification task with two previously mentioned models for two languages (English and Brazilian Portuguese) in different datasets. The results show that DistilBERT’s training time for English and Brazilian Portuguese was about 45% faster than its larger counterpart, it was also 40% smaller, and preserves about 96% of language comprehension skills for balanced datasets.",
    "citationCount": 36,
    "referenceCount": 48
}