{
    "paperId": "66196ec005c779f2db82404f90e177446e8a6582",
    "title": "Highly Efficient Direct Analytics on Semantic-Aware Time Series Data Compression",
    "year": 2025,
    "venue": "ICC 2025 - IEEE International Conference on Communications",
    "authors": [
        "Guoyou Sun",
        "Panagiotis Karras",
        "Qi Zhang"
    ],
    "doi": "10.1109/ICC52391.2025.11162086",
    "arxivId": "2503.13246",
    "url": "https://www.semanticscholar.org/paper/66196ec005c779f2db82404f90e177446e8a6582",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Semantic communication has emerged as a promising paradigm to tackle the challenges of massive growing data traffic and sustainable data communication. It shifts the focus from data fidelity to goal-oriented or task-oriented semantic transmission. While deep learning-based methods are commonly used for semantic encoding and decoding, they struggle with the sequential nature of time series data and high computation cost, particularly in resource-constrained IoT environments. Data compression plays a crucial role in reducing transmission and storage costs, yet traditional data compression methods fall short of the demands of goal-oriented communication systems. In this paper, we propose a novel method for direct analytics on time series data compressed by the Shrink compression algorithm. Through experimentation using outlier detection as a case study, we show that our method outperforms baselines running on uncompressed data in multiple cases, with merely 1% difference in the worst case. Additionally, it achieves four times lower runtime on average and accesses approximately 10% of the data volume, which enables edge analytics with limited storage and computation power. These results demonstrate that our approach offers reliable, high-speed outlier detection analytics for diverse IoT applications while extracting semantics from time-series data, achieving high compression, and reducing data transmission.",
    "citationCount": 0,
    "referenceCount": 20
}