{
    "paperId": "6621c12f931e0bebd761ae744f5575fac29e8d07",
    "title": "Exploring Machine Learning Approaches for QoS Prediction on SMT Processors",
    "year": 2024,
    "venue": "International Conference on Future Internet of Things and Cloud",
    "authors": [
        "Sercan Sari",
        "Onur Demir",
        "Gürhan Küçük"
    ],
    "doi": "10.1109/FiCloud62933.2024.00054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6621c12f931e0bebd761ae744f5575fac29e8d07",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Improving efficiency in large-scale computing environments involves optimizing server usage while ensuring that latency-sensitive applications maintain their quality of service (QoS). While there has been research on maintaining QoS for high-performance threads (HPT) in multicore systems, simultaneous multithreading processors present various challenges for QoS. These challenges increase significantly as the number of threads increases, due to the complexity of maintaining QoS in shared resources such as instruction pipelines, execution units, and cache. To meet the QoS requirements of HPTs, monitoring and dynamic allocation of these resources are necessary. However, privacy concerns may arise if monitoring is needed, as it could lead to data leaks and side-channel attacks.This study compares different machine learning approaches to provide a more straightforward way of predicting resource utilization and allocating resources. We also consider the situations when the HPT thread should protected against side-channel attacks. We selected one of the heuristic algorithms from the previous work and prepared data to build different models. We have 89% prediction accuracy for the decision tree regression model and 93% for XGB classification models, where we can also provide a secure environment for the HPT against side-channel attacks.",
    "citationCount": 0,
    "referenceCount": 34
}