{
    "paperId": "662658a17a854478598b04ba89ddb201555dc7c2",
    "title": "PALQO: Physics-informed Model for Accelerating Large-scale Quantum Optimization",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yiming Huang",
        "Yajie Hao",
        "Jing Zhou",
        "Xiao Yuan",
        "Xiaoting Wang",
        "Yuxuan Du"
    ],
    "doi": "10.48550/arXiv.2509.20733",
    "arxivId": "2509.20733",
    "url": "https://www.semanticscholar.org/paper/662658a17a854478598b04ba89ddb201555dc7c2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Variational quantum algorithms (VQAs) are leading strategies to reach practical utilities of near-term quantum devices. However, the no-cloning theorem in quantum mechanics precludes standard backpropagation, leading to prohibitive quantum resource costs when applying VQAs to large-scale tasks. To address this challenge, we reformulate the training dynamics of VQAs as a nonlinear partial differential equation and propose a novel protocol that leverages physics-informed neural networks (PINNs) to model this dynamical system efficiently. Given a small amount of training trajectory data collected from quantum devices, our protocol predicts the parameter updates of VQAs over multiple iterations on the classical side, dramatically reducing quantum resource costs. Through systematic numerical experiments, we demonstrate that our method achieves up to a 30x speedup compared to conventional methods and reduces quantum resource costs by as much as 90\\% for tasks involving up to 40 qubits, including ground state preparation of different quantum systems, while maintaining competitive accuracy. Our approach complements existing techniques aimed at improving the efficiency of VQAs and further strengthens their potential for practical applications.",
    "citationCount": 0,
    "referenceCount": 99
}