{
    "paperId": "66267237ad17584da4ff67c162ad7003e85e6737",
    "title": "Workload-Aware Performance Tuning for Autonomous DBMSs",
    "year": 2021,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Zhengtong Yan",
        "Jiaheng Lu",
        "Naresh Chainani",
        "Chunbin Lin"
    ],
    "doi": "10.1109/ICDE51399.2021.00267",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/66267237ad17584da4ff67c162ad7003e85e6737",
    "isOpenAccess": true,
    "openAccessPdf": "https://helda.helsinki.fi/bitstream/10138/341340/1/2021_Workload_Aware_Performance_Tuning_for_Autonomous_DBMSs_ICDE_.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimal configuration is vital for a DataBase Management System (DBMS) to achieve high performance. There is no one-size-fits-all configuration that works for different workloads since each workload has varying patterns with different resource requirements. There is a relationship between configuration, workload, and system performance. If a configuration cannot adapt to the dynamic changes of a workload, there could be a significant degradation in the overall performance of DBMS unless a sophisticated administrator is continuously re-configuring the DBMS. In this tutorial, we focus on autonomous workload-aware performance tuning, which is expected to automatically and continuously tune the configuration as the workload changes. We survey three research directions, including 1) workload classification, 2) workload forecasting, and 3) workload-based tuning. While the first two topics address the issue of obtaining accurate workload information, the third one tackles the problem of how to properly use the workload information to optimize performance. We also identify research challenges and open problems, and give real-world examples about leveraging workload information for database tuning in commercial products (e.g., Amazon Redshift). We will demonstrate workload-aware performance tuning in Amazon Redshift in the presentation.",
    "citationCount": 11,
    "referenceCount": 37
}