{
    "paperId": "6643c1ccb0b4b08d9c084f04d4cbae5b27dc1786",
    "title": "Photothermal Integration of Multi-Spectral Imaging Data via UAS Improves Prediction of Target Traits in Oat Breeding Trials",
    "year": 2025,
    "venue": "Agronomy",
    "authors": [
        "David Evershed",
        "Jason Brook",
        "Sandy Cowan",
        "Irene Griffiths",
        "Sara Tudor",
        "Marc Loosley",
        "John H. Doonan",
        "Catherine J. Howarth"
    ],
    "doi": "10.3390/agronomy15071583",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6643c1ccb0b4b08d9c084f04d4cbae5b27dc1786",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The modelling and prediction of important agronomic traits using remotely sensed data is an evolving science and an attractive concept for plant breeders, as manual crop phenotyping is both expensive and time consuming. Major limiting factors in creating robust prediction models include the appropriate integration of data across different years and sites, and the availability of sufficient genetic and phenotypic diversity. Variable weather patterns, especially at higher latitudes, add to the complexity of this integration. This study introduces a novel approach by using photothermal time units to align spectral data from unmanned aerial system images of spring, winter, and facultative oat (Avena sativa) trials conducted over different years at a trial site at Aberystwyth, on the western Atlantic seaboard of the UK. The resulting regression and classification models for various agronomic traits are of significant interest to oat breeding programmes. The potential applications of these findings include optimising breeding strategies, improving crop yield predictions, and enhancing the efficiency of resource allocation in breeding programmes.",
    "citationCount": 0,
    "referenceCount": 55
}