{
    "paperId": "667afa7db12e5c6b2d5fc9408a6c49e9f89a6f69",
    "title": "Data‐driven methods for quantitative imaging",
    "year": 2024,
    "venue": "GAMM-Mitteilungen",
    "authors": [
        "Guozhi Dong",
        "Moritz Flaschel",
        "Michael Hintermüller",
        "Kostas Papafitsoros",
        "Clemens Sirotenko",
        "Karsten Tabelow"
    ],
    "doi": "10.1002/gamm.202470014",
    "arxivId": "2404.07886",
    "url": "https://www.semanticscholar.org/paper/667afa7db12e5c6b2d5fc9408a6c49e9f89a6f69",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1002/gamm.202470014",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the field of quantitative imaging, the image information at a pixel or voxel in an underlying domain entails crucial information about the imaged matter. This is particularly important in medical imaging applications, such as quantitative magnetic resonance imaging (qMRI), where quantitative maps of biophysical parameters can characterize the imaged tissue and thus lead to more accurate diagnoses. Such quantitative values can also be useful in subsequent, automatized classification tasks in order to discriminate normal from abnormal tissue, for instance. The accurate reconstruction of these quantitative maps is typically achieved by solving two coupled inverse problems which involve a (forward) measurement operator, typically ill‐posed, and a physical process that links the wanted quantitative parameters to the reconstructed qualitative image, given some underlying measurement data. In this review, by considering qMRI as a prototypical application, we provide a mathematically‐oriented overview on how data‐driven approaches can be employed in these inverse problems eventually improving the reconstruction of the associated quantitative maps.",
    "citationCount": 2,
    "referenceCount": 212
}