{
    "paperId": "669d6c339a83218177a7e94b6f867f798d5e743a",
    "title": "Supporting professionals to implement integrated, person-centered care for people with chronic conditions: the TARGET pilot study",
    "year": 2023,
    "venue": "Scandinavian Journal of Primary Health Care",
    "authors": [
        "Rowan G. M. Smeets",
        "D. Hertroijs",
        "D. Ruwaard",
        "S. Spoorenberg",
        "A. Elissen"
    ],
    "doi": "10.1080/02813432.2023.2250392",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/669d6c339a83218177a7e94b6f867f798d5e743a",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/02813432.2023.2250392?needAccess=true&role=button",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Objective The TARGET program for integrated, person-centered care for people with chronic conditions offers primary care (PC) professionals a set of tools and trainings to actively engage in population segmentation and person-centered needs assessments (PCNAs). A pilot study was conducted to gain insight into the program’s feasibility and acceptability, and identify preconditions for successful implementation. Design and setting Seven Dutch PC practices participated in a half-year pilot study starting in August 2020. We performed a review of the population segmentation tool, observed four training sessions and 15 PCNAs, and interviewed 15 professionals and 12 patients. Results Regarding feasibility and acceptability, we found that the tools and trainings provided professionals with skills to use the segmentation tool and take a more coaching role in the well-appreciated PCNAs. Concerning implementation preconditions, we found that team commitment and network connections need improvement, although work pleasure increased and professionals generally wanted the program to continue. Conclusions While the content of the TARGET program is supported by its users, the implementation process, for instance team commitment to the program, needs more attention in future upscaling efforts. Key Points To implement integrated care in practice, primary care professionals (PCPs) need concrete tools, skills and confidence. PCPs consider the tools and trainings of the TARGET program as feasible and acceptable to organize integrated care TARGET’s success depends on commitment from professionals to its implementation and the strength of ties with professionals in other domains. Based on qualitative insights, TARGET improves work pleasure and patient experience, but it takes time to decrease work pressure effectively.",
    "citationCount": 1,
    "referenceCount": 70
}