{
    "paperId": "66abd0fb6d39523369315a06a10637869a69440a",
    "title": "Learning a Partitioning Advisor with Deep Reinforcement Learning",
    "year": 2019,
    "venue": "arXiv.org",
    "authors": [
        "Benjamin Hilprecht",
        "Carsten Binnig",
        "Uwe Röhm"
    ],
    "doi": null,
    "arxivId": "1904.01279",
    "url": "https://www.semanticscholar.org/paper/66abd0fb6d39523369315a06a10637869a69440a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Commercial data analytics products such as Microsoft Azure SQL Data Warehouse or Amazon Redshift provide ready-to-use scale-out database solutions for OLAP-style workloads in the cloud. While the provisioning of a database cluster is usually fully automated by cloud providers, customers typically still have to make important design decisions which were traditionally made by the database administrator such as selecting the partitioning schemes. \nIn this paper we introduce a learned partitioning advisor for analytical OLAP-style workloads based on Deep Reinforcement Learning (DRL). The main idea is that a DRL agent learns its decisions based on experience by monitoring the rewards for different workloads and partitioning schemes. We evaluate our learned partitioning advisor in an experimental evaluation with different databases schemata and workloads of varying complexity. In the evaluation, we show that our advisor is not only able to find partitionings that outperform existing approaches for automated partitioning design but that it also can easily adjust to different deployments. This is especially important in cloud setups where customers can easily migrate their cluster to a new set of (virtual) machines.",
    "citationCount": 9,
    "referenceCount": 24
}