{
    "paperId": "66aef21b50fcb5375de3830680368c6cc0a37013",
    "title": "ICEGAN: inverse covariance estimating generative adversarial network",
    "year": 2023,
    "venue": "Machine Learning: Science and Technology",
    "authors": [
        "Insoo Kim",
        "Minhyeok Lee",
        "Junhee Seok"
    ],
    "doi": "10.1088/2632-2153/acc638",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/66aef21b50fcb5375de3830680368c6cc0a37013",
    "isOpenAccess": true,
    "openAccessPdf": "https://iopscience.iop.org/article/10.1088/2632-2153/acc638/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Owing to the recent explosive expansion of deep learning, several challenging problems in a variety of fields have been handled by deep learning, yet deep learning methods have been limited in their application to the network estimation problem. While network estimation has a possibility to be a useful method in various domains, deep learning-based network estimation has a limitation in that the number of variables must be fixed and the estimation cannot be performed by convolutional layers. In this study, we propose a Generative Adversarial Network (GAN) based method, called Inverse Covariance Estimating GAN (ICEGAN), which can alleviate these limitations. In ICEGAN, the concepts in Cycle-Consistent Adversarial Networks are modified for the problem and employed to adopt gene expression data. Additionally, the Monte Carlo approach is used to address the fixed size in the network estimation process. Thus, sub-networks are sampled from the entire network and estimated by ICEGAN; then, the Monte Carlo approach reconstructs the entire network with the estimations. In the simulation study, ICEGAN demonstrated superior performances compared to conventional models and the ordinary GAN model in estimating networks. Specifically, ICEGAN outperformed an ordinary GAN by 85.9% on average when the models were evaluated using the area under curve. In addition, ICEGAN performed gene network estimation of breast cancer using a gene expression dataset. Consequently, ICEGAN demonstrated promising results, considering the deep learning-based network estimation and the proposed Monte Carlo approach for GAN models, both of which can be expanded to other domains.",
    "citationCount": 15,
    "referenceCount": 45
}