{
    "paperId": "66da92e57a48d8e30b95357e7780f8aad2301fc3",
    "title": "Hybrid Twins Modeling of a High-Level Radioactive Waste Cell Demonstrator for Long-Term Temperature Monitoring and Forecasting",
    "year": 2024,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "David Muñoz",
        "Anoop Ebey Thomas",
        "Julien Cotton",
        "J. Bertrand",
        "F. Chinesta"
    ],
    "doi": "10.3390/s24154931",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/66da92e57a48d8e30b95357e7780f8aad2301fc3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/24/15/4931/pdf?version=1722333874",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Monitoring a deep geological repository for radioactive waste during the operational phases relies on a combination of fit-for-purpose numerical simulations and online sensor measurements, both producing complementary massive data, which can then be compared to predict reliable and integrated information (e.g., in a digital twin) reflecting the actual physical evolution of the installation over the long term (i.e., a century), the ultimate objective being to assess that the repository components/processes are effectively following the expected trajectory towards the closure phase. Data prediction involves using historical data and statistical methods to forecast future outcomes, but it faces challenges such as data quality issues, the complexity of real-world data, and the difficulty in balancing model complexity. Feature selection, overfitting, and the interpretability of complex models further contribute to the complexity. Data reconciliation involves aligning model with in situ data, but a major challenge is to create models capturing all the complexity of the real world, encompassing dynamic variables, as well as the residual and complex near-field effects on measurements (e.g., sensors coupling). This difficulty can result in residual discrepancies between simulated and real data, highlighting the challenge of accurately estimating real-world intricacies within predictive models during the reconciliation process. The paper delves into these challenges for complex and instrumented systems (multi-scale, multi-physics, and multi-media), discussing practical applications of machine and deep learning methods in the case study of thermal loading monitoring of a high-level waste (HLW) cell demonstrator (called ALC1605) implemented at Andra’s underground research laboratory.",
    "citationCount": 0,
    "referenceCount": 34
}