{
    "paperId": "66fbe9a507ee801dd3f4ad1f45cd8c46d69f383c",
    "title": "Self-Awareness in Business Acumen as a Cognitive Bridge Between Accounting Proficiency and Financial Performance in Thai Community Enterprises",
    "year": 2025,
    "venue": "Journal of Risk and Financial Management",
    "authors": [
        "Kirana Yeesoonsam",
        "R. Tansuchat",
        "Namchok Chimprang"
    ],
    "doi": "10.3390/jrfm18090492",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/66fbe9a507ee801dd3f4ad1f45cd8c46d69f383c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study investigates the mediating role of self-awareness within the broader framework of business acumen, emphasizing its connection to entrepreneurial accounting proficiency and financial performance in community enterprises across Thailand. The purpose is to advance theoretical understanding by integrating metacognition theory and the resource-based view (RBV), and to provide practical insights for strengthening grassroots entrepreneurship. Using survey data from 210 enterprises, a hybrid Structural Equation Modeling–Artificial Neural Network (SEM–ANN) approach is applied to capture both linear and nonlinear relationships among cognitive, technical, and financial variables. The results confirm that accounting proficiency has a significant and positive effect on self-awareness with value of 0.125. However, self-awareness does not exert a direct influence on financial performance. These findings suggest that self-awareness may function as a cognitive enabler, facilitating the translation of entrepreneurial skills into effective decision-making, rather than serving as an independent predictor of financial outcomes. Empirical patterns further reveal that commercial enterprises report higher self-awareness than service firms, unregistered enterprises show greater awareness than registered ones, and financially stable firms display lower awareness, suggesting complacency or overconfidence. In contrast, regular participation in training significantly enhances awareness, underscoring the role of continuous learning.",
    "citationCount": 0,
    "referenceCount": 53
}