{
    "paperId": "6717a60058dcfc385dc8c8c13a7c23d8c0b96f22",
    "title": "Algorithm 1039: Automatic Generators for a Family of Matrix Multiplication Routines with Apache TVM",
    "year": 2023,
    "venue": "ACM Transactions on Mathematical Software",
    "authors": [
        "Guillermo Alaejos",
        "A. Castell'o",
        "P. Alonso-Jordá",
        "Francisco D. Igual",
        "Héctor Martínez",
        "Enrique S. Quintana-Ort'i"
    ],
    "doi": "10.1145/3638532",
    "arxivId": "2310.20347",
    "url": "https://www.semanticscholar.org/paper/6717a60058dcfc385dc8c8c13a7c23d8c0b96f22",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We explore the utilization of the Apache TVM open source framework to automatically generate a family of algorithms that follow the approach taken by popular linear algebra libraries, such as GotoBLAS2, BLIS, and OpenBLAS, to obtain high-performance blocked formulations of the general matrix multiplication (gemm). In addition, we fully automatize the generation process by also leveraging the Apache TVM framework to derive a complete variety of the processor-specific micro-kernels for gemm. This is in contrast with the convention in high-performance libraries, which hand-encode a single micro-kernel per architecture using Assembly code. In global, the combination of our TVM-generated blocked algorithms and micro-kernels for gemm (1) improves portability, maintainability, and, globally, streamlines the software life cycle; (2) provides high flexibility to easily tailor and optimize the solution to different data types, processor architectures, and matrix operand shapes, yielding performance on a par (or even superior for specific matrix shapes) with that of hand-tuned libraries; and (3) features a small memory footprint.",
    "citationCount": 5,
    "referenceCount": 55
}