{
    "paperId": "672d48ca7bbecfa6442223061ef4f8467e08f234",
    "title": "Evolutionary diversity of CXCL16-CXCR6: Convergent Substitutions and Recurrent Gene Loss in Sauropsids",
    "year": 2024,
    "venue": "bioRxiv",
    "authors": [
        "Buddhabhushan Girish Salve",
        "Sandhya Sharma",
        "N. Vijay"
    ],
    "doi": "10.1101/2024.09.20.614078",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/672d48ca7bbecfa6442223061ef4f8467e08f234",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The CXCL16-CXCR6 axis is crucial for regulating the persistence of CD8 tissue-resident memory T-cells (TRM). CXCR6 deficiency lowers TRM cell numbers in the lungs and depletes ILC3s in the lamina propria, impairing mucosal defence. This axis is linked to diseases like HIV/SIV, cancer, and COVID-19. Together, these highlight that the CXCL16-CXCR6 axis is pivotal in host immunity. Previous studies of the CXCL16-CXCR6 axis found genetic variation among species but were limited to primates and rodents. To understand the evolution and diversity of CXCL16-CXCR6 across vertebrates, we compared ∼400 1-to-1 CXCR6 orthologs spanning diverse vertebrates. The unique DRF motif of CXCR6 facilitates leukocyte adhesion by interacting with cell surface-expressed CXCL16 and plays a key role in G-protein selectivity during receptor signalling; however, our findings show that this motif is not universal. The DRF motif is restricted to mammals, turtles, and frogs, while the DRY motif, typical in other CKRs, is found in snakes and lizards. Most birds exhibit the DRL motif. These substitutions at the DRF motif affect the receptor─Gi/o protein interaction. We establish recurrent CXCR6 gene loss in 10 out of 36 bird orders, including Galliformes and Passeriformes, Crocodilia, and Elapidae, attributed to segmental deletions and/or frame-disrupting changes. Notably, single-cell RNA sequencing of the lung shows a drop in TRM cells in species with CXCR6 loss, suggesting a possible link. The concurrent loss of ITGAE, CXCL16 and CXCR6 in chickens may have altered CD8 TRM cell abundance, with implications for immunity against viral diseases and vaccines inducing CD8 TRM cells.",
    "citationCount": 1,
    "referenceCount": 103
}