{
    "paperId": "67322d753c9e05f19e7df54923a722d9d68e4e62",
    "title": "SQL2Circuits: Estimating Metrics for SQL Queries with A Quantum Natural Language Processing Method",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Valter Uotila"
    ],
    "doi": "10.48550/arXiv.2306.08529",
    "arxivId": "2306.08529",
    "url": "https://www.semanticscholar.org/paper/67322d753c9e05f19e7df54923a722d9d68e4e62",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2306.08529",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, advances in quantum computing have led to accelerating research on quantum applications across fields. Here, we introduce a quantum machine learning model as a potential solution to the classical question in database research: the estimation of metrics for SQL queries. This work employs a quantum natural language processing (QNLP)-inspired approach for constructing a quantum machine learning model that can classify SQL queries with respect to their cardinalities, costs, and execution times. The model consists of an encoding mechanism and a training phase, including classical and quantum subroutines. The encoding mechanism encodes SQL queries as parametrized quantum circuits. In the training phase, we utilize classical optimization algorithms, such as SPSA and Adam, to optimize the circuit parameters to make predictions about the query metrics. We conclude that our model reaches an accuracy equivalent to that of the QNLP model in the binary classification tasks. Moreover, we extend the previous work by adding 4-class classification tasks and compare the cardinality estimation results to the state-of-the-art databases. We perform a theoretical analysis of the quantum machine learning model by calculating its expressibility and entangling capabilities. The analysis shows that the model has advantageous properties that make it expressible but also not too complex to be executed on the existing quantum hardware.",
    "citationCount": 8,
    "referenceCount": 102
}