{
    "paperId": "675111aaba88d9fb763bb2966b4afaef2642a5f7",
    "title": "A classification and review of tools for developing and interacting with machine learning systems",
    "year": 2022,
    "venue": "ACM Symposium on Applied Computing",
    "authors": [
        "E. Mosqueira-Rey",
        "Elena Hernández-Pereira",
        "David Alonso-Ríos",
        "José Bobes-Bascarán"
    ],
    "doi": "10.1145/3477314.3507310",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/675111aaba88d9fb763bb2966b4afaef2642a5f7",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3477314.3507310",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper we aim to bring some order to the myriad of tools that have emerged in the field of Artificial Intelligence (AI), focusing on the field of Machine Learning (ML). For this purpose, we suggest a classification of the tools in which the categories are organized following the development lifecycle of an ML system and we make a review of the existing tools within each section of the classification. We believe this will help to better understand the ecosystem of tools currently available and will also allow us to identify niches in which to develop new tools to aid in the development of AI and ML systems. After reviewing the state-of-the-art of the tools, we have identified three trends in them: the incorporation of humans into the loop of the machine learning process, the movement from ad-hoc and experimental approaches to a more engineering perspective and the ability to make it easier to develop intelligent systems for people without an educational background in the area, in order to move the focus from the technical environment to the domain-specific problem.",
    "citationCount": 13,
    "referenceCount": 88
}