{
    "paperId": "6763c867585e95afcb574464ef3c9d96506cd8a7",
    "title": "A New Impossibility Result for Online Bipartite Matching Problems",
    "year": 2025,
    "venue": "International Colloquium on Automata, Languages and Programming",
    "authors": [
        "Flavio Chierichetti",
        "Mirko Giacchini",
        "Alessandro Panconesi",
        "Andrea Vattani"
    ],
    "doi": "10.48550/arXiv.2504.14251",
    "arxivId": "2504.14251",
    "url": "https://www.semanticscholar.org/paper/6763c867585e95afcb574464ef3c9d96506cd8a7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online Bipartite Matching with random user arrival is a fundamental problem in the online advertisement ecosystem. Over the last 30 years, many algorithms and impossibility results have been developed for this problem. In particular, the latest impossibility result was established by Manshadi, Oveis Gharan and Saberi in 2011. Since then, several algorithms have been published in an effort to narrow the gap between the upper and the lower bounds on the competitive ratio. In this paper we show that no algorithm can achieve a competitive ratio better than $1- \\frac e{e^e} = 0.82062\\ldots$, improving upon the $0.823$ upper bound presented in (Manshadi, Oveis Gharan and Saberi, SODA 2011). Our construction is simple to state, accompanied by a fully analytic proof, and yields a competitive ratio bound intriguingly similar to $1 - \\frac1e$, the optimal competitive ratio for the fully adversarial Online Bipartite Matching problem. Although the tightness of our upper bound remains an open question, we show that our construction is extremal in a natural class of instances.",
    "citationCount": 0,
    "referenceCount": 61
}