{
    "paperId": "678b05603697e4923a139ed9ac1755941f5ed11d",
    "title": "AutoMLBench: A Comprehensive Experimental Evaluation of Automated Machine Learning Frameworks",
    "year": 2022,
    "venue": "Expert systems with applications",
    "authors": [
        "Hassan Eldeeb",
        "M. Maher",
        "Oleh Matsuk",
        "Abdelrahman Aldallal",
        "Radwa El Shawi",
        "Sherif Sakr"
    ],
    "doi": "10.48550/arXiv.2204.08358",
    "arxivId": "2204.08358",
    "url": "https://www.semanticscholar.org/paper/678b05603697e4923a139ed9ac1755941f5ed11d",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2204.08358",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the booming demand for machine learning applications, it has been recognized that the number of knowledgeable data scientists can not scale with the growing data volumes and application needs in our digital world. In response to this demand, several automated machine learning (AutoML) frameworks have been developed to fill the gap of human expertise by automating the process of building machine learning pipelines. Each framework comes with different heuristics-based design decisions. In this study, we present a comprehensive evaluation and comparison of the performance characteristics of six popular AutoML frameworks, namely, AutoWeka, AutoSKlearn, TPOT, Recipe, ATM, and SmartML, across 100 data sets from established AutoML benchmark suites. Our experimental evaluation considers different aspects for its comparison, including the performance impact of several design decisions, including time budget, size of search space, meta-learning, and ensemble construction. The results of our study reveal various interesting insights that can significantly guide and impact the design of AutoML frameworks.",
    "citationCount": 24,
    "referenceCount": 51
}