{
    "paperId": "67a4dd5210b8102b5bdbf0eb6e23b8ea2ecc71ce",
    "title": "Learned discretizations for passive scalar advection in a two-dimensional turbulent flow",
    "year": 2020,
    "venue": "Physical Review Fluids",
    "authors": [
        "J. Zhuang",
        "Dmitrii Kochkov",
        "Yohai Bar-Sinai",
        "M. Brenner",
        "Stephan Hoyer"
    ],
    "doi": "10.1103/PhysRevFluids.6.064605",
    "arxivId": "2004.05477",
    "url": "https://www.semanticscholar.org/paper/67a4dd5210b8102b5bdbf0eb6e23b8ea2ecc71ce",
    "isOpenAccess": true,
    "openAccessPdf": "http://link.aps.org/pdf/10.1103/PhysRevFluids.6.064605",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The computational cost of fluid simulations increases rapidly with grid resolution. This has given a hard limit on the ability of simulations to accurately resolve small scale features of complex flows. Here we use a machine learning approach to learn a numerical discretization that retains high accuracy even when the solution is under-resolved with classical methods. We apply this approach to passive scalar advection in a two-dimensional turbulent flow. The method maintains the same accuracy as traditional high-order flux-limited advection solvers, while using $4\\times$ lower grid resolution in each dimension. The machine learning component is tightly integrated with traditional finite-volume schemes and can be trained via an end-to-end differentiable programming framework. The solver can achieve near-peak hardware utilization on CPUs and accelerators via convolutional filters. Code is available at this https URL",
    "citationCount": 66,
    "referenceCount": 63
}