{
    "paperId": "67d1401eff7cb7720fdf7018b744ffd24a7d9f2f",
    "title": "Federated Analysis for Privacy-Preserving Data Sharing: A Technical and Legal Primer",
    "year": 2023,
    "venue": "Annual review of genomics and human genetics (Print)",
    "authors": [
        "J. Casaletto",
        "A. Bernier",
        "Robyn McDougall",
        "Melissa S. Cline"
    ],
    "doi": "10.1146/annurev-genom-110122-084756",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/67d1401eff7cb7720fdf7018b744ffd24a7d9f2f",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.annualreviews.org/doi/pdf/10.1146/annurev-genom-110122-084756",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Continued advances in precision medicine rely on the widespread sharing of data that relate human genetic variation to disease. However, data sharing is severely limited by legal, regulatory, and ethical restrictions that safeguard patient privacy. Federated analysis addresses this problem by transferring the code to the data—providing the technical and legal capability to analyze the data within their secure home environment rather than transferring the data to another institution for analysis. This allows researchers to gain new insights from data that cannot be moved, while respecting patient privacy and the data stewards’ legal obligations. Because federated analysis is a technical solution to the legal challenges inherent in data sharing, the technology and policy implications must be evaluated together. Here, we summarize the technical approaches to federated analysis and provide a legal analysis of their policy implications.",
    "citationCount": 22,
    "referenceCount": 93
}