{
    "paperId": "67da01ffb1ccd4ddfa53e3ee12f2bad13f477655",
    "title": "HaLSM: A Hotspot-aware LSM-tree based Key-Value Storage Engine",
    "year": 2022,
    "venue": "ICCD",
    "authors": [
        "Jianshun Zhang",
        "Fang Wang",
        "Chaos Dong"
    ],
    "doi": "10.1109/ICCD56317.2022.00035",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/67da01ffb1ccd4ddfa53e3ee12f2bad13f477655",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The LSM-tree based key-value store has been widely deployed in modern storage systems because of its optimized write performance. However, its query performance is frequently criticized owing to the multi-layer structure. Caching is one of the most common approaches for boosting read performance, but existing caching in LSM-tree may be invalidated due to compaction. Simultaneously, obsolete data brought by duplicate writes may cause significant read and write amplification during compaction. Caching invalidation and compaction with obsolete data both impair performance.By developing a fine-grained Entry Cache in memory and inventing a hotspot-aware compaction strategy, we propose a Hotspot-aware LSM-tree based storage engine (simplified as HaLSM). The Entry Cache stores hot data in memory efficiently, and all data in it are valid indefinitely and are unaffected by compaction. Using the hotspot-aware compaction strategy, HaLSM can reduce the impact on tree structures brought by hotspot data and keep hot data in upper levels. We have implemented HaLSM based on LevelDB, and the evaluation results with the YCSB benchmark show that the performance of HaLSM is higher than that of LevelDB in various workloads, and the number of disk I/Os can be reduced significantly.",
    "citationCount": 5,
    "referenceCount": 25
}