{
    "paperId": "67e999b9ed3ba640537f9277d2b7c7c594ed442e",
    "title": "Fuel Rate Prediction for Heavy-Duty Trucks",
    "year": 2023,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Liangkai Liu",
        "Wei Li",
        "Dawei Wang",
        "Yi Wu",
        "Ruigang Yang",
        "Weisong Shi"
    ],
    "doi": "10.1109/TITS.2023.3265007",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/67e999b9ed3ba640537f9277d2b7c7c594ed442e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fuel cost contributes significantly to the high operation cost of heavy-duty trucks. Developing fuel rate prediction models is the cornerstone of fuel consumption optimization approaches for heavy-duty trucks. However, limited by accurate features directly related to the truck’s fuel consumption, state-of-the-art models show poor performance and are rarely deployed in practice. In this paper, we use the truck’s engine management system (EMS) and Instant Fuel Meter (IFM) to collect a three-month dataset during the period of December 2019 to June 2020. Seven prediction models, including linear regression, polynomial regression, MLP, CNN, LSTM, CNN-LSTM, and AutoML, are investigated and evaluated to predict real-time fuel rate. The evaluation results show that the EMS and IFM dataset help to improve the coefficient of determination of traditional linear/polynomial models from 0.87 to 0.96, while learning-based approach AutoML improves the coefficient of determination to attain 0.99. Besides, we explore the actual deployment of fuel rate prediction with transfer learning and path planning for autonomous driving.",
    "citationCount": 8,
    "referenceCount": 48
}