{
    "paperId": "67fcfe802910af3004d66504ead08dbef80523c4",
    "title": "Transaction Conflict Control in Hyperledger Fabric: A Taxonomy, Gaps, and Design for Conflict Prevention",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "M. Debreczeni",
        "Attila Klenik",
        "Imre Kocsis"
    ],
    "doi": "10.1109/ACCESS.2024.3361318",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/67fcfe802910af3004d66504ead08dbef80523c4",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10418209.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The execute-order-validate approach to blockchain consensus, most notably implemented by Hyperledger Fabric, facilitates highly scalable execution of smart contract – in Fabric terminology, “chaincode” – invocations in cross-organizational blockchains; at the expense of requiring multi-version concurrency control conflict handling during block validation. Consequently, the system-level goodput can be significantly lower than throughput. Although several solutions have been proposed for handling and avoiding conflicts in Hyperledger Fabric, a systematic and holistic approach is missing. We introduce the notion of conflict-controlled operation, propose a novel taxonomy of its means based on the codified principles of dependable computing, and categorize the known approaches. Based on this taxonomy, we identified the critical gaps in the state-of-the-art. Design-time conflict prevention is one such gap, and we propose the application of a model-driven engineering process for this purpose. For the last storage mapping stage of the process, we propose entity attribute partitioning for conflict prevention, describe a data mapper-style chaincode layer, and empirically evaluate our solution.",
    "citationCount": 5,
    "referenceCount": 55
}