{
    "paperId": "681d29956ff15139b81642e50b6f43f549a3a8f3",
    "title": "The origin and evolution of cultivated rice and genomic signatures of heterosis for yield traits in super-hybrid rice",
    "year": 2025,
    "venue": "BMC Biology",
    "authors": [
        "Yiyong Zhao",
        "Tao Li",
        "Daliang Liu",
        "Hao Yin",
        "Liang Wang",
        "Song Lu",
        "Houlin Yu",
        "Xinhao Sun",
        "Taikui Zhang",
        "Quanzhi Zhao"
    ],
    "doi": "10.1186/s12915-025-02255-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/681d29956ff15139b81642e50b6f43f549a3a8f3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background\n Understanding the evolutionary history of cultivated rice (Oryza sativa) and the genomic basis of heterosis is crucial for advancing rice productivity and ensuring global food security. The origins of the two main subspecies, indica and japonica, remain contentious, with debates over single versus multiple domestication events. Additionally, the genetic mechanisms underlying heterosis in elite super-hybrid rice varieties are not fully elucidated. Results We performed a comprehensive genome-scale phylogenomic analysis using 33 high-quality Oryzeae genomes, integrating 39,984 gene trees. Our findings support the independent origins of indica and japonica subspecies, with molecular dating and synonymous substitution rates indicating nearly synchronous evolutionary trajectories. Analysis of 1383 gene duplications in the common ancestor of O. sativa revealed their involvement in vital biological processes and environmental adaptability. Phylogenomic analyses revealed no significant genomic signatures indicative of extensive hybridization events between the progenitors of indica and japonica. Newly generated 71.67 Gb of whole-genome sequencing data of five elite super-hybrid rice varieties and their progenitors uncovered differential positive selection and genetic exchanges between subspecies, contributing to heterosis formation. Transcriptome analyses highlighted the predominance of non-additive gene expression in heterosis, especially in genes related to DNA repair and recombination. Furthermore, expression quantitative trait locus (eQTL) and de novo mutation analyses identified key developmental and stress response genes, offering potential targets for enhancing heterosis. Conclusions Our study provides robust evidence for the independent domestication of indica and japonica rice subspecies and elucidates the genomic features associated with heterosis in super-hybrid rice. By identifying key genes linked to adaptability and heterosis, we offer valuable insights and genetic resources for breeding programs aimed at improving rice yield and resilience. These findings enhance our understanding of rice evolution and the complex genetic factors driving heterosis, contributing to future strategies for agricultural productivity enhancement. Supplementary Information The online version contains supplementary material available at 10.1186/s12915-025-02255-2.",
    "citationCount": 0,
    "referenceCount": 107
}