{
    "paperId": "68377c8c5185524767b4e3da62708fb9ce368790",
    "title": "Solvent Screening for Separation Processes Using Machine Learning and High-Throughput Technologies",
    "year": 2025,
    "venue": "Chem & bio engineering",
    "authors": [
        "Justin P. Edaugal",
        "Difan Zhang",
        "Dupeng Liu",
        "V. Glezakou",
        "Ning Sun"
    ],
    "doi": "10.1021/cbe.4c00170",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/68377c8c5185524767b4e3da62708fb9ce368790",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1021/cbe.4c00170",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the chemical industry shifts toward sustainable practices, there is a growing initiative to replace conventional fossil-derived solvents with environmentally friendly alternatives such as ionic liquids (ILs) and deep eutectic solvents (DESs). Artificial intelligence (AI) plays a key role in the discovery and design of novel solvents and the development of green processes. This review explores the latest advancements in AI-assisted solvent screening with a specific focus on machine learning (ML) models for physicochemical property prediction and separation process design. Additionally, this paper highlights recent progress in the development of automated high-throughput (HT) platforms for solvent screening. Finally, this paper discusses the challenges and prospects of ML-driven HT strategies for green solvent design and optimization. To this end, this review provides key insights to advance solvent screening strategies for future chemical and separation processes.",
    "citationCount": 9,
    "referenceCount": 151
}