{
    "paperId": "683d6f3307d027d94c292a53c7b04aea4526893d",
    "title": "ArtMem: Adaptive Migration in Reinforcement Learning-Enabled Tiered Memory",
    "year": 2025,
    "venue": "International Symposium on Computer Architecture",
    "authors": [
        "Xinyue Yi",
        "Hongchao Du",
        "Yu Wang",
        "Jie Zhang",
        "Qiao Li",
        "Chun Jason Xue"
    ],
    "doi": "10.1145/3695053.3731001",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/683d6f3307d027d94c292a53c7b04aea4526893d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the increasing memory demands of emerging applications, tiered memory has become a viable solution for reducing data center hardware costs. Given the low performance of the capacity tiers in tiered memory systems, optimizing memory management is crucial in improving overall system performance. This paper identifies three key limitations in existing tiered memory solutions. First, existing solutions often perform differently across different workloads, leading to suboptimal performance in some workloads. Second, they often fail to adjust migration strategies in response to low fast memory tier access rates, resulting in ineffective data placement. Third, they often miss the opportunity to dynamically tune the memory migration scope based on workload patterns, leading to unnecessary page migrations and under-utilization of tiered memory potential. This paper proposes ArtMem, a reinforcement learning (RL)-driven framework that dynamically manages tiered memory systems and adapts to workload evolution to address these limitations. ArtMem enables better placement of memory pages, enhancing system performance while reducing unnecessary migrations. Experimental evaluations show that ArtMem outperforms state-of-the-art tiering systems, achieving 35% - 172% performance improvements over diverse workloads.",
    "citationCount": 2,
    "referenceCount": 61
}