{
    "paperId": "6847b9658f287f430098199cd81bf26308da13f9",
    "title": "Domain Specialization as the Key to Make Large Language Models Disruptive: A Comprehensive Survey",
    "year": 2023,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Chen Ling",
        "Xujiang Zhao",
        "Jiaying Lu",
        "Chengyuan Deng",
        "Can Zheng",
        "Junxiang Wang",
        "Tanmoy Chowdhury",
        "Yun-Qing Li",
        "Hejie Cui",
        "Xuchao Zhang",
        "Tian-yu Zhao",
        "Amit Panalkar",
        "Wei Cheng",
        "Haoyu Wang",
        "Yanchi Liu",
        "Zhengzhang Chen",
        "Haifeng Chen",
        "Chris White",
        "Quanquan Gu",
        "Jian Pei",
        "Carl Yang",
        "Liang Zhao"
    ],
    "doi": "10.1145/3764579",
    "arxivId": "2305.18703",
    "url": "https://www.semanticscholar.org/paper/6847b9658f287f430098199cd81bf26308da13f9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large language models (LLMs) have significantly advanced the field of natural language processing (NLP), providing a highly useful, task-agnostic foundation for a wide range of applications. However, directly applying LLMs to solve sophisticated problems in specific domains meets many hurdles, caused by the heterogeneity of domain data, the sophistication of domain knowledge, the uniqueness of domain objectives, and the diversity of the constraints (e.g., various social norms, cultural conformity, religious beliefs, and ethical standards in the domain applications). Domain specification techniques are key to making large language models disruptive in many applications. Specifically, to solve these hurdles, there has been a notable increase in research and practices conducted in recent years on the domain specialization of LLMs. This emerging field of study, with its substantial potential for impact, necessitates a comprehensive and systematic review to summarize better and guide ongoing work in this area. In this article, we present a comprehensive survey on domain specification techniques for large language models, an emerging direction critical for large language model applications. First, we propose a systematic taxonomy that categorizes the LLM domain-specialization techniques based on the accessibility to LLMs and summarizes the framework for all the subcategories as well as their relations and differences to each other. Second, we present an extensive taxonomy of critical application domains that can benefit dramatically from specialized LLMs, discussing their practical significance and open challenges. Last, we offer our insights into the current research status and future trends in this area.",
    "citationCount": 194,
    "referenceCount": 352
}