{
    "paperId": "688749e84656c1fbe0da95fdf7e602fe76e45940",
    "title": "Tree-Based Real-Time Advertisement Recommendation System in Online Broadcasting",
    "year": 2020,
    "venue": "IEEE Access",
    "authors": [
        "Seongju Kang",
        "Chaeeun Jeong",
        "K. Chung"
    ],
    "doi": "10.1109/ACCESS.2020.3031925",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/688749e84656c1fbe0da95fdf7e602fe76e45940",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/8948470/09229171.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The viewing time of media content per week through TV is still dominant. Users are exposed to numerous advertisements, such as commercials, electronic home shopping, product placement (PPL), and T-Commerce while watching TV programs. Most of the advertisement systems provide a good overview of products. However, traditional advertising services do not consider user preferences, meaning it is difficult to expect anything more than mere exposure to them. We can adopt a recommendation system to predict the preference. However, existing recommendation systems find it difficult to satisfy the real-time requirements of online broadcasting because of the large overhead incurred in preference prediction processes. In this paper, we propose a real-time recommendation system to provide personalized advertisements. The proposed system generates tree models based on user historical data. To reduce the overhead of preference prediction, we introduce a sorted HashMap that enables fast tree searches. For sophisticated preference prediction, the proposed system normalizes the users’ preferences by considering the characteristics of their tree model. Finally, we conduct experiments to evaluate the performance of the proposed tree-based recommendation system.",
    "citationCount": 14,
    "referenceCount": 44
}