{
    "paperId": "689f70ea07215b58e39dfc624480b2b8e8c5848a",
    "title": "PerfGuard: Deploying ML-for-Systems without Performance Regressions, Almost!",
    "year": 2021,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "H. M. S. Hossain",
        "Marc T. Friedman",
        "Hiren Patel",
        "S. Qiao",
        "Soundar Srinivasan",
        "Markus Weimer",
        "Remmelt Ammerlaan",
        "Lucas Rosenblatt",
        "Gilbert Antonius",
        "P. Orenberg",
        "Vijay Ramani",
        "Abhishek Roy",
        "Irene Shaffer",
        "Alekh Jindal"
    ],
    "doi": "10.14778/3484224.3484233",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/689f70ea07215b58e39dfc624480b2b8e8c5848a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Modern data processing systems require optimization at massive scale, and using machine learning to optimize these systems (ML-for-systems) has shown promising results. Unfortunately, ML-for-systems is subject to over generalizations that do not capture the large variety of workload patterns, and tend to augment the performance of certain subsets in the workload while regressing performance for others. In this paper, we introduce a performance safeguard system, called\n PerfGuard\n , that designs pre-production experiments for deploying ML-for-systems. Instead of searching the entire space of query plans (a well-known, intractable problem), we focus on query plan deltas (a significantly smaller space). PerfGuard formalizes these differences, and correlates plan deltas to important feedback signals, like execution cost. We describe the deep learning architecture and the end-to-end pipeline in PerfGuard that could be used with general relational databases. We show that this architecture improves on baseline models, and that our pipeline identifies key query plan components as major contributors to plan disparity. Offline experimentation shows PerfGuard as a promising approach, with many opportunities for future improvement.\n",
    "citationCount": 6,
    "referenceCount": 48
}