{
    "paperId": "68ab0b4a68291819c41027da0c822d74e67c7004",
    "title": "HiNUMA: NUMA-Aware Data Placement and Migration in Hybrid Memory Systems",
    "year": 2019,
    "venue": "ICCD",
    "authors": [
        "Zhuohui Duan",
        "Haikun Liu",
        "Xiaofei Liao",
        "Hai Jin",
        "Wenbin Jiang",
        "Yu Zhang"
    ],
    "doi": "10.1109/ICCD46524.2019.00058",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/68ab0b4a68291819c41027da0c822d74e67c7004",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Non-uniform memory access (NUMA) architectures feature asymmetrical memory access latencies on different CPU nodes. Hybrid memory systems composed of non-volatile memory (NVM) and DRAM further diversify memory access latencies due to the relatively large performance gap between NVM and DRAM. Traditional NUMA memory management policies fail to manage hybrid memories effectively and may even hurt application performance. In this paper, we present HiNUMA, a new NUMA abstraction for memory allocation and migration in hybrid memory systems. HiNUMA advocates NUMA topologyaware hybrid memory allocation policies for the initial data placement. HiNUMA also proposes a new NUMA balancing mechanism called HANB for memory migration at runtime. HANB considers both data access frequency and memory bandwidth utilization to reduce the cost of memory accesses in hybrid memory systems. We evaluate the performance of HiNUMA with several typical workloads. Experimental results show that HiNUMA can effectively utilize hybrid memories, and deliver much higher application performance than conventional NUMA memory management policies and other state-of-the-art work.",
    "citationCount": 18,
    "referenceCount": 24
}