{
    "paperId": "68c3935834163b2be09c86131642244cfb3a5003",
    "title": "UltraMemV2: Memory Networks Scaling to 120B Parameters with Superior Long-Context Learning",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zihao Huang",
        "Yu Bao",
        "Qiyang Min",
        "Siyan Chen",
        "Ran Guo",
        "Hongzhi Huang",
        "Defa Zhu",
        "Yutao Zeng",
        "Banggu Wu",
        "Xun Zhou",
        "Siyuan Qiao"
    ],
    "doi": "10.48550/arXiv.2508.18756",
    "arxivId": "2508.18756",
    "url": "https://www.semanticscholar.org/paper/68c3935834163b2be09c86131642244cfb3a5003",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While Mixture of Experts (MoE) models achieve remarkable efficiency by activating only subsets of parameters, they suffer from high memory access costs during inference. Memory-layer architectures offer an appealing alternative with very few memory access, but previous attempts like UltraMem have only matched the performance of 2-expert MoE models, falling significantly short of state-of-the-art 8-expert configurations. We present UltraMemV2, a redesigned memory-layer architecture that closes this performance gap. Our approach introduces five key improvements: integrating memory layers into every transformer block, simplifying value expansion with single linear projections, adopting FFN-based value processing from PEER, implementing principled parameter initialization, and rebalancing memory-to-FFN computation ratios. Through extensive evaluation, we demonstrate that UltraMemV2 achieves performance parity with 8-expert MoE models under same computation and parameters but significantly low memory access. Notably, UltraMemV2 shows superior performance on memory-intensive tasks, with improvements of +1.6 points on long-context memorization, +6.2 points on multi-round memorization, and +7.9 points on in-context learning. We validate our approach at scale with models up to 2.5B activated parameters from 120B total parameters, and establish that activation density has greater impact on performance than total sparse parameter count. Our work brings memory-layer architectures to performance parity with state-of-the-art MoE models, presenting a compelling alternative for efficient sparse computation.",
    "citationCount": 0,
    "referenceCount": 46
}