{
    "paperId": "68f9bd59e5b03b2f6881a24f14fbc78272e7079c",
    "title": "Towards Autonomic Science Infrastructure: Architecture, Limitations, and Open Issues",
    "year": 2018,
    "venue": "AI-Science@HPDC",
    "authors": [
        "R. Kettimuthu",
        "Zhengchun Liu",
        "Ian T Foster",
        "P. Beckman",
        "A. Sim",
        "Kesheng Wu",
        "W. Liao",
        "Qiao Kang",
        "Ankit Agrawal",
        "A. Choudhary"
    ],
    "doi": "10.1145/3217197.3217205",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/68f9bd59e5b03b2f6881a24f14fbc78272e7079c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Scientific computing systems are becoming increasingly complex and indeed are close to reaching a critical limit in manageability when using current human-in-the-loop techniques. In order to address this problem, autonomic, goal-driven management actions based on machine learning must be applied end to end across the scientific computing landscape. Even though researchers proposed architectures and design choices for autonomic computing systems more than a decade ago, practical realization of such systems has been limited, especially in scientific computing environments. Growing interest and recent developments in machine learning have spurred proposals to apply machine learning for goal-based optimization of computing systems in an autonomous fashion. We review recent work that uses machine learning algorithms to improve computer system performance, identify gaps and open issues. We propose a hierarchical architecture that builds on the earlier proposals for autonomic computing systems to realize an autonomous science infrastructure.",
    "citationCount": 13,
    "referenceCount": 85
}