{
    "paperId": "6967737cab8e68c3c4f343139ba6da096020ea45",
    "title": "IPLQueeN: Integrity Preserving Low-Overhead Query Handling Over NDN-Based WSN",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "Tanusree Chatterjee",
        "Somnath Karmakar",
        "Sipra Das Bit"
    ],
    "doi": "10.1109/ACCESS.2021.3086460",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6967737cab8e68c3c4f343139ba6da096020ea45",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9312710/09447029.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently there has been a new emerging trend in using the technology of Named Data Networking (NDN) on wireless sensor networks (WSNs) to improve data-centric communications over WSNs. The usage of the NDN notion in WSN for such communications can be advantageous in many respects ranging from ensuring secure data collection without using the nodes’ location and several nodes to possible delivery of sensory data by utilizing the cached data in intermediate components of the network. On the other hand, WSN being a resource-constrained, energy-starved network, the data communication mechanism must be low-overhead in terms of computation and communication overheads. Thus, we propose integrity preserving low overhead query handling over NDN-based WSN. We make the scheme low overhead by judicious use of the NDN data structure Content Store (CS), Pending Interest Table (PIT), Forwarding Information Base (FIB) in a few strategically placed nodes. We also make the data collection secure by applying an existing Light-weight One-way Cryptographic Hash Algorithm (LOCHA) on the collected data. The performance of the scheme is analyzed theoretically in terms of communication, computation, storage overheads. We also simulate the entire query processing scheme including request and response forwarding in Cooja, the Contiki network simulator. Simulation results show that our scheme does not compromise with network performance such as packet loss rate, network lifetime, end-to-end delay, etc. while achieving the design goal of making the scheme energy saving which establishes that the scheme is readily implementable in real life mote e.g., Tmote Sky. Finally, all the results are compared with three competing schemes and the results confirm our scheme’s supremacy in terms of both design performance as well as network performance.",
    "citationCount": 2,
    "referenceCount": 43
}