{
    "paperId": "69df5c3726682c28689d8f21782c5d597c2dfe17",
    "title": "Human-inspired Perspectives: A Survey on AI Long-term Memory",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Zihong He",
        "Weizhe Lin",
        "Hao Zheng",
        "Fan Zhang",
        "Matt Jones",
        "Laurence Aitchison",
        "Xuhai Xu",
        "Miao Liu",
        "P. O. Kristensson",
        "Junxiao Shen"
    ],
    "doi": "10.48550/arXiv.2411.00489",
    "arxivId": "2411.00489",
    "url": "https://www.semanticscholar.org/paper/69df5c3726682c28689d8f21782c5d597c2dfe17",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid advancement of AI systems, their abilities to store, retrieve, and utilize information over the long term - referred to as long-term memory - have become increasingly significant. These capabilities are crucial for enhancing the performance of AI systems across a wide range of tasks. However, there is currently no comprehensive survey that systematically investigates AI's long-term memory capabilities, formulates a theoretical framework, and inspires the development of next-generation AI long-term memory systems. This paper begins by introducing the mechanisms of human long-term memory, then explores AI long-term memory mechanisms, establishing a mapping between the two. Based on the mapping relationships identified, we extend the current cognitive architectures and propose the Cognitive Architecture of Self-Adaptive Long-term Memory (SALM). SALM provides a theoretical framework for the practice of AI long-term memory and holds potential for guiding the creation of next-generation long-term memory driven AI systems. Finally, we delve into the future directions and application prospects of AI long-term memory.",
    "citationCount": 6,
    "referenceCount": 328
}