{
    "paperId": "6a0c8f3d15aef7930e7e99da4c335ab55b739dd2",
    "title": "Fashion Recommendation System using Collaborative Filtering",
    "year": 2023,
    "venue": "Building of Informatics, Technology and Science (BITS)",
    "authors": [
        "Muhammad Khiyarus Syiam",
        "Agung Toto Wibowo",
        "Erwin Budi Setiawan"
    ],
    "doi": "10.47065/bits.v5i2.3690",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6a0c8f3d15aef7930e7e99da4c335ab55b739dd2",
    "isOpenAccess": true,
    "openAccessPdf": "https://ejurnal.seminar-id.com/index.php/bits/article/download/3690/2299",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Collaborative Filtering is an method used to build a recommendation system with the concept that conclusions from different clients are used to anticipate things that may be of interest to users. This research uses data from Rent the Runway and the method used is Item-based Collaborative filtering, where the system will look for similarities in products that have been purchased by customers and then look for predictive values. Fashion requires recommendations because it plays a crucial role in helping individuals express their identity, personal style, and personality through clothing choices, accessories, and dressing styles.The recommendation system uses the item method based on analyzing the number of purchases or sales and grouping according to each product category so that it can help consumers in choosing fashion products. It was found that the use of Adjusted Cosine Similarity produces better recommendations with an average MAE value of 0.2750, while Cosine Similarity with an average MAE difference of 0.3989. This proves that the use of adjusted cosine similarity can produce better recommendations because the adjustment algorithm not only considers user behavior, but also produces lower performance errors.",
    "citationCount": 2,
    "referenceCount": 34
}