{
    "paperId": "6a1f23818f7e681d640132c4fc9d041d0f173551",
    "title": "Evaluating Leakage Attacks Against Relational Encrypted Search",
    "year": 2024,
    "venue": "IACR Cryptology ePrint Archive",
    "authors": [
        "Patrick Ehrler",
        "Abdelkarim Kati",
        "Thomas Schneider",
        "Amos Treiber"
    ],
    "doi": "10.1145/3689938.3694776",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6a1f23818f7e681d640132c4fc9d041d0f173551",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3689938.3694776",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Encrypted Search Algorithms (ESAs) are a technique to encrypt data while the user can still search over it. ESAs can protect privacy and ensure security of sensitive data stored on a remote storage. Originally, ESAs were used in the context of documents that consist of keywords. The user encrypts the documents, sends them to a remote server and is still able to search for keywords, without exposing information about the plaintext. The idea of ESAs has also been applied to relational databases, where queries (similar to SQL statements) can be privately executed on an encrypted database. But just as traditional schemes for Keyword-ESAs, also Relational-ESAs have the drawback of exposing some information, called leakage. Leakage attacks have been proposed in the literature that use this information together with auxiliary information to learn details about the plaintext. However, these leakage attacks have overwhelmingly been designed for and applied to Keyword-ESAs and not Relational-ESAs. In this work, we review the suitability of major leakage attacks against ESAs in the relational setting by adapting them accordingly. We perform extensive re-evaluations of the attacks on various relational datasets with different properties. Our evaluations show that major attacks can work against Relational-ESAs in the known-data setting. However, the attack performance differs between datasets, exploited patterns, and attacks.",
    "citationCount": 0,
    "referenceCount": 36
}