{
    "paperId": "6a2166907fe7de1f202e12015b39d7205af00a49",
    "title": "Enhancing User-Prosthesis Integration Through Intelligent Transparency",
    "year": 2024,
    "venue": "International Conference on Biomedical Robotics and Biomechatronics",
    "authors": [
        "I-Chieh Lee",
        "Ming Liu",
        "He Huang"
    ],
    "doi": "10.1109/BioRob60516.2024.10719813",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6a2166907fe7de1f202e12015b39d7205af00a49",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Powered leg prostheses have shown promise in facilitating various locomotion tasks to restore the functionality of amputees. The current design leaves the decisions regarding changes in device control modes unknown to the user. This lack of information may result in users being unaware of machine faults or unprepared for changes in prosthetic leg motion. To address this concern, enhancing Robot-to-Human transparency was proposed in this study. This concept aims to reduce uncertainty about the performance and behavior of a human-robot system, and has been shown to improve trust and safety in automation. Two unilateral transfemoral amputees were asked to perform an obstacle crossing task using our designed robotic knee prosthesis. We implemented a controller that informs the user about switches in locomotion modes. Three conditions were tested: 1. No mode transition (NSNT): Machine fault condition, 2. No sound notification of mode transition (NST): current device design, and 3. With sound notification of mode transition (ST): transparency of control mode. According to the trust questionnaire, users reported a preference for the ST condition. Additionally, we observed that the notification of control mode enhanced movement efficiency, significantly reducing the height of the foot and center of mass to step over the obstacle. Moreover, locomotion adjustments in foot placement were observed at the pre-obstacle step when users were aware of the control mode change. This study demonstrates that a simple notification of the robot's movement intent enhanced the predictability of prosthetic motion, facilitating anticipatory locomotion adjustments to improve movement efficiency and user trust.",
    "citationCount": 0,
    "referenceCount": 27
}