{
    "paperId": "6a54adf284009412fa56055567a0c45533553b8b",
    "title": "Drishyam: An Image is Worth a Data Prefetcher",
    "year": 2023,
    "venue": "International Conference on Parallel Architectures and Compilation Techniques",
    "authors": [
        "Shubdeep Mohapatra",
        "Biswabandan Panda"
    ],
    "doi": "10.1109/PACT58117.2023.00013",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6a54adf284009412fa56055567a0c45533553b8b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hardware prefetching is a latency-hiding technique that hides the costly off-chip DRAM accesses. Although hardware prefetching is an extensively researched topic with many state-of-the-art data prefetchers pushing the performance limits, prefetching for irregular applications with hard-to-predict access patterns is still a challenging problem to solve. The usage of neural networks for hardware prefetching is a promising direction, especially for predicting irregular memory access patterns. This paper presents Drishyam, a novel hardware prefetcher based on computer vision algorithms that use images to learn memory access patterns and predict future memory accesses with high accuracy and coverage. For hardware prefetching, an image is a graphical representation of memory accesses observed over time. For a sequence of memory addresses, Drishyam creates images that predict the future addresses by predicting the future OS page and a cache line offset within the OS page. Drishyam outperforms Voyager, the state-of-the-art machine learning (ML) based prefetcher, for a set of irregular benchmarks by an average of 4.7% with an average prefetch accuracy and prefetch coverage of 89.5% and 66.6%, respectively. In terms of training time, Drishyam outperforms Voyager by 225.5%.",
    "citationCount": 4,
    "referenceCount": 27
}