{
    "paperId": "6a9da812a2f40b7de6963bf07572f0d0189c7421",
    "title": "Characterizing On-Chip Traffic Patterns in General-Purpose GPUs: A Deep Learning Approach",
    "year": 2019,
    "venue": "ICCD",
    "authors": [
        "Yunfan Li",
        "Drew Penney",
        "Abhishek Ramamurthy",
        "Lizhong Chen"
    ],
    "doi": "10.1109/ICCD46524.2019.00016",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6a9da812a2f40b7de6963bf07572f0d0189c7421",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Architectural optimizations in general-purpose graphics processing units (GPGPUs) often exploit workload characteristics to reduce power and latency while improving performance. This paper finds, however, that prevailing assumptions about GPGPU traffic pattern characterization are inaccurate. These assumptions must therefore be re-evaluated, and more appropriate new patterns must be identified. This paper proposes a methodology to classify GPGPU traffic patterns, combining a convolutional neural network (CNN) for feature extraction and a t-distributed stochastic neighbor embedding (t-SNE) algorithm to determine traffic pattern clusters. A traffic pattern dataset is generated from common GPGPU benchmarks, transformed using heat mapping, and iteratively refined to ensure appropriate and highly accurate labels. The proposed classification model achieves 98.8% validation accuracy and 94.24% test accuracy. Furthermore, traffic in 96.6% of examined kernels can be classified into the eight identified traffic pattern categories.",
    "citationCount": 4,
    "referenceCount": 30
}