{
    "paperId": "6aa626cd0ed275985f7e0751e8a4eba2feec3955",
    "title": "Class-Adaptive Weighted Broad Learning System with Hybrid Memory Retention for Online Imbalanced Classification",
    "year": 2025,
    "venue": "Electronics",
    "authors": [
        "Jintao Huang",
        "Yu Wang",
        "Mengxin Wang"
    ],
    "doi": "10.3390/electronics14173562",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6aa626cd0ed275985f7e0751e8a4eba2feec3955",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data stream classification is a critical challenge in data mining, where models must rapidly adapt to evolving data distributions and concept drift in real time, while extreme learning machines offer fast training and strong generalization, most existing methods struggle to jointly address multi-class imbalance, concept drift, and the high cost of label acquisition in streaming settings. In this paper, we present the Adaptive Broad Learning System for Online Imbalanced Classification (ABLS-OIC), which introduces three core innovations: (1) a Class-Adaptive Weight Matrix (CAWM) that dynamically adjusts sample weights according to class distribution, sample density, and difficulty; (2) a Hybrid Memory Retention Mechanism (HMRM) that selectively retains representative samples based on importance and diversity; and (3) a Multi-Objective Adaptive Optimization Framework (MAOF) that balances classification accuracy, class balance, and computational efficiency. Extensive experiments on ten benchmark datasets with varying imbalance ratios and drift patterns show that ABLS-OIC consistently outperforms state-of-the-art methods, with improvements of 5.9% in G-mean, 6.3% in F1-score, and 3.4% in AUC. Furthermore, a real-world credit fraud detection case study demonstrates the practical effectiveness of ABLS-OIC, highlighting its value for early detection of rare but critical events in dynamic, high-stakes applications.",
    "citationCount": 0,
    "referenceCount": 77
}