{
    "paperId": "6aaee9332b66a59bc8c07c233cf2017c7e259f83",
    "title": "Online nonparametric process monitoring for IoT systems using edge computing",
    "year": 2024,
    "venue": "IISE Transactions",
    "authors": [
        "Ziqian Zheng",
        "Jiahui Zhang",
        "Lingyun Xiao",
        "Warren R. Williams",
        "Jing-Ru C. Cheng",
        "Kaibo Liu"
    ],
    "doi": "10.1080/24725854.2024.2352578",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6aaee9332b66a59bc8c07c233cf2017c7e259f83",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Facilitated by modern sensing and integrated circuit technology, Internet of Things (IoT) systems now have the ability to intelligently and automatically collect data, perform computational tasks on an edge, and efficiently make decisions locally or remotely. However, existing multivariate statistical process control methods commonly assume that sensors directly transmit the raw measurements to the central server, and thus the edge computing capability of IoT systems is not effectively harnessed. To fill this literature gap, we propose a monitoring scheme tailored for IoT systems by leveraging their edge computational power. In particular, inspired by the inherent hierarchical structure of the IoT system, we construct the monitoring statistics hierarchically. At each edge device, we first construct a nonparametric stream-level statistic for each data stream and aggregate them to derive the device-level statistics. To eliminate the inconsistency in device-level statistics across different edge devices, the device-level statistics are transformed into time-related statistics, which are then sent to the central server. At the central server, a system-level monitoring statistic is constructed, and the most informative edge devices that should transmit statistics are intelligently determined. Theoretical analyses are carried out to justify the effectiveness of the data transmission strategy. Both simulations and a case study, which is based on an IoT system we built, are conducted to evaluate the performance and validate the superiority of the proposed monitoring scheme.",
    "citationCount": 2,
    "referenceCount": 39
}