{
    "paperId": "6abc60869996ea36eed71f77d139a1b56008044c",
    "title": "Maximizing the utility of public data",
    "year": 2023,
    "venue": "Frontiers in Genetics",
    "authors": [
        "Mahmoud Ahmed",
        "Hyun Joon Kim",
        "D. Kim"
    ],
    "doi": "10.3389/fgene.2023.1106631",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6abc60869996ea36eed71f77d139a1b56008044c",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fgene.2023.1106631/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The human genome project galvanized the scientific community around an ambitious goal. Upon completion, the project delivered several discoveries, and a new era of research commenced. More importantly, novel technologies and analysis methods materialized during the project period. The cost reduction allowed many more labs to generate high-throughput datasets. The project also served as a model for other extensive collaborations that generated large datasets. These datasets were made public and continue to accumulate in repositories. As a result, the scientific community should consider how these data can be utilized effectively for the purposes of research and the public good. A dataset can be re-analyzed, curated, or integrated with other forms of data to enhance its utility. We highlight three important areas to achieve this goal in this brief perspective. We also emphasize the critical requirements for these strategies to be successful. We draw on our own experience and others in using publicly available datasets to support, develop, and extend our research interest. Finally, we underline the beneficiaries and discuss some risks involved in data reuse.",
    "citationCount": 1,
    "referenceCount": 48
}