{
    "paperId": "6ad1607eb66cc1f65cff07134c65184b577e5c11",
    "title": "Macro Graph Neural Networks for Online Billion-Scale Recommender Systems",
    "year": 2024,
    "venue": "The Web Conference",
    "authors": [
        "Hao Chen",
        "Yuan-Qi Bei",
        "Qijie Shen",
        "Yue Xu",
        "Sheng Zhou",
        "Wenbing Huang",
        "Feiran Huang",
        "Senzhang Wang",
        "Xiao Huang"
    ],
    "doi": "10.1145/3589334.3645517",
    "arxivId": "2401.14939",
    "url": "https://www.semanticscholar.org/paper/6ad1607eb66cc1f65cff07134c65184b577e5c11",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2401.14939",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predicting Click-Through Rate (CTR) in billion-scale recommender systems poses a long-standing challenge for Graph Neural Networks (GNNs) due to the overwhelming computational complexity involved in aggregating billions of neighbors. To tackle this, GNN-based CTR models usually sample hundreds of neighbors out of the billions to facilitate efficient online recommendations. However, sampling only a small portion of neighbors results in a severe sampling bias and the failure to encompass the full spectrum of user or item behavioral patterns. To address this challenge, we name the conventional user-item recommendation graph as \"micro recommendation grap\" and introduce a revolutionizing MAcro Recommendation Graph (MAG) for billion-scale recommendations to reduce the neighbor count from billions to hundreds in the graph structure infrastructure. Specifically, We group micro nodes (users and items) with similar behavior patterns to form macro nodes and then MAG directly describes the relation between the user/item and the hundred of macro nodes rather than the billions of micro nodes. Subsequently, we introduce tailored Macro Graph Neural Networks (MacGNN) to aggregate information on a macro level and revise the embeddings of macro nodes. MacGNN has already served Taobao's homepage feed for two months, providing recommendations for over one billion users. Extensive offline experiments on three public benchmark datasets and an industrial dataset present that MacGNN significantly outperforms twelve CTR baselines while remaining computationally efficient. Besides, online A/B tests confirm MacGNN's superiority in billion-scale recommender systems.",
    "citationCount": 68,
    "referenceCount": 48
}