{
    "paperId": "6ad69cc20a80d2bb786bd17874b44e8c7175d85a",
    "title": "Advanced Conjunctive Boolean Streaming Spatial Keyword Processing",
    "year": 2022,
    "venue": "International Conference on Mobile Data Management",
    "authors": [
        "Mayur Patil"
    ],
    "doi": "10.1109/MDM55031.2022.00027",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6ad69cc20a80d2bb786bd17874b44e8c7175d85a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the meteoric rise in the use of location-aware systems (for ex. social media) that generate streaming spatio-textual data in a fast-paced and highly dynamic nature, faster query processing is paramount for applications that demand performance. In this paper, we present methods to efficiently process multi-keyword spatial queries with advanced conjunctive boolean constraints which include a negative keyword list on streaming data. Modern applications require quick system responses for complex queries with spatial and multiple keyword filters. Processing such large amounts of geo-tagged stream data with various keyword filters is time-consuming and inefficient with current methods. To solve this problem we build techniques for indexing, updating, and query processing that proactively prunes the search space called the PNLR-Tree based on an R-Tree. Specifically, given positive and negative keyword lists along with spatial constraints we develop techniques for enabling advanced boolean constraints like ‘But-Not’, ‘XOR’, and others on queries such as range query, top-k, kNN, and their extensions over a sliding window. Our experiments on real datasets using various real and synthetic query workloads verify that our method has increased performance over alternate techniques.",
    "citationCount": 1,
    "referenceCount": 8
}