{
    "paperId": "6ae19fb6eae020951aeccbed884e04f3824bf518",
    "title": "Accelerating Machine Learning Queries with Linear Algebra Query Processing",
    "year": 2023,
    "venue": "International Conference on Statistical and Scientific Database Management",
    "authors": [
        "Wenbo Sun",
        "Asterios Katsifodimos",
        "Rihan Hai"
    ],
    "doi": "10.1145/3603719.3603726",
    "arxivId": "2306.08367",
    "url": "https://www.semanticscholar.org/paper/6ae19fb6eae020951aeccbed884e04f3824bf518",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3603719.3603726",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of large-scale machine learning (ML) models has led numerous commercial companies to utilize ML models for generating predictive results to help business decision-making. As two primary components in traditional predictive pipelines, data processing, and model predictions often operate in separate execution environments, leading to redundant engineering and computations. Additionally, the diverging mathematical foundations of data processing and machine learning hinder cross-optimizations by combining these two components, thereby overlooking potential opportunities to expedite predictive pipelines. In this paper, we propose an operator fusing method based on GPU-accelerated linear algebraic evaluation of relational queries. Our method leverages linear algebra computation properties to merge operators in machine learning predictions and data processing, significantly accelerating predictive pipelines by up to 317x. We perform a complexity analysis to deliver quantitative insights into the advantages of operator fusion, considering various data and model dimensions. Furthermore, we extensively evaluate matrix multiplication query processing utilizing the widely-used Star Schema Benchmark. Through comprehensive evaluations, we demonstrate the effectiveness and potential of our approach in improving the efficiency of data processing and machine learning workloads on modern hardware.",
    "citationCount": 3,
    "referenceCount": 28
}