{
    "paperId": "6afbf0817fcac27de146a501e64caf1efbee89b6",
    "title": "Adversarial Human Trajectory Learning for Trip Recommendation",
    "year": 2021,
    "venue": "IEEE Transactions on Neural Networks and Learning Systems",
    "authors": [
        "Qiang Gao",
        "Fan Zhou",
        "Kunpeng Zhang",
        "Fengli Zhang",
        "Goce Trajcevski"
    ],
    "doi": "10.1109/TNNLS.2021.3058102",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6afbf0817fcac27de146a501e64caf1efbee89b6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The problem of trip recommendation has been extensively studied in recent years, by both researchers and practitioners. However, one of its key aspects—understanding human mobility—remains under-explored. Many of the proposed methods for trip modeling rely on empirical analysis of attributes associated with historical points-of-interest (POIs) and routes generated by tourists while attempting to also intertwine personal preferences—such as contextual topics, geospatial, and temporal aspects. However, the implicit transitional preferences and semantic sequential relationships among various POIs, along with the constraints implied by the starting point and destination of a particular trip, have not been fully exploited. Inspired by the recent advances in generative neural networks, in this work we propose DeepTrip—an end-to-end method for better understanding of the underlying human mobility and improved modeling of the POIs’ transitional distribution in human moving patterns. DeepTrip consists of: a trip encoder (TE) to embed the contextual route into a latent variable with a recurrent neural network (RNN); and a trip decoder to reconstruct this route conditioned on an optimized latent space. Simultaneously, we define an Adversarial Net composed of a generator and critic, which generates a representation for a given query and uses a critic to distinguish the trip representation generated from TE and query representation obtained from Adversarial Net. DeepTrip enables regularizing the latent space and generalizing users’ complex check-in preferences. We demonstrate, both theoretically and empirically, the effectiveness and efficiency of the proposed model, and the experimental evaluations show that DeepTrip outperforms the state-of-the-art baselines on various evaluation metrics",
    "citationCount": 33,
    "referenceCount": 65
}