{
    "paperId": "6b019728ec1ec6b00f0a46d426f7a25c881bbf25",
    "title": "Deep learning in data science: Theoretical foundations, practical applications, and comparative analysis",
    "year": 2024,
    "venue": "Applied and Computational Engineering",
    "authors": [
        "Yingxuan Chai",
        "Liangning Jin"
    ],
    "doi": "10.54254/2755-2721/69/20241419",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b019728ec1ec6b00f0a46d426f7a25c881bbf25",
    "isOpenAccess": true,
    "openAccessPdf": "https://ace.ewapublishing.org/media/5a076b50a6c44a2baf408dc1384edde1.marked.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning has emerged as a transformative technology in data science, revolutionizing various domains through its powerful capabilities. This paper explores the theoretical foundations, practical applications, and comparative analysis of deep learning models. The theoretical foundations section discusses key neural network architectures such as Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), and Transformers, highlighting their unique capabilities in processing different types of data. Optimization algorithms crucial for effective training, including Stochastic Gradient Descent (SGD) and Adam, are examined. Regularization techniques for preventing overfitting and enhancing generalization are also addressed. Practical applications in healthcare, finance, and retail showcase the real-world impact of deep learning. A comparative analysis of performance metrics demonstrates the superiority of deep learning models over traditional methods. Despite their advantages, deep learning models face limitations and challenges, including data dependency and interpretability issues. The paper concludes by emphasizing the ongoing research efforts to mitigate these challenges and ensure the continued advancement of deep learning in data science.",
    "citationCount": 1,
    "referenceCount": 10
}