{
    "paperId": "6b1a03cf2d9eb7eed0882c72fb8cc55f6da47a03",
    "title": "Molecular Characterization of Escherichia coli Causing Urinary Tract Infections Through Next-Generation Sequencing: A Comprehensive Analysis of Serotypes, Sequence Types, and Antimicrobial and Virulence Genes",
    "year": 2024,
    "venue": "Cureus",
    "authors": [
        "Venkataramana Kandi",
        "P. Shahapur",
        "T. Suvvari",
        "Vallab Ganesh Bharadwaj",
        "Chitra Rajalakshmi P",
        "R. Shahapur",
        "Eswar Podaralla",
        "Vikram Godishala"
    ],
    "doi": "10.7759/cureus.55556",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b1a03cf2d9eb7eed0882c72fb8cc55f6da47a03",
    "isOpenAccess": true,
    "openAccessPdf": "https://assets.cureus.com/uploads/original_article/pdf/229675/20240305-21752-eqm1xy.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction An enormous increase in antimicrobial resistance (AMR) among bacteria isolated from human clinical specimens contributed to treatment failures. Increased surveillance through next-generation sequencing (NGS) or whole genome sequencing (WGS) could facilitate the study of the epidemiology of drug-resistant bacterial strains, resistance genes, and other virulence determinants they are potentially carrying. Methods This study included 30 Escherichia coli (E. coli) isolates obtained from patients suffering from urinary tract infections (UTIs) attending Prathima Institute of Medical Sciences, Karimnagar, India. All bacterial isolates were identified, and antimicrobial susceptibility patterns were determined through conventional microbiological techniques and confirmed by automated systems. All the isolates were investigated using NGS to identify genes coding for resistance, such as extended-spectrum beta-lactamases (ESBLs), metallo-beta-lactamases, and virulence genes. Multilocus sequence typing (MLST) was used to understand the prevalent strain types, and serotyping was carried out to evaluate the type of O (cell wall antigen) and H (flagellar antigen) serotypes carried by the isolates. Results The conventional antimicrobial susceptibility testing revealed that 15 (50%) isolates were resistant to imipenem (IPM), 10 (33.33%) were resistant to amikacin (AK), 13 (43.33%) were resistant to piperacillin-tazobactam (PTZ), 17 (56.66%) were resistant to cephalosporins, and 14 (46.66%) were resistant to nitrofurantoin (NIT). Among the isolates, 26 (86.66%) had revealed the presence of multiple antibiotic-resistant genes with evidence of at least one gene coding for beta-lactamase resistance. There was a high prevalence of blaCTX-M (19/30, 63.33%) genes, followed by blaTEM and blaOXA-1. The blaNDM-5 gene was found in three isolates (3/30, 10%). The virulence genes identified in the present study were iutA, sat, iss, and papC, among others. The E. coli serotype found predominantly belonged to O25:H4 (5, 16.66%), followed by O102:H6 (4, 13.33%). A total of 16 MLST variants were identified among the examined samples. Of the MLST-based sequence types (STs) identified, ST-131 (7, 23.33%) was the predominant one, followed by ST-167 (3, 10%) and ST-12 (3, 10%). Conclusions The study results demonstrated that the E. coli strains isolated from patients suffering from UTIs potentially carried antimicrobial resistance and virulence genes and belonged to different strain types based on MLST. Careful evaluation of bacterial strains using molecular analyses such as NGS could facilitate an improved understanding of bacterial antibiotic resistance and its virulence potential. This could enable physicians to choose appropriate antimicrobial agents and contribute to better patient management, thereby preventing the emergence and spread of drug-resistant bacteria.",
    "citationCount": 8,
    "referenceCount": 49
}