{
    "paperId": "6b2568b4ad816630ce0a8ef705f0ac3741ed9ce7",
    "title": "Photonic switching in high performance datacenters [Invited].",
    "year": 2018,
    "venue": "Optics Express",
    "authors": [
        "Q. Cheng",
        "S. Rumley",
        "M. Bahadori",
        "K. Bergman"
    ],
    "doi": "10.1364/OE.26.016022",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b2568b4ad816630ce0a8ef705f0ac3741ed9ce7",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1364/oe.26.016022",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Photonic switches are increasingly considered for insertion in high performance datacenter architectures to meet the growing performance demands of interconnection networks. We provide an overview of photonic switching technologies and develop an evaluation methodology for assessing their potential impact on datacenter performance. We begin with a review of three categories of optical switches, namely, free-space switches, III-V integrated switches and silicon integrated switches. The state-of-the-art of MEMS, LCOS, SOA, MZI and MRR switching technologies are covered, together with insights on their performance limitations and scalability considerations. The performance metrics that are required for optical switches to truly emerge in datacenters are discussed and summarized, with special focus on the switching time, cost, power consumption, scalability and optical power penalty. Furthermore, the Pareto front of the switch metric space is analyzed. Finally, we propose a hybrid integrated switch fabric design using the III-V/Si wafer bonding technique and investigate its potential impact on realizing reduced cost and power penalty.",
    "citationCount": 204,
    "referenceCount": 76
}