{
    "paperId": "6b2ae319c1707ce413208fdaffe9cd6c7fbba780",
    "title": "TuplePick: A High Stability Packet Classification based on Neural Network",
    "year": 2024,
    "venue": "IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks",
    "authors": [
        "Zhuo Li",
        "Tongtong Wang",
        "Jindian Liu",
        "Yu Zhang",
        "Tianxiang Ma",
        "Kaihua Liu"
    ],
    "doi": "10.1109/WoWMoM60985.2024.00066",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b2ae319c1707ce413208fdaffe9cd6c7fbba780",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Packet classification is one of the crucial components of networking. With the advent of Software Defined Network (SDN), packet classification has become more challenging. So far, the proposed schemes have shown good performance. However, packet classification has different application scenarios, such as access control and firewalls. The distribution characteristics of rulesets vary in different application scenarios, which affects packet classification throughput. To this end, a tuple selection model named Picking Model (PM) is designed in this paper to perform packet matching via a neural network. Moreover, based on PM, a packet classification scheme called TuplePick (TP) is proposed, which enables to pick a possible good tuple rather than an exhaustive search in the tuple space. The experimental results indicate that its throughput variances of different rulesets are less than state-of-the-art schemes, which means it outperforms current schemes on stability of throughput in different application scenarios.",
    "citationCount": 0,
    "referenceCount": 20
}