{
    "paperId": "6b42a087ac234e14db002549703f2538549b16f5",
    "title": "Selective Late Materialization in Modern Analytical Databases",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Yi-He Liu",
        "Shaoxuan Tang",
        "Yulong Hui",
        "Hangrui Zhou",
        "Huanchen Zhang"
    ],
    "doi": "10.14778/3749646.3749717",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b42a087ac234e14db002549703f2538549b16f5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Late Materialization (LM) is a critical technique applied in traditional column stores to speed up analytical queries. However, with modern analytical databases evolved to incorporate a vectorized columnar execution engine, LM's benefits in I/O reduction and fast columnar query processing have diminished. In this paper, we redefine the concept of Late Materialization in the context of modern analytical databases and propose Selective Late Materialization (SLM) to allow each attribute in a query to choose its own materialization point that yields the minimum cost. SLM expands the solution space of the traditional materialization problem from one unified hard-coded binary decision (i.e., early or late) for all attributes to per attribute per query decisions. By integrating SLM into DuckDB, we show that SLM consistently outperforms the baselines of Early Materialization and Late Materialization by 14.7% and 8.9%, respectively, on average using the Join Order Benchmark (JOB), with up to 76.7% latency reduction for individual queries. We observe similar results for the TPC-DS benchmark.",
    "citationCount": 0,
    "referenceCount": 43
}