{
    "paperId": "6b60fc27ebc828a69d96a5131dbdd3e731aeb6ad",
    "title": "Advancing Indoor Epidemiological Surveillance: Integrating Real-Time Object Detection and Spatial Analysis for Precise Contact Rate Analysis and Enhanced Public Health Strategies",
    "year": 2024,
    "venue": "International Journal of Environmental Research and Public Health",
    "authors": [
        "Ali Baligh Jahromi",
        "Koorosh Attarian",
        "A. Asgary",
        "Jianhong Wu"
    ],
    "doi": "10.3390/ijerph21111502",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b60fc27ebc828a69d96a5131dbdd3e731aeb6ad",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to escalating concerns about the indoor transmission of respiratory diseases, this study introduces a sophisticated software tool engineered to accurately determine contact rates among individuals in enclosed spaces—essential for public health surveillance and disease transmission mitigation. The tool applies YOLOv8, a cutting-edge deep learning model that enables precise individual detection and real-time tracking from video streams. An innovative feature of this system is its dynamic circular buffer zones, coupled with an advanced 2D projective transformation to accurately overlay video data coordinates onto a digital layout of the physical environment. By analyzing the overlap of these buffer zones and incorporating detailed heatmap visualizations, the software provides an in-depth quantification of contact instances and spatial contact patterns, marking an advancement over traditional contact tracing and contact counting methods. These enhancements not only improve the accuracy and speed of data analysis but also furnish public health officials with a comprehensive framework to develop more effective non-pharmaceutical infection control strategies. This research signifies a crucial evolution in epidemiological tools, transitioning from manual, simulation, and survey-based tracking methods to automated, real time, and precision-driven technologies that integrate advanced visual analytics to better understand and manage disease transmission in indoor settings.",
    "citationCount": 2,
    "referenceCount": 21
}