{
    "paperId": "6b6e3ad8df96cd409e6798a65150cb5ba80a4c13",
    "title": "Inferring experimental procedures from text-based representations of chemical reactions",
    "year": 2020,
    "venue": "Nature Communications",
    "authors": [
        "Alain C. Vaucher",
        "P. Schwaller",
        "Joppe Geluykens",
        "Vishnu H. Nair",
        "A. Iuliano",
        "T. Laino"
    ],
    "doi": "10.1038/s41467-021-22951-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b6e3ad8df96cd409e6798a65150cb5ba80a4c13",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.26434/chemrxiv.13118423",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The experimental execution of chemical reactions is a context-dependent and time-consuming process, often solved using the experience collected over multiple decades of laboratory work or searching similar, already executed, experimental protocols. Although data-driven schemes, such as retrosynthetic models, are becoming established technologies in synthetic organic chemistry, the conversion of proposed synthetic routes to experimental procedures remains a burden on the shoulder of domain experts. In this work, we present data-driven models for predicting the entire sequence of synthesis steps starting from a textual representation of a chemical equation, for application in batch organic chemistry. We generated a data set of 693,517 chemical equations and associated action sequences by extracting and processing experimental procedure text from patents, using state-of-the-art natural language models. We used the attained data set to train three different models: a nearest-neighbor model based on recently-introduced reaction fingerprints, and two deep-learning sequence-to-sequence models based on the Transformer and BART architectures. An analysis by a trained chemist revealed that the predicted action sequences are adequate for execution without human intervention in more than 50% of the cases. In organic chemistry, synthetic routes for new molecules are often specified in terms of reacting molecules only. The current work reports an artificial intelligence model to predict the full sequence of experimental operations for an arbitrary chemical equation.",
    "citationCount": 68,
    "referenceCount": 43
}