{
    "paperId": "6b99c392546bb8d9639cef2e3e546bd1ce95726c",
    "title": "Survival prediction of glioblastoma patients using machine learning and deep learning: a systematic review",
    "year": 2024,
    "venue": "BMC Cancer",
    "authors": [
        "Roya Poursaeed",
        "Mohsen Mohammadzadeh",
        "Ali A Safaei"
    ],
    "doi": "10.1186/s12885-024-13320-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6b99c392546bb8d9639cef2e3e546bd1ce95726c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s12885-024-13320-4",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Glioblastoma Multiforme (GBM), classified as a grade IV glioma by the World Health Organization (WHO), is a prevalent and notably aggressive form of brain tumor derived from glial cells. It stands as one of the most severe forms of primary brain cancer in humans. The median survival time of GBM patients is only 12–15 months, making it the most lethal type of brain tumor. Every year, about 200,000 people worldwide succumb to this disease. GBM is also highly heterogeneous, meaning that its characteristics and behavior vary widely among different patients. This leads to different outcomes and survival times for each individual. Predicting the survival of GBM patients accurately can have multiple benefits. It can enable optimal and personalized treatment planning based on the patient's condition and prognosis. It can also support the patients and their families to cope with the possible outcomes and make informed decisions about their care and quality of life. Furthermore, it can assist the researchers and scientists to discover the most relevant biomarkers, features, and mechanisms of the disease and to design more effective and personalized therapies. Artificial intelligence methods, such as machine learning and deep learning, have been widely applied to survival prediction in various fields, such as breast cancer, lung cancer, gastric cancer, cervical cancer, liver cancer, prostate cancer, and covid 19. This systematic review summarizes the current state-of-the-art methods for predicting glioblastoma survival using different types of input data, such as clinical features, molecular markers, imaging features, radiomics features, omics data or a combination of them. Following PRISMA guidelines, we searched databases from 2015 to 2024, reviewing 107 articles meeting our criteria. We analyzed the data sources, methods, performance metrics and outcomes of the studies. We found that random forest was the most popular method, and a combination of radiomics and clinical data was the most common input data. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-024-13320-4.",
    "citationCount": 18,
    "referenceCount": 135
}