{
    "paperId": "6bba08b5fd426ad81deba00b183bc72d365344b3",
    "title": "Whole-Genome Sequencing Reveals the Progress of Genetic Breeding in Eriocheir sinensis",
    "year": 2025,
    "venue": "Animals",
    "authors": [
        "Xuanpeng Wang",
        "Gaowei Zhang",
        "Dandan Gao",
        "Yongchun Ge",
        "Yongxu Cheng",
        "Xinhai Wang"
    ],
    "doi": "10.3390/ani15010077",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6bba08b5fd426ad81deba00b183bc72d365344b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Simple Summary A new variety of E. sinensis urgently needs to be produced though genetic breeding. Our research group collected crabs from Yixing and Suqian populations and aimed to produce a new variety of E. sinensis through mass selection. The progress of the genetic breeding of E. sinensis was evaluated through whole-genome sequencing. Generally, individuals from the G1 generation showed better growth performance than those from the G0 generation. In addition, crabs from the G0 and G1 generations shared close genetic backgrounds, and the G0 and G1 generations showed a high level of genetic diversity and a relatively stable genetic structure. Abstract Eriocheir sinensis is an important and popular crustacean species in China, producing huge economic benefits. Large individuals of E. sinensis are preferred due to market demand. The long-term goal of our research group is to produce a new variety of E. sinensis with better growth performance and stronger abilities to resist environmental changes through mass selection. The present study aimed to evaluate the progress of the genetic breeding of E. sinensis by analyzing the genetic diversity and genetic distance between the basic breeding population (pooled population of Suqian and Yixing, G0) and generation 1 (G1) using whole-genome sequencing (WGS). The growth traits, including body weight, shell length, shell width, and third appendage length, in the G1 generation increased by 8.3%, 7.9%, 9.6%, and 9.3%, respectively, compared with those of the G0 generation, indicating that the G1 generation showed better growth performance. A total of 372,448,393 high-quality single nucleotide polymorphisms (SNPs) were detected in 40 E. sinensis individuals, with an average of 9,331,209.83 SNPs. The fixation index values were 0.007 between the Yixing and Suqian populations and 0.015 between the G0 generation and G1 generation, indicating a close genetic background between these groups, especially when considered in combination with the phylogenetic tree and principal component analysis. All of these data suggest that genetic information was stably inherited by the G1 generation, with no introduction of foreign genetic information during the genetic breeding process. In addition, the genetic diversity analysis revealed that the G0 and G1 generations showed a high level of genetic diversity and a relatively stable genetic structure. The present study evaluated the recent progress of the genetic improvement of E. sinensis by our research group, providing valuable evidence for further genetic improvement in this species. Future studies will be performed to select growth-related SNPs and genes through genome-wide association studies.",
    "citationCount": 3,
    "referenceCount": 71
}