{
    "paperId": "6bdb636b7dc1a370db9a95697d9c2514b3ed3b00",
    "title": "Efficient Feature Extraction for Image Analysis through Adaptive Caching in Vector Databases",
    "year": 2024,
    "venue": "International Congress on Information and Communication Technology",
    "authors": [
        "Solmaz Seyed Monir",
        "Dongfang Zhao"
    ],
    "doi": "10.1109/ICICT62343.2024.00036",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6bdb636b7dc1a370db9a95697d9c2514b3ed3b00",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For popular machine learning (ML) models like MobileNetV3 and ResNet, the extraction and storage of image features serve as a critical step for both the training and inference stages. Unfortunately, the state-of-the-art ML systems exhibit a performance bottleneck on the extraction and storage of image features. To that end, this paper proposes a new caching subsystem that employs an in-memory vector database. The key idea is to preprocess images using MobileNetV3 and ResNet, extract features, and store them in an in-memory vector database instance, which is realized by a MySQL deployment on the RAM disk that is extended with similarity search. The implemented enhancements, including batch insertion and parallel processing using ThreadPoolExecutor, have yielded a notable 36.6% improvement in the execution time of MobileNetV3 image processing compared to the sequential approach. For ResNet, the execution time without caching was 15.46 seconds, and was reduced to 11.61 seconds with parallel processing, resulting in a notable improvement of 24.9%.",
    "citationCount": 4,
    "referenceCount": 26
}