{
    "paperId": "6bf74c03ad06dae663a3941f0bc1ead3cd039c4e",
    "title": "Analysis of package heat transfer characteristics and evaluation of operational status of IC silicon chip surface mount considering regulator position",
    "year": 2022,
    "venue": "2022 IEEE 5th International Conference on Automation, Electronics and Electrical Engineering (AUTEEE)",
    "authors": [
        "S. Zhao",
        "Lingyun Huang",
        "Zhiyu Chen"
    ],
    "doi": "10.1109/AUTEEE56487.2022.9994404",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6bf74c03ad06dae663a3941f0bc1ead3cd039c4e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The primary problem facing integrated circuits' continuous development is the temperature-dependent characteristics of electronic chips and other group components. As a necessary part of integrated circuits, regulators play an important role in achieving power regulation and improving the operational performance of microprocessors and systems-on-chip. However, the thermal impact on the regulator has not been well studied, so this paper investigates the effect of regulator position on its chip cooling heat transfer performance. Firstly, this paper designs a typical integrated circuit structure based on Comsol and explores the impact of three regulator positions and different heat source conditions on the chip temperature. Based on the data results obtained from the simulation, this paper uses the XGBoost algorithm to evaluate the state of the output function. The experimental results show that the regulator should be designed as far as possible from the grounded copper plate and the chip location, and an incorrect design will make the chip heat up the circuit's more significant impact on the heat.",
    "citationCount": 1,
    "referenceCount": 13
}