{
    "paperId": "6c47bfbab4d5ac95bcf3158e16e9471f92b7fb05",
    "title": "Model Joins: Enabling Analytics Over Joins of Absent Big Tables",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "A. Shanghooshabad",
        "P. Triantafillou"
    ],
    "doi": "10.48550/arXiv.2206.10434",
    "arxivId": "2206.10434",
    "url": "https://www.semanticscholar.org/paper/6c47bfbab4d5ac95bcf3158e16e9471f92b7fb05",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.10434",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work is motivated by two key facts. First, it is highly desirable to be able to learn and perform knowledge discovery and analytics (LKD) tasks without the need to access raw-data tables. This may be due to organizations finding it increasingly frustrating and costly to manage and maintain ever-growing tables, or for privacy reasons. Hence, compact models can be developed from the raw data and used instead of the tables. Second, oftentimes, LKD tasks are to be performed on a (potentially very large) table which is itself the result of joining separate (potentially very large) relational tables. But how can one do this, when the individual to-be-joined tables are absent? Here, we pose the following fundamental questions: Q1: How can one\"join models\"of (absent/deleted) tables or\"join models with other tables\"in a way that enables LKD as if it were performed on the join of the actual raw tables? Q2: What are appropriate models to use per table? Q3: As the model join would be an approximation of the actual data join, how can one evaluate the quality of the model join result? This work puts forth a framework, Model Join, addressing these challenges. The framework integrates and joins the per-table models of the absent tables and generates a uniform and independent sample that is a high-quality approximation of a uniform and independent sample of the actual raw-data join. The approximation stems from the models, but not from the Model Join framework. The sample obtained by the Model Join can be used to perform LKD downstream tasks, such as approximate query processing, classification, clustering, regression, association rule mining, visualization, and so on. To our knowledge, this is the first work with this agenda and solutions. Detailed experiments with TPC-DS data and synthetic data showcase Model Join's usefulness.",
    "citationCount": 0,
    "referenceCount": 35
}