{
    "paperId": "6c6c597f35fb7111d4c4dbb7895a69f28058da74",
    "title": "Smart Targeting: A Relevance-driven and Configurable Targeting Framework for Advertising System",
    "year": 2020,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Y. Li",
        "Zihao Zhao",
        "Zhiwei Fang",
        "Kui Ma",
        "Yafei Yao",
        "Changping Peng",
        "Yongjun Bao",
        "Weipeng P. Yan"
    ],
    "doi": "10.1145/3383313.3418481",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6c6c597f35fb7111d4c4dbb7895a69f28058da74",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Targeting system is an essential part of computational advertising. It allows advertisers to select and reach their targeted users. Due to various advertising goals and the demand for making budget plans, advertisers have a strong will to configure the final targeting results, or they can become very cautious in spending money on advertising campaigns. Meanwhile, to guarantee the advertising performance, the targeted users should also be relevant to the ads of the advertisers. Recent targeting methods are mainly based on tags produced by the Data Management Platform (DMP) which is easy for the advertisers to configure the targeting results. However, in such methods, the relevance between the targeted users and ads is not technically evaluated and cannot be guaranteed. The biggest challenge is that it is hard for a machine learning model to both model the relevance and take account of the advertiser’s configuration demands. In this paper, we propose a novel relevance-driven and configurable targeting framework called Smart Targeting to solve the problem. Specifically, different from Tag-wise Targeting, we first use a relevance model to retrieve the most relevant users for the ads. To further enable the advertisers to configure the final results, we develop a Delay Intervention Mechanism to leverage the power of DMP. As far as we know, this is the first attempt of combining relevance modeling and advertiser intervention into a unified targeting system. We implement and evaluate our framework on JD.com platform with over 300 million users and the results show that it can bring significant improvements to the core indicators such as CTR and eCPM. The long term monitoring also demonstrates that Smart Targeting gradually becomes the most popular targeting tool after its release.",
    "citationCount": 0,
    "referenceCount": 23
}