{
    "paperId": "6c78bf485367b4cf0968504a0595550e65389327",
    "title": "From Large Language Models and Optimization to Decision Optimization CoPilot: A Research Manifesto",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "S. Wasserkrug",
        "Léonard Boussioux",
        "D. Hertog",
        "F. Mirzazadeh",
        "Ilker Birbil",
        "Jannis Kurtz",
        "Donato Maragno"
    ],
    "doi": "10.48550/arXiv.2402.16269",
    "arxivId": "2402.16269",
    "url": "https://www.semanticscholar.org/paper/6c78bf485367b4cf0968504a0595550e65389327",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Significantly simplifying the creation of optimization models for real-world business problems has long been a major goal in applying mathematical optimization more widely to important business and societal decisions. The recent capabilities of Large Language Models (LLMs) present a timely opportunity to achieve this goal. Therefore, we propose research at the intersection of LLMs and optimization to create a Decision Optimization CoPilot (DOCP) - an AI tool designed to assist any decision maker, interacting in natural language to grasp the business problem, subsequently formulating and solving the corresponding optimization model. This paper outlines our DOCP vision and identifies several fundamental requirements for its implementation. We describe the state of the art through a literature survey and experiments using ChatGPT. We show that a) LLMs already provide substantial novel capabilities relevant to a DOCP, and b) major research challenges remain to be addressed. We also propose possible research directions to overcome these gaps. We also see this work as a call to action to bring together the LLM and optimization communities to pursue our vision, thereby enabling much more widespread improved decision-making.",
    "citationCount": 9,
    "referenceCount": 52
}