{
    "paperId": "6cd37758822fbcc9a853a03299d0d01ab1231237",
    "title": "Knowledge graph augmentation: consistency, immutability, reliability, and context",
    "year": 2023,
    "venue": "PeerJ Computer Science",
    "authors": [
        "Savas Takan"
    ],
    "doi": "10.7717/peerj-cs.1542",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6cd37758822fbcc9a853a03299d0d01ab1231237",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7717/peerj-cs.1542",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A knowledge graph is convenient for storing knowledge in artificial intelligence applications. On the other hand, it has some shortcomings that need to be improved. These shortcomings can be summarised as the inability to automatically update all the knowledge affecting a piece of knowledge when it changes, ambiguity, inability to sort the knowledge, inability to keep some knowledge immutable, and inability to make a quick comparison between knowledge. In our work, reliability, consistency, immutability, and context mechanisms are integrated into the knowledge graph to solve these deficiencies and improve the knowledge graph’s performance. Hash technology is used in the design of these mechanisms. In addition, the mechanisms we have developed are kept separate from the knowledge graph to ensure that the functionality of the knowledge graph is not impaired. The mechanisms we developed within the scope of the study were tested by comparing them with the traditional knowledge graph. It was shown graphically and with t-test methods that our proposed structures have higher performance in terms of update and comparison. It is expected that the mechanisms we have developed will contribute to improving the performance of artificial intelligence software using knowledge graphs.",
    "citationCount": 3,
    "referenceCount": 53
}