{
    "paperId": "6cec1a091f958d3fe5ff67a42ae58cae5c6c34b3",
    "title": "oneDNN Graph Compiler: A Hybrid Approach for High-Performance Deep Learning Compilation",
    "year": 2023,
    "venue": "IEEE/ACM International Symposium on Code Generation and Optimization",
    "authors": [
        "Jianhui Li",
        "Zhen Qin",
        "Yijie Mei",
        "Jingze Cui",
        "Yunfei Song",
        "Ciyong Chen",
        "Yifei Zhang",
        "Longsheng Du",
        "Xianhang Cheng",
        "Baihui Jin",
        "Jason Ye",
        "Eric Lin",
        "Daniel M. Lavery"
    ],
    "doi": "10.1109/CGO57630.2024.10444871",
    "arxivId": "2301.01333",
    "url": "https://www.semanticscholar.org/paper/6cec1a091f958d3fe5ff67a42ae58cae5c6c34b3",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2301.01333",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development of deep learning models and hardware support for dense computing, the deep learning (DL) workload characteristics changed significantly from a few hot spots on compute-intensive operations to a broad range of operations scattered across the models. Accelerating a few compute-intensive operations using the expert-tuned implementation of primitives doesn't fully exploit the performance potential of AI hardware. Various efforts have been made to compile a full deep neural network (DNN) graph. One of the biggest challenges is to achieve high-performance tensor compilation by generating expert-level performance code for the dense compute-intensive operations and applying compilation optimization at the scope of DNN computation graph across multiple compute-intensive operations. We present oneDNN Graph Compiler, a tensor compiler that employs a hybrid approach of using techniques from both compiler optimization and expert-tuned kernels for high-performance code generation of the deep neural network graph. oneDNN Graph Compiler addresses unique optimization challenges in the deep learning domain, such as low-precision computation, aggressive fusion of graph operations, optimization for static tensor shapes and memory layout, constant weight optimization, and memory buffer reuse. Experimental results demonstrate significant performance gains over existing tensor compiler and primitives library for performance-critical DNN computation graphs and end-to-end models on Intel® Xeon® Scalable Processors.",
    "citationCount": 14,
    "referenceCount": 25
}