{
    "paperId": "6d38da2736bed5c3a4a8ba8f3f2f9749bc95c287",
    "title": "Hierarchical Naming Scheme in Named Data Networking for Internet of Things: A Review and Future Security Challenges",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Mohammad Shahrul Mohd Shah",
        "Y. Leau",
        "Zhiwei Yan",
        "Mohammed Anbar"
    ],
    "doi": "10.1109/ACCESS.2022.3151864",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6d38da2736bed5c3a4a8ba8f3f2f9749bc95c287",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9668973/09714391.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The proliferation of connected devices in the Internet of Things (IoT) presents a connectivity challenge. The future internet will require a paradigm shift in which content is evaluated on the basis of “What” it is rather than “Where” it originated. ICN’s goal is to provide the benefits of name-based content addressing in order to facilitate scalable content distribution, security, mobility, and trust. NDN is a new internet architecture that evolved from Content-Centric Networking (CCN). NDN is viewed as a solution to the IoT’s challenges, as well as a way to transcend the IP paradigm. With IoT systems that had a number of challenging characteristics to satisfy, including heterogeneous devices, resource constraints, and energy efficiency. Due to the fact that NDN native features deliver data via hierarchically structured names, it offer promising solutions for current research integrating NDN into IoT. The review discusses the significance of naming, its influence, and security factor. Additionally, research challenges in the areas of naming and security will be discussed. The primary objective of this review is to give a new facelift to a new integrating naming convention for NDN.",
    "citationCount": 20,
    "referenceCount": 70
}