{
    "paperId": "6d421f5388c13ac71da8a9a5e31bae264861b540",
    "title": "Automatic Decision Algorithm of Interpretation Power in Criminal Justice Based on Data Activity Consultant",
    "year": 2021,
    "venue": "Mobile Information Systems",
    "authors": [
        "Xiaolong Yang"
    ],
    "doi": "10.1155/2021/3922660",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6d421f5388c13ac71da8a9a5e31bae264861b540",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/misy/2021/3922660.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In order to solve the problems existing in the current decision algorithm, such as poor data processing performance, low decision accuracy, and long decision time, an automatic decision algorithm of criminal justice interpretation right based on data activity consultant was designed. According to the requirements of reasonable design consultant system data activity and demanded data activity consultants provide data processing requirements and scope. Use the Scrapy web crawler framework to crawl data related to criminal justice interpretation and criminal law provisions from related websites, and clear and extract the collected data to realize data query. Based on the obtained data, the feature array of criminal law is designed, and the decision of criminal judicial interpretation right is made. The C4.5 decision tree algorithm is used to predict the correct rate of decision. The decision of criminal judicial interpretation right is adjusted constantly according to the prediction results to achieve the goal of the automatic decision of criminal judicial interpretation right. Experimental results show that the algorithm has superior data processing performance, high decision accuracy, and short decision time, which verifies the effectiveness of the algorithm.",
    "citationCount": 1,
    "referenceCount": 18
}