{
    "paperId": "6d5c5e0df5dc4bd0bcd524d2a22d65d672bd0b74",
    "title": "TensorIR: An Abstraction for Automatic Tensorized Program Optimization",
    "year": 2022,
    "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems",
    "authors": [
        "Siyuan Feng",
        "Bohan Hou",
        "Hongyi Jin",
        "Wuwei Lin",
        "Junru Shao",
        "Ruihang Lai",
        "Zihao Ye",
        "Lianmin Zheng",
        "Cody Hao Yu",
        "Yong Yu",
        "Tianqi Chen"
    ],
    "doi": "10.1145/3575693.3576933",
    "arxivId": "2207.04296",
    "url": "https://www.semanticscholar.org/paper/6d5c5e0df5dc4bd0bcd524d2a22d65d672bd0b74",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3575693.3576933",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deploying deep learning models on various devices has become an important topic. The wave of hardware specialization brings a diverse set of acceleration primitives for multi-dimensional ten- sor computations. These new acceleration primitives, along with the emerging machine learning models, bring tremendous engineering challenges. In this paper, we present TensorIR, a compiler abstraction for optimizing programs with these tensor computation primitives. TensorIR generalizes the loop nest representation used in existing machine learning compilers to bring tensor computation as the first-class citizen. Finally, we build an end-to-end framework on top of our abstraction to automatically optimize deep learning models for given tensor computation primitives. Experimental results show that TensorIR compilation automatically uses the tensor computation primitives for given hardware backends and delivers performance that is competitive to state-of-art hand-optimized systems across platforms.",
    "citationCount": 76,
    "referenceCount": 49
}