{
    "paperId": "6d86c952d40b9f1a374481c99177f811c5c20068",
    "title": "GENIUS: A Generative Framework for Universal Multimodal Search",
    "year": 2025,
    "venue": "Computer Vision and Pattern Recognition",
    "authors": [
        "Sungyeon Kim",
        "Xinliang Zhu",
        "Xiaofan Lin",
        "Muhammet Bastan",
        "Douglas Gray",
        "Suha Kwak"
    ],
    "doi": "10.1109/CVPR52734.2025.01831",
    "arxivId": "2503.19868",
    "url": "https://www.semanticscholar.org/paper/6d86c952d40b9f1a374481c99177f811c5c20068",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative retrieval is an emerging approach in information retrieval that generates identifiers (IDs) of target data based on a query, providing an efficient alternative to traditional embedding-based retrieval methods. However, existing models are task-specific and fall short of embedding-based retrieval in performance. This paper proposes GENIUS, a universal generative retrieval framework supporting diverse tasks across multiple modalities and domains. At its core, GENIUS introduces modality-decoupled semantic quantization, transforming multimodal data into discrete IDs encoding both modality and semantics. Moreover, to enhance generalization, we propose a query augmentation that interpolates between a query and its target, allowing GENIUS to adapt to varied query forms. Evaluated on the M-BEIR benchmark, it surpasses prior generative methods by a clear margin. Unlike embedding-based retrieval, GENIUS consistently maintains high retrieval speed across database size, with competitive performance across multiple benchmarks. With additional re-ranking, GENIUS often achieves results close to those of embedding-based methods while preserving efficiency.",
    "citationCount": 3,
    "referenceCount": 63
}