{
    "paperId": "6d872a93566ccf29dbd8223a6fe3e86518b5704e",
    "title": "Two Birds with One Stone: Unified Model Learning for Both Recall and Ranking in News Recommendation",
    "year": 2021,
    "venue": "Findings",
    "authors": [
        "Chuhan Wu",
        "Fangzhao Wu",
        "Tao Qi",
        "Yongfeng Huang"
    ],
    "doi": "10.18653/v1/2022.findings-acl.274",
    "arxivId": "2104.07404",
    "url": "https://www.semanticscholar.org/paper/6d872a93566ccf29dbd8223a6fe3e86518b5704e",
    "isOpenAccess": true,
    "openAccessPdf": "https://aclanthology.org/2022.findings-acl.274.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recall and ranking are two critical steps in personalized news recommendation. Most existing news recommender systems conduct personalized news recall and ranking separately with different models. However, maintaining multiple models leads to high computational cost and poses great challenges to meeting the online latency requirement of news recommender systems. In order to handle this problem, in this paper we propose UniRec, a unified method for recall and ranking in news recommendation. In our method, we first infer user embedding for ranking from the historical news click behaviors of a user using a user encoder model. Then we derive the user embedding for recall from the obtained user embedding for ranking by using it as the attention query to select a set of basis user embeddings which encode different general user interests and synthesize them into a user embedding for recall. The extensive experiments on benchmark dataset demonstrate that our method can improve both efficiency and effectiveness for recall and ranking in news recommendation.",
    "citationCount": 26,
    "referenceCount": 37
}