{
    "paperId": "6dbe653debd3c0278108a832ea2894654fb999d9",
    "title": "Knowledge Graph Based on Reinforcement Learning: A Survey and New Perspectives",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Qingfeng Huo",
        "Huaqiao Fu",
        "Caixia Song",
        "Qingshuai Sun",
        "Pengmin Xu",
        "Kejia Qu",
        "Huiyu Feng",
        "Chuanqi Liu",
        "Jiajia Ren",
        "Yuanhong Tang",
        "Tongwei Li"
    ],
    "doi": "10.1109/ACCESS.2024.3479774",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6dbe653debd3c0278108a832ea2894654fb999d9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Knowledge graph is a form of data representation that uses graph structure to model the connections between things. The intention of knowledge graph is to optimize the results returned by search engines and enhance user search quality and experience. With the continuous development of intelligent information service applications, knowledge graphs have been widely used in question-answering, semantic search, recommender system, language understanding, and advanced analysis, etc. Knowledge graph construction process includes knowledge representation, knowledge extraction, knowledge fusion and knowledge reasoning. However, in the research of knowledge graphs, there are still some challenges. For example, knowledge representation methods require prior knowledge and manually defined rules. In knowledge extraction, it is difficult to obtain labeled data. Knowledge fusion issues of effectively and efficiently integrating big data and heterogeneous data need to be addressed urgently. The interpretability and reliability of knowledge reasoning need to be further improved. Reinforcement Learning (RL) is an effective method for solving sequential decision-making problems. Through continuous interaction with the environment, the goal of optimizing the knowledge graph is gradually achieved in the process of action selection and state update. This paper aims to provide a comprehensive review of recent research efforts on RL-based knowledge graph. More concretely, we provide and devise a taxonomy of RL-based knowledge graph models, along with providing a comprehensive summary of the state-of-the-art. Various applications of knowledge graphs based on RL are introduced. Finally, we expand on current trends and provide new perspectives pertaining to this new exciting development of the field.",
    "citationCount": 1,
    "referenceCount": 195
}