{
    "paperId": "6dbf38c882eeca97df4128d459a8fdcf77db03f8",
    "title": "Virtualizing Cloud Data Infrastructures with BRAD",
    "year": 2025,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Geoffrey X. Yu",
        "Ziniu Wu",
        "Ferdinand Kossmann",
        "Tianyu Li",
        "Markos Markakis",
        "Amadou Latyr Ngom",
        "Sophie Zhang",
        "Tim Kraska",
        "Samuel Madden"
    ],
    "doi": "10.1145/3722212.3725141",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6dbf38c882eeca97df4128d459a8fdcf77db03f8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Organizations usually manage their data using multiple specialized cloud database engines (e.g., Aurora, BigQuery, etc.). However, designing and managing multi-engine infrastructures is hard; there can be many designs, each with different performance and costs. Changing the design afterwards (e.g., due to growth) is even more challenging since application code usually ends up tightly coupled to the engines. We propose data infrastructure virtualization. The key idea is to declare a set of virtual database engines (VDBEs), which specify an engine's application-facing properties (e.g., query interface, performance) and its tables, but do not prescribe a concrete engine. An automated planner then decides how to best realize the VDBEs onto physical engines based on the workload. Clients connect to VDBE endpoints and are oblivious to the underlying physical engines-allowing for seamless infrastructure changes. We implemented VDBEs and an automated planner in BRAD: the first data infrastructure virtualization runtime. Our demo will showcase VDBEs and BRAD's automated planner under different workloads.",
    "citationCount": 0,
    "referenceCount": 7
}