{
    "paperId": "6dc0abdff70ee15b558ee4c9a936d64d4aba32b3",
    "title": "The Black-Box Simplex Architecture for Runtime Assurance of Autonomous CPS",
    "year": 2021,
    "venue": "NASA Formal Methods",
    "authors": [
        "Usama Mehmood",
        "S. Sheikhi",
        "Stanley Bak",
        "S. Smolka",
        "S. Stoller"
    ],
    "doi": "10.1007/978-3-031-06773-0_12",
    "arxivId": "2102.12981",
    "url": "https://www.semanticscholar.org/paper/6dc0abdff70ee15b558ee4c9a936d64d4aba32b3",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2102.12981",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Simplex Architecture is a runtime assurance framework where control authority may switch from an unverified and potentially unsafe advanced controller to a backup baseline controller in order to maintain the safety of an autonomous cyber-physical system. In this work, we show that runtime checks can replace the requirement to statically verify safety of the baseline controller. This is important as there are many powerful control techniques, such as model-predictive control and neural network controllers, that work well in practice but are difficult to statically verify. Since the method does not use internal information about the advanced or baseline controller, we call the approach the Black-Box Simplex Architecture. We prove the architecture is safe and present two case studies where (i) model-predictive control provides safe multi-robot coordination, and (ii) neural networks provably prevent collisions in groups of F-16 aircraft, despite the controllers occasionally outputting unsafe commands.",
    "citationCount": 13,
    "referenceCount": 37
}