{
    "paperId": "6dca3850deabd6fd802867d17cb3ae3d1813a2ca",
    "title": "An Overview of AI and Blockchain Integration for Privacy-Preserving",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Zongwei Li",
        "D. Kong",
        "Yuanzheng Niu",
        "Hongli Peng",
        "Xiaoqi Li",
        "Wenkai Li"
    ],
    "doi": "10.48550/arXiv.2305.03928",
    "arxivId": "2305.03928",
    "url": "https://www.semanticscholar.org/paper/6dca3850deabd6fd802867d17cb3ae3d1813a2ca",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.03928",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the widespread attention and application of artificial intelligence (AI) and blockchain technologies, privacy protection techniques arising from their integration are of notable significance. In addition to protecting privacy of individuals, these techniques also guarantee security and dependability of data. This paper initially presents an overview of AI and blockchain, summarizing their combination along with derived privacy protection technologies. It then explores specific application scenarios in data encryption, de-identification, multi-tier distributed ledgers, and k-anonymity methods. Moreover, the paper evaluates five critical aspects of AI-blockchain-integration privacy protection systems, including authorization management, access control, data protection, network security, and scalability. Furthermore, it analyzes the deficiencies and their actual cause, offering corresponding suggestions. This research also classifies and summarizes privacy protection techniques based on AI-blockchain application scenarios and technical schemes. In conclusion, this paper outlines the future directions of privacy protection technologies emerging from AI and blockchain integration, including enhancing efficiency and security to achieve a more comprehensive privacy protection of privacy.",
    "citationCount": 27,
    "referenceCount": 61
}