{
    "paperId": "6dd307322a2767cc6a3d5d425301a52ce1edbb60",
    "title": "Designing Deep Reinforcement Learning for Human Parameter Exploration",
    "year": 2019,
    "venue": "ACM Trans. Comput. Hum. Interact.",
    "authors": [
        "Hugo Scurto",
        "Bavo Van Kerrebroeck",
        "Baptiste Caramiaux",
        "Frédéric Bevilacqua"
    ],
    "doi": "10.1145/3414472",
    "arxivId": "1907.00824",
    "url": "https://www.semanticscholar.org/paper/6dd307322a2767cc6a3d5d425301a52ce1edbb60",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.archives-ouvertes.fr/hal-03124053/file/tochi2021authorsversion.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Software tools for generating digital sound often present users with high-dimensional, parametric interfaces, that may not facilitate exploration of diverse sound designs. In this article, we propose to investigate artificial agents using deep reinforcement learning to explore parameter spaces in partnership with users for sound design. We describe a series of user-centred studies to probe the creative benefits of these agents and adapting their design to exploration. Preliminary studies observing users’ exploration strategies with parametric interfaces and testing different agent exploration behaviours led to the design of a fully-functioning prototype, called Co-Explorer, that we evaluated in a workshop with professional sound designers. We found that the Co-Explorer enables a novel creative workflow centred on human–machine partnership, which has been positively received by practitioners. We also highlight varied user exploration behaviours throughout partnering with our system. Finally, we frame design guidelines for enabling such co-exploration workflow in creative digital applications.",
    "citationCount": 22,
    "referenceCount": 117
}