{
    "paperId": "6de5bb6e952da0fa1c49f25cb4a2dd6e602da080",
    "title": "The Pros and Cons of Adversarial Robustness",
    "year": 2023,
    "venue": "International Conference on Agents and Artificial Intelligence",
    "authors": [
        "Yacine Izza",
        "João Marques-Silva"
    ],
    "doi": "10.48550/arXiv.2312.10911",
    "arxivId": "2312.10911",
    "url": "https://www.semanticscholar.org/paper/6de5bb6e952da0fa1c49f25cb4a2dd6e602da080",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Robustness is widely regarded as a fundamental problem in the analysis of machine learning (ML) models. Most often robustness equates with deciding the non-existence of adversarial examples, where adversarial examples denote situations where small changes on some inputs cause a change in the prediction. The perceived importance of ML model robustness explains the continued progress observed for most of the last decade. Whereas robustness is often assessed locally, i.e. given some target point in feature space, robustness can also be defined globally, i.e. where any point in feature space can be considered. The importance of ML model robustness is illustrated for example by the existence of competitions evaluating the progress of robustness tools, namely in the case of neural networks (NNs) but also by efforts towards robustness certification. More recently, robustness tools have also been used for computing rigorous explanations of ML models. In contrast with the observed successes of robustness, this paper uncovers some limitations with existing definitions of robustness, both global and local, but also with efforts towards robustness certification. The paper also investigates uses of adversarial examples besides those related with robustness.",
    "citationCount": 1,
    "referenceCount": 90
}