{
    "paperId": "6e3812c5132f118ab0ca8f00f1e44942a9cb3d3f",
    "title": "A novel sustainable value co-creation improvement framework based on group attractiveness matching-graph neural network",
    "year": 2025,
    "venue": "Kybernetes",
    "authors": [
        "Yang Yang",
        "Jun Wu",
        "Qiushuang Zheng"
    ],
    "doi": "10.1108/k-05-2024-1381",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6e3812c5132f118ab0ca8f00f1e44942a9cb3d3f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeSustainable value co-creation has become a critical target in open innovation communities (OICs). This study aims to provide a novel sustainable value co-creation improvement framework by promoting high-quality innovation resources.Design/methodology/approachThis study constructs a novel sustainable value co-creation improvement framework based on the group attractiveness matching-graph neural network (GAM-GNN). The framework describes the OIC as a user-idea hypernetwork structure and comprises three modules: group attractiveness characteristics monitoring, diverse-orientation matching and effective interaction recommendation module.FindingsThe experiment uses data from a well-known smartphone community. Our method outperforms existing models. The accuracy is 84.63, and the F1 score is 0.8036. The accuracy of our method increases by 2.96% for GraphSage, 3.72% for graph isomorphism network, 20.40% for graph-auto encoder, 51.88% for graph convolutional network, 9.14% for graph attention network and 66.92% for convolutional neural network.Originality/valueThis study extends the effectiveness perspective of sustainable value co-creation by integrating insights from group dynamics theory and group attractiveness effects. This provides practical guidance for enterprises to improve sustainable value co-creation.",
    "citationCount": 0,
    "referenceCount": 87
}