{
    "paperId": "6e450b2fcb0892c8ae5f38be456fca6690e571db",
    "title": "HENN: A Hierarchical Epsilon Net Navigation Graph for Approximate Nearest Neighbor Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Mohsen Dehghankar",
        "Abolfazl Asudeh"
    ],
    "doi": "10.48550/arXiv.2505.17368",
    "arxivId": "2505.17368",
    "url": "https://www.semanticscholar.org/paper/6e450b2fcb0892c8ae5f38be456fca6690e571db",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hierarchical graph-based algorithms such as HNSW have achieved state-of-the-art performance for Approximate Nearest Neighbor (ANN) search in practice, yet they often lack theoretical guarantees on query time or recall due to their heavy use of randomized heuristic constructions. Conversely, existing theoretically grounded structures are typically difficult to implement and struggle to scale in real-world scenarios. We propose the Hierarchical $\\varepsilon$-Net Navigation Graph (HENN), a novel graph-based indexing structure for ANN search that combines strong theoretical guarantees with practical efficiency. Built upon the theory of $\\varepsilon$-nets, HENN guarantees polylogarithmic worst-case query time while preserving high recall and incurring minimal implementation overhead. Moreover, we establish a probabilistic polylogarithmic query time bound for HNSW, providing theoretical insight into its empirical success. In contrast to these prior hierarchical methods that may degrade to linear query time under adversarial data, HENN maintains provable performance independent of the input data distribution. Empirical evaluations demonstrate that HENN achieves faster query time while maintaining competitive recall on diverse data distributions, including adversarial inputs. These results underscore the effectiveness of HENN as a robust and scalable solution for fast and accurate nearest neighbor search.",
    "citationCount": 0,
    "referenceCount": 38
}