{
    "paperId": "6e6958849524a005b7e8af7f1d63e91eb85ad38c",
    "title": "BloomACS: Bloom Filter-Based Access Control Scheme in Blockchain-Enabled V2G Networks",
    "year": 2024,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Arzoo Miglani",
        "Neeraj Kumar"
    ],
    "doi": "10.1109/TITS.2024.3421562",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6e6958849524a005b7e8af7f1d63e91eb85ad38c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advancements in Vehicle-to-Grid (V2G) lead to efficient service provisions, such as eco-friendly environment, demand response management, charging, and discharging to the end-users. However, security and privacy preservation for the aforementioned services are key challenges keeping in view of the dependency on the existing centralized security architectures which are not resilient to fault tolerance due to a single point of failure. Hence, there is a need to design new efficient security solutions for the current V2G network, so as to provide seamless services to the end-users. Motivated by these, in this work, we proposed a bloom filter-enabled smart contract-based scheme for access control in V2G environment. In comparison to complex signature-based cryptographic techniques, we propose bloom filter-based authentication for the registered nodes for efficient storage and searching of stored data on the blockchain network. We also designed the Proof-of-Authority (PoA) consensus mechanism, which selects authority nodes dynamically to verify various transactions on the blockchain network. To validate the proposal, we implemented it on the Ethereum network on benchmark datasets using various evaluation parameters such as- latency, throughput, false positive probability, and gas cost.",
    "citationCount": 1,
    "referenceCount": 42
}