{
    "paperId": "6e77d9e228f17707544c0bdc70130bd5d2e62108",
    "title": "The Impact of a Skill-Driven Model on Scrum Teams in Software Projects: A Catalyst for Digital Transformation",
    "year": 2024,
    "venue": "Syst.",
    "authors": [
        "Vayodya Haputhanthrige",
        "Ikram Asghar",
        "Sidra Saleem",
        "Saqib Shamim"
    ],
    "doi": "10.3390/systems12050149",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6e77d9e228f17707544c0bdc70130bd5d2e62108",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-8954/12/5/149/pdf?version=1714123378",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Human skills are a critical factor in the success or failure of a digital project. Limited studies have been conducted to identify the industry demand for skills of scrum roles (product owner, scrum master, web developer) and levels (entry, associate, mid-senior). The evaluation of skills over time benefits both decision-makers and associated team members, which leads to successful project completions. The aim of this research is to improve decision making concerning the level-specific skills of selected scrum roles for digital projects. The study identifies major and minor skills, patterns, and relationships between levels, and formulates the mathematical equations as the most important inputs to the skill-driven model’s implementation and evaluation. Both qualitative and quantitative research methods were used to analyse 900 surveyed job advertisements published on LinkedIn in Europe. Descriptive analysis was used to analyse quantitative data while the deductive approach was followed with thematic analysis. There are required skill sets for each level of roles, level-specific skills, industry-demanded skills, and formulas related to the initial and individual skill ratings that are investigated. A new mechanism for evaluation is introduced based on “the time spent with skills”. As a result, the proposed model is implemented by feeding research findings into the Mendix programming platform. The skill-driven model is a decision-support solution in software project management to evaluate skills which assist in assigning the right person to the right digital project. Further investigation on different job portals can help to improve the accuracy of industry standards and reduce the lack of progression skills by overcoming limitations identified in this paper.",
    "citationCount": 7,
    "referenceCount": 94
}