{
    "paperId": "6e9295e7ab3f15c5042277e4187f035a10fdd640",
    "title": "An Intelligent Memory Framework for Resource Constrained IoT Systems",
    "year": 2024,
    "venue": "IEEE Computer Society Annual Symposium on VLSI",
    "authors": [
        "Prabuddha Chakraborty",
        "S. Bhunia"
    ],
    "doi": "10.1109/ISVLSI61997.2024.00061",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6e9295e7ab3f15c5042277e4187f035a10fdd640",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Internet-of-Things systems are being widely used in diverse applications ranging from healthcare and retail to surveillance and smart agriculture. However the memory in these IoT applications can become a severe bottleneck particularly for resource-constrained edge systems. In this work we will discuss different existing Artificial Intelligence (AI) driven techniques that can lead to improved memory performance. Particularly we will discuss BINGO, a recently proposed reinforcement learning guided framework that can boost memory performance for application-specific edge systems by mimicking human brain properties such as data-awareness, forgetfulness, preferential access, and plasticity. We will highlight, through quantitative analysis, the effectiveness of the BINGO framework for a context-switching application that prioritizes different data over time. Finally, we will present different pathways for future research directions in this emerging area of research.",
    "citationCount": 1,
    "referenceCount": 17
}