{
    "paperId": "6f0d8fcefb555732cad626d1f215232ae65750eb",
    "title": "Assured Point Cloud Perception",
    "year": 2023,
    "venue": "International Conference on Applied Algorithms",
    "authors": [
        "Chris R. Serrano",
        "A. Nogin",
        "Michael A. Warren"
    ],
    "doi": "10.1109/ICAA58325.2023.00025",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6f0d8fcefb555732cad626d1f215232ae65750eb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing work on verification of neural networks has largely focused on the image domain, where issues of adversarial robustness are the main concern. In this paper, we exploit the geometric nature of point cloud data that makes it a natural domain in which neural network verification technology can provide even stronger guarantees. We illustrate this in the context of estimation of surface normals by showing how neural network verification can be used to analyze correctness properties related to this task, thereby allowing proofs of correctness that provide universally quantified guarantees over positive measure sets of patches. Whereas previous applications of neural network verification to point clouds have focused on the task of classification, here we apply neural network verification to point cloud regression. Our contribution includes a novel representation of local point cloud patches invariant to point cloud density, as well as small network architectures that can be more readily analyzed by existing neural network verification tools and may be more suitable for deployment on size, weight and power constrained platforms than state-of-the-art architectures. Our approach allows for a model trained only in simulation to successfully transfer to diverse real-world systems (including on a US Army autonomous vehicle platform) and sensors without any additional training or fine-tuning. Applying our input representation to existing approaches achieves improved performance on unoriented surface normals in low-noise environments.",
    "citationCount": 0,
    "referenceCount": 44
}