{
    "paperId": "6f62a093a8a81d39e6af66e9eef68bce798aafcf",
    "title": "A Comparative Analysis of Deep Learning Models for SMS Spam Detection: CNN-LSTM, CNN-GRU, and ResNet Approaches",
    "year": 2024,
    "venue": "Journal of Computer Networks, Architecture and High Performance Computing",
    "authors": [
        "Gregorius Airlangga"
    ],
    "doi": "10.47709/cnahpc.v6i4.4827",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6f62a093a8a81d39e6af66e9eef68bce798aafcf",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.47709/cnahpc.v6i4.4827",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spam messages have become a growing challenge in mobile communication, threatening user security and data privacy. Traditional spam detection methods, including rule-based and machine learning techniques, are increasingly insufficient due to the evolving sophistication of spam tactics. This research evaluates the effectiveness of advanced deep learning models such as CNN-LSTM, CNN-GRU, and ResNet for SMS spam detection. The dataset used consists of diverse SMS messages labeled as either spam or legitimate (ham), ensuring broad coverage of real-world spam patterns. The study employs a robust ten-fold cross-validation approach to assess the generalization capabilities of the models, measuring performance based on accuracy, precision, recall, and F1 score. The results indicate that ResNet outperformed the other models, achieving an average accuracy of 99.08% and an F1 score of 0.9646, making it the most reliable model for spam detection. CNN-GRU demonstrated competitive performance with a balance between accuracy (98.97%) and computational efficiency, making it suitable for real-time applications. CNN-LSTM, while highly accurate (98.92%), showed a slightly lower recall compared to the other models, indicating a more cautious approach to detecting spam. These findings highlight the potential of hybrid deep learning models in addressing the complexities of SMS spam detection. Future research could focus on optimizing these models for deployment in resource-constrained environments, such as mobile devices, and further exploring the integration of residual connections for more effective spam filtering.",
    "citationCount": 2,
    "referenceCount": 47
}