{
    "paperId": "6fc3895a08b17522fc38c5f597e25ee9aaeeaf24",
    "title": "Science and Society: Pathways to Equitable Access and Delivery of Genomics Medicine in Africa",
    "year": 2025,
    "venue": "Current Genetic Medicine Reports",
    "authors": [
        "N. S. Munung"
    ],
    "doi": "10.1007/s40142-024-00211-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/6fc3895a08b17522fc38c5f597e25ee9aaeeaf24",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s40142-024-00211-0",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose of Review Recent advances in genetics are pushing the frontiers of health research in Africa. Notable developments include the release of the draft human pangenome reference, regulatory approval of gene editing therapies for sickle cell disease, and the announcements of major initiatives such as the Ghana Genome Project, the Personalized Medicine in North Africa Initiative, Nigeria’s 100K Genome Project and South Africa’s 110K Human Genomes Project. Additionally, gene-based therapies for HIV are on the horizon, with clinical trials planned in some African countries. Despite this progress, a pressing challenge remains: ensuring equitable access and delivery of genomics medicine worldwide, particularly in Africa and other low and middle income regions. Summary and a Call to Action Science diplomacy and academic-industry partnerships are key to achieving \"Genomics for All.\" This requires collaboration between African governments, academic institutions, funding agencies, commercial biotechnology companies, civil society, and international health organizations. Together, these stakeholders must define and establish a sustainable framework to support genetic research in Africa, increase the availability of genetic data from African populations, and set-up translational genomics medicine initiatives tailored to the continent’s unique healthcare needs. Science advocacy and diplomacy is also needed to establish mechanisms that prevent the hoarding of genetic resources, including genetic data and novel interventions, and guarantee equitable access to the scientific, medical and economic benefits of genomics for all nations. Achieving this vision may necessitate international treaties to promote equitable access to genomic innovations, responsible and ethical cross-border data sharing, and long-term strategies to address funding gaps in genomic research and its application in medicine and healthcare in Africa.",
    "citationCount": 3,
    "referenceCount": 51
}