{
    "paperId": "7005fa25ba89b46ec56d516d2c515ddc362d2497",
    "title": "Twin-Layer Deep Learning Model with IoT Integration for Intelligent Pest Detection in Smart Farming",
    "year": 2025,
    "venue": "2025 Fourth International Conference on Smart Technologies, Communication and Robotics (STCR)",
    "authors": [
        "R. Sankar",
        "M. Anubala",
        "M. Hemalatha",
        "U. Lavanya",
        "S. Narmadha"
    ],
    "doi": "10.1109/STCR62650.2025.11020488",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7005fa25ba89b46ec56d516d2c515ddc362d2497",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Smart farming needs accurate pest detection models. This research develops an efficient pest classification system using deep learning and IoT integration. An improved YOLOv8 model extracts features and detects pests. A deep neural network (DNN) classifies detected pests. The proposed Cross-Scale Attention Gradient Pruning enhances learning efficiency in both YOLOv8 and DNN. The Cross-Scale Attention Gradient Pruning method reduces redundant computations. It focuses on essential features for accurate detection and classification. This improves processing speed and reduces memory usage. The method ensures real-time pest detection in smart farming. The IoT framework collects and transmits real-time images to the deep learning model. The lightweight model allows deployment on resource-limited devices. Experimental results show that the proposed method achieves higher accuracy than existing models. The pruning technique reduces model size while maintaining classification precision. The system detects and classifies pests in real-world farming environments. The improved YOLOv8 architecture enhances object detection with better feature extraction. The DNN classifier ensures reliable pest identification. The model outperforms conventional deep learning approaches in accuracy and efficiency.",
    "citationCount": 1,
    "referenceCount": 21
}