{
    "paperId": "700924da9eb3316799c5359e4701fc2bc9fa8672",
    "title": "DL-RMD: a geophysically constrained electromagnetic resistivity model database (RMD) for deep learning (DL) applications",
    "year": 2023,
    "venue": "Earth System Science Data",
    "authors": [
        "M. R. Asif",
        "N. Foged",
        "T. Bording",
        "J. Larsen",
        "A. Christiansen"
    ],
    "doi": "10.5194/essd-15-1389-2023",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/700924da9eb3316799c5359e4701fc2bc9fa8672",
    "isOpenAccess": true,
    "openAccessPdf": "https://essd.copernicus.org/articles/15/1389/2023/essd-15-1389-2023.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geology",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract. Deep learning (DL) algorithms have shown incredible potential\nin many applications. The success of these data-hungry methods is largely\nassociated with the availability of large-scale datasets, as millions of\nobservations are often required to achieve acceptable performance levels.\nRecently, there has been an increased interest in applying deep learning\nmethods to geophysical applications where electromagnetic methods are used\nto map the subsurface geology by observing variations in the electrical\nresistivity of the subsurface materials. To date, there are no standardized\ndatasets for electromagnetic methods, which hinders the progress,\nevaluation, benchmarking, and evolution of deep learning algorithms due to\ndata inconsistency. Therefore, we present a large-scale electrical\nresistivity model database (RMD) with a wide variety of geologically plausible and\ngeophysically resolvable subsurface structures for the commonly deployed\nground-based and airborne electromagnetic systems. Potentially, the\npresented database can be used to build surrogate models of well-known\nprocesses and to aid in labour-intensive tasks. The geophysically\nconstrained property of this database will not only achieve enhanced\nperformance and improved generalization but, more importantly,\nincorporate consistency and credibility into deep learning models. We show the\neffectiveness of the presented database by surrogating the forward-modelling\nprocess, and we urge the geophysical community interested in deep learning\nfor electromagnetic methods to utilize the presented database. The dataset\nis publicly available at https://doi.org/10.5281/zenodo.7260886\n(Asif et al., 2022a).\n",
    "citationCount": 13,
    "referenceCount": 91
}