{
    "paperId": "701c738395ead4ee4c4e782e1406bc4648eddf62",
    "title": "Rank4Class: A Ranking Formulation for Multiclass Classification",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Nan Wang",
        "Zhen Qin",
        "Le Yan",
        "Honglei Zhuang",
        "Xuanhui Wang",
        "Michael Bendersky",
        "Marc Najork"
    ],
    "doi": null,
    "arxivId": "2112.09727",
    "url": "https://www.semanticscholar.org/paper/701c738395ead4ee4c4e782e1406bc4648eddf62",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multiclass classification (MCC) is a fundamental machine learning problem of classifying each instance into one of a predefined set of classes. In the deep learning era, extensive efforts have been spent on developing more powerful neural embedding models to better represent the instance for improving MCC performance. In this paper, we do not aim to propose new neural models for instance representation learning, but to show that it is promising to boost MCC performance with a novel formulation through the lens of ranking. In particular, by viewing MCC as to rank classes for an instance, we first argue that ranking metrics, such as Normalized Discounted Cumulative Gain, can be more informative than the commonly used Top-$K$ metrics. We further demonstrate that the dominant neural MCC recipe can be transformed to a neural ranking framework. Based on such generalization, we show that it is intuitive to leverage advanced techniques from the learning to rank literature to improve the MCC performance out of the box. Extensive empirical results on both text and image classification tasks with diverse datasets and backbone neural models show the value of our proposed framework.",
    "citationCount": 4,
    "referenceCount": 55
}