{
    "paperId": "702139fcaa687cf8f8bda8d942735923def2774a",
    "title": "Integrating genomics and transcriptomics to identify candidate genes for high-altitude adaptation and egg production in Nixi chicken",
    "year": 2024,
    "venue": "British Poultry Science",
    "authors": [
        "C. Deng",
        "M. Li",
        "T. Wang",
        "W. Duan",
        "A. Guo",
        "G. Ma",
        "F. Yang",
        "F. Dai",
        "Q. Li"
    ],
    "doi": "10.1080/00071668.2024.2367228",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/702139fcaa687cf8f8bda8d942735923def2774a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT 1. This study combined genome-wide selection signal analysis with RNA-sequencing to identify candidate genes associated with high altitude adaptation and egg production performance in Nixi chickens (NXC). 2. Based on the whole-genome data from 20 NXC (♂:10; ♀:10), the population selection signal was analysed by sliding window analysis. The selected genes were screened by combination with the population differentiation statistic (FST). The sequence diversity statistic (θπ). RNA-seq was performed on the ovarian tissues of NXC (n = 6) and Lohmann laying hens (n = 6) to analyse the differentially expressed genes (DEGs) between the two groups. The functional enrichment analysis of the selected genes and differentially expressed genes was performed. 3. There were 742 genes under strong positive selection and 509 differentially expressed genes screened in NXC. Integrated analysis of the genome and transcriptome revealing 26 overlapping genes. The candidate genes for adaptation to a high-altitude environment, as well as for egg production, disease resistance, vision and pigmentation in NXC were preliminarily screened. 4. The results provided theoretical guidance for further research on the genetic resource protection and utilisation of NXC.",
    "citationCount": 2,
    "referenceCount": 110
}