{
    "paperId": "706f4eb2396b6c7c46db3d68399218e9bf1eb7f8",
    "title": "A Review on Impact of Bloom Filter on Named Data Networking: The Future Internet Architecture",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Sabuzima Nayak",
        "Ripon Patgiri",
        "Angana Borah"
    ],
    "doi": null,
    "arxivId": "2005.06965",
    "url": "https://www.semanticscholar.org/paper/706f4eb2396b6c7c46db3d68399218e9bf1eb7f8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Today is the era of smart devices. Through the smart devices, people remain connected with systems across the globe even in mobile state. Hence, the current Internet is facing scalability issue. Therefore, leaving IP based Internet behind due to scalability, the world is moving to the Future Internet Architecture, called Named Data Networking (NDN). Currently, the number of nodes connected to the Internet is in billions. And, the number of requests sent is in millions per second. NDN handles such huge numbers by modifying the IP architecture to meet the current requirements. NDN is scalable, produces less traffic and congestion, provides high level security, saves bandwidth, efficiently utilizes multiple network interfaces and have many more functionalities. Similarly, Bloom Filter is the only good choice to deploy in various modules of NDN to handle the huge number of packets. Bloom Filter is a simple probabilistic data structure for the membership query. This article presents a detailed discussion on the role of Bloom Filter in implementing NDN. The article includes a precise discussion on Bloom Filter and the main components of the NDN architecture, namely, packet, content store, forward information base and pending interest table are also discussed briefly.",
    "citationCount": 0,
    "referenceCount": 126
}