{
    "paperId": "708dc59c76e7bf713870783d831c33f9bb3e08ff",
    "title": "D2Comp: Efficient Offload of LSM-tree Compaction with Data Processing Units on Disaggregated Storage",
    "year": 2024,
    "venue": "ACM Transactions on Architecture and Code Optimization (TACO)",
    "authors": [
        "Chen Ding",
        "Jian Zhou",
        "Kai Lu",
        "Sicen Li",
        "Yiqin Xiong",
        "Jiguang Wan",
        "Ling Zhan"
    ],
    "doi": "10.1145/3656584",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/708dc59c76e7bf713870783d831c33f9bb3e08ff",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3656584",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "LSM-based key-value stores suffer from sub-optimal performance due to their slow and heavy background compactions. The compaction brings severe CPU and network overhead on high-speed disaggregated storage. This article further reveals that data-intensive compression in compaction consumes a significant portion of CPU power. Moreover, the multi-threaded compactions cause substantial CPU contention and network traffic during high-load periods. Based on the above observations, we propose fine-grained dynamical compaction offloading by leveraging the modern Data Processing Unit (DPU) to alleviate the CPU and network overhead. To achieve this, we first customized a file system to enable efficient data access for DPU. We then leverage the Arm cores on the DPU to meet the burst CPU and network requirements to reduce resource contention and data movement. We further employ dedicated hardware-based accelerators on the DPU to speed up the compression in compactions. We integrate our DPU-offloaded compaction with RocksDB and evaluate it with NVIDIA’s latest Bluefield-2 DPU on a real system. The evaluation shows that the DPU is an effective solution to solve the CPU bottleneck and reduce data traffic of compaction. The results show that compaction performance is accelerated by 2.86 to 4.03 times, system write and read throughput is improved by up to 3.2 times and 1.4 times respectively, and host CPU contention and network traffic are effectively reduced compared to the fine-tuned CPU-only baseline.",
    "citationCount": 6,
    "referenceCount": 46
}