{
    "paperId": "70cfb100468c08fc4c0628733e939ceaeace02e3",
    "title": "BANANA REIGNS WILT BASED ON MACHINE LEARNING AND UAV-BASED MULTISPECTRAL IMAGERY",
    "year": 2025,
    "venue": "Geographia Technica",
    "authors": [
        "Q. Nguyen",
        "Q. Du",
        "Viet Thanh Pham",
        "Hong Nhat Vuong",
        "Van Hong Nguyen",
        "Tran Van Sang",
        "A. Petrisor"
    ],
    "doi": "10.21163/gt_2025.201.22",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/70cfb100468c08fc4c0628733e939ceaeace02e3",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.21163/gt_2025.201.22",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Reigns Wilt disease is one of the diseases that cause serious damage to crops in tropical monsoon regions. Among them, banana wilt disease is one of the common and worrying problems, especially in Vietnam. Therefore, monitoring and surveillance of reigning wilt disease in crops in general and bananas in particular is an important task, helping to improve crop productivity and quality. The objective of this study is to develop a method based on machine learning and data from unmanned aerial vehicles (UAVs), namely AdaBoost (ADB), Deep neural network (DNN), Random Forest (RF), and Support vector machine (SVM) models, to monitor banana reigns wilt. The study was carried out in Ly Nhan district, Ha Nam province, Vietnam. To evaluate the performance of the proposed models, statistical indices such as the area under the curve (AUC), the root mean squared error (RMSE), and the mean absolute error (MAE) were used. The results showed that all proposed models, combined with UAV data, were successful in zoning and monitoring banana wilt disease. The ADB model gave the best results with an AUC value of 0.98, followed by the DNN model with an AUC of 0.96, RF with 0.95 and SVM with 0.94. In addition, the results also showed that areas with high and very high levels of leaf wilt disease were concentrated in the south and the edge of the garden, possibly due to the influence of external factors and ineffective care conditions. This study is important to provide an effective and accurate tool to monitor plant health, especially banana plants. The research results not only help to detect diseased areas early, but also help farmers and managers take timely interventions, thereby improving crop productivity and quality while contributing to the development of sustainable agriculture.",
    "citationCount": 0,
    "referenceCount": 50
}