{
    "paperId": "711b09ec49a504a99f7562539fe7b3c4abbb4f4e",
    "title": "Evolving Knowledge Management: Artificial Intelligence and the Dynamics of Social Interactions",
    "year": 2025,
    "venue": "IEEE Engineering Management Review",
    "authors": [
        "Xiaomei He",
        "Thierry Burger-Helmchen"
    ],
    "doi": "10.1109/EMR.2024.3519342",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/711b09ec49a504a99f7562539fe7b3c4abbb4f4e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article examines the integration of artificial intelligence (AI) in knowledge management (KM), highlighting how AI reshapes traditional KM practices in organizations. It starts by reviewing historical KM frameworks, particularly the SECI model, which emphasizes the transformation between tacit and explicit knowledge. It differentiates generative AI from earlier AI models in terms of output nature, learning adaptability, and application scope. The study explores AI's potential to improve KM processes, focusing on how it influences social interactions, facilitates knowledge community development, and fosters collaborative intelligence by leveraging the strengths of both AI and human capabilities. AI's transformative role in KM includes enhancing knowledge creation, storage, and dissemination, accelerating processes like externalization and combination in the SECI model. However, the article notes AI's current limitations in managing tacit knowledge and human-centric decision-making. The research underscores AI's capacity to streamline KM processes, improve efficiency, and unlock new opportunities for organizations. By integrating AI tools with human expertise, organizations can enhance their ability to manage, share, and apply knowledge, setting the stage for innovative approaches to knowledge-driven growth and decision-making in diverse contexts.",
    "citationCount": 4,
    "referenceCount": 98
}