{
    "paperId": "71248922c5c989bd9c50cff9e8b43642034ea6fc",
    "title": "Augmenting Ad-Hoc IR Dataset for Interactive Conversational Search",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Pierre Erbacher",
        "Jian-Yun Nie",
        "P. Preux",
        "Laure Soulier"
    ],
    "doi": "10.48550/arXiv.2311.06119",
    "arxivId": "2311.06119",
    "url": "https://www.semanticscholar.org/paper/71248922c5c989bd9c50cff9e8b43642034ea6fc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A peculiarity of conversational search systems is that they involve mixed-initiatives such as system-generated query clarifying questions. Evaluating those systems at a large scale on the end task of IR is very challenging, requiring adequate datasets containing such interactions. However, current datasets only focus on either traditional ad-hoc IR tasks or query clarification tasks, the latter being usually seen as a reformulation task from the initial query. The only two datasets known to us that contain both document relevance judgments and the associated clarification interactions are Qulac and ClariQ. Both are based on the TREC Web Track 2009-12 collection, but cover a very limited number of topics (237 topics), far from being enough for training and testing conversational IR models. To fill the gap, we propose a methodology to automatically build large-scale conversational IR datasets from ad-hoc IR datasets in order to facilitate explorations on conversational IR. Our methodology is based on two processes: 1) generating query clarification interactions through query clarification and answer generators, and 2) augmenting ad-hoc IR datasets with simulated interactions. In this paper, we focus on MsMarco and augment it with query clarification and answer simulations. We perform a thorough evaluation showing the quality and the relevance of the generated interactions for each initial query. This paper shows the feasibility and utility of augmenting ad-hoc IR datasets for conversational IR.",
    "citationCount": 0,
    "referenceCount": 73
}