{
    "paperId": "71312c9b32b338f875d3608459769510b40664c7",
    "title": "From over-reliance to smart integration: using Large-Language Models as translators between specialized modeling and simulation tools",
    "year": 2025,
    "venue": "Social Science Research Network",
    "authors": [
        "P. Giabbanelli",
        "John Beverley",
        "Istvan David",
        "Andreas Tolk"
    ],
    "doi": "10.48550/arXiv.2506.11141",
    "arxivId": "2506.11141",
    "url": "https://www.semanticscholar.org/paper/71312c9b32b338f875d3608459769510b40664c7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language Models (LLMs) offer transformative potential for Modeling&Simulation (M&S) through natural language interfaces that simplify workflows. However, over-reliance risks compromising quality due to ambiguities, logical shortcuts, and hallucinations. This paper advocates integrating LLMs as middleware or translators between specialized tools to mitigate complexity in M&S tasks. Acting as translators, LLMs can enhance interoperability across multi-formalism, multi-semantics, and multi-paradigm systems. We address two key challenges: identifying appropriate languages and tools for modeling and simulation tasks, and developing efficient software architectures that integrate LLMs without performance bottlenecks. To this end, the paper explores LLM-mediated workflows, emphasizes structured tool integration, and recommends Low-Rank Adaptation-based architectures for efficient task-specific adaptations. This approach ensures LLMs complement rather than replace specialized tools, fostering high-quality, reliable M&S processes.",
    "citationCount": 0,
    "referenceCount": 53
}