{
    "paperId": "7184af8e3b1f8fef0f75d1a1232b9372ed168699",
    "title": "Innovative Analogous Storage Framework for IoT using Social Computing and Data Partitioning",
    "year": 2025,
    "venue": "2025 3rd International Conference on Sustainable Computing and Data Communication Systems (ICSCDS)",
    "authors": [
        "Bhavya Kadiyala",
        "Rajani Priya Nippatla",
        "Subramanyam Boyapati",
        "Chaitanya Vasamsetty",
        "Sunil Kumar Alavilli",
        "Revathi Sundarasekar"
    ],
    "doi": "10.1109/ICSCDS65426.2025.11167767",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7184af8e3b1f8fef0f75d1a1232b9372ed168699",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Advanced data management frameworks are needed to address latency, scalability, and contextual relevance issues as the Internet of Things expands exponentially. Current approaches such as reputation-based clustering or cloud and edge computing are limited by their inability to concurrently achieve high accuracy, fast retrieval, and precision, necessitating creative and integrative solutions. This project presents a new data management framework in the Internet of Things, by combining data segmentation with social computing. The objectives will be to realize accuracy enhancement, latency reduction, scalability, and efficient retrieval of data. Filling in an important gap that is left unfilled in state-of-the-art approaches, the paradigm maximizes the performance of IoT systems toward trustful context-aware decision-making. The proposed framework relies on trust-based communication and hierarchical clustering for the segmentation and retrieval of IoT data. Scalability, accuracy, and latency are key performance indicators that it is analyzed against. A comparison is done with validating the proposed framework as being superior to them. The proposed framework surpasses all the approaches that have been evaluated, with 96.1% accuracy, 94.6% scalability, 18.9 ms latency, and a 95.4 retrieval score. Improved accuracy and contextual relevance in retrieving data are two significant enhancements regarding how effectively it handles some of the IoT system's most challenging issues. The study shows that the combination of data partitioning with social computing can be used in IoT frameworks. The proposed method is a great step forward in scalable, effective IoT data management since it fills the gaps and reaches better performance metrics.",
    "citationCount": 0,
    "referenceCount": 26
}