{
    "paperId": "718dcd0320b539cc837102fb3c64e211317a2617",
    "title": "(Vision Paper) A Vision for Spatio-Causal Situation Awareness, Forecasting, and Planning",
    "year": 2024,
    "venue": "ACM Trans. Spatial Algorithms Syst.",
    "authors": [
        "Fahim Tasneema Azad",
        "K. Candan",
        "Ahmet Kapkiç",
        "Mao-Lin Li",
        "Huan Liu",
        "Pratanu Mandal",
        "Paras Sheth",
        "Bilgehan Arslan",
        "Gerardo Chowell-Puente",
        "John Sabo",
        "R. Muenich",
        "Javier Redondo Anton",
        "M. Sapino"
    ],
    "doi": "10.1145/3672556",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/718dcd0320b539cc837102fb3c64e211317a2617",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3672556",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Successfully tackling many urgent challenges in socio-economically critical domains, such as public health and sustainability, requires a deeper understanding of causal relationships and interactions among a diverse spectrum of spatio-temporally distributed entities. In these applications, the ability to leverage spatio-temporal data to obtain causally based situational awareness and to develop informed forecasts to provide resilience at different scales is critical. While the promise of a causally grounded approach to these challenges is apparent, the core data technologies needed to achieve these are in the early stages and lack a framework to help realize their potential. In this article, we argue that there is an urgent need for a novel paradigm of spatio-causal research built on computational advances in spatio-temporal data and model integration, causal learning and discovery, large scale data- and model-driven simulations, emulations, and forecasting, as well as spatio-temporal data-driven and model-centric operational recommendations, and effective causally driven visualization and explanation. We thus provide a vision, and a road map, for spatio-causal situation awareness, forecasting, and planning.",
    "citationCount": 3,
    "referenceCount": 198
}