{
    "paperId": "7192bb652b2bc6ebb487f1bfb87260d04ca94d9d",
    "title": "IDLat: An Importance-Driven Latent Generation Method for Scientific Data",
    "year": 2022,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Jingyi Shen",
        "Haoyu Li",
        "Jiayi Xu",
        "Ayan Biswas",
        "Han-Wei Shen"
    ],
    "doi": "10.1109/TVCG.2022.3209419",
    "arxivId": "2208.03345",
    "url": "https://www.semanticscholar.org/paper/7192bb652b2bc6ebb487f1bfb87260d04ca94d9d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2208.03345",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning based latent representations have been widely used for numerous scientific visualization applications such as isosurface similarity analysis, volume rendering, flow field synthesis, and data reduction, just to name a few. However, existing latent representations are mostly generated from raw data in an unsupervised manner, which makes it difficult to incorporate domain interest to control the size of the latent representations and the quality of the reconstructed data. In this paper, we present a novel importance-driven latent representation to facilitate domain-interest-guided scientific data visualization and analysis. We utilize spatial importance maps to represent various scientific interests and take them as the input to a feature transformation network to guide latent generation. We further reduced the latent size by a lossless entropy encoding algorithm trained together with the autoencoder, improving the storage and memory efficiency. We qualitatively and quantitatively evaluate the effectiveness and efficiency of latent representations generated by our method with data from multiple scientific visualization applications.",
    "citationCount": 8,
    "referenceCount": 43
}