{
    "paperId": "719eafb8dd24996463d39814be3ad0a9eba6820d",
    "title": "Integrating Multiple Database Resources to Elucidate the Gene Flow in Southeast Asian Pig Populations",
    "year": 2024,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "Guangzhen Li",
        "Yuqiang Liu",
        "Xue Feng",
        "Shuqi Diao",
        "Zhanming Zhong",
        "Bolang Li",
        "J. Teng",
        "Wenjing Zhang",
        "Haonan Zeng",
        "Xiaodian Cai",
        "Yahui Gao",
        "Xiaohong Liu",
        "Xiaolong Yuan",
        "Jiaqi Li",
        "Zhe Zhang"
    ],
    "doi": "10.3390/ijms25115689",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/719eafb8dd24996463d39814be3ad0a9eba6820d",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1422-0067/25/11/5689/pdf?version=1716468447",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The domestic pig (Sus scrofa) and its subfamilies have experienced long-term and extensive gene flow, particularly in Southeast Asia. Here, we analyzed 236 pigs, focusing on Yunnan indigenous, European commercial, East Asian, and Southeast Asian breeds, using the Pig Genomics Reference Panel (PGRP v1) of Pig Genotype-Tissue Expression (PigGTEx) to investigate gene flow and associated complex traits by integrating multiple database resources. In this study, we discovered evidence of admixtures from European pigs into the genome of Yunnan indigenous pigs. Additionally, we hypothesized that a potential conceptual gene flow route that may have contributed to the genetic composition of the Diannan small-ear pig is a gene exchange from the Vietnamese pig. Based on the most stringent gene introgression scan using the fd statistic, we identified three specific loci on chromosome 8, ranging from 51.65 to 52.45 Mb, which exhibited strong signatures of selection and harbored the NAF1, NPY1R, and NPY5R genes. These genes are associated with complex traits, such as fat mass, immunity, and litter weight, in pigs, as supported by multiple bio-functionalization databases. We utilized multiple databases to explore the potential dynamics of genetic exchange in Southeast Asian pig populations and elucidated specific gene functionalities.",
    "citationCount": 0,
    "referenceCount": 71
}