{
    "paperId": "71ab829a6d3ba31d89d64cefd08cd05495e2aef4",
    "title": "A comprehensive review of deep learning-based hyperspectral image reconstruction for agri-food quality appraisal",
    "year": 2025,
    "venue": "Artificial Intelligence Review",
    "authors": [
        "M. Ahmed",
        "Ocean Monjur",
        "A. Khaliduzzaman",
        "Mohammed Kamruzzaman"
    ],
    "doi": "10.1007/s10462-024-11090-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/71ab829a6d3ba31d89d64cefd08cd05495e2aef4",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s10462-024-11090-w",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Hyperspectral imaging (HSI) has recently emerged as a promising tool for various agricultural applications. However, high equipment cost, instrumentation complexity, and data-intensive nature have limited its widespread adoption. To overcome these challenges, reconstructing hyperspectral data from simple, cost-effective color or RGB (red-green-blue) images using advanced deep learning algorithms offers a practically attractive solution for a wide range of applications in food quality control and assurance. Through advanced deep learning algorithms, it is possible to capture and reconstruct spectral information from simple, cost-effective RGB imaging to create a reliable, efficient, and scalable system with accuracy comparable to dedicated, expensive HSI systems. This review provides a comprehensive overview of recent advances in deep learning techniques for HSI reconstruction and highlights the transformative impact of deep learning-based hyperspectral image reconstruction on agricultural and food products and anticipates a future where these innovations will lead to more advanced and widespread applications in the agri-food industry.",
    "citationCount": 26,
    "referenceCount": 63
}