{
    "paperId": "71c30ab700c313c5fc28591e539337df6bd4a01f",
    "title": "NDN Fabric: Where the Software-Defined Networking Meets the Content-Centric Model",
    "year": 2021,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "A. L. R. Madureira",
        "Francisco Renato Cavalcante Araújo",
        "Guilherme B. Araújo",
        "L. Sampaio"
    ],
    "doi": "10.1109/TNSM.2020.3044038",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/71c30ab700c313c5fc28591e539337df6bd4a01f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Named Data Networking (NDN) is a new network architecture based on the content-based model that has fundamental differences to the legacy path-based model. The first is focused on the content itself, and the latter focuses on the location of data. Both models provide different benefits to the end-user and the network, but they often cannot inter-operate due to their significant design differences. Therefore, we propose a new network architecture and protocol, both named NDN-Fab, to allow the inter-operation between path-based and content-based network architectures. NDN-Fab is based on the Fabric model and allows the edge network to operate with content-centric architectures, such as the NDN, while the core network can operate with a high-performance path-based communication model. The Core network uses the NDN-Fab protocol that can be embedded in the programmable data plane hardware of the core network’s switches, allowing for the sending of multicast packets and link-layer packet steering. Our results show that NDN-Fab can be more efficient in packet forwarding than IPv4, achieving up to 150 times lower average delay, 100 times lower network dispersion, and it managed to process 21% more packets.",
    "citationCount": 12,
    "referenceCount": 45
}