{
    "paperId": "71ea2d6f9012ed5d6c6cdb353e7921258f266fd5",
    "title": "Insight into the genetic underpinnings of tobacco hairy root formation by variant-associated genes based on whole-genome resequencing",
    "year": 2025,
    "venue": "Planta",
    "authors": [
        "Xiaozong Wu",
        "Zhiwen Zhu",
        "Peilin Li",
        "Zhitao Qi",
        "Ruojie Zhu",
        "Chaonan Shi"
    ],
    "doi": "10.1007/s00425-025-04715-z",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/71ea2d6f9012ed5d6c6cdb353e7921258f266fd5",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s00425-025-04715-z",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Main conclusion Our whole-genome resequencing of tobacco hairy roots reveals functionally relevant variations in secondary metabolism-related genes and NAC transcription factors, providing actionable targets for metabolic pathway optimization and bioreactor design. Abstract Tobacco hairy roots are a critical model system for studying plant root development and secondary metabolism. The in-depth analysis of their genetic background and molecular regulatory mechanisms is important for biotechnological applications. In this study, we performed a whole-genome resequencing of tobacco hairy roots to uncover their genomic variation characteristics and potential functional implications. Genes associated with stop-lost, stop-gained, start-lost, and premature-start-codon-gain variants were enriched in zeatin biosynthesis, flavonoid biosynthesis, and glycosyltransferase activities. The results of metabolite content determination showed that hairy roots possessed a low content of zeatin and flavonoid but a higher content of glycoside compounds. Among transcription factors associated with effective variants, NAC transcription factors constituted the largest proportion. Further characterization of NAC proteins revealed their functional domains and expression patterns. This study not only explores the molecular genetic underpinnings of tobacco hairy roots but also provides a critical dataset for metabolic engineering optimization, development of efficient bioreactors, and plant–microbe interaction mechanisms research. Supplementary Information The online version contains supplementary material available at 10.1007/s00425-025-04715-z.",
    "citationCount": 0,
    "referenceCount": 36
}