{
    "paperId": "71f7e4503c0a2ba97e79a984f23ea9cf10167e6a",
    "title": "Barley Variety Identification by iPhone Images and Deep Learning",
    "year": 2021,
    "venue": "Journal of the American Society of Brewing Chemists",
    "authors": [
        "Yaying Shi",
        "Y. Patel",
        "Behrouz Rostami",
        "Huawei Chen",
        "Lushen Wu",
        "Zeyun Yu",
        "Yin Li"
    ],
    "doi": "10.1080/03610470.2021.1958602",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/71f7e4503c0a2ba97e79a984f23ea9cf10167e6a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract The quality of barley seeds determines the quality and flavor aspects of malts and beers, and the purity of barley seeds is one of the primary considerations in the malting process. Visual discrimination between barley varieties is difficult and requires a barley specialist with intensive experience and years of training. Therefore, computational and automatic methods are in great demand to efficiently and effectively evaluate barley seed purity among different varieties. By using digital images, this research work developed a novel, automated, deep learning-based approach to accurately classify barley seeds. It implemented and compared different artificial neural networks for the classification problem based on the shape, color, and texture attributes of the barley seed. Data augmentation and transfer learning strategies were integrated into the deep convolutional networks to maximize the model’s performance and accuracy. The results demonstrate the feasibility and effectiveness of automatic classification of barley seeds with high validation accuracy and test accuracies at 95.71% and 95.70%, respectively.",
    "citationCount": 9,
    "referenceCount": 31
}