{
    "paperId": "71fcf4e1e0c08c99e4383f72468fd2b0a9da772d",
    "title": "Why TPC Is Not Enough: An Analysis of the Amazon Redshift Fleet",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Alexander van Renen",
        "Dominik Horn",
        "Pascal Pfeil",
        "Kapil Vaidya",
        "Wenjian Dong",
        "Murali Narayanaswamy",
        "Zhengchun Liu",
        "Gaurav Saxena",
        "Andreas Kipf",
        "Tim Kraska"
    ],
    "doi": "10.14778/3681954.3682031",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/71fcf4e1e0c08c99e4383f72468fd2b0a9da772d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database research and development is heavily influenced by benchmarks, such as the industry-standard TPC-H and TPC-DS for analytical systems. However, these twenty-year-old benchmarks neither capture how databases are deployed nor what workloads modern cloud data warehouse systems face these days.\n In this paper, we summarize well-known, confirm suspected, and unearth novel discrepancies between TPC-H/DS and actual workloads using empirical data. We base our analysis on telemetrics from Amazon Redshift - one of the largest cloud data warehouse deployments. Among others, we show how write-heavy data pipelines are prominent, workloads vary over time (in both load and type), queries are repetitive, and how most properties of queries or workloads experience very long tailed distributions. We conclude that data warehouse benchmarks, just like database systems, need to become more holistic and stop focusing solely on query engine performance. Finally, we publish a dataset containing query statistics of 200 randomly selected Redshift serverless and provisioned instances (each) over a three-month period, as a basis for building more realistic benchmarks.",
    "citationCount": 37,
    "referenceCount": 34
}