{
    "paperId": "720ca65d4bf0ad0a27ea78a35f9f6137084382df",
    "title": "A global urban tree leaf area index dataset for urban climate modeling",
    "year": 2025,
    "venue": "Scientific Data",
    "authors": [
        "Wenzong Dong",
        "Hua Yuan",
        "Wanyi Lin",
        "Zhuo Liu",
        "Jiayi Xiang",
        "Zhongwang Wei",
        "Lu Li",
        "Qingliang Li",
        "Yongjiu Dai"
    ],
    "doi": "10.1038/s41597-025-04729-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/720ca65d4bf0ad0a27ea78a35f9f6137084382df",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41597-025-04729-y",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Urban trees are recognized for mitigating urban thermal stress, therefore incorporating their effects is crucial for urban climate research. However, due to the limitation of remote sensing, the LAI in urban areas is generally masked (e.g., MODIS), which in turn limits its application in Urban Canopy Models (UCMs). To address this gap, we developed a high-resolution (500 m) and long-time-series (2000–2022) urban tree LAI dataset derived through the Random Forest model trained with MODIS LAI data, with the help of meteorological variables and tree height datasets. The results show that our dataset has high accuracy when validated against site reference maps, with R of 0.85 and RMSE of 1.03 m2/m2. Compared to reprocessed MODIS LAI, our modeled LAI exhibits an RMSE ranging from 0.36 to 0.64 m2/m2 and an R ranging from 0.89 to 0.97 globally. This dataset provides a reasonable representation of urban tree LAI in terms of magnitude and seasonal changes, thereby potentially enhancing its applications in UCMs and urban climate studies.",
    "citationCount": 1,
    "referenceCount": 60
}