{
    "paperId": "722a5ac3d8308bba12a65f1dcbf171e0d9ff05a7",
    "title": "Leveraging network representation learning and community detection for analyzing the activity profiles of adolescents",
    "year": 2022,
    "venue": "Applied Network Science",
    "authors": [
        "Saket Gurukar",
        "Bethany Boettner",
        "Christopher R. Browning",
        "Catherine A. Calder",
        "Srinivas Parthasarathy"
    ],
    "doi": "10.1007/s41109-022-00461-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/722a5ac3d8308bba12a65f1dcbf171e0d9ff05a7",
    "isOpenAccess": true,
    "openAccessPdf": "https://appliednetsci.springeropen.com/track/pdf/10.1007/s41109-022-00461-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Human mobility analysis plays a crucial role in urban analysis, city planning, epidemic modeling, and even understanding neighborhood effects on individuals’ health. Often, these studies model human mobility in the form of co-location networks. We have recently seen the tremendous success of network representation learning models on several machine learning tasks on graphs. To the best of our knowledge, limited attention has been paid to identifying communities using network representation learning methods specifically for co-location networks. We attempt to address this problem and study user mobility behavior through the communities identified with latent node representations. Specifically, we select several diverse network representation learning models to identify communities from a real-world co-location network. We include both general-purpose representation models that make no assumptions on network modality as well as approaches designed specifically for human mobility analysis. We evaluate these different methods on data collected in the Adolescent Health and Development in Context study. Our experimental analysis reveals that a recently proposed method (LocationTrails) offers a competitive advantage over other methods with respect to its ability to represent and reflect community assignment that is consistent with extant findings regarding neighborhood racial and socio-economic differences in mobility patterns. We also compare the learned activity profiles of individuals by factoring in their residential neighborhoods. Our analysis reveals a significant contrast in the activity profiles of individuals residing in white-dominated versus black-dominated neighborhoods and advantaged versus disadvantaged neighborhoods in a major metropolitan city of United States. We provide a clear rationale for this contrastive pattern through insights from the sociological literature.",
    "citationCount": 3,
    "referenceCount": 58
}