{
    "paperId": "728f8dbbc9b320d5a617bfb82f470d92269c1606",
    "title": "Auto-tuning for HPC storage stack: an optimization perspective",
    "year": 2024,
    "venue": "CCF Transactions on High Performance Computing",
    "authors": [
        "Zhangyu Liu",
        "Jinqiu Wang",
        "Huijun Wu",
        "Qingzhen Ma",
        "Lin Peng",
        "Zhanyong Tang"
    ],
    "doi": "10.1007/s42514-024-00198-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/728f8dbbc9b320d5a617bfb82f470d92269c1606",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1007/s42514-024-00198-8",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Storage stack layers in high-performance computing (HPC) systems offer many tunable parameters controlling I/O behaviors and underlying file system settings. The setting of these parameters plays a decisive role in I/O performance. Nevertheless, the increasing complexity of data operations and storage architectures makes identifying a set of well-performing configurations a challenge. Auto-tuning is a promising technology. This paper presents a comprehensive survey on \"Auto-tuning in HPC I/O\". We expound a general storage structure based on a general storage stack and critical elements of auto-tuning, and categorize related studies according to the way of tuning. On the basis of the order in which the approaches were applied, we introduce the specific works of each approach in detail, and summarize and compare the pros and cons of these approaches. Through a comprehensive and in-depth study of existing research, we elaborate on the development history of auto-tuning technology in HPC I/O, analyze the current situation, and provide guidance for optimization technology in the future.",
    "citationCount": 0,
    "referenceCount": 34
}