{
    "paperId": "72c84351a67c9576ca164e2053d959d288364255",
    "title": "Deep learning application for marketing engagement – its thematic evolution",
    "year": 2024,
    "venue": "Journal of Research in Interactive Marketing",
    "authors": [
        "Billy T. W. Yu",
        "Stella T.X. Liu"
    ],
    "doi": "10.1108/jrim-08-2024-0371",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/72c84351a67c9576ca164e2053d959d288364255",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeThis analysis examines the evolving role of deep learning in engagement marketing research. It tries to address a critical knowledge gap despite the rapid growth of artificial intelligence (AI) applications in this field.Design/methodology/approachUsing bibliometric techniques, this study analyzes Scopus data to investigate the evolution of engagement marketing research influenced by technology. Overlapping maps, evolution maps and strategic diagrams reveal key trends and intellectual structures within this dynamic field.FindingsOur analysis reveals key trends in deep learning applications, like focuses on language-interaction, interactivity-privacy and human-focus satisfaction. While results show the contribution in foundational works like linguistics, algorithms and interactive marketing, they also raise concerns about the algorithmic bias, privacy violations and etc.Research limitations/implicationsWhile Scopus data offers valuable insights, our analysis acknowledges its limitations on publication language. Future research should treasure foundational works and historical context for comprehensive understandings. Additionally, addressing emerging challenges such as negative customer experiences and fairness is crucial for future studies.Originality/valueThis review provides a comprehensive perspective on deep learning applications on engagement marketing research in the context of interactive marketing. We present trends and thematic structures with practical implications for scholars and practitioners. It presents a fuller intellectual landscape and suggests that future research directions shall prioritize a human-centered approach to AI implementation, ultimately fostering genuine customer connections.",
    "citationCount": 0,
    "referenceCount": 85
}