{
    "paperId": "72dc15dd498c21342bc208bc9b01a97f63a68ad3",
    "title": "Data Security Patterns for Critical Big Data Systems",
    "year": 2023,
    "venue": "International Conference on Cloud Computing Technologies and Applications",
    "authors": [
        "Chaymae Majdoubi",
        "Saida El Mendili",
        "Youssef Gahi"
    ],
    "doi": "10.1109/CloudTech58737.2023.10366149",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/72dc15dd498c21342bc208bc9b01a97f63a68ad3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the words' current growth in technologies and digitalization, protecting data in massive data-driven systems has become a new challenge to overcome. Therefore, many measures, algorithms, and protocols are used and still under development to minimize risks of Data loss, manipulation, sniffing, or spying… In order to gain more in terms of security, privacy, and integrity levels. As important as this issue is, combined efforts from different disciplines (Network Security, Security Operations Center Analysis (SOC Analysis), Machine Learning (ML), and Deep Learning (DL) algorithms) are necessary to enhance Data protection. In this paper, we will expose some natural threats of Big Data, based on its definition, ethics, and suggestions to avoid these threats, or at least limit their effects. We will also show works related to big data security based on ML and shed light on Artificial Neural Networks (ANN) applications for data classification and threat detection. Then focus on Convolutional Neural Networks (CNN) to optimize parameters. We will try to find solutions for CNN limitations of hyperparameters tuning and rotating image feature extraction. Furthermore, we will discuss state of art results to understand the matter in a deeper sense and expose high-accuracy solutions with improvement path suggestions. Our work is going to come up with some natural threats, compare some existing methods, expose, and discuss results, and then suggest optimal ways to help increase data security, especially through improving CNN limitations.",
    "citationCount": 3,
    "referenceCount": 40
}