{
    "paperId": "733c5e3a3f1bb5751d5474c94c8573e1356973c2",
    "title": "ZenFS+: Nurturing Performance and Isolation to ZenFS",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Myounghoon Oh",
        "Seehwan Yoo",
        "Jongmoo Choi",
        "J. Park",
        "Chang-eun Choi"
    ],
    "doi": "10.1109/ACCESS.2023.3257354",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/733c5e3a3f1bb5751d5474c94c8573e1356973c2",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10070767.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper proposes ZenFS+, a new storage backend of RocksDB for small-zone ZNS SSD. RocksDB has complicated internal operations such as flush and compaction. Flush and compaction run in separate threads, and it is well known that they closely interact around the sstables. Due to the concurrent storage I/O between flush and compaction, ZenFS presents unsatisfactory performance for small-zone ZNS SSD. We believe that ZenFS+ presents how ZNS SSD can support the performance and isolation of modern key-value stores. Leveraging the ZNS SSD, ZenFS+ intelligently identifies the independent zones group (IZG), which reveals the device’s internal parallelism. With the IZG information, ZenFS+ effectively isolates the flush workloads of RocksDB from compaction. Besides, ZenFS+ spreads the sstables to multiple IZGs so that the storage write can leverage the hardware parallelism. ZenFS+ presents up to 4.8x higher storage throughput for write-intensive microbenchmark and stabilizing 99.9P tail latency by 1/51 from existing ZenFS. Further, ZenFS+ implements proactive garbage collection, and presents sustainable performance over longer lifespan of the device.",
    "citationCount": 14,
    "referenceCount": 48
}