{
    "paperId": "735c6668e34c0e48895926fc6b9e6a9028c3e9d7",
    "title": "Predicting Slow Network Transfers in Scientific Computing",
    "year": 2022,
    "venue": "SNTA@HPDC",
    "authors": [
        "Robin Shao",
        "Jinoh Kim",
        "A. Sim",
        "Kesheng Wu"
    ],
    "doi": "10.1145/3526064.3534112",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/735c6668e34c0e48895926fc6b9e6a9028c3e9d7",
    "isOpenAccess": true,
    "openAccessPdf": "https://sdm.lbl.gov/oapapers/snta22-netperf.pdf",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data access throughput is one of the key performance metrics in scientific computing, particularly for distributed data-intensive applications. While there has been a body of studies focusing on elephant connections that consume a significant fraction of network bandwidth, this study focuses on predicting slow connections that create bottlenecks in distributed workflows. In this study, we analyze network traffic logs collected between January 2019 and May 2021 at National Energy Research Scientific Computing Center (NERSC). Based on the observed patterns from this data collection, we define a set of features to be used for identifying low-performing data transfers. Through extensive feature engineering and feature selection, we identify a number of new features to significantly enhance the prediction performance. With these new features, even the relatively simple decision tree model could predict slow connections with a F1 score as high as 0.945.",
    "citationCount": 3,
    "referenceCount": 16
}