{
    "paperId": "7368bef6b6ddcdf7bf35350491bf69e6574324c0",
    "title": "Learning Approximation Sets for Exploratory Queries",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Susan B. Davidson",
        "Tova Milo",
        "Kathy Razmadze",
        "Gal Zeevi"
    ],
    "doi": "10.48550/arXiv.2401.17059",
    "arxivId": "2401.17059",
    "url": "https://www.semanticscholar.org/paper/7368bef6b6ddcdf7bf35350491bf69e6574324c0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In data exploration, executing complex non-aggregate queries over large databases can be time-consuming. Our paper introduces a novel approach to address this challenge, focusing on finding an optimized subset of data, referred to as the approximation set, for query execution. The goal is to maximize query result quality while minimizing execution time. We formalize this problem as Approximate Non-Aggregates Query Processing (ANAQP) and establish its NP-completeness. To tackle this, we propose an approximate solution using advanced Reinforcement Learning architecture, termed ASQP-RL. This approach overcomes challenges related to the large action space and the need for generalization beyond a known query workload. Experimental results on two benchmarks demonstrate the superior performance of ASQP-RL, outperforming baselines by 30% in accuracy and achieving efficiency gains of 10-35X. Our research sheds light on the potential of reinforcement learning techniques for advancing data management tasks. Experimental results on two benchmarks show that ASQP-RL significantly outperforms the baselines both in terms of accuracy (30% better) and efficiency (10-35X). This research provides valuable insights into the potential of RL techniques for future advancements in data management tasks.",
    "citationCount": 1,
    "referenceCount": 45
}