{
    "paperId": "73842f389e74f0d866217928faa6836329bc7b40",
    "title": "A systematic mapping to investigate the application of machine learning techniques in requirement engineering activities",
    "year": 2024,
    "venue": "CAAI Transactions on Intelligence Technology",
    "authors": [
        "Shoaib Hassan",
        "Qianmu Li",
        "Khursheed Aurangzeb",
        "Affan Yasin",
        "Javed Ali Khan",
        "M. S. Anwar"
    ],
    "doi": "10.1049/cit2.12348",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/73842f389e74f0d866217928faa6836329bc7b40",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1049/cit2.12348",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Over the past few years, the application and usage of Machine Learning (ML) techniques have increased exponentially due to continuously increasing the size of data and computing capacity. Despite the popularity of ML techniques, only a few research studies have focused on the application of ML especially supervised learning techniques in Requirement Engineering (RE) activities to solve the problems that occur in RE activities. The authors focus on the systematic mapping of past work to investigate those studies that focused on the application of supervised learning techniques in RE activities between the period of 2002–2023. The authors aim to investigate the research trends, main RE activities, ML algorithms, and data sources that were studied during this period. Forty‐five research studies were selected based on our exclusion and inclusion criteria. The results show that the scientific community used 57 algorithms. Among those algorithms, researchers mostly used the five following ML algorithms in RE activities: Decision Tree, Support Vector Machine, Naïve Bayes, K‐nearest neighbour Classifier, and Random Forest. The results show that researchers used these algorithms in eight major RE activities. Those activities are requirements analysis, failure prediction, effort estimation, quality, traceability, business rules identification, content classification, and detection of problems in requirements written in natural language. Our selected research studies used 32 private and 41 public data sources. The most popular data sources that were detected in selected studies are the Metric Data Programme from NASA, Predictor Models in Software Engineering, and iTrust Electronic Health Care System.",
    "citationCount": 6,
    "referenceCount": 137
}