{
    "paperId": "739ae8cfbfce8077fee8d48374375a7f4272f877",
    "title": "Defining and designing spatial queries: the role of spatial relationships",
    "year": 2023,
    "venue": "Geo-Spatial Information Science",
    "authors": [
        "A. Carniel"
    ],
    "doi": "10.1080/10095020.2022.2163924",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/739ae8cfbfce8077fee8d48374375a7f4272f877",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/10095020.2022.2163924?needAccess=true&role=button",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Spatial relationships are core components in the design and definition of spatial queries. A spatial relationship determines how two or more spatial objects are related or connected in space. Hence, given a spatial dataset, users can retrieve spatial objects in a given relationship with a search object. Different interpretations of spatial relationships are conceivable, leading to different types of relationships. The main types are (i) topological relationships (e.g. overlap, meet, inside), (ii) metric relationships (e.g. nearest neighbors), and (iii) direction relationships (e.g. cardinal directions). Although spatial information retrieval has been extensively studied in the literature, it is unclear which types of spatial queries can be defined using spatial relationships. In this article, we introduce a taxonomy for naming, describing, and classifying types of spatial queries frequently found in the literature. This taxonomy is based on the types of spatial relationships that are employed by spatial queries. By using this taxonomy, we discuss the intuitive descriptions, formal definitions, and possible implementation techniques of several types of spatial queries. The discussions lead to the identification of correspondences between types of spatial queries. Further, we identify challenges and open research topics in the spatial information retrieval area.",
    "citationCount": 14,
    "referenceCount": 141
}