{
    "paperId": "73d873a2cc36c930811943c23c6f908d439a4ddc",
    "title": "Devolution: A Symbiotic Cloud–Edge Framework for Real-Time Multimodal Retrieval in 6G-Based Surveillance IoT System",
    "year": 2025,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Lingwu Meng",
        "Guangchi Liu",
        "Junzhou Luo"
    ],
    "doi": "10.1109/JIOT.2025.3601800",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/73d873a2cc36c930811943c23c6f908d439a4ddc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid evolution of the 6G network infrastructure has position cloud–edge systems integrating giant AI models and Internet of Things (IoT) devices as key enablers for next-generation surveillance solutions. However, traditional centralized architectures for such solutions face challenges in efficient multimodal data transmission and processing due to the massive data generated by terminal devices and the high computational demands of giant AI models served at the cloud side. To address these limitations, we propose Devolution, a 6G-based symbiotic cloud–edge framework that optimizes multimodal data transmission and the operation of the giant AI model in surveillance solutions. Devolution employs a two-stage hierarchical index encoding mechanism to dynamically distribute computation loads between Elasticsearch cluster edge devices and cloud servers, mitigating bandwidth constraints while preserving data locality. Furthermore, Devolution introduce a distributed giant model adaptation strategy, where cloud servers fine-tune the Chinese CLIP model (CN-CLIP), while edge devices deploy a lightweight Chinese CLIP Self-attention and Cross-attention (CN-CLIP-SA-CA) fusion model, enabling secure and efficient cross-modal data transformation and alignment. In the end, a symbiotic retrieval engine, optimized with a best-first beam search (BFBS) strategy for 6G environments, ensures high-accuracy, low-latency multimodal retrieval. Experimental studies are being conducted on real datasets and the results demonstrate that Devolution significantly reduces latency, enhances privacy through edge-localized processing, and outperforms traditional methods (BM25, IVF, HIVF, KNN). A very small number of top candidate sets require encryption and decryption and transmission to recall. The retrieval precision can reach 96%–100% of the accuracy of Elasticsearch KNN, while retrieval reduces the retrieval time by 1.2%–45.2% compared to several latest schemes in different datasets and scales.",
    "citationCount": 0,
    "referenceCount": 48
}