{
    "paperId": "73e413c33946c5226ff74fb15a66138abebe9a9c",
    "title": "AIDA - Abstraction for Advanced In-Database Analytics",
    "year": 2018,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Joseph Vinish D'silva",
        "Florestan De Moor",
        "Bettina Kemme"
    ],
    "doi": "10.14778/3236187.3236194",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/73e413c33946c5226ff74fb15a66138abebe9a9c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the tremendous growth in data science and machine learning, it has become increasingly clear that traditional relational database management systems (RDBMS) are lacking appropriate support for the programming paradigms required by such applications, whose developers prefer tools that perform the computation outside the database system. While the database community has attempted to integrate some of these tools in the RDBMS, this has not swayed the trend as existing solutions are often not convenient for the incremental, iterative development approach used in these fields. In this paper, we propose AIDA - an abstraction for advanced in-database analytics. AIDA emulates the syntax and semantics of popular data science packages but transparently executes the required transformations and computations inside the RDBMS. In particular, AIDA works with a regular Python interpreter as a client to connect to the database. Furthermore, it supports the seamless use of both relational and linear algebra operations using a unified abstraction. AIDA relies on the RDBMS engine to efficiently execute relational operations and on an embedded Python interpreter and NumPy to perform linear algebra operations. Data reformatting is done transparently and avoids data copy whenever possible. AIDA does not require changes to statistical packages or the RDBMS facilitating portability.",
    "citationCount": 39,
    "referenceCount": 62
}