{
    "paperId": "73f305039a9ed5c067ea1d3f25e56833baa5577d",
    "title": "An Availability Analysis Approach for Deployment Configurations of Containers",
    "year": 2021,
    "venue": "IEEE Transactions on Services Computing",
    "authors": [
        "Stefano Sebastio",
        "R. Ghosh",
        "Tridib Mukherjee"
    ],
    "doi": "10.1109/TSC.2017.2788442",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/73f305039a9ed5c067ea1d3f25e56833baa5577d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Operating system (OS) containers enabling the microservice-oriented architecture are becoming popular in the context of Cloud services. Containers provide the ability to create lightweight and portable runtime environments that decouple the application requirements from the characteristics of the underlying system. Services built on containers have a small resource footprint in terms of processing, storage, memory and network, allowing a more dense deployment environment. While the performance of such containers is addressed in few previous studies, understanding the failure-repair behavior of the containers remains unexplored. In this paper, from an availability point of view, we propose and compare different configuration models for deploying a containerized software system. Inspired by Google Kubernetes, a container management system, these configurations are characterized with a failure response and migration service. We develop novel non-state-space (i.e., fault tree) and state-space (i.e., stochastic reward net) analytic models for container availability analysis. Analytical as well as simulative solutions are obtained for the developed models. Our analysis provides insights on k out-of N availability and sensitivity of system availability for key system parameters. Finally, we build an open-source software tool powered by these models. The tool helps a Cloud administrator to assess the availability of a containerized system and to conduct a what-if analysis based on user-provided parameters and configurations.",
    "citationCount": 41,
    "referenceCount": 48
}