{
    "paperId": "73faeb70192df7fa6c0596a08a11da7b047d30a0",
    "title": "An Edge Computing Service Model Based on Information-Centric Networking",
    "year": 2019,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Zhenyu Fan",
        "Wang Yang",
        "Kaijin Tian"
    ],
    "doi": "10.1109/ICPADS47876.2019.00076",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/73faeb70192df7fa6c0596a08a11da7b047d30a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In edge computing scenarios, the computing service provider needs to be selected according to the edge server and network status. In the TCP/IP architecture, edge computing applications rely on centralized proxy servers to select an appropriate edge server, which leads to additional network overhead and increases system response latency. Compared with TCP/IP, Information-Centric Networking(ICN) has more potential to provide efficient network support for edge computing, so we consider leveraging ICN facilitate edge computing. However, traditional ICN cannot be used directly in edge computing because the computing results are dynamically generated in edge computing. Therefore, we propose an edge computing service model based on ICN, which contains a new naming scheme, service session models and service request forwarding strategies. Our edge computing service model can forward computing requests to an appropriate edge server in a distributed way, which can provide real-time, dynamic and efficient edge computing services.",
    "citationCount": 6,
    "referenceCount": 28
}