{
    "paperId": "744bb618b3b6d5bbd1b73787ab410974520aaaf5",
    "title": "Deep Unfolding with Approximated Computations for Rapid Optimization",
    "year": 2025,
    "venue": "",
    "authors": [
        "Dvir Avrahami",
        "Amit Milstein",
        "Caroline Chaux",
        "T. Routtenberg",
        "Nir Shlezinger"
    ],
    "doi": null,
    "arxivId": "2509.00782",
    "url": "https://www.semanticscholar.org/paper/744bb618b3b6d5bbd1b73787ab410974520aaaf5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimization-based solvers play a central role in a wide range of signal processing and communication tasks. However, their applicability in latency-sensitive systems is limited by the sequential nature of iterative methods and the high computational cost per iteration. While deep unfolding has emerged as a powerful paradigm for converting iterative algorithms into learned models that operate with a fixed number of iterations, it does not inherently address the cost of each iteration. In this paper, we introduce a learned optimization framework that jointly tackles iteration count and per-iteration complexity. Our approach is based on unfolding a fixed number of optimization steps, replacing selected iterations with low-complexity approximated computations, and learning extended hyperparameters from data to compensate for the introduced approximations. We demonstrate the effectiveness of our method on two representative problems: (i) hybrid beamforming; and (ii) robust principal component analysis. These fundamental case studies show that our learned approximated optimizers can achieve state-of-the-art performance while reducing computational complexity by over three orders of magnitude. Our results highlight the potential of our approach to enable rapid, interpretable, and efficient decision-making in real-time systems.",
    "citationCount": 0,
    "referenceCount": 49
}