{
    "paperId": "74844878b3833cb788bf89c9b30e375c0e2cbc03",
    "title": "Optimization of Dynamic Pricing Models for Consumer Segmentation Markets and Analysis of Big Data-Driven Marketing Strategies",
    "year": 2025,
    "venue": "Journal of Organizational and End User Computing",
    "authors": [
        "Qi Zhang",
        "Qiang Shi",
        "B. Alatas",
        "Yu-His Yuan"
    ],
    "doi": "10.4018/joeuc.368840",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/74844878b3833cb788bf89c9b30e375c0e2cbc03",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to the challenges posed by globalization and rapid technological advancements, traditional static pricing models are no longer sufficient to capture the dynamic nature of consumer behavior and market fluctuations. This study proposes a “Multi-dimensional Dynamic Pricing Optimization and Consumer Behavior Prediction Model Driven by Big Data,” which integrates multi-source data and reinforcement learning to improve dynamic pricing strategies. Through a hybrid model architecture using Random Forest and LSTM, it captures both static and time-series features. Experimental results show that the proposed model significantly outperforms baseline models, achieving a 43% reduction in Mean Squared Error (MSE), a 28% decrease in Mean Absolute Percentage Error (MAPE), a 6.5% increase in Accuracy, and a 14.7% increase in Cumulative Revenue. These findings confirm the model's ability to enhance prediction accuracy, optimize pricing strategies, and maximize revenue, demonstrating its potential for real-world applications in industries like e-commerce, finance, and advertising.",
    "citationCount": 0,
    "referenceCount": 24
}