{
    "paperId": "748ce990333de9a8c9a9f80f0ea8a2c6a973a954",
    "title": "Reinforcement Learning for Adaptive Caching With Dynamic Storage Pricing",
    "year": 2018,
    "venue": "IEEE Journal on Selected Areas in Communications",
    "authors": [
        "A. Sadeghi",
        "Fatemeh Sheikholeslami",
        "A. Marques",
        "G. Giannakis"
    ],
    "doi": "10.1109/JSAC.2019.2933780",
    "arxivId": "1812.08593",
    "url": "https://www.semanticscholar.org/paper/748ce990333de9a8c9a9f80f0ea8a2c6a973a954",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/jsac.2019.2933780",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Small base stations (SBs) of fifth-generation (5G) cellular networks are envisioned to have storage devices to locally serve requests for reusable and popular contents by caching them at the edge of the network, close to the end users. The ultimate goal is to smartly utilize a limited storage capacity to serve locally contents that are frequently requested instead of fetching them from the cloud, contributing to a better overall network performance and service experience. To enable the SBs with efficient fetch-cache decision-making schemes operating in dynamic settings, this paper introduces simple but flexible generic time-varying fetching and caching costs, which are then used to formulate a constrained minimization of the aggregate cost across files and time. Since caching decisions per time slot influence the content availability in future slots, the novel formulation for optimal fetch-cache decisions falls into the class of dynamic programming. Under this generic formulation, first by considering stationary distributions for the costs as well as file popularities, an efficient reinforcement learning-based solver known as value iteration algorithm can be used to solve the emerging optimization problem. Later, it is shown that practical limitations on cache capacity can be handled using a particular instance of this generic dynamic pricing formulation. Under this setting, to provide a light-weight online solver for the corresponding optimization, the well-known reinforcement learning algorithm, $Q$ -learning, is employed to find optimal fetch-cache decisions. Numerical tests corroborating the merits of the proposed approach wrap up the paper.",
    "citationCount": 53,
    "referenceCount": 43
}