{
    "paperId": "748e9ec76dc90d376f43b5c993b83abbc7dce673",
    "title": "Autotuning Systems: Techniques, Challenges, and Opportunities",
    "year": 2025,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Brian Kroth",
        "Sergiy Matusevych",
        "Yiwen Zhu"
    ],
    "doi": "10.1145/3722212.3725638",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/748e9ec76dc90d376f43b5c993b83abbc7dce673",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of cloud computing and systems has introduced significant complexity in managing and optimizing configurations to meet diverse workload demands across a wide array of hardware. Autotuning systems, leveraging advancements in machine learning and optimization, offer an effective solution to these challenges. By automating configuration tuning, these systems can dynamically adapt to workload changes, optimize performance in real time, and reduce the burden on system administrators. This tutorial provides both theoretical foundations and practical demonstrations of systems autotuning software, with a focus on offline and online optimization methodologies. We present a comprehensive review of state-of-the-art autotuning systems and discuss how they address key challenges, such as handling large configuration spaces, mitigating noise in real-world environments, and ensuring safe and efficient exploration during tuning. To conclude, we offer a hands-on session where participants can experiment with an open-source system and gain experience with real-world tuning scenarios.",
    "citationCount": 0,
    "referenceCount": 65
}