{
    "paperId": "7491b92d7122f5bcf6d7794e4c88c3e8d41defe0",
    "title": "Deep Learning-Centric Task Offloading in IoT-Fog-Cloud Continuum: A State-of-the-Art Review, Open Research Issues, and Future Directions",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Gurpreet Singh Chhabra",
        "Goluguri N. V. Rajareddy",
        "Abhijeet Mahapatra",
        "S. Mangalampalli",
        "K. Sahoo",
        "Deepak Sethi",
        "Kaushik Mishra"
    ],
    "doi": "10.1109/ACCESS.2025.3599190",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7491b92d7122f5bcf6d7794e4c88c3e8d41defe0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of IoT and real-time applications has led to a surge in data generation, traditionally processed in cloud-centric architectures. However, this paradigm introduces high latency, bandwidth bottlenecks, and privacy concerns. Fog computing, supported by edge devices, addresses these challenges by enabling computation closer to data sources. This survey presents a comprehensive review of recent studies on task offloading and resource allocation in fog computing, with a focus on Machine Learning (ML) and Deep Learning (DL)-based techniques. We analyze strategies across the fog–cloud continuum, considering factors such as latency, energy consumption, network utilization, and cost. The review also highlights simulation tools, architectural models, and placement policies. Unresolved challenges and interdependencies among research issues are discussed, and future directions are outlined with actionable evaluation metrics. This article serves as a valuable reference for researchers and practitioners aiming to optimize intelligent resource management in fog-enabled IoT environments.",
    "citationCount": 0,
    "referenceCount": 96
}