{
    "paperId": "7493e3f39b1e5ad9aa2ebe5bc850a4b05bf54bf8",
    "title": "Multiplex CRISPR-Cas9 knockout of EIL3, EIL4, and EIN2L advances soybean flowering time and pod set",
    "year": 2023,
    "venue": "BMC Plant Biology",
    "authors": [
        "Yunqing Cheng",
        "Yujie Li",
        "Jing Yang",
        "Hongli He",
        "Xingzheng Zhang",
        "Jianfeng Liu",
        "Xiangdong Yang"
    ],
    "doi": "10.1186/s12870-023-04543-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7493e3f39b1e5ad9aa2ebe5bc850a4b05bf54bf8",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcplantbiol.biomedcentral.com/counter/pdf/10.1186/s12870-023-04543-x",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Ethylene inhibitor treatment of soybean promotes flower bud differentiation and early flowering, suggested that there is a close relationship between ethylene signaling and soybean growth and development. The short-lived ETHYLENE INSENSITIVE2 ( EIN2 ) and ETHYLENE INSENSITIVE3 ( EIN3 ) proteins play central roles in plant development. The objective of this study was carried out gene editing of EIL family members in soybeans and to examine the effects on soybean yield and other markers of growth. Methods and results By editing key-node genes in the ethylene signaling pathway using a multi-sgRNA-in-one strategy, we obtained a series of gene edited lines with variable edit combinations among 15 target genes. EIL3 , EIL4 , and EIN2L were editable genes favored by the T0 soybean lines. Pot experiments also show that the early flowering stage R1 of the EIL3, EIL4 , and EIN2L triple mutant was 7.05 d earlier than that of the wild-type control. The yield of the triple mutant was also increased, being 1.65-fold higher than that of the control. Comparative RNA-seq revealed that sucrose synthase, AUX28, MADS3, type-III polyketide synthase A/B, ABC transporter G family member 26, tetraketide alpha-pyrone reductase, and fatty acyl-CoA reductase 2 may be involved in regulating early flowering and high-yield phenotypes in triple mutant soybean plants. Conclusion Our results provide a scientific basis for genetic modification to promote the development of earlier-flowering and higher-yielding soybean cultivars.",
    "citationCount": 7,
    "referenceCount": 58
}