{
    "paperId": "74c674cd2606da207966fce375f27ccd66114202",
    "title": "RGB-D Human Matting: A Real-World Benchmark Dataset and a Baseline Method",
    "year": 2023,
    "venue": "IEEE transactions on circuits and systems for video technology (Print)",
    "authors": [
        "Bo Peng",
        "M. Zhang",
        "Jianjun Lei",
        "H. Fu",
        "Haifeng Shen",
        "Qingming Huang"
    ],
    "doi": "10.1109/TCSVT.2023.3238580",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/74c674cd2606da207966fce375f27ccd66114202",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The last decade has witnessed an increasing exploration and development of human matting. However, existing matting works primarily focus on predicting better alpha mattes from RGB images. So far few efforts have been devoted to tackling human matting in real-world activity scenarios with RGB-D information. To this end, this paper concentrates on the RGB-D human matting task, and provides the first public RGB-D human matting benchmark dataset as well as a baseline method for deep learning-based RGB-D human matting. To support the research on RGB-D human matting, a new RGB-D human-matting dataset (HDM-2K) is collected and released, which contains 2,270 high-resolution human images in various real-world scenarios and the corresponding depth maps. Additionally, a baseline method for RGB-D human matting is further proposed, which automatically generates the alpha matte by jointly exploiting the spatial structure information in the depth map and detailed texture information in the RGB image. Finally, extensive experiments conducted on the HDM-2K dataset demonstrate that the depth maps are effective for the matting task and the proposed baseline method achieves promising performance on human matting.",
    "citationCount": 13,
    "referenceCount": 59
}