{
    "paperId": "74e98763e51e2213d46bb571c058785144936de6",
    "title": "Towards Citizen-Centric Services using Blockchain-Powered Digitalization of Public Sector Processes",
    "year": 2023,
    "venue": "International Conference on Blockchain Computing and Applications",
    "authors": [
        "Sion Israel Sion",
        "Kaiwen Zhang",
        "Alain April"
    ],
    "doi": "10.1109/BCCA58897.2023.10338883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/74e98763e51e2213d46bb571c058785144936de6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Public sector institutions operate in a rapidly changing landscape that is transforming the way services are delivered. To ensure positive outcomes for citizens, governments need the support of efficient public institutions with the capacity to keep track with emerging trends and changing expectations. The adoption of new technologies offers innovative opportunities for the public sector and can improve interactions between citizens and institutions and enabling citizen-centric services. The emergence of blockchain technology has inspired a new type of information exchange infrastructure on a peer-to-peer model that makes possible a set of use cases in sectors where improved efficiency, reliability, security and costs around transparency are intended. The public sector is mainly characterized by administrative processes that involve several institutions. If blockchain can promote various types of integration in an organization, the implications around its applicability and its interoperability in the complex integration of an inter-organizational public process remain to be demonstrated. In this paper, we investigate a real-life use case in public administration related to the vehicle registration process involving multiple institutions to develop an architecture that makes possible a blockchain-based digitalization of the inter-organizational process. We describe a case study and use it to extract the system requirements, analyze an approach that identifies coordination and data interoperability in public sector inter-organizational processes, and propose an architecture focused on transparency and privacy for effective deployment. We then implement the designed architecture around the scenarios of the vehicle registration.",
    "citationCount": 1,
    "referenceCount": 37
}