{
    "paperId": "74fdc8624d7e774b9342cba82a5148a7b5e5b6e1",
    "title": "Advances of deep Neural Networks (DNNs) in the development of peptide drugs.",
    "year": 2025,
    "venue": "Future Medicinal Chemistry",
    "authors": [
        "Yuzhen Niu",
        "Pingyang Qin",
        "Ping Lin"
    ],
    "doi": "10.1080/17568919.2025.2463319",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/74fdc8624d7e774b9342cba82a5148a7b5e5b6e1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Peptides are able to bind to difficult disease targets with high potency and specificity, providing great opportunities to meet unmet medical requirements. Nevertheless, the unique features of peptides, such as their small size, high structural flexibility, and scarce data availability, bring extra challenges to the design process. Firstly, this review sums up the application of peptide drugs in treating diseases. Then, the review probes into the advantages of Deep Neural Networks (DNNs) in predicting and designing peptide structures. DNNs have demonstrated remarkable capabilities in structural prediction, enabling accurate three-dimensional modeling of peptide drugs through models like AlphaFold and its successors. Finally, the review deliberates on the challenges and coping strategies of DNNs in the development of peptide drugs, along with future research directions. Future research directions focus on further improving the accuracy and efficiency of DNN-based peptide drug design, exploring novel applications of peptide drugs, and accelerating their clinical translation. With continuous advancements in technology and data accumulation, DNNs are poised to play an increasingly crucial role in the field of peptide drug development.",
    "citationCount": 1,
    "referenceCount": 138
}