{
    "paperId": "7548715cb52d0a81cc09ce494ae540a30f28734d",
    "title": "FeatureBox: Feature Engineering on GPUs for Massive-Scale Ads Systems",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Weijie Zhao",
        "Xuewu Jiao",
        "Xinsheng Luo",
        "Jingxue Li",
        "Belhal Karimi",
        "Ping Li"
    ],
    "doi": "10.1109/BigData55660.2022.10021016",
    "arxivId": "2210.07768",
    "url": "https://www.semanticscholar.org/paper/7548715cb52d0a81cc09ce494ae540a30f28734d",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.07768",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning has been widely deployed for online ads systems to predict click-through rate (CTR). Practitioners frequently re-train CTR models to test their new extracted features. As the CTR model training relies on a large number of raw input data logs, the feature extraction step takes a significant portion of the training time. In this paper, we propose FeatureBox, a novel end-to-end training framework that pipelines the feature extraction and the training on GPU servers to save the intermediate I/O of the feature extraction. We rewrite computation-intensive feature extraction operators as GPU operators and leave the memory-intensive operator on CPUs. We introduce a layer-wise operator scheduling algorithm to schedule these heterogeneous operators. We present a light-weight GPU memory management algorithm that supports dynamic GPU memory allocation with minimal overhead. We experimentally evaluate FeatureBox and compare it with the previous in-production feature extraction framework on two ads applications. The results confirm the effectiveness of our proposed method.",
    "citationCount": 2,
    "referenceCount": 43
}