{
    "paperId": "756fc03b6f0bfaf9470f59801ae3d1f9da662e0a",
    "title": "Optimal Synthesis of Robust IDK Classifier Cascades",
    "year": 2023,
    "venue": "ACM Transactions on Embedded Computing Systems",
    "authors": [
        "Sanjoy Baruah",
        "Alan Burns",
        "Robert I. Davis"
    ],
    "doi": "10.1145/3609129",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/756fc03b6f0bfaf9470f59801ae3d1f9da662e0a",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3609129",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "An IDK classifier is a computing component that categorizes inputs into one of a number of classes, if it is able to do so with the required level of confidence, otherwise it returns “I Don’t Know” (IDK). IDK classifier cascades have been proposed as a way of balancing the needs for fast response and high accuracy in classification-based machine perception. Efficient algorithms for the synthesis of IDK classifier cascades have been derived; however, the responsiveness of these cascades is highly dependent on the accuracy of predictions regarding the run-time behavior of the classifiers from which they are built. Accurate predictions of such run-time behavior is difficult to obtain for many of the classifiers used for perception. By applying the algorithms using predictions framework, we propose efficient algorithms for the synthesis of IDK classifier cascades that are robust to inaccurate predictions in the following sense: the IDK classifier cascades synthesized by our algorithms have short expected execution durations when the predictions are accurate, and these expected durations increase only within specified bounds when the predictions are inaccurate.",
    "citationCount": 6,
    "referenceCount": 26
}