{
    "paperId": "759efcc693e897a84f98a8f5765fcbdb126b8f72",
    "title": "Artificial intelligence based hybrid solar energy systems with smart materials and adaptive photovoltaics for sustainable power generation",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Udit Mamodiya",
        "Indra Kishor",
        "Ramakrishna Garine",
        "Priyam Ganguly",
        "Nithesh Naik"
    ],
    "doi": "10.1038/s41598-025-01788-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/759efcc693e897a84f98a8f5765fcbdb126b8f72",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The advancement of solar energy systems requires intelligent, scalable solutions that adapt to dynamic environmental conditions. This research proposes a novel AI-enhanced hybrid solar energy framework integrating spatio-temporal forecasting, adaptive control, and decentralized energy trading. The core objective is to improve the efficiency, responsiveness, and scalability of solar power generation using a unified multi-layer architecture. The system comprises a CNN-LSTM model for accurate solar irradiance forecasting, reinforcement learning for real-time dual-axis tracking, and Edge AI for low-latency control decisions. To enhance optical and thermal efficiency, the design incorporates hybrid nanocoatings with self-cleaning and anti-reflective properties, along with dual-layer phase-change materials for real-time heat regulation. Additionally, adaptive perovskite-silicon photovoltaic cells were implemented to dynamically tune electrical characteristics such as bandgap and voltage based on irradiance levels. A blockchain-enabled smart grid facilitates secure and decentralized peer-to-peer energy transactions. Experimental validation was conducted over a full year at Sitapura, Jaipur (India), under real-world climatic conditions. The proposed system achieved a 41.4% increase in annual energy yield, an 18.7% improvement in spectral absorption efficiency, and an 11.9 °C reduction in average panel temperature compared to conventional MPPT and static PV setups. Furthermore, blockchain integration reduced energy dispatch latency from 180 to 48 ms, and AI-based hybrid storage management increased battery lifespan by over 60%. The framework demonstrates significant performance enhancement, real-time adaptability, and deployment viability, offering a transformative step toward intelligent, resilient, and sustainable solar energy systems. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-01788-4.",
    "citationCount": 4,
    "referenceCount": 50
}