{
    "paperId": "75b9c91ad8fbb4653f4fad6c69f78a0bc41fa903",
    "title": "An Efficient Method for Scientific Data Retrieval Service",
    "year": 2020,
    "venue": "ICBDT",
    "authors": [
        "Lixin Du",
        "Mingyue Li",
        "Jiangying Xu"
    ],
    "doi": "10.1145/3422713.3422731",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/75b9c91ad8fbb4653f4fad6c69f78a0bc41fa903",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The sharing of scientific research data on the Internet is already the trend in academia. More and more data have been published to the public throughout the web on Internet. Due to the rapid growth of data, and the requirements of data service quality, the efficiency of data retrieval services has become an important factor affecting service quality. Based on the characteristics of scientific data, and the actual requirements of Pharmaceutical Information Center (PIC, http://pharmdata.ncmi.cn), we propose an efficient scientific data service retrieval method which can greatly improve retrieval speed and service quality. This method includes two work phases. The first phase is to obtain meaningful search keywords from scientific data using semantic analysis technology, including effective keyword sets construction, and eliminating the impact of invalid search keywords. The second phase is to construct a Hash Index Tree (HI-Tree) for valid keywords. Scientific data retrieval service will just traverse the cached HI-Tree instead of traversing the entire database to minimize the database query operation. Compared with traditional database retrieval methods, the experimental results show that our method improves the retrieval efficiency greatly and make better user experience of the data services.",
    "citationCount": 1,
    "referenceCount": 17
}