{
    "paperId": "75d2f50d51a816e90fee09dfb0402eca35eeac8a",
    "title": "Interpretable Chromosomal Abnormality Recognition",
    "year": 2024,
    "venue": "2024 5th International Conference on Computer, Big Data and Artificial Intelligence (ICCBD+AI)",
    "authors": [
        "Xinxu Zhang",
        "Haoxi Zhang",
        "E. Szczerbicki"
    ],
    "doi": "10.1109/ICCBD-AI65562.2024.00090",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/75d2f50d51a816e90fee09dfb0402eca35eeac8a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Chromosome analysis plays a vital role in diagnosing genetic abnormalities, but traditional deep learning models used for this purpose often function as black boxes, lacking transparency and interpretability. In this paper, we enhance the self-supervised DINO framework to create a more interpretable model for chromosome classification and anomaly detection. We introduce three key components: Sinkhorn-Knopp (SK) centering to ensure balanced feature assignments during clustering, the KoLeo regularizer to promote a uniform distribution of feature representations, and CMS Patching to focus on relevant structural areas of chromosomes. Additionally, we integrate an anomaly detection block as an auxiliary task, enabling the model to provide interpretable explanations for detected anomalies. Experiments conducted on the HUAXI chromosome dataset demonstrate that our enhanced DINOSK model outperforms the original DINO and ResNet models in classification accuracy, achieving 99.85%. The model also exhibits improved segmentation stability and higher anomaly detection accuracy. These results indicate that our approach not only enhances performance but also provides a transparent and interpretable framework suitable for clinical genetic analysis.",
    "citationCount": 0,
    "referenceCount": 16
}