{
    "paperId": "760203dffaf8635b81e84f5bf30b039f5bf5e482",
    "title": "Smash: Flexible, Fast, and Resource-efficient Placement and Lookup of Distributed Storage",
    "year": 2023,
    "venue": "Measurement and Modeling of Computer Systems",
    "authors": [
        "Yi Liu",
        "Shouqian Shi",
        "Minghao Xie",
        "Heiner Litz",
        "Chen Qian"
    ],
    "doi": "10.1145/3589977",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/760203dffaf8635b81e84f5bf30b039f5bf5e482",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3589977",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large-scale distributed storage systems, such as object stores, usually apply hashing-based placement and lookup methods to achieve scalability and resource efficiency. However, when object locations are determined by hash values, placement becomes inflexible, failing to optimize or satisfy application requirements such as load balance, failure tolerance, parallelism, and network/system performance. This work presents a novel solution to achieve the best of two worlds: flexibility while maintaining cost-effectiveness and scalability. The proposed method Smash is an object placement and lookup method that achieves full placement flexibility, balanced load, low resource cost, and short latency. Smash utilizes a recent space-efficient data structure and applies it to object-location lookups. We implement Smash as a prototype system and evaluate it in a public cloud. The analysis and experimental results show that Smash achieves full placement flexibility, fast storage operations, fast recovery from node dynamics, and lower DRAM cost (<60%) compared to existing hash-based solutions such as Ceph and MapX.",
    "citationCount": 6,
    "referenceCount": 40
}