{
    "paperId": "762382b799019116c753e88487d31cfc446f841c",
    "title": "Automated Detection of Pedestrian and Bicycle Lanes from High-Resolution Aerial Images by Integrating Image Processing and Artificial Intelligence (AI) Techniques",
    "year": 2025,
    "venue": "ISPRS Int. J. Geo Inf.",
    "authors": [
        "R. Antwi",
        "Prince Lartey Lawson",
        "Michael Kimollo",
        "E. Ozguven",
        "Ren Moses",
        "M. Dulebenets",
        "T. Sando"
    ],
    "doi": "10.3390/ijgi14040135",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/762382b799019116c753e88487d31cfc446f841c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/ijgi14040135",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid advancement of computer vision technology is transforming how transportation agencies collect roadway characteristics inventory (RCI) data, yielding substantial savings in resources and time. Traditionally, capturing roadway data through image processing was seen as both difficult and error-prone. However, considering the recent improvements in computational power and image recognition techniques, there are now reliable methods to identify and map various roadway elements from multiple imagery sources. Notably, comprehensive geospatial data for pedestrian and bicycle lanes are still lacking across many state and local roadways, including those in the State of Florida, despite the essential role this information plays in optimizing traffic efficiency and reducing crashes. Developing fast, efficient methods to gather this data are essential for transportation agencies as they also support objectives like identifying outdated or obscured markings, analyzing pedestrian and bicycle lane placements relative to crosswalks, turning lanes, and school zones, and assessing crash patterns in the associated areas. This study introduces an innovative approach using deep neural network models in image processing and computer vision to detect and extract pedestrian and bicycle lane features from very high-resolution aerial imagery, with a focus on public roadways in Florida. Using YOLOv5 and MTRE-based deep learning models, this study extracts and segments bicycle and pedestrian features from high-resolution aerial images, creating a geospatial inventory of these roadway features. Detected features were post-processed and compared with ground truth data to evaluate performance. When tested against ground truth data from Leon County, Florida, the models demonstrated accuracy rates of 73% for pedestrian lanes and 89% for bicycle lanes. This initiative is vital for transportation agencies, enhancing infrastructure management by enabling timely identification of aging or obscured lane markings, which are crucial for maintaining safe transportation networks.",
    "citationCount": 0,
    "referenceCount": 80
}