{
    "paperId": "765bef719437a2af7ada26fb836c2585e9c1c8e0",
    "title": "Dados de Proveniência como Cidadãos de Primeira Classe para Análises de Workflows em Aprendizado Profundo",
    "year": 2025,
    "venue": "Brazilian Symposium on Databases",
    "authors": [
        "Débora B. Pina",
        "Daniele Muniz De Oliveira",
        "Marta L. Q. Mattoso"
    ],
    "doi": "10.5753/sbbd_estendido.2025.247618",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/765bef719437a2af7ada26fb836c2585e9c1c8e0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [],
    "abstract": "A adoção de modelos de Aprendizado Profundo (AP), na tomada de decisões requer confiança e interpretação por parte de usuários do modelo. A proveniência surge como uma solução natural para promover rastros do workflow de AP, passíveis de análise, englobando desde a preparação de dados ao modelo de AP. Apesar de diversas abordagens alegarem prover proveniência, a principal limitação está na ausência de mecanismos que possibilitem a análise do caminho de derivação dos dados após a geração do resultado do workflow de AP. As soluções existentes não oferecem a rastreabilidade do workflow, adotam formatos proprietários para a representação dos metadados e não geram documentos de proveniência que acompanhem os modelos no ambiente de produção. A DLProv é um conjunto de serviços de proveniência que resolve questões de captura e interoperabilidade de rastros de proveniência de diferentes etapas do workflow, independente do ambiente de AP. Os serviços geram grafos de proveniência aderentes ao W3C PROV, que contempla as etapas executadas no workflow de AP. A DLProv foi avaliada em ambientes de execução de alto desempenho, explorando casos de uso heterogêneos. Os grafos podem ser consultados pelos usuários do modelo em produção independente do acesso aos ambientes de geração do modelo.",
    "citationCount": 0,
    "referenceCount": 44
}