{
    "paperId": "7666cdb59b3cf97710d5cd57b79544674dd28150",
    "title": "CNN-RNN Based Intelligent Recommendation for Online Medical Pre-Diagnosis Support",
    "year": 2020,
    "venue": "IEEE/ACM Transactions on Computational Biology & Bioinformatics",
    "authors": [
        "Xiaokang Zhou",
        "Y. Li",
        "Wei Liang"
    ],
    "doi": "10.1109/TCBB.2020.2994780",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7666cdb59b3cf97710d5cd57b79544674dd28150",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tcbb.2020.2994780",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapidly developed Health 2.0 technology has provided people with more opportunities to conduct online medical consultation than ever before. Understanding contexts within different online medical communications and activities becomes a significant issue to facilitate patients’ medical decision making process. As a subcategory of machine learning, neural networks have drawn increasing attentions in natural language processing applications. In this article, we focus on modeling and analyzing the patient-physician-generated data based on an integrated CNN-RNN framework, in order to deal with the situation that patients’ online inquiries are usually not very long. A so-called DP-CRNN algorithm is developed with a newly designed neural network structure, to extract and highlight the combination of semantic and sequential features in terms of patient's inquiries. An intelligent recommendation method is then proposed to provide patients with automatic clinic guidance and pre-diagnosis suggestions, in which a clustering mechanism is utilized to refine the learning process with more precise diagnosis scope and more representative features. Experiments based on the collected real world data demonstrate the effectiveness of our proposed model and method for intelligent pre-diagnosis service in online medical environments.",
    "citationCount": 347,
    "referenceCount": 54
}