{
    "paperId": "7686dcf79e3f23f8c8ab393dd861ded6b1895f71",
    "title": "Enhancing FAIR Data Services in Agricultural Disaster: A Review",
    "year": 2023,
    "venue": "Remote Sensing",
    "authors": [
        "Lei Hu",
        "Chenxiao Zhang",
        "Mingda Zhang",
        "Yuming Shi",
        "Jiasheng Lu",
        "Zhe Fang"
    ],
    "doi": "10.3390/rs15082024",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7686dcf79e3f23f8c8ab393dd861ded6b1895f71",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-4292/15/8/2024/pdf?version=1681214209",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The agriculture sector is highly vulnerable to natural disasters and climate change, leading to severe impacts on food security, economic stability, and rural livelihoods. The use of geospatial information and technology has been recognized as a valuable tool to help farmers reduce the adverse impacts of natural disasters on agriculture. Remote sensing and GIS are gaining traction as ways to improve agricultural disaster response due to recent advancements in spatial resolution, accessibility, and affordability. This paper presents a comprehensive overview of the FAIR agricultural disaster services. It holistically introduces the current status, case studies, technologies, and challenges, and it provides a big picture of exploring geospatial applications for agricultural disaster “from farm to space”. The review begins with an overview of the governments and organizations worldwide. We present the major international and national initiatives relevant to the agricultural disaster context. The second part of this review illustrates recent research on remote sensing-based agricultural disaster monitoring, with a special focus on drought and flood events. Traditional, integrative, and machine learning-based methods are highlighted in this section. We then examine the role of spatial data infrastructure and research on agricultural disaster services and systems. The generic lifecycle of agricultural disasters is briefly introduced. Eventually, we discuss the grand challenges and emerging opportunities that range from analysis-ready data to decision-ready services, providing guidance on the foreseeable future.",
    "citationCount": 13,
    "referenceCount": 166
}