{
    "paperId": "768beefa797d49ed74f1fec69c470bd725a377bd",
    "title": "Data Management at Huawei: Recent Accomplishments and Future Challenges",
    "year": 2019,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Jianjun Chen",
        "Yu Chen",
        "Zhibiao Chen",
        "A. Ghazal",
        "Guoliang Li",
        "Sihao Li",
        "Weijie Ou",
        "Yang Sun",
        "Mingyi Zhang",
        "Minqi Zhou"
    ],
    "doi": "10.1109/ICDE.2019.00009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/768beefa797d49ed74f1fec69c470bd725a377bd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Huawei is a leading global provider of information and communication technologies (ICT) infrastructure and smart devices. With integrated solutions across four key domains: telecommunication networks, IT, smart devices, and cloud services, Huawei is committed to bringing digital transformation to every person, home and organization for a fully connected and intelligent world. Founded in 1987, Huawei currently has more than 180,000 employees, and operates in more than 170 countries and regions with revenue over 100 billion USD in 2018. Data management plays a key role in all of the four key domains above. We have developed innovative products and solutions to support rapid business growth driven by customer requirements. While many data management problems are common, each domain also has its own special requirements and challenges. In this paper, we will go through recent advancements in Huawei data management technologies including a petabyte scale enterprise analytics platform (FusionInsight MPPDB) and a highly available in-memory database for telecommunication networks (GMDB). In addition, we discuss data management challenges that we are facing in the areas of autonomous databases and device-edge-cloud collaboration data platforms.",
    "citationCount": 8,
    "referenceCount": 25
}