{
    "paperId": "76d05db2dac749027f5feb7a8f0f8fa6990bf84f",
    "title": "Intelligent geospatial maritime risk analytics using the Discrete Global Grid System",
    "year": 2021,
    "venue": "Big Earth Data",
    "authors": [
        "A. Rawson",
        "Z. Sabeur",
        "M. Brito"
    ],
    "doi": "10.1080/20964471.2021.1965370",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/76d05db2dac749027f5feb7a8f0f8fa6990bf84f",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/20964471.2021.1965370?needAccess=true",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Each year, accidents involving ships result in significant loss of life, environmental pollution and economic losses. The promotion of navigation safety through risk reduction requires methods to assess the spatial distribution of the relative likelihood of occurrence. Yet, such methods necessitate the integration of large volumes of heterogenous datasets which are not well suited to traditional data structures. This paper proposes the use of the Discrete Global Grid System (DGGS) as an efficient and advantageous structure to integrate vessel traffic, metocean, bathymetric, infrastructure and other relevant maritime datasets to predict the occurrence of ship groundings. Massive and heterogenous datasets are well suited for machine learning algorithms and this paper develops a spatial maritime risk model based on a DGGS utilising such an approach. A Random Forest algorithm is developed to predict the frequency and spatial distribution of groundings while achieving an R2 of 0.55 and a mean squared error of 0.002. The resulting risk maps are useful for decision-makers in planning the allocation of mitigation measures, targeted to regions with the highest risk. Further work is identified to expand the applications and insights which could be achieved through establishing a DGGS as a global maritime spatial data structure.",
    "citationCount": 30,
    "referenceCount": 75
}