{
    "paperId": "76e11aa6e723d4a8ed98961aebeb439b31424fdb",
    "title": "FinanceQA-Agent: A High-Precision Comprehensive Financial Technology Question-Answering Intelligent System Based on Vector Databases",
    "year": 2024,
    "venue": "2024 International Conference on Advances in Electrical Engineering and Computer Applications (AEECA)",
    "authors": [
        "Xin Liu",
        "Jingjing Zhu"
    ],
    "doi": "10.1109/AEECA62331.2024.00103",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/76e11aa6e723d4a8ed98961aebeb439b31424fdb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to the escalating complexity of financial operations and the pressing need for intelligent decision support, FinanceQA-Agent emerges as an avant-garde Financial Technology (FinTech) solution. This system integrates state-of-the-art natural language processing with advanced vector encoding to craft a high-precision, robust question-answering platform. Utilizing intranet isolation and load balancing, it ensures unparalleled security and stability, while its meticulously designed knowledge base and prompt engineering elevate the conversational accuracy and naturalness. The research methodology encompasses a multifaceted approach, including the deployment of large language models and semantic vector computations, underpinned by a comprehensive system architecture that facilitates scalability and maintenance. Pivotal to our findings is the system's remarkable capability to distill and generate precise financial insights, thereby significantly enhancing the FinTech domain's intelligence and operational efficiency. In conclusion, FinanceQA-Agent represents a transformative stride in FinTech, propelling the industry towards a future characterized by exceptional intelligence, efficiency, and security through its sophisticated question-answering prowess.",
    "citationCount": 0,
    "referenceCount": 17
}