{
    "paperId": "76fa5acab9a15fd36c827e68d5055aae3cf0cd50",
    "title": "Fusing Latent Dirichlet Allocation with Fuzzy Matching for Improved Topic Expressiveness in Text Mining",
    "year": 2023,
    "venue": "2023 Third International Conference on Digital Data Processing (DDP)",
    "authors": [
        "Jiahua Yu",
        "Simon Fong",
        "Qun Song",
        "Lianggui Tang",
        "R. Millham"
    ],
    "doi": "10.1109/DDP60485.2023.00050",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/76fa5acab9a15fd36c827e68d5055aae3cf0cd50",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper introduces an innovative fusion of Latent Dirichlet Allocation (LDA) with fuzzy matching, aiming to elevate the expressiveness of topics in text mining. Traditional LDA techniques, while effective, often fall short in capturing the intricate semantic nuances and contextual variations of keywords within a given document. In this enhanced version, we propose a methodology that seamlessly integrates LDA with fuzzy matching algorithms, offering a more refined approach to topic modeling. The key distinction lies in the enhanced model's ability to not only identify keywords but also accommodate their diverse forms and variations, thus creating a more comprehensive and expressive representation of topics. The integration of fuzzy matching enriches the association between topics and the underlying text by considering partial matches and accounting for variations in spelling, structure, and context. This enhancement ensures a more accurate reflection of the intricate relationships between topics and the surrounding text, fostering a deeper understanding of the document's content. To validate the effectiveness of our proposed approach, we conducted extensive experiments on diverse textual datasets. Results demonstrate that the enhanced model consistently outperforms traditional LDA in terms of capturing topic expressiveness. By revealing the subtle nuances and contextual richness within documents, our methodology contributes to a more nuanced and insightful interpretation of textual data. This paper provides a significant advancement in the field of text mining, offering researchers and practitioners an enhanced tool for uncovering the hidden layers of meaning embedded in large corpora of text.",
    "citationCount": 0,
    "referenceCount": 19
}