{
    "paperId": "771661aabc40b39ba570f811dfd60c2ab4876a1b",
    "title": "Performance Improvement of Processor Through Configurable Approximate Arithmetic Units in Multicore Systems",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Seyed Ali Kashani Gharavi",
        "Saeed Safari"
    ],
    "doi": "10.1109/ACCESS.2024.3380912",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/771661aabc40b39ba570f811dfd60c2ab4876a1b",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10478084.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multicore systems are utilized in a wide range of applications, from embedded systems to high-performance applications. Controlling power consumption while maximizing performance under the Thermal Design Power (TDP) becomes increasingly important when power density emerges as the key restriction for multicore systems. Dynamic voltage-frequency scaling (DVFS) approaches have been effective in dynamically power control and are commercially accessible. We propose a novel approach to improve the performance of multicore systems by utilizing configurable approximate Arithmetic units. The proposed system includes a machine learning-based framework for online power regulation and quality monitoring of application output. This framework dynamically adjusts the frequency and precision of the Arithmetic units to maximize performance while considering TDP constraints and the desired output quality. The experimental results demonstrate the effectiveness of the proposed approach. Using a floating point approximate Arithmetic Logic Unit (ALU) with three distinct configurations in each core, the multicore system can execute approximable applications up to 19% faster than a precise multicore system, while operating within the same TDP limit.",
    "citationCount": 2,
    "referenceCount": 35
}