{
    "paperId": "77280e97595d04aa9f7d85f2fb31cc8e189acb3d",
    "title": "R-Bot: An LLM-based Query Rewrite System",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Zhaoyan Sun",
        "Xuanhe Zhou",
        "Guoliang Li"
    ],
    "doi": "10.48550/arXiv.2412.01661",
    "arxivId": "2412.01661",
    "url": "https://www.semanticscholar.org/paper/77280e97595d04aa9f7d85f2fb31cc8e189acb3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Query rewrite is essential for optimizing SQL queries to improve their execution efficiency without changing their results. Traditionally, this task has been tackled through heuristic and learning-based methods, each with its limitations in terms of inferior quality and low robustness. Recent advancements in LLMs offer a new paradigm by leveraging their superior natural language and code comprehension abilities. Despite their potential, directly applying LLMs like GPT-4 has faced challenges due to problems such as hallucinations, where the model might generate inaccurate or irrelevant results. To address this, we propose\n R-Bot\n , an LLM-based query rewrite system with a systematic approach. We first design a multi-source rewrite evidence preparation pipeline to generate query rewrite evidences for guiding LLMs to avoid hallucinations. We then propose a hybrid structure-semantics retrieval method that combines structural and semantic analysis to retrieve the most relevant rewrite evidences for effectively answering an online query. We next propose a step-by-step LLM rewrite method that iteratively leverages the retrieved evidences to select and arrange rewrite rules with self-reflection. We conduct comprehensive experiments on real-world datasets and widely used benchmarks, and demonstrate the superior performance of our system,\n R-Bot\n , surpassing state-of-the-art query rewrite methods. The\n R-Bot\n system has been deployed at Huawei and with real customers, and the results show that the proposed\n R-Bot\n system achieves lower query latency.\n",
    "citationCount": 13,
    "referenceCount": 60
}