{
    "paperId": "774ffa11e28dcbcb1d94d191eaa48f1069d69347",
    "title": "Hull form optimization research based on multi‐precision back‐propagation neural network approximation model",
    "year": 2024,
    "venue": "International Journal for Numerical Methods in Fluids",
    "authors": [
        "Jie Liu",
        "Bao-sheng Zhang",
        "Yuyang Lai",
        "Liqiao Fang"
    ],
    "doi": "10.1002/fld.5291",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/774ffa11e28dcbcb1d94d191eaa48f1069d69347",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In order to shorten the optimization cycle of ship design optimization and solve the time‐consuming problem of computational fluid dynamics (CFD) numerical calculation, this paper proposes a multi‐precision back‐propagation neural network (MP‐BP) approximation technology. Fewer high‐precision ship samples and more low‐precision ship samples were used to construct an approximate model, back‐propagation (BP) neural network was used to train multi‐precision samples. So that the approximate model is as close as possible to the real model, and achieving the effect of high‐precision approximation model. Subsequently, numerical verification and typical hull form verification are given. Based on CFD and Rankine theory, the multi‐objective design optimization framework for ship comprehensive navigation performance is constructed. The multi‐objective approximation model of KCS ship is constructed by MP‐BP approximation technology, and optimized by particle swarm optimization (PSO) algorithm. The results show that the multi‐objective optimization design framework using the MP‐BP approximation model can capture the global optimal solution and improve the efficiency of the entire hull form design optimization. It can provide a certain degree of technical support for green ship and low‐carbon shipping.",
    "citationCount": 10,
    "referenceCount": 34
}