{
    "paperId": "776596b95ca50159ff0dd0a591361cf454e70d78",
    "title": "On Implementing Autonomic Systems with a Serverless Computing Approach: The Case of Self-Partitioning Cloud Caches",
    "year": 2020,
    "venue": "De Computis",
    "authors": [
        "Edwin F. Boza",
        "Xavier Andrade",
        "J. Cedeño",
        "Jorge R. Murillo",
        "Harold Aragon",
        "Cristina L. Abad",
        "Andres G. Abad"
    ],
    "doi": "10.3390/computers9010014",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/776596b95ca50159ff0dd0a591361cf454e70d78",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2073-431X/9/1/14/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The research community has made significant advances towards realizing self-tuning cloud caches; notwithstanding, existing products still require manual expert tuning to maximize performance. Cloud (software) caches are built to swiftly serve requests; thus, avoiding costly functionality additions not directly related to the request-serving control path is critical. We show that serverless computing cloud services can be leveraged to solve the complex optimization problems that arise during self-tuning loops and can be used to optimize cloud caches for free. To illustrate that our approach is feasible and useful, we implement SPREDS (Self-Partitioning REDiS), a modified version of Redis that optimizes memory management in the multi-instance Redis scenario. A cost analysis shows that the serverless computing approach can lead to significant cost savings: The cost of running the controller as a serverless microservice is 0.85% of the cost of the always-on alternative. Through this case study, we make a strong case for implementing the controller of autonomic systems using a serverless computing approach.",
    "citationCount": 4,
    "referenceCount": 47
}