{
    "paperId": "776e827739fe236b29bb52e706ca65ad68fc0e64",
    "title": "SOIL: Contrastive Second-Order Interest Learning for Multimodal Recommendation",
    "year": 2024,
    "venue": "ACM Multimedia",
    "authors": [
        "Hongzu Su",
        "Jingjing Li",
        "Fengling Li",
        "Ke Lu",
        "Lei Zhu"
    ],
    "doi": "10.1145/3664647.3681207",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/776e827739fe236b29bb52e706ca65ad68fc0e64",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mainstream multimodal recommender systems are designed to learn user interest by analyzing user-item interaction graphs. However, what they learn about user interest needs to be completed because historical interactions only record items that best match user interest (i.e., the first-order interest), while suboptimal items are absent. To fully exploit user interest, we propose a Second-Order Interest Learning (SOIL) framework to retrieve second-order interest from unrecorded suboptimal items. In this framework, we build a user-item interaction graph augmented by second-order interest, an interest-aware item-item graph for the visual modality, and a similar graph for the textual modality. In our work, all three graphs are constructed from user-item interaction records and multimodal feature similarity. Similarly to other graph-based approaches, we apply graph convolutional networks to each of the three graphs to learn representations of users and items. To improve the exploitation of both first-order and second-order interest, we optimize the model by implementing contrastive learning modules for user and item representations at both the user-item and item-item levels. The proposed framework is evaluated on three real-world public datasets in online shopping scenarios. Experimental results verify that our method is able to significantly improve prediction performance. For instance, our method outperforms the previous state-of-the-art method MGCN by an average of 8.1% in terms of Recall@10. Code: https://github.com/TL-UESTC/SOIL.",
    "citationCount": 8,
    "referenceCount": 40
}