{
    "paperId": "7789809e875f5fca94bfc254245dc4339c892c02",
    "title": "A trustable and interoperable decentralized solution for citizen-centric and cross-border eGovernance: A conceptual approach",
    "year": 2021,
    "venue": "International Conference on Electronic Government",
    "authors": [
        "George Domalis",
        "N. Karacapilidis",
        "Dimitris Tsakalidis",
        "Anastasios Giannaros"
    ],
    "doi": "10.1007/978-3-030-84789-0_19",
    "arxivId": "2103.15458",
    "url": "https://www.semanticscholar.org/paper/7789809e875f5fca94bfc254245dc4339c892c02",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aiming to support a cross-sector and cross-border eGovernance paradigm for sharing common public services, this paper introduces an AI-enhanced solution that enables beneficiaries to participate in a decenntralized network for effective big data exchange and service delivery that promotes the once-only priority and is by design digital, efficient, cost-effective, interoperable and secure. The solution comprises (i) a reliable and efficient decentralized mechanism for data sharing, capable of addressing the complexity of the processes and their high demand of resources; (ii) an ecosystem for delivering mobile services tailored to the needs of stakeholders; (iii) a single sign-on Wallet mechanism to manage the transactions with multiple services; and (iv) an intercommunication layer, responsible for the secure exchange of information among existing eGovernment systems with newly developed ones. An indicative application scenario showcases the potential of our approach.",
    "citationCount": 7,
    "referenceCount": 29
}