{
    "paperId": "78e95db0182d8008dcf346bf52d357af51ca0ccc",
    "title": "Graph Data Management and Graph Machine Learning: Synergies and Opportunities",
    "year": 2025,
    "venue": "SIGMOD record",
    "authors": [
        "Arijit Khan",
        "Xiangyu Ke",
        "Yinghui Wu"
    ],
    "doi": "10.1145/3749116.3749122",
    "arxivId": "2502.00529",
    "url": "https://www.semanticscholar.org/paper/78e95db0182d8008dcf346bf52d357af51ca0ccc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The ubiquity of machine learning, particularly deep learning, applied to graphs is evident in applications ranging from cheminformatics (drug discovery) and bioinformatics (protein interaction prediction) to knowledge graph-based query answering, fraud detection, and social network analysis. Concurrently, graph data management deals with the research and development of effective, efficient, scalable, robust, and user-friendly systems and algorithms for storing, processing, and analyzing vast quantities of heterogeneous and complex graph data. Our survey provides a comprehensive overview of the synergies between graph data management and graph machine learning, illustrating how they intertwine and mutually reinforce each other across the entire spectrum of the graph data science and machine learning pipeline. Specifically, the survey highlights two crucial aspects: (1) How graph data management enhances graph machine learning, including contributions such as improved graph neural network performance through graph data cleaning, scalable graph embedding, efficient graph-based vector data management, robust graph neural networks, user-friendly explainability methods; and (2) how graph machine learning, in turn, aids in graph data management, with a focus on applications like query answering over knowledge graphs and various data science tasks. We discuss pertinent open problems and delineate crucial research directions.",
    "citationCount": 1,
    "referenceCount": 167
}