{
    "paperId": "79054a1becbec6417cc8623349b6cd136a89d716",
    "title": "An Accelerated Maximum Flow Algorithm with Prediction Enhancement in Dynamic LEO Networks",
    "year": 2025,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Jiayin Sheng",
        "Xinjie Guan",
        "Fuliang Yang",
        "Xili Wan"
    ],
    "doi": "10.3390/s25082555",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/79054a1becbec6417cc8623349b6cd136a89d716",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient data transmission in low Earth orbit (LEO) satellite networks is critical for supporting real-time global communication, Earth observation, and numerous data-intensive space missions. A fundamental challenge in these networks involves solving the maximum flow problem, which determines the optimal data throughput across highly dynamic topologies with limited onboard energy and data processing capability. Traditional algorithms often fall short in these environments due to their high computational costs and inability to adapt to frequent topological changes or fluctuating link capacities. This paper introduces an accelerated maximum flow algorithm specifically designed for dynamic LEO networks, leveraging a prediction-enhanced approach to improve both speed and adaptability. The proposed algorithm integrates a novel energy-time expanded graph (e-TEG) framework, which jointly models satellite-specific constraints including time-varying inter-satellite visibility, limited onboard processing capacities, and dynamic link capacities. In addition, a learning-augmented warm-start strategy is introduced to enhance the Ford–Fulkerson algorithm. It generates near-optimal initial flows based on historical network states, which reduces the number of augmentation steps required and accelerates computation under dynamic conditions. Theoretical analyses confirm the correctness and time efficiency of the proposed approach. Evaluation results validate that the prediction-enhanced approach achieves up to a 32.2% reduction in computation time compared to conventional methods, particularly under varying storage capacity and network topologies. These results demonstrate the algorithm’s potential to support high-throughput, efficient data transmission in future satellite communication systems.",
    "citationCount": 0,
    "referenceCount": 45
}