{
    "paperId": "7909d0c8112d61bc3d225908eb499ceab4e34ae9",
    "title": "Competitive Search in the Line and the Star with Predictions",
    "year": 2023,
    "venue": "International Symposium on Mathematical Foundations of Computer Science",
    "authors": [
        "Spyros Angelopoulos"
    ],
    "doi": "10.4230/LIPIcs.MFCS.2023.12",
    "arxivId": "2312.17539",
    "url": "https://www.semanticscholar.org/paper/7909d0c8112d61bc3d225908eb499ceab4e34ae9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study the classic problem of searching for a hidden target in the line and the $m$-ray star, in a setting in which the searcher has some prediction on the hider's position. We first focus on the main metric for comparing search strategies under predictions; namely, we give positive and negative results on the consistency-robustness tradeoff, where the performance of the strategy is evaluated at extreme situations in which the prediction is either error-free, or adversarially generated, respectively. For the line, we show tight bounds concerning this tradeoff, under the untrusted advice model, in which the prediction is in the form of a $k$-bit string which encodes the responses to $k$ binary queries. For the star, we give tight, and near-tight tradeoffs in the positional and the directional models, in which the prediction is related to the position of the target within the star, and to the ray on which the target hides, respectively. Last, for all three prediction models, we show how to generalize our study to a setting in which the performance of the strategy is evaluated as a function of the searcher's desired tolerance to prediction errors, both in terms of positive and inapproximability results.",
    "citationCount": 1,
    "referenceCount": 52
}