{
    "paperId": "792e668192c53ada38dd07d1b287178e4544f126",
    "title": "Fog-Assisted Content-Centric Healthcare IoT",
    "year": 2020,
    "venue": "IEEE Internet of Things Magazine",
    "authors": [
        "Xiaonan Wang",
        "Yanli Li"
    ],
    "doi": "10.1109/IOTM.0001.2000005",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/792e668192c53ada38dd07d1b287178e4544f126",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Remote and automated healthcare monitoring systems aim to detect patient health emergencies and symptoms early enough in order to take timely and effective treatments. The technological advancements in the Internet of Things (IoT) have created opportunities for implementing such healthcare monitoring systems where rapid patient data retrieval is vital. However, due to limited computation and storage resources of IoT nodes, the prerequisite for rapid patient data retrieval is to resolve the resource restraint problem. Compared to IoT nodes, fog nodes in fog computing have powerful computing and abundant storage resources that can process, cache and provide data efficiently. Hence, we are motivated to exploit fog computing to overcome resource limitations of IoT nodes, and propose a fog-assisted healthcare IoT system. To achieve rapid patient data retrieval, this system exploits the in-network caching and request aggregation of the content-centric networking to shorten patient data retrieval latency. Finally, the proposed system is quantitatively evaluated. According to the experimental results, our system reduces the patient data retrieval latency by nearly 28.5 percent compared with the IoT-based healthcare system.",
    "citationCount": 8,
    "referenceCount": 16
}