{
    "paperId": "79395f4ef32b925381f7ec9a824b05bdb982fd33",
    "title": "Large Language Models as Zero-Shot Conversational Recommenders",
    "year": 2023,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Zhankui He",
        "Zhouhang Xie",
        "Rahul Jha",
        "H. Steck",
        "Dawen Liang",
        "Yesu Feng",
        "Bodhisattwa Prasad Majumder",
        "Nathan Kallus",
        "Julian McAuley"
    ],
    "doi": "10.1145/3583780.3614949",
    "arxivId": "2308.10053",
    "url": "https://www.semanticscholar.org/paper/79395f4ef32b925381f7ec9a824b05bdb982fd33",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3583780.3614949",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we present empirical studies on conversational recommendation tasks using representative large language models in a zero-shot setting with three primary contributions. (1) Data: To gain insights into model behavior in \"in-the-wild\" conversational recommendation scenarios, we construct a new dataset of recommendation-related conversations by scraping a popular discussion website. This is the largest public real-world conversational recommendation dataset to date. (2) Evaluation: On the new dataset and two existing conversational recommendation datasets, we observe that even without fine-tuning, large language models can outperform existing fine-tuned conversational recommendation models. (3) Analysis: We propose various probing tasks to investigate the mechanisms behind the remarkable performance of large language models in conversational recommendation. We analyze both the large language models' behaviors and the characteristics of the datasets, providing a holistic understanding of the models' effectiveness, limitations and suggesting directions for the design of future conversational recommenders.",
    "citationCount": 190,
    "referenceCount": 77
}