{
    "paperId": "793c427067c1988a58a7a1e564bee130cc052684",
    "title": "To Share or Hide: Confidential Model Compilation as a Service with Privacy-Preserving Transparency",
    "year": 2024,
    "venue": "IEEE International Symposium on Reliable Distributed Systems",
    "authors": [
        "Kailun Qin",
        "Dawu Gu"
    ],
    "doi": "10.1109/SRDS64841.2024.00022",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/793c427067c1988a58a7a1e564bee130cc052684",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Model Compilation as a Service (MCaaS) has emerged as critical Machine Learning (ML) supply chain infrastructure. It provides large-scale model optimization for heteroge-neous hardware devices in an easy-to-use, cost-efficient and fault-tolerant manner. However, a variety of attacks targeting the ML model supply chain have been reported. Further compounded by the complexity of the cloud environments where MCaaS operates, increasing security concerns have been raised about the generated model binaries. In response, we present Themis - confidential MCaaS with privacy-preserving transparency. To help build trust in model binaries, we increase supply chain transparency by introducing property-based integrity that captures complex property evidence throughout the compilation pipeline. Meanwhile, we underscore privacy preservation through the concept of a model property tree, which represents the provenance and integrity of a model binary. It allows constrained sharing and efficient verification of binary properties. In Themis, we enforce confidentiality to all generated binaries by default, but with fine-grained control through the use of hybrid selective encryption based on attribute-based encryption. Themis is further secured within distributed Trusted Execution Environments to ensure confidential and reliable execution. We build Themis on top of a state-of-the-art ML compiler, with our evaluations demonstrating its practicality.",
    "citationCount": 1,
    "referenceCount": 73
}