{
    "paperId": "7948ef2dd24aac811f3177eb3b6bad2de6ba8703",
    "title": "Low-Precision Hardware Architectures Meet Recommendation Model Inference at Scale",
    "year": 2021,
    "venue": "IEEE Micro",
    "authors": [
        "Zhaoxia Deng",
        "Jongsoo Park",
        "P. T. P. Tang",
        "Haixin Liu",
        "J. Yang",
        "Hector Yuen",
        "Jianyu Huang",
        "D. Khudia",
        "Xiaohan Wei",
        "Ellie Wen",
        "Dhruv Choudhary",
        "Raghuraman Krishnamoorthi",
        "Carole-Jean Wu",
        "S. Nadathur",
        "Changkyu Kim",
        "M. Naumov",
        "S. Naghshineh",
        "M. Smelyanskiy"
    ],
    "doi": "10.1109/MM.2021.3081981",
    "arxivId": "2105.12676",
    "url": "https://www.semanticscholar.org/paper/7948ef2dd24aac811f3177eb3b6bad2de6ba8703",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tremendous success of machine learning (ML) and the unabated growth in model complexity motivated many ML-specific designs in hardware architectures to speed up the model inference. While these architectures are diverse, highly optimized low-precision arithmetic is a component shared by most. Nevertheless, recommender systems important to Facebook’s personalization services are demanding and complex: They must serve billions of users per month responsively with low latency while maintaining high prediction accuracy. Do these low-precision architectures work well with our production recommendation systems? They do. But not without significant effort. In this article, we share our search strategies to adapt reference recommendation models to low-precision hardware, our optimization of low-precision compute kernels, and the tool chain to maintain our models’ accuracy throughout their lifespan. We believe our lessons from the trenches can promote better codesign between hardware architecture and software engineering, and advance the state of the art of ML in industry.",
    "citationCount": 11,
    "referenceCount": 62
}