{
    "paperId": "7994d1818d1086462c652873aa61fa318d01c86c",
    "title": "Creating and Using Minimizer Sketches in Computational Genomics",
    "year": 2023,
    "venue": "J. Comput. Biol.",
    "authors": [
        "Hongyu Zheng",
        "G. Marçais",
        "Carl Kingsford"
    ],
    "doi": "10.1089/cmb.2023.0094",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7994d1818d1086462c652873aa61fa318d01c86c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1089/cmb.2023.0094",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Processing large data sets has become an essential part of computational genomics. Greatly increased availability of sequence data from multiple sources has fueled breakthroughs in genomics and related fields but has led to computational challenges processing large sequencing experiments. The minimizer sketch is a popular method for sequence sketching that underlies core steps in computational genomics such as read mapping, sequence assembling, k-mer counting, and more. In most applications, minimizer sketches are constructed using one of few classical approaches. More recently, efforts have been put into building minimizer sketches with desirable properties compared with the classical constructions. In this survey, we review the history of the minimizer sketch, the theories developed around the concept, and the plethora of applications taking advantage of such sketches. We aim to provide the readers a comprehensive picture of the research landscape involving minimizer sketches, in anticipation of better fusion of theory and application in the future.",
    "citationCount": 17,
    "referenceCount": 120
}