{
    "paperId": "79e0637f45ad85eb97fde6d10dd26f2154812cd7",
    "title": "Learning Predictions for Algorithms with Predictions",
    "year": 2022,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "M. Khodak",
        "Maria-Florina Balcan",
        "Ameet Talwalkar",
        "Sergei Vassilvitskii"
    ],
    "doi": null,
    "arxivId": "2202.09312",
    "url": "https://www.semanticscholar.org/paper/79e0637f45ad85eb97fde6d10dd26f2154812cd7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A burgeoning paradigm in algorithm design is the field of algorithms with predictions, in which algorithms can take advantage of a possibly-imperfect prediction of some aspect of the problem. While much work has focused on using predictions to improve competitive ratios, running times, or other performance measures, less effort has been devoted to the question of how to obtain the predictions themselves, especially in the critical online setting. We introduce a general design approach for algorithms that learn predictors: (1) identify a functional dependence of the performance measure on the prediction quality and (2) apply techniques from online learning to learn predictors, tune robustness-consistency trade-offs, and bound the sample complexity. We demonstrate the effectiveness of our approach by applying it to bipartite matching, ski-rental, page migration, and job scheduling. In several settings we improve upon multiple existing results while utilizing a much simpler analysis, while in the others we provide the first learning-theoretic guarantees.",
    "citationCount": 29,
    "referenceCount": 50
}