{
    "paperId": "79f782432fc2a4a6c53a02d5ac709a1d61fd2f99",
    "title": "Forecasting Algorithms for Intelligent Resource Scaling: An Experimental Analysis",
    "year": 2024,
    "venue": "ACM Symposium on Cloud Computing",
    "authors": [
        "Y. Diao",
        "Dominik Horn",
        "Andreas Kipf",
        "Oleksandr Shchur",
        "Ines Benito",
        "Wenjian Dong",
        "Davide Pagano",
        "Pascal Pfeil",
        "Vikram Nathan",
        "B. Narayanaswamy",
        "Tim Kraska"
    ],
    "doi": "10.1145/3698038.3698564",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/79f782432fc2a4a6c53a02d5ac709a1d61fd2f99",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There has been a growing demand for making modern cloud-based data analytics systems cost-effective and easy to use. AI-powered intelligent resource scaling is one such effort, aiming at automating scaling decisions for serverless offerings like Amazon Redshift Serverless. The foundation of intelligent resource scaling lies in the ability to forecast query workloads and their resource consumption accurately. Although the forecasting problem has been extensively studied across various domains, there is a lack of thorough analysis of existing forecasting algorithms for large-scale, real-world cloud query workloads. This paper fills this gap by providing an in-depth analysis of forecasting algorithms for real-world cloud workloads, covering the fundamental data characteristics that distinguish query workload forecasting from prior problems and evaluating the strengths and limitations of existing algorithms in this new domain. We anticipate that our findings will provide valuable insights in informing the design of an efficient and effective solution for production use, as well as in steering the forecasting community toward more effective algorithms of high real-world impact.",
    "citationCount": 4,
    "referenceCount": 39
}