{
    "paperId": "7a0748ede292a7ea83a284ecc0a5d03887b993d6",
    "title": "Efficient Retrieval of Matrix Factorization-Based Top-k Recommendations: A Survey of Recent Approaches",
    "year": 2021,
    "venue": "Journal of Artificial Intelligence Research",
    "authors": [
        "Dung D. Le",
        "Hady W. Lauw"
    ],
    "doi": "10.1613/jair.1.12403",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7a0748ede292a7ea83a284ecc0a5d03887b993d6",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.jair.org/index.php/jair/article/download/12403/26678",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Top-k recommendation seeks to deliver a personalized list of k items to each individual user. An established methodology in the literature based on matrix factorization (MF), which usually represents users and items as vectors in low-dimensional space, is an effective approach to recommender systems, thanks to its superior performance in terms of recommendation quality and scalability. A typical matrix factorization recommender system has two main phases: preference elicitation and recommendation retrieval. The former analyzes user-generated data to learn user preferences and item characteristics in the form of latent feature vectors, whereas the latter ranks the candidate items based on the learnt vectors and returns the top-k items from the ranked list. For preference elicitation, there have been numerous works to build accurate MF-based recommendation algorithms that can learn from large datasets. However, for the recommendation retrieval phase, naively scanning a large number of items to identify the few most relevant ones may inhibit truly real-time applications. In this work, we survey recent advances and state-of-the-art approaches in the literature that enable fast and accurate retrieval for MF-based personalized recommendations. Also, we include analytical discussions of approaches along different dimensions to provide the readers with a more comprehensive understanding of the surveyed works.",
    "citationCount": 10,
    "referenceCount": 99
}