{
    "paperId": "7a17db56d23340af97210bb420b5baf1014edf0f",
    "title": "Approximating periodic functions and solving differential equations using a novel type of Fourier Neural Networks",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "M. Ngom",
        "O. Marin"
    ],
    "doi": null,
    "arxivId": "2005.13100",
    "url": "https://www.semanticscholar.org/paper/7a17db56d23340af97210bb420b5baf1014edf0f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, machine learning tools in particular neural networks have been widely used to solve differential equations. One main advantage of using machine learning, in this case, is that one does not need to mesh the computational domain and can instead randomly draw data points to solve the differential equations of interest. In this work, we propose a simple neural network to approximate low-frequency periodic functions or seek such solutions of differential equations. To this end, we build a Fourier Neural Network (FNN) represented as a shallow neural network (i.e with one hidden layer) based on the Fourier Decomposition. As opposed to traditional neural networks, which feature activation functions such as the sigmoid, logistic, ReLU, hyperbolic tangent and softmax functions, Fourier Neural Networks are composed using sinusoidal activation functions. We propose a strategy to initialize the weights of this FNN and showcase its performance against traditional networks for function approximations and differential equations solutions.",
    "citationCount": 2,
    "referenceCount": 30
}