{
    "paperId": "7a18e2b0343fe30b6e0d6a4106aebf1157004b14",
    "title": "ProCIS: A Benchmark for Proactive Retrieval in Conversations",
    "year": 2024,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Chris Samarinas",
        "Hamed Zamani"
    ],
    "doi": "10.1145/3626772.3657869",
    "arxivId": "2405.06460",
    "url": "https://www.semanticscholar.org/paper/7a18e2b0343fe30b6e0d6a4106aebf1157004b14",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2405.06460",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The field of conversational information seeking, which is rapidly gaining interest in both academia and industry, is changing how we interact with search engines through natural language interactions. Existing datasets and methods are mostly evaluating reactive conversational information seeking systems that solely provide response to every query from the user. We identify a gap in building and evaluating proactive conversational information seeking systems that can monitor a multi-party human conversation and proactively engage in the conversation at an opportune moment by retrieving useful resources and suggestions. In this paper, we introduce a large-scale dataset for proactive document retrieval that consists of over 2.8 million conversations. We conduct crowdsourcing experiments to obtain high-quality and relatively complete relevance judgments through depth-k pooling. We also collect annotations related to the parts of the conversation that are related to each document, enabling us to evaluate proactive retrieval systems. We introduce normalized proactive discounted cumulative gain (npDCG) for evaluating these systems, and further provide benchmark results for a wide range of models, including a novel model we developed for this task. We believe that the developed dataset, called ProCIS, paves the path towards developing proactive conversational information seeking systems.",
    "citationCount": 7,
    "referenceCount": 54
}