{
    "paperId": "7a92602561e40d90686d327f71719fe9afef4892",
    "title": "Data Insights Nexus-Innovative Platform for Dynamic Modeling and Visual Analytics",
    "year": 2024,
    "venue": "International Congress on Information and Communication Technology",
    "authors": [
        "V. Muneeswaran",
        "B. Venu",
        "G.Mallikarjuna Reddy",
        "P. Naga",
        "Ramya Sri",
        "N. Gayathri",
        "T. Venkata",
        "Dastagiri Reddy"
    ],
    "doi": "10.1109/ICICT60155.2024.10544527",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7a92602561e40d90686d327f71719fe9afef4892",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The study explores the terrain of data analysis by delving into Data Insights Nexus, a comprehensive system at the forefront of this field. The application integrates machine learning modeling, dynamic 2D/3D visualization, and robust anomaly detection within a unified framework. User-friendly interfaces empower effortless construction, fine-tuning, and deployment of intricate machine-learning models for deep insights from complex datasets. Advanced 2D/3D visualization transforms data relationships into visually intuitive representations. Furthermore, the system employs state-of-the-art anomaly detection, bolstering result accuracy by identifying elusive irregularities and outliers. Data Insights Nexus, as a pioneering solution, holds the potential to redefine data exploration and analysis across diverse research domains. It not only enhances efficiency but also offers unprecedented effectiveness in dealing with complex data. This research meticulously explores its components, applications, and potential impacts, providing invaluable insights for data analysts and researchers. The application represents a groundbreaking tool that promises to revolutionize research methodologies, enabling researchers to uncover new facets of data-driven discoveries.",
    "citationCount": 0,
    "referenceCount": 41
}