{
    "paperId": "7ac2fa84a90e7c407dbbf649fb1a5bb7f58eb759",
    "title": "Online Popularity Prediction Service via Minimal Substitution Reinforcement Learning for Social Networks",
    "year": 2025,
    "venue": "IEEE Transactions on Services Computing",
    "authors": [
        "Ranran Wang",
        "Yin Zhang",
        "Henning Meyerhenke",
        "Zhiliang Feng",
        "Sabita Maharjan",
        "Yan Zhang"
    ],
    "doi": "10.1109/TSC.2025.3586094",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7ac2fa84a90e7c407dbbf649fb1a5bb7f58eb759",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "One of the key challenges of current online social platforms is predicting the size of information cascades, also known as popularity prediction or cascade prediction. Accurate popularity prediction can benefit various fields, including news distribution, market decisions, and rumor detection. However, existing popularity prediction approaches concentrate more on the historical sequences of single messages, overlooking the interactions between message diffusion and the dynamic nature of social networks, which limits the timeliness and accuracy of predictions. To address this, we propose an online popularity prediction service based on minimal substitution reinforcement learning called MSRL. Specifically, we explore a substitution theory and design a minimal substitution reinforcement learning method that models diffusion as message substitution and considers mutual information diffusion. That helps the model gain a broader perspective, allowing it to fully exploit the cooperative, competitive, or dependent relationships between information diffusions. Furthermore, the reinforcement learning scheme enables the service to dynamically adjust its parameters to respond to the dynamic social network environment in real-time. Finally, extensive experiments on real-world datasets show that the MSRL outperforms state-of-the-art methods regarding accuracy and service agility.",
    "citationCount": 0,
    "referenceCount": 40
}