{
    "paperId": "7ac50c0a4ca1f306d731392bfb16446db11109a1",
    "title": "Tapping the Potential of Large Language Models as Recommender Systems: A Comprehensive Framework and Empirical Analysis",
    "year": 2024,
    "venue": "ACM Transactions on Knowledge Discovery from Data",
    "authors": [
        "Lanling Xu",
        "Junjie Zhang",
        "Bingqian Li",
        "Jinpeng Wang",
        "Sheng Chen",
        "Wayne Xin Zhao",
        "Ji-Rong Wen"
    ],
    "doi": "10.1145/3726871",
    "arxivId": "2401.04997",
    "url": "https://www.semanticscholar.org/paper/7ac50c0a4ca1f306d731392bfb16446db11109a1",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2401.04997",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, Large Language Models (LLMs) such as ChatGPT have showcased remarkable abilities in solving general tasks, demonstrating the potential for applications in recommender systems. To assess how effectively LLMs can be used in recommendation tasks, our study primarily focuses on employing LLMs as recommender systems through prompt engineering. We propose a general framework for leveraging LLMs in recommendation tasks, focusing on the capabilities of LLMs as recommenders. To conduct our analysis, we formalize the input of LLMs for recommendation into natural language prompts with two key aspects and explain how our framework can be generalized to various recommendation scenarios. As for the use of LLMs as recommenders, we analyze the impact of public availability, tuning strategies, model architecture, parameter scale, and context length on recommendation results based on the classification of LLMs. As for prompt engineering, we further analyze the impact of four important components of prompts, i.e., task descriptions, user interest modeling, candidate items construction, and prompting strategies. In each section, we first define and categorize concepts in line with the existing literature. Then, we propose inspiring research questions followed by detailed experiments on two public datasets, in order to systematically analyze the impact of different factors on recommendation performance. Based on our empirical analysis, we finally summarize promising directions to shed lights on future research.",
    "citationCount": 22,
    "referenceCount": 156
}