{
    "paperId": "7b1579f7cfbf0dea0a2937b4a4c7991d6164c625",
    "title": "Enhancing geodatabases operability: advanced human-computer interaction through RAG and Multi-Agent Systems",
    "year": 2025,
    "venue": "Big Earth Data",
    "authors": [
        "Ziming Peng",
        "X. Kuai",
        "Shuisong Ke",
        "Xuehui Dong",
        "Renzhong Guo"
    ],
    "doi": "10.1080/20964471.2025.2483541",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7b1579f7cfbf0dea0a2937b4a4c7991d6164c625",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT The increasing demand for efficient geographic data querying has underscored the need to improve both the speed and accuracy of such operations. This study presents a novel approach that combines Retrieval-Augmented Generation (RAG) with a Large Language Model (LLM)-based Multi-Agent System (MAS) to address this challenge. By leveraging Geographic Information System (GIS) metadata, the method transforms natural language queries into precise SQL queries, enhancing the functionality of LLMs in geospatial database management. RAG enriches the model’s responses with relevant external knowledge, while the MAS framework decomposes complex queries into manageable subtasks, each handled by a dedicated agent. This ensures the generation of syntactically accurate and contextually relevant SQL queries, improving query precision. Rigorous experimentation shows that the approach achieves over 80% SQL generation accuracy, surpassing traditional LLM-based techniques, even with large-scale geospatial datasets and complex queries. Additionally, the average query execution time is only 11.74 seconds, demonstrating the method’s efficiency. The practical applicability of our method has been validated through its implementation and user testing in an urban planning platform. This has made geospatial database access more accessible and user-friendly, regardless of the user’s expertise in database management or SQL, thus facilitating more efficient geospatial data interaction.",
    "citationCount": 0,
    "referenceCount": 57
}