{
    "paperId": "7b65106fdaddd3e4702b24a4d1484ad6e9ae9309",
    "title": "Acetylation of histones and non-histone proteins is not a mere consequence of ongoing transcription",
    "year": 2024,
    "venue": "Nature Communications",
    "authors": [
        "Tim Liebner",
        "Sinan Kılıç",
        "Jonas Walter",
        "Hitoshi Aibara",
        "Takeo Narita",
        "Chunaram Choudhary"
    ],
    "doi": "10.1038/s41467-024-49370-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7b65106fdaddd3e4702b24a4d1484ad6e9ae9309",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41467-024-49370-2.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In all eukaryotes, acetylation of histone lysine residues correlates with transcription activation. Whether histone acetylation is a cause or consequence of transcription is debated. One model suggests that transcription promotes the recruitment and/or activation of acetyltransferases, and histone acetylation occurs as a consequence of ongoing transcription. However, the extent to which transcription shapes the global protein acetylation landscapes is not known. Here, we show that global protein acetylation remains virtually unaltered after acute transcription inhibition. Transcription inhibition ablates the co-transcriptionally occurring ubiquitylation of H2BK120 but does not reduce histone acetylation. The combined inhibition of transcription and CBP/p300 further demonstrates that acetyltransferases remain active and continue to acetylate histones independently of transcription. Together, these results show that histone acetylation is not a mere consequence of transcription; acetyltransferase recruitment and activation are uncoupled from the act of transcription, and histone and non-histone protein acetylation are sustained in the absence of ongoing transcription.",
    "citationCount": 8,
    "referenceCount": 83
}