{
    "paperId": "7b741b5f312edcf2718976463ed810d19de37f0b",
    "title": "Market-aware Long-term Job Skill Recommendation with Explainable Deep Reinforcement Learning",
    "year": 2024,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Ying Sun",
        "Yang Ji",
        "Hengshu Zhu",
        "Fuzhen Zhuang",
        "Qing He",
        "Hui Xiong"
    ],
    "doi": "10.1145/3704998",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7b741b5f312edcf2718976463ed810d19de37f0b",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3704998",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Continuously learning new skills is essential for talents to gain a competitive advantage in the labor market. Despite extensive efforts on relevance- or preference-based skill recommendations, little attention has been given to the practical effects of job skills in the market. To bridge this gap, we propose an explainable personalized skill learning recommendation system that considers the long-term learning benefits and costs. Specifically, we model skill learning utilities based on salary and learning cost associated with job positions and propose a multi-objective deep reinforcement learning framework to model and maximize long-term utilities. Furthermore, we propose a Self-explaining Skill Recommendation Deep Q-network (SeSRDQN) that captures and prototypes prevalent skill sets in the market into representative exemplars for decision-making. SeSRDQN quantitatively decomposes the talent’s long-term learning utility into contributions from each exemplar, offering a comprehensive and multi-factorial explanation across various skill learning options. To tackle the combinatorial complexity of the skill space, we develop an MCTS-based optimization-decoding iterative training procedure for explanation fidelity and human understandability. In this way, talents will receive a tailored roadmap of essential skills, complemented by exemplar-based explanations, to effectively plan their careers. Extensive experiments on a real-world dataset validate the effectiveness and explainability of our approach.",
    "citationCount": 7,
    "referenceCount": 87
}