{
    "paperId": "7b76f3216cf396ba5eb7ce6c9b21fbe4b3d5d682",
    "title": "Supporting skill integration in an intelligent tutoring system for code tracing",
    "year": 2022,
    "venue": "Journal of Computer Assisted Learning",
    "authors": [
        "Yun Huang",
        "Peter Brusilovsky",
        "Julio Guerra",
        "K. Koedinger",
        "Christian D. Schunn"
    ],
    "doi": "10.1111/jcal.12757",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7b76f3216cf396ba5eb7ce6c9b21fbe4b3d5d682",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/jcal.12757",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Skill integration is vital in students' mastery development and is especially prominent in developing code tracing skills which are foundational to programming, an increasingly important area in the current STEM education. However, instructional design to support skill integration in learning technologies has been limited. Objectives: The current work presents the development and empirical evaluation of instructional design targeting students' difficulties in code tracing particularly in integrating component skills in the Trace Table Tutor (T3), an intelligent tutoring system. Methods: Beyond the instructional features of active learning, step-level support, and individualized problem selection of intelligent tutoring systems (ITS), the instructional design of T3 (e.g., hints, problem types, problem selection) was optimized to target skill integration based on a domain model where integrative skills were represented as combinations of component skills. We conducted an experimental study in a university-level introductory Python programming course and obtained three findings. Results and Conclusions: First, the instructional features of the ITS technology support effective learning of code tracing, as evidenced by significant learning gains (medium-to-large effect sizes). Second, performance data supports the existence of integrative skills beyond component skills. Third, an instructional design focused on integrative skills yields learning benefits beyond a design without such focus, such as improving performance efficiency (medium-to-large effect sizes). Major Takeaways: Our work demonstrates the value of designing for skill",
    "citationCount": 15,
    "referenceCount": 96
}