{
    "paperId": "7bc0f7b76a7966ac5754a1b103c10dcfa2297e15",
    "title": "User Behavior Analysis and Recommendation Optimization for Rural E-commerce Based on Adaptive Weighted Clustering Algorithm",
    "year": 2025,
    "venue": "Proceedings of the 2nd Guangdong-Hong Kong-Macao Greater Bay Area International Conference on Digital Economy and Artificial Intelligence",
    "authors": [
        "Haihong Liu"
    ],
    "doi": "10.1145/3745238.3745372",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7bc0f7b76a7966ac5754a1b103c10dcfa2297e15",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "commerce platforms are developing very fast now, and personalized recommendation systems have become a key technology to improve user experience and commercial value. But we also know that traditional recommendation algorithms still have some problems in many aspects, such as data sparseness, user behavior is always changing, and computational efficiency is a bit behind, especially in specific areas such as rural e-commerce. So now, how to design a more flexible and accurate recommendation system has become a very important research direction. In this article, we actually propose an algorithm called adaptive weighted clustering, or AWC. Its main purpose is to improve the accuracy and response speed of the recommendation system when processing user behavior features. The idea of this algorithm is also very direct, that is, it will dynamically adjust the weight of each behavior feature according to different user behaviors. Then, more personalized recommendations are given to different user groups. In this way, some limitations of traditional recommendation algorithms in dealing with data sparseness and user behavior fluctuations can be better solved. We also did some experiments to verify the effect of this AWC algorithm in e-commerce recommendation systems. The results are actually quite good, the recommendation accuracy is significantly improved, and its response speed is also quite fast. Compared with traditional collaborative filtering and content-based recommendation algorithms, the performance is indeed much better.",
    "citationCount": 0,
    "referenceCount": 8
}