{
    "paperId": "7bfcd2e30893c14558d2f0d6ad751a18b9e62610",
    "title": "Implicit Neural Solver for Time-dependent Linear PDEs with Convergence Guarantee",
    "year": 2019,
    "venue": "arXiv.org",
    "authors": [
        "Suprosanna Shit",
        "Abinav Ravi Venkatakrishnan",
        "I. Ezhov",
        "Jana Lipková",
        "M. Piraud",
        "Bjoern H Menze"
    ],
    "doi": null,
    "arxivId": "1910.03452",
    "url": "https://www.semanticscholar.org/paper/7bfcd2e30893c14558d2f0d6ad751a18b9e62610",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fast and accurate solution of time-dependent partial differential equations (PDEs) is of key interest in many research fields including physics, engineering, and biology. Generally, implicit schemes are preferred over the explicit ones for better stability and correctness. The existing implicit schemes are usually iterative and employ a general-purpose solver which may be sub-optimal for a specific class of PDEs. In this paper, we propose a neural solver to learn an optimal iterative scheme for a class of PDEs, in a data-driven fashion. We attain this objective by modifying an iteration of an existing semi-implicit solver using a deep neural network. Further, we prove theoretically that our approach preserves the correctness and convergence guarantees provided by the existing iterative-solvers. We also demonstrate that our model generalizes to a different parameter setting than the one seen during training and achieves faster convergence compared to the semi-implicit schemes.",
    "citationCount": 2,
    "referenceCount": 12
}