{
    "paperId": "7bfd6d2a2a0247f796ed9520ddcb1d95552137c5",
    "title": "Panorama: Fast-Track Nearest Neighbors",
    "year": 2025,
    "venue": "",
    "authors": [
        "Vansh Ramani",
        "Alexis Schlomer",
        "Akash Nayar",
        "Sayan Ranu",
        "Jignesh M. Patel",
        "Panagiotis Karras"
    ],
    "doi": null,
    "arxivId": "2510.00566",
    "url": "https://www.semanticscholar.org/paper/7bfd6d2a2a0247f796ed9520ddcb1d95552137c5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Approximate Nearest-Neighbor Search (ANNS) efficiently finds data items whose embeddings are close to that of a given query in a high-dimensional space, aiming to balance accuracy with speed. Used in recommendation systems, image and video retrieval, natural language processing, and retrieval-augmented generation (RAG), ANNS algorithms such as IVFPQ, HNSW graphs, Annoy, and MRPT utilize graph, tree, clustering, and quantization techniques to navigate large vector spaces. Despite this progress, ANNS systems spend up to 99% of query time to compute distances in their final refinement phase. In this paper, we present PANORAMA, a machine learning-driven approach that tackles the ANNS verification bottleneck through data-adaptive learned orthogonal transforms that facilitate the accretive refinement of distance bounds. Such transforms compact over 90% of signal energy into the first half of dimensions, enabling early candidate pruning with partial distance computations. We integrate PANORAMA into state-of-the-art ANNS methods, namely IVFPQ/Flat, HNSW, MRPT, and Annoy, without index modification, using level-major memory layouts, SIMD-vectorized partial distance computations, and cache-aware access patterns. Experiments across diverse datasets -- from image-based CIFAR-10 and GIST to modern embedding spaces including OpenAI's Ada 2 and Large 3 -- demonstrate that PANORAMA affords a 2--30$\\times$ end-to-end speedup with no recall loss.",
    "citationCount": 0,
    "referenceCount": 43
}