{
    "paperId": "7c03ff4097aa7514581deeb90ca152e25c362bfd",
    "title": "Cost-Efficient Data Retrieval Based on Integration of VC and NDN",
    "year": 2021,
    "venue": "IEEE Transactions on Vehicular Technology",
    "authors": [
        "Xiaonan Wang",
        "Xingwei Wang",
        "Dong Wang"
    ],
    "doi": "10.1109/TVT.2021.3049795",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7c03ff4097aa7514581deeb90ca152e25c362bfd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Vehicular Cloud (VC) is a new vehicular system and aims to achieve cost-efficient data retrieval with high success rates. The Named Data Networking (NDN) presents a new data-centric mechanism and its advantages may help achieve VC. Therefore, we are motivated to exploit NDN to achieve VC. However, the intrinsic features of vehicles such as high mobility and the different architectures between NDN and vehicular networks make it challenging to deploy NDN in vehicular scenarios. For example, NDN employs limited broadcast and reverse paths to achieve data retrieval, which might lead to high data retrieval costs and frequent failures in vehicular environments. Furthermore, the lack of mobility support in NDN deteriorates the situation. Taking these issues into account, we propose a cost-efficient and VC-based data retrieval solution and aims to achieve VC by exploiting the advantages of NDN. In this solution, vehicles employ unicast and aggregation to acquire data from the nearest VC member via one data retrieval process, so efficient-cost and low-latency data retrieval is achieved. Moreover, this solution supports vehicle mobility and enhances stability of reverse paths, so data retrieval success rates are effectively improved. The proposal is evaluated, and the experimental results show that the proposal effectively reduces data retrieval costs and improve data retrieval success rates.",
    "citationCount": 10,
    "referenceCount": 46
}