{
    "paperId": "7c21ca52360fa767abfc7e35bf85b98235e18838",
    "title": "A Privacy-Preserving Record Linkage Method Based on Secret Sharing and Blockchain",
    "year": 2025,
    "venue": "Applied System Innovation",
    "authors": [
        "Shumin Han",
        "Zikang Wang",
        "Qian Zhao",
        "Derong Shen",
        "Chuang Wang",
        "Yangyang Xue"
    ],
    "doi": "10.3390/asi8040092",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7c21ca52360fa767abfc7e35bf85b98235e18838",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Privacy-preserving record linkage (PPRL) aims to link records from different data sources while ensuring sensitive information is not disclosed. Utilizing blockchain as a trusted third party is an effective strategy for enhancing transparency and auditability in PPRL. However, to ensure data privacy during computation, such approaches often require computationally intensive cryptographic techniques. This can introduce significant computational overhead, limiting the method’s efficiency and scalability. To address this performance bottleneck, we combine blockchain with the distributed computation of secret sharing to propose a PPRL method based on blockchain-coordinated distributed computation. At its core, the approach utilizes Bloom filters to encode data and employs Boolean and arithmetic secret sharing to decompose the data into secret shares, which are uploaded to the InterPlanetary File System (IPFS). Combined with masking and random permutation mechanisms, it enhances privacy protection. Computing nodes perform similarity calculations locally, interacting with IPFS only a limited number of times, effectively reducing communication overhead. Furthermore, blockchain manages the entire computation process through smart contracts, ensuring transparency and correctness of the computation, achieving efficient and secure record linkage. Experimental results demonstrate that this method effectively safeguards data privacy while exhibiting high linkage quality and scalability.",
    "citationCount": 0,
    "referenceCount": 26
}