{
    "paperId": "7c277429b7e11affa0eb5e27f4260cbad914cf96",
    "title": "Empirical Analysis of Model Selection for Heterogenous Causal Effect Estimation",
    "year": 2022,
    "venue": "International Conference on Learning Representations",
    "authors": [
        "Divyat Mahajan",
        "Ioannis Mitliagkas",
        "Brady Neal",
        "Vasilis Syrgkanis"
    ],
    "doi": "10.48550/arXiv.2211.01939",
    "arxivId": "2211.01939",
    "url": "https://www.semanticscholar.org/paper/7c277429b7e11affa0eb5e27f4260cbad914cf96",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2211.01939",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study the problem of model selection in causal inference, specifically for conditional average treatment effect (CATE) estimation. Unlike machine learning, there is no perfect analogue of cross-validation for model selection as we do not observe the counterfactual potential outcomes. Towards this, a variety of surrogate metrics have been proposed for CATE model selection that use only observed data. However, we do not have a good understanding regarding their effectiveness due to limited comparisons in prior studies. We conduct an extensive empirical analysis to benchmark the surrogate model selection metrics introduced in the literature, as well as the novel ones introduced in this work. We ensure a fair comparison by tuning the hyperparameters associated with these metrics via AutoML, and provide more detailed trends by incorporating realistic datasets via generative modeling. Our analysis suggests novel model selection strategies based on careful hyperparameter selection of CATE estimators and causal ensembling.",
    "citationCount": 24,
    "referenceCount": 48
}