{
    "paperId": "7c573a8533d0919d864d08cfa692e183703974b4",
    "title": "Verilog-to-PyG - A Framework for Graph Learning and Augmentation on RTL Designs",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Yingjie Li",
        "Mingju Liu",
        "Alan Mishchenko",
        "Cunxi Yu"
    ],
    "doi": "10.48550/arXiv.2311.05722",
    "arxivId": "2311.05722",
    "url": "https://www.semanticscholar.org/paper/7c573a8533d0919d864d08cfa692e183703974b4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The complexity of modern hardware designs necessitates advanced methodologies for optimizing and analyzing modern digital systems. In recent times, machine learning (ML) methodologies have emerged as potent instruments for assessing design quality-of-results at the Register-Transfer Level (RTL) or Boolean level, aiming to expedite design exploration of advanced RTL configurations. In this presentation, we introduce an innovative open-source framework that translates RTL designs into graph representation foundations, which can be seamlessly integrated with the PyTorch Geometric graph learning platform. Furthermore, the Verilog-to-PyG (V2PYG) framework is compatible with the open-source Electronic Design Automation (EDA) toolchain OpenROAD, facilitating the collection of labeled datasets in an utterly open-source manner. Additionally, we will present novel RTL data augmentation methods (incorporated in our framework) that enable functional equivalent design augmentation for the construction of an extensive graph-based RTL design database. Lastly, we will showcase several using cases of V2PYG with detailed scripting examples. V2PYG can be found at \\url{https://yu-maryland.github.io/Verilog-to-PyG/}.",
    "citationCount": 7,
    "referenceCount": 43
}