{
    "paperId": "7c82abc28a079d4e863caf77ed690bd37f70d295",
    "title": "Machine Learning and Deep Learning Paradigms: From Techniques to Practical Applications and Research Frontiers",
    "year": 2025,
    "venue": "De Computis",
    "authors": [
        "Kamran Razzaq",
        "M. Shah"
    ],
    "doi": "10.3390/computers14030093",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7c82abc28a079d4e863caf77ed690bd37f70d295",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/computers14030093",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) and deep learning (DL), subsets of artificial intelligence (AI), are the core technologies that lead significant transformation and innovation in various industries by integrating AI-driven solutions. Understanding ML and DL is essential to logically analyse the applicability of ML and DL and identify their effectiveness in different areas like healthcare, finance, agriculture, manufacturing, and transportation. ML consists of supervised, unsupervised, semi-supervised, and reinforcement learning techniques. On the other hand, DL, a subfield of ML, comprising neural networks (NNs), can deal with complicated datasets in health, autonomous systems, and finance industries. This study presents a holistic view of ML and DL technologies, analysing algorithms and their application’s capacity to address real-world problems. The study investigates the real-world application areas in which ML and DL techniques are implemented. Moreover, the study highlights the latest trends and possible future avenues for research and development (R&D), which consist of developing hybrid models, generative AI, and incorporating ML and DL with the latest technologies. The study aims to provide a comprehensive view on ML and DL technologies, which can serve as a reference guide for researchers, industry professionals, practitioners, and policy makers.",
    "citationCount": 16,
    "referenceCount": 140
}