{
    "paperId": "7cb4b322ff3953a521af72e10e9d8b20e7105949",
    "title": "NAS-Navigator: Visual Steering for Explainable One-Shot Deep Neural Network Synthesis",
    "year": 2020,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Anjul Tyagi",
        "C. Xie",
        "Klaus Mueller"
    ],
    "doi": "10.1109/TVCG.2022.3209361",
    "arxivId": "2009.13008",
    "url": "https://www.semanticscholar.org/paper/7cb4b322ff3953a521af72e10e9d8b20e7105949",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2009.13008",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The success of DL can be attributed to hours of parameter and architecture tuning by human experts. Neural Architecture Search (NAS) techniques aim to solve this problem by automating the search procedure for DNN architectures making it possible for non-experts to work with DNNs. Specifically, One-shot NAS techniques have recently gained popularity as they are known to reduce the search time for NAS techniques. One-Shot NAS works by training a large template network through parameter sharing which includes all the candidate NNs. This is followed by applying a procedure to rank its components through evaluating the possible candidate architectures chosen randomly. However, as these search models become increasingly powerful and diverse, they become harder to understand. Consequently, even though the search results work well, it is hard to identify search biases and control the search progression, hence a need for explainability and human-in-the-loop (HIL) One-Shot NAS. To alleviate these problems, we present NAS-Navigator, a visual analytics (VA) system aiming to solve three problems with One-Shot NAS; explainability, HIL design, and performance improvements compared to existing state-of-the-art (SOTA) techniques. NAS-Navigator gives full control of NAS back in the hands of the users while still keeping the perks of automated search, thus assisting non-expert users. Analysts can use their domain knowledge aided by cues from the interface to guide the search. Evaluation results confirm the performance of our improved One-Shot NAS algorithm is comparable to other SOTA techniques. While adding Visual Analytics (VA) using NAS-Navigator shows further improvements in search time and performance. We designed our interface in collaboration with several deep learning researchers and evaluated NAS-Navigator through a control experiment and expert interviews.",
    "citationCount": 6,
    "referenceCount": 65
}