{
    "paperId": "7ce2174ce942c23a3a139f02876a49f093df9e33",
    "title": "Temporal Correlation of Internet Observatories and Outposts",
    "year": 2022,
    "venue": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum",
    "authors": [
        "J. Kepner",
        "Michael Jones",
        "Daniel Andersen",
        "Aydin Bulucc",
        "C. Byun",
        "K. Claffy",
        "Tim Davis",
        "W. Arcand",
        "Jonathan Bernays",
        "David Bestor",
        "William Bergeron",
        "V. Gadepally",
        "Daniel Grant",
        "Micheal Houle",
        "M. Hubbell",
        "Hayden Jananthan",
        "Anna Klein",
        "C. Meiners",
        "Lauren Milechin",
        "A. Morris",
        "J. Mullen",
        "Sandeep Pisharody",
        "Andrew Prout",
        "A. Reuther",
        "Antonio Rosa",
        "S. Samsi",
        "Douglas Stetson",
        "Charles Yee",
        "P. Michaleas"
    ],
    "doi": "10.1109/IPDPSW55747.2022.00054",
    "arxivId": "2203.10230",
    "url": "https://www.semanticscholar.org/paper/7ce2174ce942c23a3a139f02876a49f093df9e33",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2203.10230",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Internet has become a critical component of modern civilization requiring scientific exploration akin to endeavors to understand the land, sea, air, and space environments. Understanding the baseline statistical distributions of traffic are essential to the scientific understanding of the Internet. Correlating data from different Internet observatories and outposts can be a useful tool for gaining insights into these distributions. This work compares observed sources from the largest Internet telescope (the CAIDA darknet telescope) with those from a commercial outpost (the GreyNoise honeyfarm). Neither of these locations actively emit Internet traffic and provide distinct observations of unsolicited Internet traffic (primarily botnets and scanners). Newly developed GraphBLAS hyperspace matrices and D4M associative array technologies enable the efficient analysis of these data on significant scales. The CAIDA sources are well approximated by a Zipf-Mandelbrot distribution. Over a 6-month period 70% of the brightest (highest frequency) sources in the CAIDA telescope are consistently detected by coeval observations in the GreyNoise honeyfarm. This overlap drops as the sources dim (reduce frequency) and as the time difference between the observations grows. The probability of seeing a CAIDA source is proportional to the logarithm of the brightness. The temporal correlations are well described by a modified Cauchy distribution. These observations are consistent with a correlated high frequency beam of sources that drifts on a time scale of a month.",
    "citationCount": 9,
    "referenceCount": 54
}