{
    "paperId": "7cfd61a5f4c8d3b41922764941f6e2057109ec93",
    "title": "Soft computing for estimating concrete strength in marine settings using water and environmental data",
    "year": 2025,
    "venue": "Maritime Engineering",
    "authors": [
        "Bilal Siddiq",
        "Muhammad Faisal Javed",
        "Haidar Ali",
        "Hisham Alabduljabbar"
    ],
    "doi": "10.1680/jmaen.25.00008",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7cfd61a5f4c8d3b41922764941f6e2057109ec93",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Marine construction plays an essential role in transportation, safety, economic, and strategic development. However, seawater accelerates the deterioration of concrete structures, necessitating regular structural monitoring. This study seeks to predict the compressive strength of concrete exposed to marine environments using optimised and cost-effective machine learning models: support vector regression (SVR), gene expression programming (GEP), and extreme gradient boosting (XGBoost). A data set of 144 specimens with six input variables was split into training (80%) and testing (20%) phases. Model reliability was assessed using performance metrics, K-fold cross-validation, and uncertainty analysis. Particle swarm optimisation (PSO) was applied to optimise model hyperparameters. Results indicated that PSO-XGBoost demonstrated the highest predictive accuracy (R2 = 0.99) with the lowest error (root mean square error [RMSE] = 0.02 MPa), outperforming PSO-GEP (R2 = 0.96, RMSE = 10 MPa), and PSO-SVR (R2 = 0.90, RMSE = 57.1 MPa). Shapley analysis identified the water-to-cement (W/C) ratio as the most influential factor in marine concrete strength. The integration of PSO with advanced ML models and the development of GEP-based predictive equations enhance model interpretability. A practical graphical interface was also developed for real-world engineering use, thus providing a valuable tool for improving durability assessment of marine structures.",
    "citationCount": 0,
    "referenceCount": 98
}