{
    "paperId": "7d2ccb81bae91778bf74ff5bdb400070af55d7d3",
    "title": "On Integrating Time-Series Modeling with Long Short-Term Memory and Bayesian Optimization: A Comparative Analysis for Photovoltaic Power Forecasting",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Massimo Pacella",
        "Antonio Papa",
        "G. Papadia"
    ],
    "doi": "10.3390/app14083217",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7d2ccb81bae91778bf74ff5bdb400070af55d7d3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/14/8/3217/pdf?version=1712837210",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The means of energy generation are rapidly progressing as production shifts from a centralized model to a fully decentralized one that relies on renewable energy sources. Energy generation is intermittent and difficult to control owing to the high variability in the weather parameters. Consequently, accurate forecasting has gained increased significance in ensuring a balance between energy supply and demand with maximum efficiency and sustainability. Despite numerous studies on this issue, large sample datasets and measurements of meteorological variables at plant sites are generally required to obtain a higher prediction accuracy. In practical applications, we often encounter the problem of insufficient sample data, which makes it challenging to accurately forecast energy production with limited data. The Holt–Winters exponential smoothing method is a statistical tool that is frequently employed to forecast periodic series, owing to its low demand for training data and high forecasting accuracy. However, this model has limitations, particularly when handling time-series analysis for long-horizon predictions. To overcome this shortcoming, this study proposes an integrated approach that combines the Holt–Winters exponential smoothing method with long short-term memory and Bayesian optimization to handle long-range dependencies. For illustrative purposes, this new method is applied to forecast rooftop photovoltaic production in a real-world case study, where it is assumed that measurements of meteorological variables (such as solar irradiance and temperature) at the plant site are not available. Through our analysis, we found that by utilizing these methods in combination, we can develop more accurate and reliable forecasting models that can inform decision-making and resource management in this field.",
    "citationCount": 2,
    "referenceCount": 41
}