{
    "paperId": "7d4c92cd17ef79b03baf01796319cf888024f90a",
    "title": "In-Network Neural Networks: Challenges and Opportunities for Innovation",
    "year": 2021,
    "venue": "IEEE Network",
    "authors": [
        "M. Luizelli",
        "Ronaldo Canofre",
        "A. Lorenzon",
        "F. Rossi",
        "Weverton Cordeiro",
        "Oscar M. Caicedo"
    ],
    "doi": "10.1109/MNET.101.2100098",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7d4c92cd17ef79b03baf01796319cf888024f90a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The quest for self-driving networks poses growing pressure to manage network events at a nano-second scale. In this article, we make a case for leveraging programmable forwarding planes to achieve self-driving networks and respond to their dynamism in real time by in-network intelligence and without performing traffic steering/mirroring to centralized management solutions (intelligent or not). We briefly cover throughout the article preliminary ideas in the in-network neural networks field and discuss the technical challenges of running machine learning techniques entirely in the forwarding plane. We also highlight potential use cases of having an autonomous intelligent network capable of self-adapting to dynamic network behavior changes with minimal to no human intervention, including smart network telemetry, smart traffic engineering, real-time flow classification, and network tomography. We close with a roadmap of research opportunities enabled by distributed in-network intelligence in programma-ble forwarding planes.",
    "citationCount": 17,
    "referenceCount": 20
}