{
    "paperId": "7d85248929d9723410ffd1491ab9400bbcd96da9",
    "title": "Multi-omics reveal microbial determinants impacting the treatment outcome of antidepressants in major depressive disorder",
    "year": 2023,
    "venue": "Microbiome",
    "authors": [
        "Yaping Wang",
        "Jingjing Zhou",
        "Junbin Ye",
        "Zuoli Sun",
        "Yi He",
        "Yingxin Zhao",
        "Siyu Ren",
        "Guofu Zhang",
        "Min Liu",
        "P. Zheng",
        "Gang Wang",
        "Jian Yang"
    ],
    "doi": "10.1186/s40168-023-01635-6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7d85248929d9723410ffd1491ab9400bbcd96da9",
    "isOpenAccess": true,
    "openAccessPdf": "https://microbiomejournal.biomedcentral.com/counter/pdf/10.1186/s40168-023-01635-6",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background There is a growing body of evidence suggesting that disturbance of the gut-brain axis may be one of the potential causes of major depressive disorder (MDD). However, the effects of antidepressants on the gut microbiota, and the role of gut microbiota in influencing antidepressant efficacy are still not fully understood. Results To address this knowledge gap, a multi-omics study was undertaken involving 110 MDD patients treated with escitalopram (ESC) for a period of 12 weeks. This study was conducted within a cohort and compared to a reference group of 166 healthy individuals. It was found that ESC ameliorated abnormal blood metabolism by upregulating MDD-depleted amino acids and downregulating MDD-enriched fatty acids. On the other hand, the use of ESC showed a relatively weak inhibitory effect on the gut microbiota, leading to a reduction in microbial richness and functions. Machine learning-based multi-omics integrative analysis revealed that gut microbiota contributed to the changes in plasma metabolites and was associated with several amino acids such as tryptophan and its gut microbiota-derived metabolite, indole-3-propionic acid (I3PA). Notably, a significant correlation was observed between the baseline microbial richness and clinical remission at week 12. Compared to non-remitters, individuals who achieved remission had a higher baseline microbial richness, a lower dysbiosis score, and a more complex and well-organized community structure and bacterial networks within their microbiota. These findings indicate a more resilient microbiota community in remitters. Furthermore, we also demonstrated that it was not the composition of the gut microbiota itself, but rather the presence of sporulation genes at baseline that could predict the likelihood of clinical remission following ESC treatment. The predictive model based on these genes revealed an area under the curve (AUC) performance metric of 0.71. Conclusion This study provides valuable insights into the role of the gut microbiota in the mechanism of ESC treatment efficacy for patients with MDD. The findings represent a significant advancement in understanding the intricate relationship among antidepressants, gut microbiota, and the blood metabolome. Additionally, this study offers a microbiota-centered perspective that can potentially improve antidepressant efficacy in clinical practice. By shedding light on the interplay between these factors, this research contributes to our broader understanding of the complex mechanisms underlying the treatment of MDD and opens new avenues for optimizing therapeutic approaches. Video Abstract",
    "citationCount": 46,
    "referenceCount": 98
}