{
    "paperId": "7db940d5806ff793b69f1b079465b42132f22e82",
    "title": "Eigen+: Memory Over-Subscription for Alibaba Cloud Databases",
    "year": 2025,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Ji You Li",
        "Jiachi Zhang",
        "Yuhang Liu",
        "Wenchao Zhou",
        "Xin Zhou",
        "Fangyuan Zhou",
        "Feifei Li"
    ],
    "doi": "10.1145/3722212.3724435",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7db940d5806ff793b69f1b079465b42132f22e82",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Memory is a critical bottleneck in cloud computing. While memory over-subscription enhances resource utilization by allowing more instances per machine, it increases the risk of Out of Memory (OOM) errors, potentially compromising service availability and violating Service Level Objectives (SLOs). Traditional methods predict memory utilization based on historical data and use bin packing algorithms for resource scheduling but often fail under high utilization due to inaccurate predictions. We observe that in cloud databases, the causes of OOM errors adhere to the Pareto Principle: the majority of OOM errors originate from a minority of instances. Leveraging this insight, we transform the complex prediction problem into a classification task by identifying and managing these problematic instances. We present Eigen+, a cluster management system for Alibaba Cloud databases. Eigen+ profiles and classifies instances to identify transients, optimizes resource scheduling to balance efficiency and reliability. In addition, it models the impact of memory over-subscription on SLO compliance to provide a quantitative basis for determining precise bin-packing constraints and optimizing over-subscription levels. Evaluations on production clusters demonstrate that Eigen+ improves the memory allocation ratio of an online MySQL cluster by 36.21% (from 75.67% to 111.88%) on average, while maintaining SLO compliance with no OOM occurrences.",
    "citationCount": 0,
    "referenceCount": 43
}