{
    "paperId": "7dc557f13739a68950fe2de51ae3f684966e11db",
    "title": "Document-Level Causal Event Extraction Enhanced by Temporal Relations Using Dual-Channel Neural Network",
    "year": 2025,
    "venue": "Electronics",
    "authors": [
        "Zishu Liu",
        "Yongquan Liang",
        "Weijian Ni"
    ],
    "doi": "10.3390/electronics14050992",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7dc557f13739a68950fe2de51ae3f684966e11db",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Event–event causal relation extraction (ECRE) represents a critical yet challenging task in natural language processing. Existing studies primarily focus on extracting causal sentences and events, despite the use of joint extraction methods for both tasks. However, both pipeline methods and joint extraction approaches often overlook the impact of document-level event temporal sequences on causal relations. To address this limitation, we propose a model that incorporates document-level event temporal order information to enhance the extraction of implicit causal relations between events. The proposed model comprises two channels: an event–event causal relation extraction channel (ECC) and an event–event temporal relation extraction channel (ETC). Temporal features provide critical support for modeling node weights in the causal graph, thereby improving the accuracy of causal reasoning. An Association Link Network (ALN) is introduced to construct an Event Causality Graph (ECG), incorporating an innovative design that computes node weights using Kullback–Leibler divergence and Gaussian kernels. The experimental results indicate that our model significantly outperforms baseline models in terms of accuracy and weighted average F1 scores.",
    "citationCount": 0,
    "referenceCount": 37
}