{
    "paperId": "7dd29cc554f14eb0d29002db39dafddfefea1dfb",
    "title": "Optimizing Cloud Data Lake Queries by Minimizing the Query Coverage Set",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Grisha Weintraub",
        "E. Gudes",
        "S. Dolev"
    ],
    "doi": "10.1109/ICDE65448.2025.00375",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7dd29cc554f14eb0d29002db39dafddfefea1dfb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud data lakes provide a modern solution for managing large volumes of data. The fundamental principle behind these systems is the separation of compute and storage layers. In this architecture, inexpensive cloud storage is utilized for data storage, while compute engines are employed to perform analytics on this data in an “on-demand” mode. However, to execute any calculations on the data, it must be transferred from the storage layer to the compute layer over the network for each query. This transfer can negatively impact calculation performance and requires significant network bandwidth. In our work, we examine various strategies to enhance query performance within a cloud data lake architecture. We begin by formalizing the problem and proposing a straightforward yet robust theoretical framework that clearly outlines the associated trade-offs. Central to our framework is the concept of a “query coverage set,” which is defined as the collection of files that need to be accessed from storage to fulfill a specific query. Our objective is to identify the minimal coverage set for each query and execute the query exclusively on this subset of files. This approach enables us to significantly improve query performance across three different domains: indexing, caching, and genetic data.",
    "citationCount": 0,
    "referenceCount": 25
}