{
    "paperId": "7dd248ecbc9dd1799757efaac25ff0beb9c28778",
    "title": "Evaluating the Effectiveness of Machine Learning in Forecasting Financial Market Trends: A Fintech Perspective",
    "year": 2025,
    "venue": "2025 3rd International Conference on Integrated Circuits and Communication Systems (ICICACS)",
    "authors": [
        "Sagar Bharat Shah"
    ],
    "doi": "10.1109/ICICACS65178.2025.10968297",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7dd248ecbc9dd1799757efaac25ff0beb9c28778",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There is no doubt that the financial industry has transformed the wealth of buyers and sellers as well as banks. The combined influence and dynamics of some factors such as political factors, economic conditions and behaviour of investors makes it very challenging to predict trends in a financial market. In this research, data related to the stock prices of companies listed on Yahoo Finance, namely ICICI Bank, are predicted using DL models of RNN and CNN. Data pre-processing involved dealing with missing values, normalising the data by scaling, and dealing with input features by dividing the data into training and testing data. The performance of models was measured in terms of Mean Absolute Error (MAE), Root Mean Square Error (RMSE), Mean Absolute Percentage Error (MAPE), and Mean Squared Error (MSE). Our findings also established RNN as more effective at generating accurate predictions, with measured MAE of 20.24 and RMSE of 25.36 as compared to CNN models that had an MAE of 20.58 and RMSE of 26.77. Comparing with existing models like DNN, ANN and Attention LSTM, researchers found that RNN was more effective in identifying financial trends while it lacked the ability to deal with sharp volatility. The research shows that ML has great promise for improving the accuracy of predictions and developing new fintech tools for making data-driven decisions in the financial markets.",
    "citationCount": 0,
    "referenceCount": 22
}