{
    "paperId": "7e475a68c6004ed672155483706fe74635dfeba7",
    "title": "Deep Filter Context Network for Click-Through Rate Prediction",
    "year": 2023,
    "venue": "Journal of Theoretical and Applied Electronic Commerce Research",
    "authors": [
        "Mingting Yu",
        "Tingting Liu",
        "Jian Yin"
    ],
    "doi": "10.3390/jtaer18030073",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7e475a68c6004ed672155483706fe74635dfeba7",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/0718-1876/18/3/73/pdf?version=1692683843",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growth of e-commerce has led to the widespread use of DeepCTR technology. Among the various types, the deep interest network (DIN), deep interest evolution network (DIEN), and deep session interest network (DSIN) developed by Alibaba have achieved good results in practice. However, the above model’s use of filtering for the user’s own historical behavior sequences and the insufficient use of context features lead to reduced recommendation effectiveness. To address these issues, this paper proposes a novel article model: the deep filter context network (DFCN). This improves the efficiency of the attention mechanism by adding a filter to filter out data in the user’s historical behavior sequence that differs greatly from the target advertisement. The DFCN pays attention to the context features through two local activation units. This model greatly improves the expressiveness of the model, offering strong environment-related attributes and the adaptive capability of the model, with a significant improvement of up to 0.0652 in the AUC metric when compared with our previously proposed DICN under different datasets.",
    "citationCount": 1,
    "referenceCount": 38
}