{
    "paperId": "7e4ccbf97b2445dee16bee67766f7e88ae33215c",
    "title": "Research on Text Information Extraction and Analysis of Civil Transport Aircraft Accidents Based on Large Language Model",
    "year": 2024,
    "venue": "International Conference on Genetic Algorithms",
    "authors": [
        "Jianzhong Yang",
        "Tao Su",
        "Xiyuan Chen"
    ],
    "doi": "10.3390/engproc2024080004",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7e4ccbf97b2445dee16bee67766f7e88ae33215c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/engproc2024080004",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Civil aviation safety is crucial to the airline transportation industry, and the effective prevention and analysis of accidents are essential. This paper delves into the mining of unstructured textual information within accident reports, tracing the evolution from manual rules to machine learning and then to advanced deep learning techniques. We particularly highlight the advantages of text extraction methods that leverage large language models. We propose an innovative approach that integrates TF-IDF keyword extraction with large language model prompted filtering to scrutinize the causes of accidents involving civil transport aircraft. By analyzing the keywords before and after filtering, this method significantly enhances the efficiency of information extraction, minimizes the need for manual annotation, and thus improves the overall effectiveness of accident prevention and analysis. This research is not only pivotal in preventing similar incidents in the future but also introduces new perspectives for conducting aviation accident investigations and promotes the sustainable development of the civil aviation industry.",
    "citationCount": 1,
    "referenceCount": 21
}