{
    "paperId": "7e80b89e1035955ee11c43b8fafc12ae9e2900fd",
    "title": "Analysis of Recommender System Using Generative Artificial Intelligence: A Systematic Literature Review",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Matthew O. Ayemowa",
        "Roliana Ibrahim",
        "Muhammad Murad Khan"
    ],
    "doi": "10.1109/ACCESS.2024.3416962",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7e80b89e1035955ee11c43b8fafc12ae9e2900fd",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2024.3416962",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender Systems (RSs), which generate personalized content, have become a technological tool with diverse applications for users. While numerous RSs have been proposed and successfully implemented across various domains, traditional AI-based RSs still encounter certain challenges, such as data sparsity, cold start, and diversity. Generative Artificial Intelligence in recommender systems is a recent advancement used by platforms like Netflix, Spotify, and Amazon to recommend items, news, videos, audios, goods, and services to their customers/users or to personalize experiences for their customers/users. The main purpose of this review is to compare traditional AI-based recommender systems with generative AI-based recommender systems. A total of fifty-two (52) papers, published between 2019 and February 2024, were selected from six major online libraries. To get a more comprehensive understanding of the selected study, we reviewed the selected studies techniques, and the models, datasets, and metrics used. Our systematic review reveals that generative AI models, such as generative adversarial networks (GANs), variational autoencoder (VAEs) and autoencoders have been widely used in recommender systems and they perform better than traditional AI techniques. Among the 30 datasets analyzed, MovieLens was the most frequently used, accounting for 33%, while Amazon datasets accounted for 11%, Recall and RSME are the most commonly used metrics. Our literature review offers understandings into the Generative AI techniques used across different recommender systems and provides suggestions for the future research. Finally, we elaborated on open issues and discussed current and future trends in generative AI-based recommendation systems.",
    "citationCount": 24,
    "referenceCount": 122
}