{
    "paperId": "7e8013ad71c16ba45d84228ceb66f08e5d138e9b",
    "title": "Combining the In Silico and In Vitro Assays to Identify Strobilanthes cusia Kuntze Bioactives against Penicillin-Resistant Streptococcus pneumoniae",
    "year": 2023,
    "venue": "Pharmaceuticals",
    "authors": [
        "Xiaoyu Han",
        "Luyuan Jin",
        "Zhimin Zhao",
        "Xinjun Xu",
        "Shiyi Liu",
        "Yuquan Huang",
        "Xiaoli Liu",
        "Yuehong Xu",
        "Depo Yang",
        "Wei Huang",
        "Li Wang"
    ],
    "doi": "10.3390/ph16010105",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7e8013ad71c16ba45d84228ceb66f08e5d138e9b",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8247/16/1/105/pdf?version=1674055555",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Leaves of Strobilanthes cusia Kuntze (S. cusia) are a widely used alexipharmic Traditional Chinese Medicine (TCM) in southern China for the prevention of cold and respiratory tract infectious diseases. One of the most common bacterial pathogens in the respiratory tract is the gram-positive bacterium Streptococcus pneumoniae. The antibiotic resistance of colonized S. pneumoniae makes it a more serious threat to public health. In this study, the leaves of S. cusia were found to perform antibacterial effects on the penicillin-resistant S. pneumoniae (PRSP). Confocal assay and Transmission Electron Microscopy (TEM) monitored the diminished cell wall integrity and capsule thickness of the PRSP with treatment. The following comparative proteomics analysis revealed that the glycometabolism-related pathways were enriched for the differentially expressed proteins between the samples with treatment and the control. To further delve into the specific single effective compound, the bio-active contents of leaves of S. cusia were analyzed by UPLC-UV-ESI-Q-TOF/MS, and 23 compounds were isolated for anti-PRSP screening. Among them, Tryptanthrin demonstrated the most promising effect, and it possibly inhibited the N-glycan degradation proteins, as suggested by reverse docking analysis in silico and further experimental verification by the surface plasmon resonance assay (SPR). Our study provided a research foundation for applications of the leaves of S. cusia as a TCM, and supplied a bio-active compound Tryptanthrin as a candidate drug skeleton for infectious diseases caused by the PRSP.",
    "citationCount": 0,
    "referenceCount": 90
}