{
    "paperId": "7e93bf7307bd57fae89941d38d38f08ed54dec21",
    "title": "EGCR: an enhanced graph neural network for cache replacement",
    "year": 2024,
    "venue": "3rd International Conference on High Performance Computing and Communication Engineering (HPCCE 2023)",
    "authors": [
        "kexin zhu",
        "weifeng jiang"
    ],
    "doi": "10.1117/12.3026663",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7e93bf7307bd57fae89941d38d38f08ed54dec21",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Caching is a fundamental strategy in computer systems to minimize latency and enhance performance, crucial for achieving optimal program execution speed. The Cache Hit Ratio is a key metric, emphasizing the critical role of cache hits, which are significantly faster than misses. The challenge lies in efficient cache replacement strategies, determining which cache line to evict when introducing a new line. Current policies, often based on heuristics for common access patterns, fall short in diverse scenarios. In response, this paper introduces EGCR (Enhanced Graph Neural Network for Cache Replacement), a pioneering model integrating Graph Neural Networks (GNN) to intelligently adapt to varying workloads and enhance the Cache Hit Ratio. EGCR introduces a graph-based representation for cache-related data, dynamically learning to respond effectively to intricate access patterns. In empirical evaluations, EGCR consistently outperforms the current state of the art, demonstrating a remarkable 36% improvement in cache hit rates across 13 memory-intensive SPEC applications. This positions EGCR as a promising solution, effectively bridging traditional heuristics and the potential of GNNs for optimized Cache Hit Ratios in dynamic computing environments.",
    "citationCount": 1,
    "referenceCount": 20
}