{
    "paperId": "7ee135ab37b1c5a47c66b64ff5d2f5dc824fd40b",
    "title": "Lorentz: Learned SKU Recommendation Using Profile Data",
    "year": 2024,
    "venue": "Proc. ACM Manag. Data",
    "authors": [
        "Nick Glaze",
        "Tria McNeely",
        "Yiwen Zhu",
        "Matthew Gleeson",
        "Helen Serr",
        "Rajeev Bhopi",
        "Subru Krishnan"
    ],
    "doi": "10.1145/3654952",
    "arxivId": "2411.11325",
    "url": "https://www.semanticscholar.org/paper/7ee135ab37b1c5a47c66b64ff5d2f5dc824fd40b",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3654952",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to diverse demands, cloud operators have significantly expanded the array of service offerings, often referred to as Stock Keeping Units (SKUs) available for computing resource configurations. Such diversity has led to increased complexity for customers to choose the appropriate SKU. In the analyzed system, only 43% of the resource capacity was rightly chosen. Although various automated solutions have attempted to resolve this issue, they often rely on the availability of enriched data, such as workload traces, which are unavailable for newly established services. Since these services amass a substantial volume of telemetry from existing users, cloud operators can leverage this information to better understand customer needs and mitigate the risk of over- or under-provisioning. Furthermore, customer satisfaction feedback serves as a crucial resource for continuous learning and improving the recommendation mechanism. In this paper, we present Lorentz, an intelligent SKU recommender for provisioning new compute resources that circumvents the need for workload traces. Lorentz leverages customer profile data to forecast resource capacities for new users based on detailed profiling of existing users. Furthermore, using a continuous learned feedback loop, Lorentz tailors capacity recommendations according to customer performance vs. cost preferences captured through satisfaction signals. Validated using the production data from provisioned VMs supporting Database Platform X, we demonstrate that Lorentz outperforms user selections and existing defaults, reducing slack by >60% without increasing throttling. Evaluated using synthetic data, Lorentz's personalization stage iteratively learns the user preferences over time with high accuracy.",
    "citationCount": 0,
    "referenceCount": 40
}