{
    "paperId": "7ef4386438c2056368f5f91f8be4ecf315cf8740",
    "title": "Efficient and Asymptotically Unbiased Constrained Decoding for Large Language Models",
    "year": 2025,
    "venue": "International Conference on Artificial Intelligence and Statistics",
    "authors": [
        "Haotian Ye",
        "Himanshu Jain",
        "Chong You",
        "A. Suresh",
        "Haowei Lin",
        "James Zou",
        "Felix X. Yu"
    ],
    "doi": "10.48550/arXiv.2504.09135",
    "arxivId": "2504.09135",
    "url": "https://www.semanticscholar.org/paper/7ef4386438c2056368f5f91f8be4ecf315cf8740",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In real-world applications of large language models, outputs are often required to be confined: selecting items from predefined product or document sets, generating phrases that comply with safety standards, or conforming to specialized formatting styles. To control the generation, constrained decoding has been widely adopted. However, existing prefix-tree-based constrained decoding is inefficient under GPU-based model inference paradigms, and it introduces unintended biases into the output distribution. This paper introduces Dynamic Importance Sampling for Constrained Decoding (DISC) with GPU-based Parallel Prefix-Verification (PPV), a novel algorithm that leverages dynamic importance sampling to achieve theoretically guaranteed asymptotic unbiasedness and overcomes the inefficiency of prefix-tree. Extensive experiments demonstrate the superiority of our method over existing methods in both efficiency and output quality. These results highlight the potential of our methods to improve constrained generation in applications where adherence to specific constraints is essential.",
    "citationCount": 1,
    "referenceCount": 57
}