{
    "paperId": "7efe8ff7db9832d8123a29389b5bbb4903c77518",
    "title": "Model-Based Deep Learning",
    "year": 2020,
    "venue": "Proceedings of the IEEE",
    "authors": [
        "Nir Shlezinger",
        "Jay Whang",
        "Yonina C. Eldar",
        "A. Dimakis"
    ],
    "doi": "10.1109/JPROC.2023.3247480",
    "arxivId": "2012.08405",
    "url": "https://www.semanticscholar.org/paper/7efe8ff7db9832d8123a29389b5bbb4903c77518",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2012.08405",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Signal processing, communications, and control have traditionally relied on classical statistical modeling techniques. Such model-based methods utilize mathematical formulations that represent the underlying physics, prior information, and additional domain knowledge. Simple classical models are useful but sensitive to inaccuracies and may lead to poor performance when real systems display complex or dynamic behavior. On the other hand, purely data-driven approaches that are model-agnostic are becoming increasingly popular as datasets become abundant and the power of modern deep learning pipelines increases. Deep neural networks (DNNs) use generic architectures that learn to operate from data and demonstrate excellent performance, especially for supervised problems. However, DNNs typically require massive amounts of data and immense computational resources, limiting their applicability for some scenarios. In this article, we present the leading approaches for studying and designing model-based deep learning systems. These are methods that combine principled mathematical models with data-driven systems to benefit from the advantages of both approaches. Such model-based deep learning methods exploit both partial domain knowledge, via mathematical structures designed for specific problems, and learning from limited data. Among the applications detailed in our examples for model-based deep learning are compressed sensing, digital communications, and tracking in state-space models. Our aim is to facilitate the design and study of future systems at the intersection of signal processing and machine learning that incorporate the advantages of both domains.",
    "citationCount": 371,
    "referenceCount": 174
}