{
    "paperId": "7f1f68f2cfebb5d0d993450c8eb163079b70b645",
    "title": "A Comprehensive Survey on SmartNICs: Architectures, Development Models, Applications, and Research Directions",
    "year": 2024,
    "venue": "IEEE Access",
    "authors": [
        "Elie F. Kfoury",
        "Samia Choueiri",
        "Ali Mazloum",
        "Ali AlSabeh",
        "Jose Gomez",
        "J. Crichigno"
    ],
    "doi": "10.1109/ACCESS.2024.3437203",
    "arxivId": "2405.09499",
    "url": "https://www.semanticscholar.org/paper/7f1f68f2cfebb5d0d993450c8eb163079b70b645",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The end of Moore’s Law and Dennard Scaling has slowed processor improvements in the past decade. While multi-core processors have improved performance, they are limited by the application’s level of parallelism, as prescribed by Amdahl’s Law. This has led to the emergence of domain-specific processors that specialize in a narrow range of functions. Smart Network Interface Cards (SmartNICs) can be seen as a revolutionary technology that combines heterogeneous domain-specific processors and general-purpose cores to offload infrastructure tasks. Despite the impressive advantages of SmartNICs and their importance in modern networks, the literature has been missing a comprehensive survey. To this end, this paper provides a background encompassing an overview of the evolution of NICs from basic to SmartNICs, describing their architectures, development environments, and advantages over legacy NICs. The paper then presents a comprehensive taxonomy of applications offloaded to SmartNICs, covering network, security, storage, and compute functions. Challenges associated with SmartNIC development and deployment are discussed, along with current initiatives and open research issues.",
    "citationCount": 26,
    "referenceCount": 217
}