{
    "paperId": "7f1f1aa8686b6edde628fb28a9318c2243a1ce29",
    "title": "Quark: Implementing Convolutional Neural Networks Entirely on Programmable Data Plane",
    "year": 2025,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Mai Zhang",
        "Lin Cui",
        "Xiaoquan Zhang",
        "Fung Po Tso",
        "Zhen Zhang",
        "Yuhui Deng",
        "Zhetao Li"
    ],
    "doi": "10.1109/INFOCOM55648.2025.11044654",
    "arxivId": "2501.15100",
    "url": "https://www.semanticscholar.org/paper/7f1f1aa8686b6edde628fb28a9318c2243a1ce29",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid development of programmable network devices and the widespread use of machine learning (ML) in networking have facilitated efficient research into intelligent data plane (IDP). Offloading ML to programmable data plane (PDP) enables quick analysis and responses to network traffic dynamics, and efficient management of network links. However, PDP hardware pipeline has significant resource limitations. For instance, Intel Tofino ASIC has only 10Mb SRAM in each stage, and lacks support for multiplication, division and floating-point operations. These constraints significantly hinder the development of IDP. This paper presents Quark, a framework that fully offloads convolutional neural network (CNN) inference onto PDP. Quark employs model pruning to simplify the CNN model, and uses quantization to support floating-point operations. Additionally, Quark divides the CNN into smaller units to improve resource utilization on the PDP. We have implemented a testbed prototype of Quark on both P4 hardware switch (Intel Tofino ASIC) and software switch (i.e., BMv2). Extensive evaluation results demonstrate that Quark achieves 97.3% accuracy in anomaly detection task while using only 22.7% of the SRAM resources on the Intel Tofino ASIC switch, completing inference tasks at line rate with an average latency of 42.66µs.",
    "citationCount": 4,
    "referenceCount": 37
}