{
    "paperId": "7f3398e736db5af62d20bfd7d3786bcd3641e39b",
    "title": "RCRank: Multimodal Ranking of Root Causes of Slow Queries in Cloud Database Systems",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Biao Ouyang",
        "Yingying Zhang",
        "Hanyin Cheng",
        "Yang Shu",
        "Chenjuan Guo",
        "Bin Yang",
        "Qingsong Wen",
        "Lunting Fan",
        "Christian S. Jensen"
    ],
    "doi": "10.48550/arXiv.2503.04252",
    "arxivId": "2503.04252",
    "url": "https://www.semanticscholar.org/paper/7f3398e736db5af62d20bfd7d3786bcd3641e39b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the continued migration of storage to cloud database systems, the impact of slow queries in such systems on services and user experience is increasing. Root-cause diagnosis plays an indispensable role in facilitating slow-query detection and revision. This paper proposes a method capable of both identifying possible root cause types for slow queries and ranking these according to their potential for accelerating slow queries. This enables prioritizing root causes with the highest impact, in turn improving slow-query revision effectiveness. To enable more accurate and detailed diagnoses, we propose the multimodal Ranking for the Root Causes of slow queries (RCRank) framework, which formulates root cause analysis as a multimodal machine learning problem and leverages multimodal information from query statements, execution plans, execution logs, and key performance indicators. To obtain expressive embeddings from its heterogeneous multimodal input, RCRank integrates self-supervised pre-training that enhances cross-modal alignment and task relevance. Next, the framework integrates root-cause-adaptive cross Transformers that enable adaptive fusion of multimodal features with varying characteristics. Finally, the framework offers a unified model that features an impact-aware training objective for identifying and ranking root causes. We report on experiments on real and synthetic datasets, finding that RCRank is capable of consistently outperforming the state-of-the-art methods at root cause identification and ranking according to a range of metrics.",
    "citationCount": 6,
    "referenceCount": 53
}