{
    "paperId": "7f531adbc09f3ee20fccebc2a6890813b2e61425",
    "title": "Graph-based and generative approaches to multi-document summarization",
    "year": 2024,
    "venue": "Journal of Computer Science and Cybernetics",
    "authors": [
        "Tam Doan Thanh",
        "Tan-Minh Nguyen",
        "Thai-Binh Nguyen",
        "Hoang-Trung Nguyen",
        "Hai-Long Nguyen",
        "Mai-Vu Tran",
        "Quang Thuy Ha",
        "Ha Thanh Nguyen"
    ],
    "doi": "10.15625/1813-9663/18353",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7f531adbc09f3ee20fccebc2a6890813b2e61425",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multi-document summarization is a challenging problem in the Natural Language Processing field that has drawn a lot of interest from the research community. In this paper, we propose a two-phase pipeline to tackle the Vietnamese abstractive multi-document summarization task. The initial phase of the pipeline involves an extractive summarization stage including two different systems. The first system employs a hybrid model based on the TextRank algorithm and a text correlation consideration mechanism. The second system is a modified version of SummPip - an unsupervised graph-based method for multi-document summarization. The second phase of the pipeline is abstractive summarization models. Particularly, generative models are applied to produce abstractive summaries from previous phase outputs. The proposed method achieves competitive results as we surpassed many strong research teams to finish the first rank in the AbMusu task - Vietnamese abstractive multi-document summarization, organized in the VLSP 2022 workshop.",
    "citationCount": 0,
    "referenceCount": 50
}