{
    "paperId": "7f7686d2e2af4a7308fa947680f52194b8bb067f",
    "title": "Differential Optimization Testing of Gremlin-Based Graph Database Systems",
    "year": 2024,
    "venue": "International Conference on Information Control Systems & Technologies",
    "authors": [
        "Yingying Zheng",
        "Wensheng Dou",
        "Leile Tang",
        "Ziyu Cui",
        "Jiansen Song",
        "Ziyue Cheng",
        "Wei Wang",
        "Jun Wei",
        "Hua Zhong",
        "Tao Huang"
    ],
    "doi": "10.1109/ICST60714.2024.00012",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7f7686d2e2af4a7308fa947680f52194b8bb067f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph database systems (GDBs) allow efficiently creating, modifying, and retrieving graph data in a graph database. To accelerate graph queries, GDBs usually adopt various and complex optimization strategies. However, incorrect optimizations in GDBs can introduce optimization bugs, which cause a graph query to compute an incorrect query result, e.g., omitting a vertex in a graph database. In this paper, we propose Differential Optimization Testing (DOT), an effective and automated approach to detect optimization bugs in GDBs that adopt Gremlin as their query language. The main idea of DOT is that, given a Gremlin query $Q$, we execute it on the target GDB with two different optimization configurations and then verify whether they can compute the same query results for query $Q$. Any inconsistency between their query results indicates an optimization bug in the target GDB. To improve the efficiency of differential testing in DOT, we further propose an optimization-guided approach, aiming to explore more optimization strategies and more graph database features. We evaluate DOT on six popular and widely-used GDBs, i.e., Neo4j, OrientDB, JanusGraph, HugeGraph, TinkerGraph, and ArcadeDB. In total, we have found 28 unique optimization bugs, 16 of which have been confirmed as previously-unknown bugs.",
    "citationCount": 7,
    "referenceCount": 57
}