{
    "paperId": "7fe75238d3fce5520dee10b69786c160dba14880",
    "title": "FedRoad: Secure and Efficient Road Network Queries over Traffic Data Federation",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Shuai Huang",
        "Guoliang Li",
        "Wei Zhou"
    ],
    "doi": "10.1109/ICDE65448.2025.00170",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/7fe75238d3fce5520dee10b69786c160dba14880",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Federated computing has emerged as a promising approach to address the data isolation problem, enabling multiple data owners to utilize secure multi-party computation (MPC) to collaboratively process queries while keeping the data decentralized, private, and secret. However, existing studies primarily focused on federated queries over structural data, which does not apply to non-structural road network queries prevalent in daily travel scenarios. To tackle this limitation, this paper proposes FedRoad, the first traffic data federation with secure and efficient road network shortest-path queries over it. In this context, the network topology is shared while each silo (e.g., mobility services platform) holds an individual traffic observation of edge weights (e.g., vehicle speeds), where we search the path with minimum joint weights (e.g., the least traveling time). To ensure security, we implement a secret-sharing-based MPC operator to secretly compare joint path weights and achieve a secure federated shortest-path search based on it. To improve the efficiency over road network structures, we (1) first minimize the search iterations by proposing federated shortcut indices and effective federated lower-bound estimation methods, (2) then reduce the cost in each iteration by designing a priority queue structure dedicated to minimizing the expensive MPC comparison operations. Extensive experiments demonstrate that FedRoad significantly outperforms the baselines $(100\\times \\text{faster})$ and is practical for usage (sub-second level running time).",
    "citationCount": 0,
    "referenceCount": 46
}