{
    "paperId": "8054923226945e067cb9ca16eb7efee0793983b5",
    "title": "A Cube-enabled Cloud Geoprocessing Engine for Big Earth Data",
    "year": 2023,
    "venue": "International Conference on Agro-Geoinformatics",
    "authors": [
        "R. Liu",
        "P. Yue",
        "Dayu Yu",
        "Kaixuan Wang",
        "Haipeng Deng",
        "Hao Li"
    ],
    "doi": "10.1109/Agro-Geoinformatics59224.2023.10233597",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8054923226945e067cb9ca16eb7efee0793983b5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this age of data explosion, the ever-increasing volume of Earth observation (EO) data poses a big challenge in terms of EO data storage structures and geoprocessing methods. Currently, data cubes and cloud computing show promise in facilitating data storage and data processing owing to their exceptional scalability, elasticity, and cost-efficiency. This paper presents a cube-enabled cloud geoprocessing engine that provides a fast and efficient way to conduct geospatial data processing. The engine is equipped with the capability to provide cloud storage and processing resources to meet the demands for large-scale geospatial data processing. This engine not only incorporates a number of cloud-native geospatial operators based on Apache Spark but also integrates existing operators from open-source Geographic Information System (GIS) software, thus delivering an extensive array of computational methodologies. In addition, it offers two modes for geoprocessing: on-the-fly and batch, which improve the user experience in performing large-scale geoprocessing.",
    "citationCount": 0,
    "referenceCount": 18
}