{
    "paperId": "805e6569579ba64799443ce31795fff64e134649",
    "title": "FLoomChecker: Repelling Free-riders in Federated Learning via Training Integrity Verification",
    "year": 2024,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Guanghao Liang",
        "Shan Chang",
        "Minghui Dai",
        "Hongzi Zhu"
    ],
    "doi": "10.1109/ICPADS63350.2024.00034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/805e6569579ba64799443ce31795fff64e134649",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Federated learning is a mechanism that allows participating clients to train locally with their own data in order to receive rewards, thus avoiding the transfer of data to a central server and protecting users’ privacy. However, some “lazy” clients may adopt the strategy of fabricating false model local updates in an attempt to “free-riding” without actually contributing real data or consuming local computational resources. To address this issue, we propose FLoomChecker, an integrity detection scheme for federated learning training models. The scheme combines the techniques of trusted execution environments and Bloom filters to efficiently identify clients that do not train honestly by committing and proving. We conducted experimental evaluations of FLoomChecker, examining three main aspects: query time, build time, and memory footprint in trusted execution environment (TEE). The experimental results demonstrate the effectiveness of our scheme, and its performance improves as the number of local training rounds increases.",
    "citationCount": 0,
    "referenceCount": 18
}