{
    "paperId": "806ef488387f4d83c0e2ef8abef6125f0e0dfec3",
    "title": "The NIH Comparative Genomics Resource: addressing the promises and challenges of comparative genomics on human health",
    "year": 2023,
    "venue": "BMC Genomics",
    "authors": [
        "Kristin Bornstein",
        "Gary Gryan",
        "E. S. Chang",
        "Aron Marchler-Bauer",
        "Valerie A. Schneider"
    ],
    "doi": "10.1186/s12864-023-09643-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/806ef488387f4d83c0e2ef8abef6125f0e0dfec3",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcgenomics.biomedcentral.com/counter/pdf/10.1186/s12864-023-09643-4",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Comparative genomics is the comparison of genetic information within and across organisms to understand the evolution, structure, and function of genes, proteins, and non-coding regions (Sivashankari and Shanmughavel, Bioinformation 1:376-8, 2007). Advances in sequencing technology and assembly algorithms have resulted in the ability to sequence large genomes and provided a wealth of data that are being used in comparative genomic analyses. Comparative analysis can be leveraged to systematically explore and evaluate the biological relationships and evolution between species, aid in understanding the structure and function of genes, and gain a better understanding of disease and potential drug targets. As our knowledge of genetics expands, comparative genomics can help identify emerging model organisms among a broader span of the tree of life, positively impacting human health. This impact includes, but is not limited to, zoonotic disease research, therapeutics development, microbiome research, xenotransplantation, oncology, and toxicology. Despite advancements in comparative genomics, new challenges have arisen around the quantity, quality assurance, annotation, and interoperability of genomic data and metadata. New tools and approaches are required to meet these challenges and fulfill the needs of researchers. This paper focuses on how the National Institutes of Health (NIH) Comparative Genomics Resource (CGR) can address both the opportunities for comparative genomics to further impact human health and confront an increasingly complex set of challenges facing researchers.",
    "citationCount": 16,
    "referenceCount": 114
}