{
    "paperId": "80f66ac426b294749499f017ca2e1639df53fc85",
    "title": "Construction of an ultrahigh-density genetic linkage map for Manihot esculenta Crantz and identification of QTL for root quantity traits",
    "year": 2025,
    "venue": "BMC Plant Biology",
    "authors": [
        "Qi Liu",
        "Zixuan Li",
        "Zihao Wang",
        "Yanjie Lu",
        "Sirong Jiang",
        "Chengcai Xia",
        "Pengliang An",
        "Long Zhao",
        "Ke Deng",
        "Zhiqiang Xia",
        "Wenquan Wang"
    ],
    "doi": "10.1186/s12870-025-06278-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/80f66ac426b294749499f017ca2e1639df53fc85",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cassava, Manihot esculenta Crantz, is the main raw material used in starch production in China. However, due to the small planting scale and high demand in China, large-scale imports are needed. To improve cassava yield and to meet China’s needs, we examine the agronomic traits of root weight, root number, and root length-to-width ratio per plant. By constructing two semi-sibling genetic maps and using years of data for quantitative trait locus (QTL) localization, we compare two population mapping results to screen co-located 15 QTLs, and transcriptome analysis to explore candidate genes related to these traits. We found OsWRKY78 in rice to be homologous to candidate gene Manes.03G051300, which can regulate rice stem elongation and seed size, and Manes.18G023500 to be homologous to MeMYB108, which can reduce leaf shedding and regulate cassava biomass. Through QTL mapping, we identify key genes related to yield traits that can be used in cassava molecular breeding to improve cassava yield. Supplementary Information The online version contains supplementary material available at 10.1186/s12870-025-06278-3.",
    "citationCount": 1,
    "referenceCount": 73
}