{
    "paperId": "8101c00fd2ec7094c4debe0ed10a4e9ba4ea8f7e",
    "title": "From beats to bytes: electronic dance music, artificial intelligence and teen identity",
    "year": 2025,
    "venue": "Young Consumers",
    "authors": [
        "Linto Thomas",
        "V. V. Kumar",
        "L. K. Jena"
    ],
    "doi": "10.1108/yc-08-2024-2166",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8101c00fd2ec7094c4debe0ed10a4e9ba4ea8f7e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Art",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose\nThe journey through beats and bytes of artificial intelligence (AI)-infused electronic dance music (EDM) production is more than just a technical indication; it is a celebration of innovation. The recent EDM surge in India has sparked interest, particularly among teenagers. This contrasts with the country’s rich tradition of diverse musical genres. This study aims to explore the shift in behaviour of EDM artists toward AI and how it influences teenagers in India, including its potential benefits and risks, which remain under explored.\n\nDesign/methodology/approach\nA mixed-methods approach was used, comprising quantitative surveys (n = 275), qualitative focus group discussions with youngsters (n = 32) and semi-structured interviews with EDM professionals (n = 12). A combination of thematic analysis and statistical methods was employed to analyze the data, utilizing IBM SPSS version 28.0.\n\nFindings\nThe findings of this study contribute to a deeper understanding of India’s evolving musical landscape, particularly the intersection of AI and EDM. The findings illuminate how EDM shapes teen identity, how AI is amalgamated into EDM and how the production and consumption of EDM influence both EDM artists and young consumers.\n\nPractical implications\nThe integration of AI technologies enables EDM artists to enhance creativity, streamline production processes and elevate the quality of their work, ensuring a competitive edge in the evolving music industry. AI fosters innovative trends and immerses teenagers in new experiences; However, the industry must address the positive and negative impacts on teenagers. It also recommends increased AI involvement in music production alongside policies addressing ethical concerns such as copyright, ownership of AI-generated EDM tracks, educational policies and public awareness campaigns.\n\nOriginality/value\nThe study’s novelty lies in its offering unique insights into India’s evolving musical landscape and providing valuable resources for policymakers, educators and music industry professionals.\n",
    "citationCount": 1,
    "referenceCount": 77
}