{
    "paperId": "814047bf599ab40ab809ff214ebd22d58e48bb7d",
    "title": "Chat with Standards: An Assistant for the Provision of Normative Knowledge for Practical Use in Welding",
    "year": 2025,
    "venue": "Conference on Designing Interactive Systems",
    "authors": [
        "Nils Wakan Boecking",
        "Parastou Azari Gargari",
        "Sarah Reichel",
        "Sven Hoffmann",
        "Tobias Richter",
        "Volker Wulf"
    ],
    "doi": "10.1145/3715336.3735798",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/814047bf599ab40ab809ff214ebd22d58e48bb7d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Standards form an important basis for the manufacture of high-quality and safe products. As the standards landscape becomes more complex over time, the mandatory interpretation is becoming increasingly challenging and knowledge gained from experience in dealing with the standards plays a key role. This paper uses welding—as a manufacturing process that is highly regulated by standards—to demonstrate the possibilities that large language models (LLMs) offer to assist people and shows how knowledge management can be supported in applying these standards. Therefore, a chatbot prototype specialising in the specific requirements of welding standards was developed and evaluated on the methodological framework of a design case study. The results show that LLMs have the potential to improve access to complex standards beyond simple databases and document searches and facilitate compliance with these requirements. However, there are certain limitations regarding normative language and the need for referencing.",
    "citationCount": 0,
    "referenceCount": 100
}