{
    "paperId": "814913a82c815a3f0c589d6f59fb14dc0286834e",
    "title": "Capsule Network Performance With Autonomous Navigation",
    "year": 2020,
    "venue": "International Journal of Artificial Intelligence & Applications",
    "authors": [
        "Tom Molnar",
        "E. Culurciello"
    ],
    "doi": "10.5121/ijaia.2020.11101",
    "arxivId": "2002.03181",
    "url": "https://www.semanticscholar.org/paper/814913a82c815a3f0c589d6f59fb14dc0286834e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5121/ijaia.2020.11101",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Capsule Networks (CapsNets) have been proposed as an alternative to Convolutional Neural Networks (CNNs). This paper showcases how CapsNets are more capable than CNNs for autonomous agent exploration of realistic scenarios. In real world navigation, rewards external to agents may be rare. In turn, reinforcement learning algorithms can struggle to form meaningful policy functions. This paper's approach Capsules Exploration Module (Caps-EM) pairs a CapsNets architecture with an Advantage Actor Critic algorithm. Other approaches for navigating sparse environments require intrinsic reward generators, such as the Intrinsic Curiosity Module (ICM) and Augmented Curiosity Modules (ACM). Caps-EM uses a more compact architecture without need for intrinsic rewards. Tested using ViZDoom, the Caps-EM uses 44% and 83% fewer trainable network parameters than the ICM and Depth-Augmented Curiosity Module (D-ACM), respectively, for 1141% and 437% average time improvement over the ICM and D-ACM, respectively, for converging to a policy function across \"My Way Home\" scenarios.",
    "citationCount": 2,
    "referenceCount": 21
}