{
    "paperId": "814f964dcea77b63cba31068b0721af579e6542b",
    "title": "InDel Markers for Identifying Interspecific Hybrid Offspring of Apple and Pear",
    "year": 2025,
    "venue": "Plants",
    "authors": [
        "Wenqi Fan",
        "Baoan Wang",
        "Yao Xiao",
        "Jinfeng Huang",
        "Dongmei Wang",
        "Shengyuan Wang",
        "Wei Li",
        "Qiulei Zhang",
        "Fuli Huang",
        "Chenxi Shi",
        "Tianzhong Li"
    ],
    "doi": "10.3390/plants14050646",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/814f964dcea77b63cba31068b0721af579e6542b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/plants14050646",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Distant hybridization, such as between apple (Malus domestica Borkh.) and pear (Pyrus communis L.), can introduce unique genetic traits that aren’t possible through traditional hybridization methods. However, these hybrids often display maternal traits, making it difficult to visually identify hybrid offspring in the early stages. Thus, identifying these hybrids has been a longstanding challenge. To address this challenge, this study performed whole-genome resequencing of apple ‘Golden Delicious’ and pear ‘Yan Zhuang’, along with 62 of their hybrid offspring, to develop effective molecular markers. Genomic variation analysis revealed significant genetic diversity between apple and pear. By selecting markers based on notable parental differences and high polymorphism among offspring, 51 effective markers were identified from 340 apple-specific InDel markers. These markers could reliably identify the 62 offspring as distant hybrids with genetic material from both apple and pear. Among them, InDel1-7, InDel2-3, InDel3-1, and InDel4-3 proved to be the most efficient, achieving a 100% identification rate for hybrid offspring when used in combination in the ‘Golden Delicious’ × ‘Yan Zhuang’ population. Furthermore, marker universality tests showed that 88.2%, 76.5%, and 70.6% of the 51 markers were transferable to the ‘Golden Delicious’ × ‘Jin Zhui’, ‘Fuji’ × ‘Yan Zhuang’, and ‘Fuji’ × ‘Jin Zhui’ hybrid populations, respectively. The identification efficiencies in these three validation populations were 82.6%, 80.3%, and 85.0%, with the four highly efficient markers exceeding a 70% identification rate. This study developed an efficient molecular marker system for identifying apple and pear distant hybrid offspring based on InDel variation, providing a valuable tool for breeding new varieties of Rosaceae fruit trees.",
    "citationCount": 1,
    "referenceCount": 48
}