{
    "paperId": "819c87f088d23c70baf995ba129fd31aaa398f42",
    "title": "Artificial intelligence evaluation of nature based flood resilience in hilly terrain",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Abdelkader Mabrouk",
        "I. Inam",
        "Muhammad Zeeshan Qureshi",
        "Tariq Ali",
        "Nadir Murtaza",
        "Mohamed Mohamed Ouda",
        "A. Al-Naghi",
        "Dany Tasán Cruz"
    ],
    "doi": "10.1038/s41598-025-19629-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/819c87f088d23c70baf995ba129fd31aaa398f42",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hilly terrain has notable challenges of flash flooding, requiring a cost-effective and sustainable management approach. Nature-based solutions (NBS) provide significant sustainability, however need methodical assessment under diverse hydrological conditions. To fill this gap, the current investigation explores the significance of the NBS utilizing artificial intelligence (AI) techniques for optimizing flood resilience through the prediction of peak discharge generated from the hilly terrain. For this purpose, two AI advanced models including random forest (RF) and support vector regression (SVR) model were utilized for the assessment of laboratory scale data series of slope, rainfall intensity (P), and time ratio (T/Tc, T: total time, Tc: time of concentration) with flexible (FV) and rigid vegetation (RV). A total of 344 data series were collected, split into three different phases of training (70%), testing (15%), and validation (15%) for both AI models. The values of root mean square error (RMSE), coefficient of determination (R2), and mean absolute error (MAE), along with SHAP (SHapley Additive exPlanations) analysis, are used to assess the performance of AI models. Further Monte Carlo simulation was performed to clarify uncertainty and feature importance. The result demonstrated 8% more reduction of the peak discharge in the case of flexible vegetation, because of its surface resistance and infiltration capability. The RF model has greater prediction power compared to the SVR model Due to a higher R-value of 0.9809 for FV and 0.9906 for RV conditions. The result of SHAP analysis demonstrates greater influence of time ratio on peak discharge under FV (SHAP range:±25 and RV (SHAP range: ±30), while the moderate impact of rainfall intensity was observed in the case of FV (SHAP range: ±5) and RV (SHAP range: ±7). The findings concluded that AI-driven models utilized for NBS enhance resilience against flooding in hilly terrain. Urban planners and policymakers should utilize an AI-driven approach for nonlinear hydrological phenomena. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-19629-9.",
    "citationCount": 0,
    "referenceCount": 68
}