{
    "paperId": "81a12d68d23f47dc8f65c7129ed2df1822cc82f3",
    "title": "A Unified Generative Retriever for Knowledge-Intensive Language Tasks via Prompt Learning",
    "year": 2023,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Jiangui Chen",
        "Ruqing Zhang",
        "J. Guo",
        "M. de Rijke",
        "Y. Liu",
        "Yixing Fan",
        "Xueqi Cheng"
    ],
    "doi": "10.1145/3539618.3591631",
    "arxivId": "2304.14856",
    "url": "https://www.semanticscholar.org/paper/81a12d68d23f47dc8f65c7129ed2df1822cc82f3",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2304.14856",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Knowledge-intensive language tasks (KILTs) benefit from retrieving high-quality relevant contexts from large external knowledge corpora. Learning task-specific retrievers that return relevant contexts at an appropriate level of semantic granularity, such as a document retriever, passage retriever, sentence retriever, and entity retriever, may help to achieve better performance on the end-to-end task. But a task-specific retriever usually has poor generalization ability to new domains and tasks, and it may be costly to deploy a variety of specialised retrievers in practice. We propose a unified generative retriever (UGR) that combines task-specific effectiveness with robust performance over different retrieval tasks in KILTs. To achieve this goal, we make two major contributions: (i) To unify different retrieval tasks into a single generative form, we introduce an n-gram-based identifier for relevant contexts at different levels of granularity in KILTs. And (ii) to address different retrieval tasks with a single model, we employ a prompt learning strategy and investigate three methods to design prompt tokens for each task. In this way, the proposed UGR model can not only share common knowledge across tasks for better generalization, but also perform different retrieval tasks effectively by distinguishing task-specific characteristics. We train UGR on a heterogeneous set of retrieval corpora with well-designed prompts in a supervised and multi-task fashion. Experimental results on the KILT benchmark demonstrate the effectiveness of UGR on in-domain datasets, out-of-domain datasets, and unseen tasks.",
    "citationCount": 35,
    "referenceCount": 48
}