{
    "paperId": "81c55fb8d563267225d76f91af1ea4f1433b7b21",
    "title": "Deep Learning for Enterprise Systems Implementation Lifecycle Challenges: Research Directions",
    "year": 2021,
    "venue": "Informatics",
    "authors": [
        "Hossam El-Din Hassanien",
        "Ahmed Elragal"
    ],
    "doi": "10.3390/informatics8010011",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/81c55fb8d563267225d76f91af1ea4f1433b7b21",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2227-9709/8/1/11/pdf?version=1614836882",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Transforming the state-of-the-art definition and anatomy of enterprise systems (ESs) seems to some academics and practitioners as an unavoidable destiny. Value depletion lead by early retirement and/or replacement of ESs solutions has been a constant throughout the past decade. That did drive an enormous amount of research that works on addressing the problems leading to the resource drain. The resource waste had persisted throughout the ESs implementation lifecycle phases and dimensions especially post-live phases; leading to depleting the value of the social and technical dimensions of the lifecycle. Parallel to this research stream, the momentum gained by deep learning (DL) algorithms and platforms has been exponentially growing to fuel the advancements toward artificial intelligence and automated augmentation. Correspondingly, this paper is set out to present five key research directions through which DL would take part as a contributor towards the transformation of the ESs state-of-the-art. The paper reviews the ESs implementation lifecycle challenges and the intersection with DL research conducted on ESs by analyzing and synthesizing key basket journals (list of the Association of Information Systems). The paper also presents results from several experiments showcasing the effectiveness of DL in adding a level of augmentation to ESs by analyzing a large set of data extracted from the Atlassian Jira Software Issue Tracking System across different ecosystems. The paper then concludes by presenting the research directions and discussing socio-technical research courses that work on key frontiers identified within this scholarly work.",
    "citationCount": 3,
    "referenceCount": 125
}