{
    "paperId": "81dd7455c03d20d1499810d65947c269d9dbcb2e",
    "title": "Lessons learned to boost a bioinformatics knowledge base reusability, the Bgee experience",
    "year": 2022,
    "venue": "GigaScience",
    "authors": [
        "Tarcisio Mendes de Farias",
        "Julien Wollbrett",
        "M. Robinson-Rechavi",
        "Frédéric B. Bastian"
    ],
    "doi": "10.1093/gigascience/giad058",
    "arxivId": "2303.12329",
    "url": "https://www.semanticscholar.org/paper/81dd7455c03d20d1499810d65947c269d9dbcb2e",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/gigascience/article-pdf/doi/10.1093/gigascience/giad058/51122027/giad058.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Background Enhancing interoperability of bioinformatics knowledge bases is a high-priority requirement to maximize data reusability and thus increase their utility such as the return on investment for biomedical research. A knowledge base may provide useful information for life scientists and other knowledge bases, but it only acquires exchange value once the knowledge base is (re)used, and without interoperability, the utility lies dormant. Results In this article, we discuss several approaches to boost interoperability depending on the interoperable parts. The findings are driven by several real-world scenario examples that were mostly implemented by Bgee, a well-established gene expression knowledge base. To better justify the findings are transferable, for each Bgee interoperability experience, we also highlight similar implementations by major bioinformatics knowledge bases. Moreover, we discuss ten general main lessons learned. These lessons can be applied in the context of any bioinformatics knowledge base to foster data reusability. Conclusions This work provides pragmatic methods and transferable skills to promote reusability of bioinformatics knowledge bases by focusing on interoperability.",
    "citationCount": 4,
    "referenceCount": 105
}