{
    "paperId": "81ea4b85960e1c31a4202a0f4ba2dce9906d9fb3",
    "title": "Insight into Adsorption Kinetics, Equilibrium, Thermodynamics, and Modeling of Ciprofloxacin onto Iron Ore Tailings",
    "year": 2025,
    "venue": "Water",
    "authors": [
        "Nan Fang",
        "Yanhua Xi",
        "Jing Zhang",
        "Jian Wu",
        "Huicai Cheng",
        "Qiang He"
    ],
    "doi": "10.3390/w17050760",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/81ea4b85960e1c31a4202a0f4ba2dce9906d9fb3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To achieve the resource utilization of iron ore tailings (IOTs), two different IOTs were investigated as sustainable adsorbents for ciprofloxacin (CIP) removal from aqueous systems. Through systematic batch experiments, key adsorption parameters including initial pH, adsorbent dosage, contact time, ionic strength, and temperature were comprehensively evaluated. The results showed that CIP adsorption by IOTs remained relatively stable across a broad initial pH range (2–10), with maximum adsorption capacities of 5-IOT and 14-IOT observed at the initial pH values of 10.1 and 9.16, respectively. Competitive ion experiments revealed a gradual decrease in CIP adsorption capacity with increasing ionic strength (Na⁺, Mg2⁺, and Ca2⁺). Thermodynamic analyses indicated an inverse relationship between adsorption capacity and temperature, yielding maximum adsorption capacities (Qmax) of 16.64 mg/g (5-IOT) and 13.68 mg/g (14-IOT) at 288.15 K. Mechanistic investigations combining material characterization and adsorption modeling identified ion exchange as the predominant interaction mechanism. Notably, trace elements (Cd, Co, Cr, Cu, Fe, Ni, Pb, and Zn) were released during leaching tests, with concentrations consistently below environmental safety thresholds. A back-propagation artificial neural network (BP-ANN) with optimized architecture (8-11-1 topology) demonstrated high predictive accuracy (MSE = 0.0031, R2 = 0.9907) for adsorption behavior. These findings suggested IOTs as cost-effective, environmentally compatible adsorbents for CIP remediation, offering the dual advantages of pharmaceutical pollutant removal and industrial waste valorization.",
    "citationCount": 2,
    "referenceCount": 72
}