{
    "paperId": "820b7b14342754e60a7c0599207b1f8577c92746",
    "title": "ALO-NMF: Accelerated Locality-Optimized Non-negative Matrix Factorization",
    "year": 2020,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Gordon E. Moon",
        "J. A. Ellis",
        "Aravind Sukumaran-Rajam",
        "S. Parthasarathy",
        "P. Sadayappan"
    ],
    "doi": "10.1145/3394486.3403227",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/820b7b14342754e60a7c0599207b1f8577c92746",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.osti.gov/biblio/1798068",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Non-negative Matrix Factorization (NMF) is a key kernel for unsupervised dimension reduction used in a wide range of applications, including graph mining, recommender systems and natural language processing. Due to the compute-intensive nature of applications that must perform repeated NMF, several parallel implementations have been developed. However, existing parallel NMF algorithms have not addressed data locality optimizations, which are critical for high performance since data movement costs greatly exceed the cost of arithmetic/logic operations on current computer systems. In this paper, we present a novel optimization method for parallel NMF algorithm based on the HALS (Hierarchical Alternating Least Squares) scheme that incorporates algorithmic transformations to enhance data locality. Efficient realizations of the algorithm on multi-core CPUs and GPUs are developed, demonstrating a new Accelerated Locality-Optimized NMF (ALO-NMF) that obtains up to 2.29x lower data movement cost and up to 4.45x speedup over existing state-of-the-art parallel NMF algorithms.",
    "citationCount": 12,
    "referenceCount": 28
}