{
    "paperId": "8221786c99e69edd018757a029b1c25270afb9a0",
    "title": "Enhancing Semantic Image Retrieval Using Self-Supervised Learning: A Label-Efficient Approach",
    "year": 2025,
    "venue": "Babylonian Journal of Machine Learning",
    "authors": [
        "Malik Sallam",
        "Marwan Ali Shnan"
    ],
    "doi": "10.58496/bjml/2025/004",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8221786c99e69edd018757a029b1c25270afb9a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this study, we tackle the fundamental problem of cross-modal retrieval and propose a novel self-supervised learning framework to improve the performance of semantic image search systems with limited dependency on labeled data. This research covers the problem of high retrieval accuracy on the image task, when dealing with small datasets rolling close annotation. The study presents a novel approach that mixes high-dimensional unlabeled data (e.g., millions of images) with a carefully created set of labeled ones to significantly improve semantic understanding and retrieval efficacy when evaluated against the proposed model. Indeed, experimental outcomes establish that our deployed self-supervised mechanism not only yields state-of-the-art performance on numerous routine trials, but also possesses being proof against the limited amount of labeled examples, giving rise to the signs of 30% accuracy increase for retrieval missions. The implications of these results are relevant to healthcare multimodal applications, in which fast retrieval of medical images is essential for diagnosis and treatment planning. This research may, therefore, enable better clinical workflows, assist disease recognition, and gradually lead to improved patient outcomes by providing more accurate and robust image retrieval systems. Above all, these significances note that the self-supervised learning paradigm they introduce here may extend beyond healthcare to transform how image data is used in other areas, ultimately leading to more powerful and automated vision systems across numerous domains that depend on visual data analysis.\n ",
    "citationCount": 4,
    "referenceCount": 21
}