{
    "paperId": "82227b8305bb746d9cb4be7f42c3dc7f2a26fecc",
    "title": "Exploring Image Dataset Structure through Deep Feature Extraction and Dimensionality Reduction",
    "year": 2025,
    "venue": "Computer Science in Cars Symposium",
    "authors": [
        "Ana-Mihaela Vasilevschi",
        "Daniela Faur"
    ],
    "doi": "10.1109/CSCS66924.2025.00057",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/82227b8305bb746d9cb4be7f42c3dc7f2a26fecc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study explores the use of dimensionality reduction methods, focusing on Principal Component Analysis (PCA) and t-distributed Stochastic Neighbor Embedding (t-SNE), to visualize image dataset information. We applied these methods to two datasets with varying class complexities: Fruits 360 (141 classes) and CIFAR-10 (10 classes). Our goal was to assess how well these techniques preserve class separations in reduced dimensions. PCA required 221 components to explain 95% of the variance in CIFAR-10 and 239 components for Fruits 360. However, PCA struggled to provide clear class separations, particularly in CIFAR-10, due to the dataset's complexity. In contrast, t-SNE demonstrated superior ability to capture non-linear relationships, yielding clearer clusters in Fruits 360 and partial separations in CIFAR-10. Although t-SNE is highly effective, it is computationally demanding and highly sensitive to hyperparameters, necessitating precise adjustments for optimal performance. Additionally, combining ResNet50 with t-SNE as a feature extractor enhanced the visualizations, particularly for CIFAR-10, where PCA was less effective. However, memory constraints arise when processing large datasets. This study highlights the strengths and limitations of PCA and t-SNE for data visualization.",
    "citationCount": 0,
    "referenceCount": 28
}