{
    "paperId": "822d07d5fe2e951dd0218fc13cbefd3dacf288b2",
    "title": "Feature-interactive Siamese graph encoder-based image analysis to predict STAS from histopathology images in lung cancer",
    "year": 2024,
    "venue": "npj Precision Oncology",
    "authors": [
        "Liangrui Pan",
        "Qingchun Liang",
        "Wenwu Zeng",
        "Yijun Peng",
        "Zhenyu Zhao",
        "Yiyi Liang",
        "Jiadi Luo",
        "Xiang Wang",
        "Shaoliang Peng"
    ],
    "doi": "10.1038/s41698-024-00771-y",
    "arxivId": "2411.15274",
    "url": "https://www.semanticscholar.org/paper/822d07d5fe2e951dd0218fc13cbefd3dacf288b2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41698-024-00771-y",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spread through air spaces (STAS) is a distinct invasion pattern in lung cancer, crucial for prognosis assessment and guiding surgical decisions. Histopathology is the gold standard for STAS detection, yet traditional methods are subjective, time-consuming, and prone to misdiagnosis, limiting large-scale applications. We present VERN, an image analysis model utilizing a feature-interactive Siamese graph encoder to predict STAS from lung cancer histopathological images. VERN captures spatial topological features with feature sharing and skip connections to enhance model training. Using 1,546 histopathology slides, we built a large single-cohort STAS lung cancer dataset. VERN achieved an AUC of 0.9215 in internal validation and AUCs of 0.8275 and 0.8829 in frozen and paraffin-embedded test sections, respectively, demonstrating clinical-grade performance. Validated on a single-cohort and three external datasets, VERN showed robust predictive performance and generalizability, providing an open platform (http://plr.20210706.xyz:5000/) to enhance STAS diagnosis efficiency and accuracy.",
    "citationCount": 3,
    "referenceCount": 72
}