{
    "paperId": "825870090716d6c38e05987a8d96397f72651c10",
    "title": "Holistic Cloud-AI Fusion for Autonomous Conversational Commerce in High-Velocity E-Commerce Channels",
    "year": 2023,
    "venue": "International Journal of Scientific Research and Management",
    "authors": [
        "Rahul Khurana"
    ],
    "doi": "10.18535/ijsrm/v11i06.ec1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/825870090716d6c38e05987a8d96397f72651c10",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.18535/ijsrm/v11i06.ec1",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Given the pace at which e-commerce is growing, high velocity channels require synchronous, individual, and highly engaging methods of dealing with the customers. In this research, the combination of cloud computing and AI is proposed and an organization conversational commerce framework will be created to enhance digital economies flexibility and autonomy. Taking advantage of cloud-AI synergy, the presented system improves efficiency, computing, and customer interaction through constructive architectural structures and sophisticated algorithms. This research assesses the potential of the proposed framework in improving the overall performance and the level of customer interaction of e-commerce transactions through comparing its efficiency in improving response time and enhancing user satisfaction metrics using a case study approach. The study concludes that moving towards the integration of cloud and AI both facilitates scalability while at the same time improves resource utilization and withstands fluctuating e-commerce conversational systems. Finally, this paper provides suggestions for e-commerce firms interested in implementing such cloud-AI solutions, with a focus on the areas of concern and future research directions.",
    "citationCount": 0,
    "referenceCount": 29
}