{
    "paperId": "825fc08a4da9079febfe203eafa36fd9dd6122dd",
    "title": "Translational MEMS Platform for Planar Optical Switching Fabrics",
    "year": 2019,
    "venue": "Micromachines",
    "authors": [
        "Suraj Sharma",
        "Niharika Kohli",
        "Jonathan Brière",
        "M. Ménard",
        "F. Nabki"
    ],
    "doi": "10.3390/mi10070435",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/825fc08a4da9079febfe203eafa36fd9dd6122dd",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-666X/10/7/435/pdf?version=1562324293",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Materials Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While 3-D microelectromechanical systems (MEMS) allow switching between a large number of ports in optical telecommunication networks, the development of such systems often suffers from design, fabrication and packaging constraints due to the complex structures, the wafer bonding processes involved, and the tight alignment tolerances between different components. In this work, we present a 2-D translational MEMS platform capable of highly efficient planar optical switching through integration with silicon nitride (SiN) based optical waveguides. The discrete lateral displacement provided by simple parallel plate actuators on opposite sides of the central platform enables switching between different input and output waveguides. The proposed structure can displace the central platform by 3.37 µm in two directions at an actuation voltage of 65 V. Additionally, the parallel plate actuator designed for closing completely the 4.26 µm air gap between the fixed and moving waveguides operates at just 50 V. Eigenmode expansion analysis shows over 99% butt-coupling efficiency the between the SiN waveguides when the gap is closed. Also, 2.5 finite-difference time-domain analysis demonstrates zero cross talk between two parallel SiN waveguides across the length of the platform for a 3.5 µm separation between adjacent waveguides enabling multiple waveguide configuration onto the platform. Different MEMS designs were simulated using static structural analysis in ANSYS. These designs were fabricated with a custom process by AEPONYX Inc. (Montreal, QC, Canada) and through the PiezoMUMPs process of MEMSCAP (Durham, NC, USA).",
    "citationCount": 16,
    "referenceCount": 52
}