{
    "paperId": "827b4d1fa295ccfd04f0538d6a0ea6e187fbe160",
    "title": "Towards Operationalizing Heterogeneous Data Discovery",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jin Wang",
        "Yanlin Feng",
        "Chen Shen",
        "Sajjadur Rahman",
        "Eser Kandogan"
    ],
    "doi": "10.48550/arXiv.2504.02059",
    "arxivId": "2504.02059",
    "url": "https://www.semanticscholar.org/paper/827b4d1fa295ccfd04f0538d6a0ea6e187fbe160",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Querying and exploring massive collections of data sources, such as data lakes, has been an essential research topic in the database community. Although many efforts have been paid in the field of data discovery and data integration in data lakes, they mainly focused on the scenario where the data lake consists of structured tables. However, real-world enterprise data lakes are always more complicated, where there might be silos of multi-modal data sources with structured, semi-structured and unstructured data. In this paper, we envision an end-to-end system with declarative interface for querying and analyzing the multi-modal data lakes. First of all, we come up with a set of multi-modal operators, which is a unified interface that extends the relational operations with AI-composed ones to express analytical workloads over data sources in various modalities. In addition, we formally define the essential steps in the system, such as data discovery, query planning, query processing and results aggregation. On the basis of it, we then pinpoint the research challenges and discuss potential opportunities in realizing and optimizing them with advanced techniques brought by Large Language Models. Finally, we demonstrate our preliminary attempts to address this problem and suggest the future plan for this research topic.",
    "citationCount": 3,
    "referenceCount": 52
}