{
    "paperId": "8289788a7bdc1d73814eb8f90ae85ba23685fd64",
    "title": "HEX-BLOOM: An Efficient Method for Authenticity and Integrity Verification in Privacy-preserving Computing",
    "year": 2022,
    "venue": "IEEE International Performance, Computing, and Communications Conference",
    "authors": [
        "Ripon Patgiri",
        "M. Borah"
    ],
    "doi": "10.1109/IPCCC55026.2022.9894352",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8289788a7bdc1d73814eb8f90ae85ba23685fd64",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Merkle tree is applied in diverse applications, namely, Blockchain, smart grid, IoT, Biomedical, financial transactions, etc., to verify authenticity and integrity. Also, the Merkle tree is used in privacy-preserving computing. However, the Merkle tree is a computationally costly data structure. It uses cryptographic string hash functions to partially verify the data integrity and authenticity of a data block. Moreover, the verification process creates unnecessary network traffic because it requires partial hash values to verify a particular block. Furthermore, the performance of the Merkle tree also depends on the network latency. Therefore, it is not feasible for most of the applications. To address the above issue, we proposed an alternative model to replace the Merkle tree, called HEX-BLOOM, and it is implemented using hash, Exclusive-OR, and Bloom Filter. Our proposed model’s performance does not depends on network latency for verification of data block’s authenticity and integrity. HEX-BLOOM uses an approximation model, Bloom Filter. Moreover, it employs a deterministic model for final verification of the correctness. In this paper, we show that our proposed model is better than the state-of-the-art Merkle tree in every aspect.",
    "citationCount": 6,
    "referenceCount": 45
}