{
    "paperId": "82b60af53f3121d0c7fe7011b43260c941d5be65",
    "title": "CNN-based Data-Model Co-Design for Efficient Test-termination Prediction",
    "year": 2022,
    "venue": "IEEE European Test Symposium",
    "authors": [
        "Hongfei Wang",
        "Zhanfei Wu",
        "Wei Liu"
    ],
    "doi": "10.1109/ETS54262.2022.9810406",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/82b60af53f3121d0c7fe7011b43260c941d5be65",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Failure diagnosis is a software-based data-driven procedure. Collecting an excessive amount of fail data not only increases the overall test cost, but may also lead to degradation of diagnostic resolution. Test-termination prediction is thus proposed to dynamically determine which failing test pattern to terminate testing, producing an amount of test data that is sufficient for an accurate diagnosis analysis. In this work, we describe a novel data-model co-design method of using deep learning method for efficient test-termination prediction. In particular, images describing the failing test responses are constructed from failure-log files. A multi-layer convolutional neural network (CNN) embedding a residual block is then trained, based on the images and known diagnosis results. The learned CNN model is later deployed in a test flow to determine the optimal test-termination for an efficient and quality diagnosis. Experiments on actual failing chips and standard benchmarks demonstrate that the proposed method outperforms SOTA works. Our method creates opportunities to harness the power of deep learning for improving diagnostic efficiency and quality.",
    "citationCount": 1,
    "referenceCount": 39
}