{
    "paperId": "82ba2b0ae22de1f0bd8f907632a41935cca1d54c",
    "title": "Enhancing Recommendations with Adaptive Multi-Modal Generative Models",
    "year": 2025,
    "venue": "International Conference on Computing and Convergence Technology",
    "authors": [
        "Atharva Digamber Katurde",
        "Samiksha Dnyaneshwar Gharge",
        "Bhakti Bharat Shinde",
        "Soham Vijay Kolapkar",
        "Ashwat Anant Nakate",
        "Awantika Anil Jadhav"
    ],
    "doi": "10.1109/ICCCT63501.2025.11019832",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/82ba2b0ae22de1f0bd8f907632a41935cca1d54c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender systems play a critical role in personalizing content, but integrating multiple data modalities and addressing dynamic user preferences presents significant challenges. This paper introduces the Adaptive Multi-Modal Generative Recommender (AMGR) framework, which combines text, image, and video data to enhance recommendation accuracy. By leveraging advanced generative models such as GANs, VAEs, and transformers, AMGR not only suggests content based on user history but also generates personalized content that aligns with evolving preferences. To address the complexities of real-time adaptation, AMGR utilizes reinforcement learning strategies, balancing exploration and exploitation of content. The framework also tackles key technical and ethical challenges, including computational efficiency, multi-modal data fusion, fairness, and privacy. Potential solutions such as federated learning and bias mitigation techniques are explored to ensure responsible and scalable deployment. This paper outlines the proposed methodology, its applications, and the necessary safeguards for AMGR's real-world implementation, contributing to the development of adaptive, fair, and transparent recommendation systems.",
    "citationCount": 0,
    "referenceCount": 13
}