{
    "paperId": "831f8dbb4ec260266f6d0e189fe2a236d156e1e7",
    "title": "Integrating Systems of Record (SOR) into the Asset Administration Shell (AAS) Dataspace",
    "year": 2024,
    "venue": "IEEE International Conference on Emerging Technologies and Factory Automation",
    "authors": [
        "Mohammad Ghazanfar Ali Danish",
        "Frank Schnicke"
    ],
    "doi": "10.1109/ETFA61755.2024.10710635",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/831f8dbb4ec260266f6d0e189fe2a236d156e1e7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A core technology in realizing Industry 4.0 is the Asset Administration Shell (AAS) as an implementation of the Digital Twin. The AAS enables interoperable data-sharing in a company as well as within a network of companies, creating an AAS dataspace. To create this AAS dataspace, however, data in Systems of Record (SOR) such as ERP, PLM, and quality databases must be available as AASs. SORs typically form data silos that lack interoperability due to custom data models and interfaces that are typically incompatible with the native Industry 4.0 communication. Very little guidance or even tooling is Available on integrating SORs into the AAS dataspace in a reusable and scalable way. This paper shows architectural solutions and concepts to narrow this gap, thus enabling quick integration of existing SORs with the AAS dataspace. Additionally, it provides an open-source implementation bridging this gap. Researchers and practitioners can benefit from the proposed architecture and implementation by applying various use cases of integrating SORs with AAS dataspace.",
    "citationCount": 4,
    "referenceCount": 23
}