{
    "paperId": "836639db470c083e986fc1d9e6764eead2a2ef6d",
    "title": "An Effective DDPG-generated Task Scheduling Policy to Minimize Latency in Distributed Computing System",
    "year": 2023,
    "venue": "2023 International Conference on Frontiers of Robotics and Software Engineering (FRSE)",
    "authors": [
        "Xincheng Yang",
        "Biao Hu"
    ],
    "doi": "10.1109/FRSE58934.2023.00049",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/836639db470c083e986fc1d9e6764eead2a2ef6d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of artificial intelligence technology in recent years, more and more computation-intensive applications are emerging on user devices, which are difficult to meet the needs of users due to the limitations of their own processing power and endurance. Offloading computing tasks to cloud servers with sufficient resources is an effective solution to this problem. Meanwhile, how to schedule computing tasks on cloud servers is critical. In this paper, we study the problem of how to assign tasks to distributed cloud computing servers such that the computation latency, i.e., their computing time, can be minimized, where tasks are dependent and can be modeled as directed acyclic graphs. We first formulate this problem as a mixed-integer programming problem with some linear and nonlinear constraints. A Markov decision process is built for solving this problem, where we define the state, action, and reward functions. The deep deterministic policy gradient algorithm is then successfully applied to build a task scheduling policy. Various tradeoffs are investigated in experiments, and the results confirm that our built-in scheduling policy is more effective than some classic heuristic scheduling approaches.",
    "citationCount": 1,
    "referenceCount": 23
}