{
    "paperId": "8368c7b9fd5b9e22b601ff24aa95617ffb62cddb",
    "title": "EHL*: Memory-Budgeted Indexing for Ultrafast Optimal Euclidean Pathfinding",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Jinchun Du",
        "Bojie Shen",
        "Muhammad Aamir Cheema"
    ],
    "doi": "10.48550/arXiv.2408.11341",
    "arxivId": "2408.11341",
    "url": "https://www.semanticscholar.org/paper/8368c7b9fd5b9e22b601ff24aa95617ffb62cddb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Euclidean Shortest Path Problem (ESPP), which involves finding the shortest path in a Euclidean plane with polygonal obstacles, is a classic problem with numerous real-world applications. The current state-of-the-art solution, Euclidean Hub Labeling (EHL), offers ultra-fast query performance, outperforming existing techniques by 1-2 orders of magnitude in runtime efficiency. However, this performance comes at the cost of significant memory overhead, requiring up to tens of gigabytes of storage on large maps, which can limit its applicability in memory-constrained environments like mobile phones or smaller devices. Additionally, EHL's memory usage can only be determined after index construction, and while it provides a memory-runtime tradeoff, it does not fully optimize memory utilization. In this work, we introduce an improved version of EHL, called EHL*, which overcomes these limitations. A key contribution of EHL* is its ability to create an index that adheres to a specified memory budget while optimizing query runtime performance. Moreover, EHL* can leverage preknown query distributions, a common scenario in many real-world applications to further enhance runtime efficiency. Our results show that EHL* can reduce memory usage by up to 10-20 times without much impact on query runtime performance compared to EHL, making it a highly effective solution for optimal pathfinding in memory-constrained environments.",
    "citationCount": 0,
    "referenceCount": 13
}