{
    "paperId": "83899adebf94722befbec210a795d4b8d0db5b92",
    "title": "TRAP: Tailored Robustness Assessment for Index Advisors via Adversarial Perturbation",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Wei Zhou",
        "Chen Lin",
        "Xuanhe Zhou",
        "Guoliang Li",
        "Tianqing Wang"
    ],
    "doi": "10.1109/ICDE60146.2024.00011",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/83899adebf94722befbec210a795d4b8d0db5b92",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many index advisors have recently been proposed to build indexes automatically to improve query performance. However, they mainly consider performance improvement in static scenarios. Their robustness, i.e., stable performance in dynamic scenarios (e.g., with minor workload changes), has not been well investigated. This paper addresses the challenges of assessing the index advisor's robustness from the following aspects. First, we introduce perturbation-based workloads for robustness assessment and identify three typical perturbation constraints that occur in real scenarios. Second, with the perturbation constraints, we formulate the generation of perturbed queries as a sequence-to-sequence problem and propose TRAP (Tailored Robustness assessment via Adversarial Perturbation) to pinpoint the performance loopholes of index advisors. Third, to generalize to various index advisors, we place TRAP in an opaque-box setting (i.e., with little knowledge of the index advisors' internal design), and we propose a two-phase training paradigm to efficiently train TRAP without elaborately annotated data. Fourth, we conduct comprehensive robustness assessments on standard benchmarks and real workloads for ten existing index advisors. Our findings reveal that these index advisors are vulnerable to the workloads generated by TRAP. Finally, based on the assessment results, we shed light on insights to enhance the robustness of different index advisors. For example, learning-based index advisors can benefit from adopting a fine-grained state representation and a candidate pruning strategy.",
    "citationCount": 3,
    "referenceCount": 83
}