{
    "paperId": "83ae488a8d7e112d76c8515ca4c88d970eaa67ca",
    "title": "Analysis of Digital Information in Storage Devices Using Supervised and Unsupervised Natural Language Processing Techniques",
    "year": 2023,
    "venue": "Future Internet",
    "authors": [
        "Luis Alberto Martínez Hernández",
        "A. L. Sandoval Orozco",
        "L. J. García Villalba"
    ],
    "doi": "10.3390/fi15050155",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/83ae488a8d7e112d76c8515ca4c88d970eaa67ca",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1999-5903/15/5/155/pdf?version=1682228944",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the advancement of technology, cybercrime has increased considerably, making digital forensics essential for any organisation. One of the most critical challenges is to analyse and classify the information on devices, identifying the relevant and valuable data for a specific purpose. This phase of the forensic process is one of the most complex and time-consuming, and requires expert analysts to avoid overlooking data relevant to the investigation. Although tools exist today that can automate this process, they will depend on how tightly their parameters are tuned to the case study, and many lack support for complex scenarios where language barriers play an important role. Recent advances in machine learning allow the creation of new architectures to significantly increase the performance of information analysis and perform the intelligent search process automatically, reducing analysis time and identifying relationships between files based on initial parameters. In this paper, we present a bibliographic review of artificial intelligence algorithms that allow an exhaustive analysis of multimedia information contained in removable devices in a forensic process, using natural language processing and natural language understanding techniques for the automatic classification of documents in seized devices. Finally, some of the open challenges technology developers face when generating tools that use artificial intelligence techniques to analyse the information contained in documents on seized devices are reviewed.",
    "citationCount": 6,
    "referenceCount": 52
}