{
    "paperId": "83c9f1ae56007407f80b1333fe66d66f8d73cf29",
    "title": "TQVS: Temporal Queries over Video Streams in Action",
    "year": 2020,
    "venue": "SIGMOD Conference",
    "authors": [
        "Yueting Chen",
        "Xiaohui Yu",
        "Nick Koudas"
    ],
    "doi": "10.1145/3318464.3384693",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/83c9f1ae56007407f80b1333fe66d66f8d73cf29",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present TQVS, a system capable of conducting efficient evaluation of declarative temporal queries over real-time video streams. Users may issue queries to identify video clips in which the same two cars and the same three persons appear jointly in the frames for say 30 seconds. In real-world videos, some of the objects may disappear in frames due to reasons such as occlusion, which introduces challenges to query evaluation. Our system, aiming to address such challenges, consists of two main components: the Object Detection and Tracking (ODT) module and the Query Evaluation module. The ODT module utilizes state-of-art Object Detection and Tracking algorithms to produce a list of identified objects for each frame. Based on these results, we maintain select object combinations through the current window during query evaluation. Those object combinations contain sufficient information to evaluate queries correctly. Since the number of possible combinations could be very large, we introduce a novel technique to structure the possible combinations and facilitate query evaluation. We demonstrate that our approach offers significant performance benefits compared to alternate approaches and constitutes a fundamental building block of the TQVS system.",
    "citationCount": 10,
    "referenceCount": 16
}