{
    "paperId": "84070487eb2397133e235df2c33214332e7be13e",
    "title": "AnalyticDB-PG: A Cloud-native High-performance Data Warehouse in Alibaba Cloud",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Fangyuan Zhang",
        "Caihua Yin",
        "Hua Fan",
        "Fenghua Fang",
        "Yineng Chen",
        "Xuqi Wang",
        "Mengqi Wu",
        "Bing Chen",
        "Tianbo Jin",
        "Sibo Wang",
        "Wenchao Zhou",
        "Feifei Li"
    ],
    "doi": "10.14778/3750601.3750633",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/84070487eb2397133e235df2c33214332e7be13e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the era of big data, the landscape of data management and analytics has significantly transformed, presenting diverse challenges for cloud platforms. Modern data warehouses face increasing challenges in handling hybrid transactional and analytical processing (HTAP) workloads efficiently in cloud environments. Traditional shared-nothing architectures provide high-performance query execution but suffer from high storage costs and limited elasticity, while shared-storage approaches improve scalability but often struggle with query efficiency due to increased data movement and indexing overhead. Furthermore, existing execution engines lack optimized support for vectorized processing and real-time analytics, limiting their ability to handle large-scale workloads efficiently.\n To address these limitations, we introduce AnalyticDB-PG (ADB-PG), a cloud-native, high-performance data warehouse designed for modern analytical workloads. It integrates a unified architecture supporting both Shared-Nothing and Shared-Storage modes, allowing flexible deployment and seamless elasticity. In ADB-PG, we introduce Beam, a hybrid storage engine that efficiently balances row-based and columnar storage for real-time analytics, and Laser, an optimized execution engine leveraging vectorized execution and Just-In-Time compilation to accelerate query processing. The system further incorporates advanced indexing mechanisms, adaptive runtime filtering, and dictionary encoding to enhance performance. Extensive evaluations on TPC-H and TPC-DS benchmarks demonstrate that ADB-PG achieves significant performance improvements while reducing storage and operational costs, making it a compelling solution for modern cloud-based data analytics.",
    "citationCount": 0,
    "referenceCount": 52
}