{
    "paperId": "841dcc2eb5e00c6a9c08c46a5b02fbfc78d5a080",
    "title": "Mesenchymal stem cell exosomes inhibit nucleus pulposus cell apoptosis via the miR-125b-5p/TRAF6/NF-κB pathway axis",
    "year": 2023,
    "venue": "Acta Biochimica et Biophysica Sinica",
    "authors": [
        "Yang Duan",
        "Chen Yu",
        "Wenhao Kuang",
        "Jianjun Li",
        "Sujun Qiu",
        "Songjia Ni",
        "Zhong Chen"
    ],
    "doi": "10.3724/abbs.2023241",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/841dcc2eb5e00c6a9c08c46a5b02fbfc78d5a080",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10753375",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Intervertebral disc degeneration (IVDD) is the pathological basis of a range of degenerative spinal diseases and is the primary cause of lower back pain. Mesenchymal stem cell (MSC) transplantation inhibits IVDD progression. However, the specific mechanisms that underlie these effects remain unclear. In this study, candidate microRNAs (miRNAs) are screened using bioinformatics and high-throughput sequencing. TNF-α is used to induce nucleus pulposus cell (NPC) degeneration. MSC-derived exosomes (MSC-exosomes) are obtained using high-speed centrifugation and identified by transmission electron microscopy (TEM), nanoparticle tracking analysis (NTA) and western blot analysis. Cell viability is determined by CCK-8 assay. Flow cytometry and TUNEL assays are used to detect cell apoptosis. The expression levels of miR-125b-5p are detected by RT-qPCR, and a dual-luciferase gene reporter assay confirms the downstream target genes of miR-125b-5p. Protein expression is determined by western blot analysis. Rat models are used to validate the function of miR-125b-5p in MSC-exosomes. The results show that miR-125b-5p is expressed at low levels in degenerated disc tissues compared with that in normal disc tissues; however, it is highly expressed in MSC-exosomes. Furthermore, MSC-exosomes are efficiently taken up by NPCs while miR-125b-5p is delivered into NPCs; thus, MSC-exosomes act as inhibitors of apoptosis in NPCs. Overexpression of miR-125b-5p downregulates TRAF6 expression and inhibits NF-κB activation. However, TRAF6 overexpression reverses these effects of miR-125b-5p. We demonstrate that MSC-exosomes attenuate IVDD in vivo by delivering miR-125b-5p. MSC-exosomes can deliver miR-125b-5p to target TRAF6, inhibit NF-κB activation, and attenuate the progression of IVDD.",
    "citationCount": 9,
    "referenceCount": 41
}