{
    "paperId": "843352c9d7a4384c8da6264afbf43fdd13252629",
    "title": "SQL-Factory: A Multi-Agent Framework for High-Quality and Large-Scale SQL Generation",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jiahui Li",
        "Tongwang Wu",
        "Yuren Mao",
        "Yunjun Gao",
        "Yajie Feng",
        "Huaizhong Liu"
    ],
    "doi": "10.48550/arXiv.2504.14837",
    "arxivId": "2504.14837",
    "url": "https://www.semanticscholar.org/paper/843352c9d7a4384c8da6264afbf43fdd13252629",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High quality SQL corpus is essential for intelligent database. For example, Text-to-SQL requires SQL queries and correspond natural language questions as training samples. However, collecting such query corpus remains challenging in practice due to the high cost of manual annotation, which highlights the importance of automatic SQL generation. Despite recent advances, existing generation methods still face limitations in achieving both diversity and cost-effectiveness. Besides, many methods also treat all tables equally, which overlooks schema complexity and leads to under-utilization of structurally rich tables. To address these issues, this paper proposes a multi-agent framework for high-quality and large-scale SQL generation, dubbed SQL-Factory. It decomposes the generation process into three collaborative teams: the Generation Team explores diverse query structures using a powerful language model, the Expansion Team scales promising patterns via a lightweight language model, and the Management Team adaptively schedules the workflow and evaluates the quality of synthesized queries. This modular framework ensures a balanced trade-off between diversity, scalability, and generation cost. We apply SQL-Factory to four widely used benchmarks and generate over 300,000 SQL queries with less than $200 API cost. Our generated queries achieve higher diversity compared to other methods, and extensive experiments demonstrate that the generated queries significantly improve the model performance in various downstream tasks.",
    "citationCount": 1,
    "referenceCount": 63
}