{
    "paperId": "843793928e308b5414d2883ac869e813ec16f65d",
    "title": "Progressive Data Science: Potential and Challenges",
    "year": 2018,
    "venue": "arXiv.org",
    "authors": [
        "C. Turkay",
        "Nicola Pezzotti",
        "Carsten Binnig",
        "Hendrik Strobelt",
        "B. Hammer",
        "D. Keim",
        "Jean-Daniel Fekete",
        "Themis Palpanas",
        "Yunhai Wang",
        "Florin Rusu"
    ],
    "doi": null,
    "arxivId": "1812.08032",
    "url": "https://www.semanticscholar.org/paper/843793928e308b5414d2883ac869e813ec16f65d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data science requires time-consuming iterative manual activities. In particular, activities such as data selection, preprocessing, transformation, and mining, highly depend on iterative trial-and-error processes that could be sped up significantly by providing quick feedback on the impact of changes. The idea of progressive data science is to compute the results of changes in a progressive manner, returning a first approximation of results quickly and allow iterative refinements until converging to a final result. Enabling the user to interact with the intermediate results allows an early detection of erroneous or suboptimal choices, the guided definition of modifications to the pipeline and their quick assessment. In this paper, we discuss the progressiveness challenges arising in different steps of the data science pipeline. We describe how changes in each step of the pipeline impact the subsequent steps and outline why progressive data science will help to make the process more effective. Computing progressive approximations of outcomes resulting from changes creates numerous research challenges, especially if the changes are made in the early steps of the pipeline. We discuss these challenges and outline first steps towards progressiveness, which, we argue, will ultimately help to significantly speed-up the overall data science process.",
    "citationCount": 36,
    "referenceCount": 87
}