{
    "paperId": "84670250cd6d27776f174f512a46f838a65a9f51",
    "title": "Machine Learning for Detecting DoS Attack: A Comparative Approach",
    "year": 2025,
    "venue": "British journal of computer, networking and information technology",
    "authors": [
        "Akwaronwu, B. G.",
        "Akwaronwu, I. U.",
        "Adeniyi, O. J."
    ],
    "doi": "10.52589/bjcnit-i0v0hk0y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/84670250cd6d27776f174f512a46f838a65a9f51",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Denial-of-Service (DoS) attacks has been a critical challenge in cybersecurity, disrupting the availability of network services and causing significant operational and economic losses. To ascertain the most suitable approaches to mitigate to dilemma, this study compares the effectiveness of some selected machine learning models in identifying denial-of-service (DoS) attacks. Two ensemble learning models, Random Forest (RF) and Extreme Gradient Boosting (XGB), showed remarkable accuracy and dependability. RF performed almost perfectly on criteria including accuracy (99%), precision (99%), and recall (99%). Convolutional Neural Networks (CNN) and Recurrent Neural Networks (RNN) stood out as Deep Learning models, capturing complex patterns with CNN achieving an accuracy of 98% and a perfect AUC score of 1.00. The models utilized the Recursive Feature Elimination (RFE) to select significant features and ensured proper data balancing techniques for robust model training and evaluation, minimizing overfitting and enhancing generalization. The results highlight RF and CNN as the best-performing models, with RF offering interpretability and computational efficiency, while CNN excels in handling unstructured and complex datasets. This study underscores the need for context-driven model selection and suggests exploring hybrid approaches that integrate the strengths of ML and DL for improved DoS attack detection. Future work should aim to enhance scalability and adaptability for real-world cybersecurity applications.",
    "citationCount": 0,
    "referenceCount": 54
}