{
    "paperId": "8467f4b4ad65e11c1f14c3c2d84cdcdfb0b96cc0",
    "title": "Enhancing hyperspectral image object classification through robust feature extraction and spatial-spectral fusion using deep learning",
    "year": 2025,
    "venue": "Indonesian Journal of Electrical Engineering and Computer Science",
    "authors": [
        "Vijaylaxmi Kochari",
        "S. Sannakki",
        "V. Rajpurohit",
        "Mahesh G. Huddar"
    ],
    "doi": "10.11591/ijeecs.v37.i1.pp279-287",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8467f4b4ad65e11c1f14c3c2d84cdcdfb0b96cc0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hyperspectral imaging (HSI) has gained significant attention in recent years due to its broad applications across agriculture, environmental monitoring, urban planning, infrastructure management, and defense and security for object detection and classification. Despite its potential, current methodologies face challenges such as insufficient feature extraction, noise interference, and inadequate spatial-spectral fusion, limiting classification accuracy and robustness. This study reviews advancements in HSI object detection and classification methodologies, emphasizing the role of machine-learning (ML) and deep-learning (DL) techniques. Hence, this work proposes a novel framework to address these challenges, prioritizing robust feature extraction, effective spatial-spectral fusion, and comprehensive noise removal mechanisms. By integrating DL techniques and training with HSI noisy data, this framework aims to enhance classification accuracy and robustness. The findings suggest that the proposed approach significantly improves the reliability and performance of HSI-based object classification systems. This research provides a pathway for future development in the domain, promising to elevate the effectiveness of HSI applications in real-world scenarios.",
    "citationCount": 0,
    "referenceCount": 39
}