{
    "paperId": "84959e211a767f902cbf1695ec54a5b50148020f",
    "title": "Clifford Neural Layers for PDE Modeling",
    "year": 2022,
    "venue": "International Conference on Learning Representations",
    "authors": [
        "Johannes Brandstetter",
        "Rianne van den Berg",
        "M. Welling",
        "Jayesh K. Gupta"
    ],
    "doi": "10.48550/arXiv.2209.04934",
    "arxivId": "2209.04934",
    "url": "https://www.semanticscholar.org/paper/84959e211a767f902cbf1695ec54a5b50148020f",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2209.04934",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Partial differential equations (PDEs) see widespread use in sciences and engineering to describe simulation of physical processes as scalar and vector fields interacting and coevolving over time. Due to the computationally expensive nature of their standard solution methods, neural PDE surrogates have become an active research topic to accelerate these simulations. However, current methods do not explicitly take into account the relationship between different fields and their internal components, which are often correlated. Viewing the time evolution of such correlated fields through the lens of multivector fields allows us to overcome these limitations. Multivector fields consist of scalar, vector, as well as higher-order components, such as bivectors and trivectors. Their algebraic properties, such as multiplication, addition and other arithmetic operations can be described by Clifford algebras. To our knowledge, this paper presents the first usage of such multivector representations together with Clifford convolutions and Clifford Fourier transforms in the context of deep learning. The resulting Clifford neural layers are universally applicable and will find direct use in the areas of fluid dynamics, weather forecasting, and the modeling of physical systems in general. We empirically evaluate the benefit of Clifford neural layers by replacing convolution and Fourier operations in common neural PDE surrogates by their Clifford counterparts on 2D Navier-Stokes and weather modeling tasks, as well as 3D Maxwell equations. For similar parameter count, Clifford neural layers consistently improve generalization capabilities of the tested neural PDE surrogates. Source code for our PyTorch implementation is available at https://microsoft.github.io/cliffordlayers/.",
    "citationCount": 102,
    "referenceCount": 188
}