{
    "paperId": "84958b642b15a640b7f9d8dde771a03d85a980da",
    "title": "Active Image Indexing",
    "year": 2022,
    "venue": "International Conference on Learning Representations",
    "authors": [
        "Pierre Fernandez",
        "Matthijs Douze",
        "Herv'e J'egou",
        "T. Furon"
    ],
    "doi": "10.48550/arXiv.2210.10620",
    "arxivId": "2210.10620",
    "url": "https://www.semanticscholar.org/paper/84958b642b15a640b7f9d8dde771a03d85a980da",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.10620",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image copy detection and retrieval from large databases leverage two components. First, a neural network maps an image to a vector representation, that is relatively robust to various transformations of the image. Second, an efficient but approximate similarity search algorithm trades scalability (size and speed) against quality of the search, thereby introducing a source of error. This paper improves the robustness of image copy detection with active indexing, that optimizes the interplay of these two components. We reduce the quantization loss of a given image representation by making imperceptible changes to the image before its release. The loss is back-propagated through the deep neural network back to the image, under perceptual constraints. These modifications make the image more retrievable. Our experiments show that the retrieval and copy detection of activated images is significantly improved. For instance, activation improves by $+40\\%$ the Recall1@1 on various image transformations, and for several popular indexing structures based on product quantization and locality sensitivity hashing.",
    "citationCount": 10,
    "referenceCount": 66
}