{
    "paperId": "8497ac9160bc1ef8f00429fcf40bdd9efb76b7e6",
    "title": "Modified Firefly Algorithm for Optimizing Biomedical Breast Cancer Queries",
    "year": 2021,
    "venue": "",
    "authors": [
        "G. Ramalingam"
    ],
    "doi": "10.21203/RS.3.RS-171211/V1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8497ac9160bc1ef8f00429fcf40bdd9efb76b7e6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.21203/rs.3.rs-171211/v1",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Querying and retrieving Semantic Web data is a challenging task due to the increment in its volume. Many query languages were designed to retrieve Semantic Web data. A popular querying method of communication in Semantic Web is SPARQL. The query languages were designed with some optimization strategies, and it was found in literature that these query languages were not able to handle large volume of data efficiently. In this research, a Modified Firefly Algorithm (MFA) is applied to optimize the SPARQL queries so that it can retrieve data from a large Semantic Web repository efficiently by reducing query execution time. Every query will have multiple query plans generated with different cost values. The challenge is to choose the best query plan which reduces the query cost and query execution time. The proposed algorithm uses the best query plan in the previous iteration to calculate the distance between two query plans using the radius parameter. The proposed algorithm generates a query plan which is a global optimal solution. MFA is evaluated using the BioPortal dataset with triples containing breast cancer. Experimental analysis is conducted to identify the significant improvement in performance of the proposed work with the existing nature inspired query optimization algorithms. The efficiency of MFA is compared with other algorithms in terms of query execution time and the performance is evaluated.",
    "citationCount": 0,
    "referenceCount": 19
}