{
    "paperId": "84a9bfe015b5457709ae94981fe0aab3b3653a13",
    "title": "Framework for experimental evaluation of software solutions in a virtual environment",
    "year": 2022,
    "venue": "Russian Technological Journal",
    "authors": [
        "D. Ilin"
    ],
    "doi": "10.32362/2500-316x-2022-10-5-16-27",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/84a9bfe015b5457709ae94981fe0aab3b3653a13",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.rtj-mirea.ru/jour/article/download/564/400",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Objectives. Ready-made information technology solutions used when developing software have various characteristics depending on the objectives to be experimentally obtained. While the selection of appropriate technologies and software tools used in experimental software engineering can be time-consuming, experimental complexity can be reduced by providing the researcher with domain-specific tools. The aim of the study is to design and develop a domain-specific software framework for experimental evaluation of the characteristics of information technology solutions in a virtual environment.Methods. To determine the required characteristics of the software framework, an analysis of software tools for conducting experimental studies to evaluate the characteristics of information technology solutions in a virtual environment was conducted. Methods of decomposition, structural design, and software development were applied to design and develop the framework.Results. A software framework for conducting experimental research has been developed. The design results, key features of the framework and a description of the functionality are presented. The implementation of the framework comprises commands for managing virtual machines and commands for scaffolding. A technique for conducting experimental studies using the framework is proposed.Conclusions. The developed domain-specific software framework addresses shortcomings of existing tools to reduce labor costs when conducting experiments to evaluate information technology solutions. The developed framework and proposed methodology allows the number of programming and markup languages required for setting up a software experiment to be reduced from 3 to 1.",
    "citationCount": 2,
    "referenceCount": 12
}