{
    "paperId": "84d2389f4d375c1db81cb208a166739180be2274",
    "title": "The Impact of AI-Personalized Recommendations on Clicking Intentions: Evidence from Chinese E-Commerce",
    "year": 2025,
    "venue": "Journal of Theoretical and Applied Electronic Commerce Research",
    "authors": [
        "Jiwang Yin",
        "Xiaodong Qiu",
        "Ya Wang"
    ],
    "doi": "10.3390/jtaer20010021",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/84d2389f4d375c1db81cb208a166739180be2274",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/jtaer20010021",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "AI-personalized recommendation technology offers more accurate and diverse choices to consumers and increases click-through rates and sales on e-commerce platforms. Yet, data on consumers’ experiences of AI-personalized recommendations and their impact path on clicking intention are scarce. This article addressed these issues through three studies. In study 1, we adopted the Grounded Theory approach to conduct in-depth interviews with 30 Chinese consumers and constructed a scale to measure the impact of consumer experience on click intention. In study 2, we adopted the empirical research method to conduct reliability and validity tests on 347 valid questionnaires to finalize the scale officially. In study 3, based on the SOR theory, we constructed a model and formulated hypotheses and then conducted empirical analysis using 1097 valid questionnaires. We found that the relevance, inspiration, and insightful experiences of AI-personalized recommendations can significantly promote consumers’ clicking intention. Moreover, immersive experience mediates between the former three factors and clicking intention, and technology acceptance mediates between relevance, inspiration, and clicking intention. When consumers perceive a high degree of information privacy infringement, the immersive experience’s positive impact on clicking intention will be weakened. Meanwhile, the promoting effect of technology acceptance on clicking intention will also be inhibited. When information quality improves, the positive impact of technology acceptance on clicking intention will be enhanced. This research fills the gap in the literature on consumers’ experiences of AI-personalized recommendations and clarifies how these experiences affect the clicking intention. It offers valuable insights for e-commerce platforms to continuously optimize personalized recommendation algorithms and boost the click conversion rate of online shopping.",
    "citationCount": 10,
    "referenceCount": 138
}