{
    "paperId": "84ea99cf88ac91180c12b91057b1cdd6ad95f77a",
    "title": "Artificial Intelligence for Web 3.0: A Comprehensive Survey",
    "year": 2023,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Meng Shen",
        "Zhehui Tan",
        "Dusist Niyato",
        "Yuzhi Liu",
        "Jiawen Kang",
        "Zehui Xiong",
        "Liehuang Zhu",
        "Wei Wang",
        "X. Shen"
    ],
    "doi": "10.1145/3657284",
    "arxivId": "2309.09972",
    "url": "https://www.semanticscholar.org/paper/84ea99cf88ac91180c12b91057b1cdd6ad95f77a",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3657284",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Web 3.0 is the next generation of the Internet built on decentralized technologies such as blockchain and cryptography. It is born to solve the problems faced by the previous generation of the Internet such as imbalanced distribution of interests, monopoly of platform resources, and leakage of personal privacy. In this survey, we discuss the latest development status of Web 3.0 and the application of emerging AI technologies in it. First, we investigate the current successful practices of Web 3.0 and various components in the current Web 3.0 ecosystem and thus propose the hierarchical architecture of the Web 3.0 ecosystem from the perspective of application scenarios. The architecture we proposed contains four layers: data management, value circulation, ecological governance, and application scenarios. We dive into the current state of development and the main challenges and issues present in each layer. In this context, we find that AI technology will have great potential. We first briefly introduce the role that artificial intelligence technology may play in the development of Web 3.0. Then, we conduct an in-depth analysis of the current application status of artificial intelligence technology in the four layers of Web 3.0 and provide some insights into its potential future development directions.",
    "citationCount": 21,
    "referenceCount": 165
}