{
    "paperId": "850adcd90b4cdc218ccbf95402501fbe90da8c8a",
    "title": "Toward demand-aware networking: a theory for self-adjusting networks",
    "year": 2018,
    "venue": "CCRV",
    "authors": [
        "C. Avin",
        "S. Schmid"
    ],
    "doi": "10.1145/3310165.3310170",
    "arxivId": "1807.02935",
    "url": "https://www.semanticscholar.org/paper/850adcd90b4cdc218ccbf95402501fbe90da8c8a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The physical topology is emerging as the next frontier in an ongoing effort to render communication networks more flexible. While first empirical results indicate that these flexibilities can be exploited to reconfigure and optimize the network toward the workload it serves and, e.g., providing the same bandwidth at lower infrastructure cost, only little is known today about the fundamental algorithmic problems underlying the design of reconfigurable networks. This paper initiates the study of the theory of demand-aware, self-adjusting networks. Our main position is that self-adjusting networks should be seen through the lense of self-adjusting datastructures. Accordingly, we present a taxonomy classifying the different algorithmic models of demand-oblivious, fixed demand-aware, and reconfigurable demand-aware networks, introduce a formal model, and identify objectives and evaluation metrics. We also demonstrate, by examples, the inherent advantage of demand-aware networks over state-of-the-art demand-oblivious, fixed networks (such as expanders). We conclude by observing that the usefulness of self-adjusting networks depends on the spatial and temporal locality of the demand; as relevant data is scarce, we call for community action.",
    "citationCount": 77,
    "referenceCount": 51
}