{
    "paperId": "8525c351c3705ff2a6e94bdd6cb1587563775034",
    "title": "Sandwich: Separating Prefill-Decode Compilation for Efficient CPU LLM Serving",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Juntao Zhao",
        "Jiuru Li",
        "Chuan Wu"
    ],
    "doi": "10.48550/arXiv.2507.18454",
    "arxivId": "2507.18454",
    "url": "https://www.semanticscholar.org/paper/8525c351c3705ff2a6e94bdd6cb1587563775034",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Utilizing CPUs to serve large language models (LLMs) is a resource-friendly alternative to GPU serving. Existing CPU-based solutions ignore workload differences between the prefill and the decode phases of LLM inference, applying a static per-NUMA (Non-Uniform Memory Access) node model partition and utilizing vendor libraries for operator-level execution, which is suboptimal. We propose Sandwich, a hardware-centric CPU-based LLM serving engine that uses different execution plans for the prefill and decode phases and optimizes them separately. We evaluate Sandwich across diverse baselines and datasets on five CPU platforms, including x86 with AVX-2 and AVX-512, as well as ARM with NEON. Sandwich achieves an average 2.01x throughput improvement and 90% satisfactory time-to-first-token (TTFT) and time-per-output-token (TPOT) latencies with up to 3.40x lower requirements in single sequence serving, and significant improvement in Goodput in continuous-batching serving. The GEMM kernels generated by Sandwich outperform representative vendor kernels and other dynamic shape solutions, achieving performance comparable to static compilers with three orders of magnitude less kernel tuning costs.",
    "citationCount": 1,
    "referenceCount": 56
}