{
    "paperId": "853476daaebde52cb1dd891ada481b874d30f10a",
    "title": "Lack of Helios During Neural Development Induces Adult Schizophrenia-Like Behaviors Associated With Aberrant Levels of the TRIF-Recruiter Protein WDFY1",
    "year": 2020,
    "venue": "Frontiers in Cellular Neuroscience",
    "authors": [
        "A. Sancho-Balsells",
        "V. Brito",
        "Belissa S. Fernandez",
        "M. Pardo",
        "M. Straccia",
        "S. Ginés",
        "J. Alberch",
        "Isabel Hernández",
        "B. Arranz",
        "J. Canals",
        "A. Giralt"
    ],
    "doi": "10.3389/fncel.2020.00093",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/853476daaebde52cb1dd891ada481b874d30f10a",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fncel.2020.00093/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The role of the WDFY1 protein has been studied as a TLR3/4 scaffold/recruiting protein in the immune system and in different oncogenic conditions. However, its function in brain remains poorly understood. We have found that in mice devoid of Helios (He–/– mice), a transcription factor specifically expressed during the development of the immune cells and the central nervous system, there is a permanent and sustained increase of Wdfy1 gene expression in the striatum and hippocampus. Interestingly, we observed that WDFY1 protein levels were also increased in the hippocampus and dorsolateral prefrontal cortex of schizophrenic patients, but not in the hippocampus of Alzheimer’s disease patients with an associated psychotic disorder. Accordingly, young He–/– mice displayed several schizophrenic-like behaviors related to dysfunctions in the striatum and hippocampus. These changes were associated with an increase in spine density in medium spiny neurons (MSNs) and with a decrease in the number and size of PSD-95-positive clusters in the stratum radiatum of the CA1. Moreover, these alterations in structural synaptic plasticity were associated with a strong reduction of neuronal NF-κB in the pyramidal layer of the CA1 in He–/– mice. Altogether, our data indicate that alterations involving the molecular axis Helios-WDFY1 in neurons during the development of core brain regions could be relevant for the pathophysiology of neuropsychiatric disorders such as schizophrenia.",
    "citationCount": 11,
    "referenceCount": 74
}