{
    "paperId": "854133a17832a156f71472db2611fb0fc976350e",
    "title": "Specific Mycobacterium tuberculosis Strain Circulating in Prison Revealed by Cost-Effective Amplicon Sequencing",
    "year": 2024,
    "venue": "Microorganisms",
    "authors": [
        "Joaquín Hurtado",
        "M. N. Bentancor",
        "P. Laserra",
        "C. Coitinho",
        "G. Greif"
    ],
    "doi": "10.3390/microorganisms12050999",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/854133a17832a156f71472db2611fb0fc976350e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-2607/12/5/999/pdf?version=1715782353",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This scientific study focuses on tuberculosis (TB) within prison settings, where persons deprived of liberty (PDL) face significantly higher rates of the disease compared to the general population. The research employs the low-cost amplicon sequencing of Mycobacterium tuberculosis strains, aiming first to identify specific lineages and also to detect mutations associated with drug resistance. The method involves multiplex amplification, DNA extraction, and sequencing, providing valuable insights into TB dynamics and resistance-mutation profiles within the prison system at an affordable cost. The study identifies a characteristic lineage (X) circulating among PDLs in the penitentiary system in Uruguay, absent in the general population, and notes its prevalence at prison entry. No high-confidence mutations associated with drug resistance were found. The findings underscore the importance of molecular epidemiology in TB control, emphasizing the potential for intra-prison transmissions and the need for broader studies to understand strain dynamics.",
    "citationCount": 0,
    "referenceCount": 29
}