{
    "paperId": "8551341fb2ac371ab7de7bc8b32014176a323a1e",
    "title": "Efficient Document-at-a-time and Score-at-a-time Query Evaluation for Learned Sparse Representations",
    "year": 2022,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "J. Mackenzie",
        "A. Trotman",
        "Jimmy J. Lin"
    ],
    "doi": "10.1145/3576922",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8551341fb2ac371ab7de7bc8b32014176a323a1e",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3576922",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Researchers have had much recent success with ranking models based on so-called learned sparse representations generated by transformers. One crucial advantage of this approach is that such models can exploit inverted indexes for top-k retrieval, thereby leveraging decades of work on efficient query evaluation. Yet, there remain many open questions about how these learned representations fit within the existing literature, which our work aims to tackle using four representative learned sparse models. We find that impact weights generated by transformers appear to greatly reduce opportunities for skipping and early exiting optimizations in well-studied document-at-a-time (DaaT) approaches. Similarly, “off-the-shelf” application of score-at-a-time (SaaT) processing exhibits a mismatch between these weights and assumptions behind accumulator management strategies. Building on these observations, we present solutions to address deficiencies with both DaaT and SaaT approaches, yielding substantial speedups in query evaluation. Our detailed empirical analysis demonstrates that both methods lie on the effectiveness–efficiency Pareto frontier, indicating that the optimal choice for deployment depends on operational constraints.",
    "citationCount": 28,
    "referenceCount": 86
}