{
    "paperId": "8559e58baa7ea1461e251601c1983835421e8b7d",
    "title": "VISITOR: Visual Interactive State Sequence Exploration for Reinforcement Learning",
    "year": 2023,
    "venue": "Computer graphics forum (Print)",
    "authors": [
        "Yannick Metz",
        "Eugene Bykovets",
        "Lucas Joos",
        "D. Keim",
        "Mennatallah El-Assady"
    ],
    "doi": "10.1111/cgf.14839",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8559e58baa7ea1461e251601c1983835421e8b7d",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/cgf.14839",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Understanding the behavior of deep reinforcement learning agents is a crucial requirement throughout their development. Existing work has addressed the identification of observable behavioral patterns in state sequences or analysis of isolated internal representations; however, the overall decision‐making of deep‐learning RL agents remains opaque. To tackle this, we present VISITOR, a visual analytics system enabling the analysis of entire state sequences, the diagnosis of singular predictions, and the comparison between agents. A sequence embedding view enables the multiscale analysis of state sequences, utilizing custom embedding techniques for a stable spatialization of the observations and internal states. We provide multiple layers: (1) a state space embedding, highlighting different groups of states inside the state‐action sequences, (2) a trajectory view, emphasizing decision points, (3) a network activation mapping, visualizing the relationship between observations and network activations, (4) a transition embedding, enabling the analysis of state‐to‐state transitions. The embedding view is accompanied by an interactive reward view that captures the temporal development of metrics, which can be linked directly to states in the embedding. Lastly, a model list allows for the quick comparison of models across multiple metrics. Annotations can be exported to communicate results to different audiences. Our two‐stage evaluation with eight experts confirms the effectiveness in identifying states of interest, comparing the quality of policies, and reasoning about the internal decision‐making processes.",
    "citationCount": 4,
    "referenceCount": 41
}