{
    "paperId": "855cceff57904b05ec7dfcfecf8488f197ee1f96",
    "title": "DJEnsemble: a Cost-Based Selection and Allocation of a Disjoint Ensemble of Spatio-temporal Models",
    "year": 2021,
    "venue": "International Conference on Statistical and Scientific Database Management",
    "authors": [
        "R. S. Pereira",
        "Y. M. Souto",
        "A. Silva",
        "Rocio Zorilla",
        "Brian Tsan",
        "Florin Rusu",
        "Eduardo Ogasawara",
        "A. Ziviani",
        "F. Porto"
    ],
    "doi": "10.1145/3468791.3468806",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/855cceff57904b05ec7dfcfecf8488f197ee1f96",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Consider a set of black-box models – each of them independently trained on a different dataset – answering the same predictive spatio-temporal query. Being built in isolation, each model traverses its own life-cycle until it is deployed to production, learning data patterns from different datasets and facing independent hyper-parameter tuning. In order to answer the query, the set of black-box predictors has to be ensembled and allocated to the spatio-temporal query region. However, computing an optimal ensemble is a complex task that involves selecting the appropriate models and defining an effective allocation strategy that maps the models to the query region. In this paper we present DJEnsemble, a cost-based strategy for the automatic selection and allocation of a disjoint ensemble of black-box predictors to answer predictive spatio-temporal queries. We conduct a set of extensive experiments that evaluate DJEnsemble and highlight its efficiency, selecting model ensembles that are almost as efficient as the optimal solution. When compared against the traditional ensemble approach, DJEnsemble achieves up to 4X improvement in execution time and almost 9X improvement in prediction accuracy.",
    "citationCount": 8,
    "referenceCount": 24
}