{
    "paperId": "856351b12dcaa9af9141985e9f69d0ac9d07ab6d",
    "title": "MLOS in Action: Bridging the Gap Between Experimentation and Auto-Tuning in the Cloud",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Brian Kroth",
        "Sergiy Matusevych",
        "Rana Alotaibi",
        "Yiwen Zhu",
        "Anja Gruenheid",
        "Yuanyuan Tian"
    ],
    "doi": "10.14778/3685800.3685852",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/856351b12dcaa9af9141985e9f69d0ac9d07ab6d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents MLOS (ML Optimized Systems), a flexible framework that bridges the gap between benchmarking, experimentation, and optimization of software systems. It allows users to create one-click benchmarking and experimentation scenarios for multi-VM setups in the cloud with optional standard and custom metrics collection and data management of the results. MLOS provides a collection of pluggable optimizers (ML or otherwise) for efficiently exploring the configuration space and finding optimal values for parameters across the entire software stack, including VM, OS kernel, and userland applications. It has a convenient lightweight interface for data storage, access, and visualization for a user-friendly notebook experience. These features make it a useful platform for both systems developers and auto-tuning researchers. MLOS is an active open-source project and is being used within Azure Data. A video demonstrating MLOS is available at https://aka.ms/MLOS/VLDB-2024-demo-video.",
    "citationCount": 10,
    "referenceCount": 21
}