{
    "paperId": "85800b525f15d7efd2960575b28908501faec56f",
    "title": "Sketched Sum-Product Networks for Joins",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Brian Tsan",
        "Abylay Amanbayev",
        "Asoke Datta",
        "Florin Rusu"
    ],
    "doi": "10.48550/arXiv.2506.14034",
    "arxivId": "2506.14034",
    "url": "https://www.semanticscholar.org/paper/85800b525f15d7efd2960575b28908501faec56f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sketches have shown high accuracy in multi-way join cardinality estimation, a critical problem in cost-based query optimization. Accurately estimating the cardinality of a join operation -- analogous to its computational cost -- allows the optimization of query execution costs in relational database systems. However, although sketches have shown high efficacy in query optimization, they are typically constructed specifically for predefined selections in queries that are assumed to be given a priori, hindering their applicability to new queries. As a more general solution, we propose for Sum-Product Networks to dynamically approximate sketches on-the-fly. Sum-Product Networks can decompose and model multivariate distributions, such as relations, as linear combinations of multiple univariate distributions. By representing these univariate distributions as sketches, Sum-Product Networks can combine them element-wise to efficiently approximate the sketch of any query selection. These approximate sketches can then be applied to join cardinality estimation. In particular, we implement the Fast-AGMS and Bound Sketch methods, which have successfully been used in prior work, despite their costly construction. By accurately approximating them instead, our work provides a practical alternative to apply these sketches to query optimization.",
    "citationCount": 0,
    "referenceCount": 57
}