{
    "paperId": "85874f684356aa242450ab3f7a40cc18b63b62ff",
    "title": "MTRP: A High-Performance Cost-Efficient Buffering Scheme for Multi-Tenant Cloud Services",
    "year": 2024,
    "venue": "International Symposium on Image and Signal Processing and Analysis",
    "authors": [
        "Zekai Zhu",
        "Peiquan Jin",
        "Guorui Huang",
        "Xiaoliang Wang",
        "Yigui Yuan"
    ],
    "doi": "10.1109/ISPA63168.2024.00228",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/85874f684356aa242450ab3f7a40cc18b63b62ff",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multi-tenancy is a crucial criterion for cloud service providers since it enables them to share resources among tenants, thus reducing costs. As all tenants share the same buffer space in the cloud server, a tenant’s overall performance will be affected by other tenants. Thus, developing an efficient buffering scheme to ensure tenant isolation becomes an urgent need. Aiming to solve this problem, this paper proposes a novel buffering scheme for managing the shared buffer in a multi-tenant cloud database. We first present an SLA (Service Level Agreement)-based model to quantify the buffering performance of each tenant. Then, we propose MTRP (Multi-Tenant Replacement Policy) for multi-tenant scenarios. The novelty of MTRP lies in three aspects: (1) it partitions the buffer into logical zones to implement tenant isolation. Each zone manages the pages one tenant uses, but the zone space can be dynamically adjusted by buffer replacements; (2) it proposes a two-step replacement algorithm, including global replacement and local replacement, which can improve space efficiency and reduce the SLA cost; (3) it adopts a reinforcement learning model to select the most appropriate zone for page replacement. The experimental results on various multi-tenant workloads show that MTRP achieves a higher hit ratio and lower SLA costs than LRU, LFU, LRU-2, and LeCaR.",
    "citationCount": 0,
    "referenceCount": 11
}