{
    "paperId": "8618491020366dfce6a33914557776bfcedf1525",
    "title": "PostgreSQL vs. Oracle: A Comparative Study of Performance, Scalability, and Enterprise Adoption",
    "year": 2024,
    "venue": "International Journal of Emerging Trends in Computer Science and Information Technology",
    "authors": [
        "Harsha Vardhan ReddyKavuluri"
    ],
    "doi": "10.63282/3050-9246.ijetcsit-v5i2p104",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8618491020366dfce6a33914557776bfcedf1525",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "- PostgreSQL and Oracle are two of the most preferred market RDBMS in the enterprise and open-source platforms. Specifically, PostgreSQL is an object-relational database management system, open-source that can be easily extended with competitive costs and good community support. On the other hand, Oracle Database is a commercial RDBMS with high performance, reliability, as well as enterprise solutions. This paper offers a detailed analysis of PostgreSQL and Oracle undertaken in terms of performance, scalability, and the ranking of the software in enterprises. We perform standard benchmark tests that are the speed of query, the ability to handle transactions and concurrent connections and so on. Moreover, we investigate the scalability options, which are vertical and horizontal scalability, clustering, and parallel processing. Finally, we evaluate the adoption of TME by examining the practical application of TME in organizations, licensing cost Program, vendor support and the total cost of the ownership. This comparison is intended to help several organizations make a better choice when it comes to the selection of a database depending on their needs and the amount of money needed to pay for it.",
    "citationCount": 0,
    "referenceCount": 16
}