{
    "paperId": "86234587d791323dbd086f980e3b7c1ada4250a0",
    "title": "Machine Learning Approaches for Active Queue Management: A Survey, Taxonomy, and Future Directions",
    "year": 2024,
    "venue": "Comput. Networks",
    "authors": [
        "Mohammad Parsa Toopchinezhad",
        "Mahmood Ahmadi"
    ],
    "doi": "10.48550/arXiv.2410.02563",
    "arxivId": "2410.02563",
    "url": "https://www.semanticscholar.org/paper/86234587d791323dbd086f980e3b7c1ada4250a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Active Queue Management (AQM), a network-layer congestion control technique endorsed by the Internet Engineering Task Force (IETF), encourages routers to discard packets before the occurrence of buffer overflow. Traditional AQM techniques often employ heuristic approaches that require meticulous parameter adjustments, limiting their real-world applicability. In contrast, Machine Learning (ML) approaches offer highly adaptive, data-driven solutions custom to dynamic network conditions. Consequently, many researchers have adapted ML for AQM throughout the years, resulting in a wide variety of algorithms ranging from predicting congestion via supervised learning to discovering optimal packet-dropping policies with reinforcement learning. Despite these remarkable advancements, no previous work has compiled these methods in the form of a survey article. This paper presents the first thorough documentation and analysis of ML-based algorithms for AQM, in which the strengths and limitations of each proposed method are evaluated and compared. In addition, a novel taxonomy of ML approaches based on methodology is also established. The review is concluded by discussing unexplored research gaps and potential new directions for more robust ML-AQM methods.",
    "citationCount": 2,
    "referenceCount": 157
}