{
    "paperId": "862a4ccacb92c3960b357cbb6deee935c4a15521",
    "title": "MetaCon: Unified Predictive Segments System with Trillion Concept Meta-Learning",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Keqian Li",
        "Yifan Hu",
        "Logan Palanisamy",
        "Lisa Jones",
        "A. Gupta",
        "J. Grigsby",
        "Ili Selinger",
        "Matt Gillingham",
        "Fei Tan"
    ],
    "doi": "10.48550/arXiv.2203.04540",
    "arxivId": "2203.04540",
    "url": "https://www.semanticscholar.org/paper/862a4ccacb92c3960b357cbb6deee935c4a15521",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2203.04540",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate understanding of users in terms of predicative segments play an essential role in the day to day operation of modern internet enterprises. Nevertheless, there are significant challenges that limit the quality of data, especially on long tail predictive tasks. In this work, we present MetaCon, our unified predicative segments system with scalable, trillion concepts meta learning that addresses these challenges. It builds on top of a flat concept representation that summarizes entities' heterogeneous digital footprint, jointly considers the entire spectrum of predicative tasks as a single learning task, and leverages principled meta learning approach with efficient first order meta-optimization procedure under a provable performance guarantee in order to solve the learning task. Experiments on both proprietary production datasets and public structured learning tasks demonstrate that MetaCon can lead to substantial improvements over state of the art recommendation and ranking approaches.",
    "citationCount": 1,
    "referenceCount": 66
}