{
    "paperId": "863d7df82f98ecbbed77dfb89c4fc765ed3d8232",
    "title": "Internet of health things and machine learning for continuous quality of life monitoring",
    "year": 2025,
    "venue": "Health and Quality of Life Outcomes",
    "authors": [
        "Pedro A. M. Oliveira",
        "Rossana M. C. Andrade",
        "P. A. S. Santos Neto",
        "Ismayle S. Santos",
        "E. C. Junior",
        "V. T. Oliveira"
    ],
    "doi": "10.1186/s12955-025-02420-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/863d7df82f98ecbbed77dfb89c4fc765ed3d8232",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Continuous Quality of Life (QoL) monitoring enables many benefits, such as early healthcare interventions. This work uses Internet of Health Things (IoHT) data and Machine Learning to infer physical and psychological Quality of Life measures. Methods We conducted a longitudinal study with 44 participants for six months. Health data were collected daily through smartphones and wearables, and the participants answered the WHOQOL-BREF questionnaire weekly. Then, five Machine Learning models were trained to evaluate their ability to estimate users’ QoL. Results Random Forest (RF) had the best results considering the Root Mean Squared Error (RMSE). RF got an RMSE of 7.8618 for the physical domain and 7.4591 for the psychological domain. Conclusions Overall, it is possible to use IoHT data to infer users’ QoL, considering a certain margin of error; RF had a reasonable performance for this problem and it was not found any decisive feature for the inference process. This last point reinforces that QoL inference using IoHT data is not trivial, and only combining a large number of features can give relevant insights into users’ QoL. Project approved by UFC ethics committee (ID 56153322.0.0000.5054) on March 9, 2022.",
    "citationCount": 0,
    "referenceCount": 71
}