{
    "paperId": "86405fd053bf27bde909149193968f11b094c710",
    "title": "3PO: Programmed Far-Memory Prefetching for Oblivious Applications",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Christopher Branner-Augmon",
        "Narek Galstyan",
        "Sam Kumar",
        "Emmanuel Amaro",
        "Amy Ousterhout",
        "Aurojit Panda",
        "Sylvia Ratnasamy",
        "S. Shenker"
    ],
    "doi": "10.48550/arXiv.2207.07688",
    "arxivId": "2207.07688",
    "url": "https://www.semanticscholar.org/paper/86405fd053bf27bde909149193968f11b094c710",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2207.07688",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Using memory located on remote machines, or far memory, as a swap space is a promising approach to meet the increasing memory demands of modern datacenter applications. Operating systems have long relied on prefetchers to mask the increased latency of fetching pages from swap space to main memory. Unfortunately, with traditional prefetching heuris-tics, performance still degrades when applications use far memory. In this paper we propose a new prefetching tech-nique for far-memory applications. We focus our efforts on memory-intensive, oblivious applications whose memory access patterns are independent of their inputs, such as matrix multiplication. For this class of applications we observe that we can perfectly prefetch pages without relying on heuristics. However, prefetching perfectly without requiring significant application modifications is challenging. In this paper we describe the design and implementation of 3PO , a system that provides p re- p lanned p refetching for general o blivious applications. We demonstrate that 3PO can",
    "citationCount": 5,
    "referenceCount": 53
}