{
    "paperId": "86461bd960c711e93c115250e4c650a60c17d6c9",
    "title": "Efficient Stack Distance Approximation Based on Workload Characteristics",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Sooyoung Lim",
        "Dongchul Park"
    ],
    "doi": "10.1109/ACCESS.2022.3180327",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/86461bd960c711e93c115250e4c650a60c17d6c9",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09789168.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A stack distance of a reference is the depth from which the reference must be extracted from a stack. It has been widely applied to a variety of applications utilizing temporal locality information. However, calculating an exact stack distance requires significant computational complexity that is impractical for online production systems. This paper proposes an efficient algorithm that approximates a stack distance based on workload characteristics. The proposed algorithm utilizes two simple reference metrics: inter-reference distance and a quasi-unique reference count. More importantly, its approximation algorithm requires surprisingly simple calculation. Consequently, it significantly reduces computational overhead while exhibiting exceptional accuracy and runs extremely fast. Moreover, it allows configurable parameters for performance optimization by making optimal use of workload characteristics. Our extensive experiments with diverse realistic workloads demonstrate our stack distance approximation algorithm outperforms the current state-of-the-art algorithm with higher accuracy ( $3.7\\times $ ), lower memory footprint ( $3.05\\times $ ) and fast execution (less than 0.05 seconds) on average. In addition, with configuration parameters, our refined algorithm can achieve a 28% average additional accuracy improvement.",
    "citationCount": 2,
    "referenceCount": 31
}