{
    "paperId": "865ef0d6c4b4013dd80bd59623ddc49a55cf6585",
    "title": "Response to NITRD, NCO, NSF Request for Information on \"Update to the 2016 National Artificial Intelligence Research and Development Strategic Plan\"",
    "year": 2018,
    "venue": "arXiv.org",
    "authors": [
        "J. Amundson",
        "J. Annis",
        "C. Avestruz",
        "D. Bowring",
        "J. Caldeira",
        "G. Cerati",
        "C. Chang",
        "S. Dodelson",
        "D. Elvira",
        "A. Farahi",
        "K. Genser",
        "L. Gray",
        "O. Gutsche",
        "P. Harris",
        "J. Kinney",
        "J. Kowalkowski",
        "R. Kutschke",
        "S. Mrenna",
        "B. Nord",
        "A. Para",
        "K. Pedro",
        "G. Perdue",
        "A. Scheinker",
        "P. Spentzouris",
        "J. S. John",
        "N. Tran",
        "S. Trivedi",
        "L. Trouille",
        "W. L. K. Wu",
        "C. R. Bom"
    ],
    "doi": "10.2172/1592156",
    "arxivId": "1911.05796",
    "url": "https://www.semanticscholar.org/paper/865ef0d6c4b4013dd80bd59623ddc49a55cf6585",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/1911.05796",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Business",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present a response to the 2018 Request for Information (RFI) from the NITRD, NCO, NSF regarding the \"Update to the 2016 National Artificial Intelligence Research and Development Strategic Plan.\" Through this document, we provide a response to the question of whether and how the National Artificial Intelligence Research and Development Strategic Plan (NAIRDSP) should be updated from the perspective of Fermilab, America's premier national laboratory for High Energy Physics (HEP). We believe the NAIRDSP should be extended in light of the rapid pace of development and innovation in the field of Artificial Intelligence (AI) since 2016, and present our recommendations below. AI has profoundly impacted many areas of human life, promising to dramatically reshape society --- e.g., economy, education, science --- in the coming years. We are still early in this process. It is critical to invest now in this technology to ensure it is safe and deployed ethically. Science and society both have a strong need for accuracy, efficiency, transparency, and accountability in algorithms, making investments in scientific AI particularly valuable. Thus far the US has been a leader in AI technologies, and we believe as a national Laboratory it is crucial to help maintain and extend this leadership. Moreover, investments in AI will be important for maintaining US leadership in the physical sciences.",
    "citationCount": 11,
    "referenceCount": 51
}