{
    "paperId": "86633a906653c2d0f6a4a8104aa9e0bd2869b9a5",
    "title": "Making Data Clouds Smarter at Keebo: Automated Warehouse Optimization using Data Learning",
    "year": 2023,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Barzan Mozafari",
        "Radu Alexandru Burcuta",
        "Alan Cabrera",
        "A. Constantin",
        "Derek Francis",
        "David Grömling",
        "Alekh Jindal",
        "Maciej Konkolowicz",
        "Valentin Marian Spac",
        "Yongjoo Park",
        "Russell Razo Carranzo",
        "Nicholas M. Richardson",
        "Abhishek Roy",
        "Aayushi Srivastava",
        "Isha Tarte",
        "B. Westphal",
        "Chi Zhang"
    ],
    "doi": "10.1145/3555041.3589681",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/86633a906653c2d0f6a4a8104aa9e0bd2869b9a5",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3555041.3589681",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data clouds in general, and cloud data warehouses (CDWs) in particular, have lowered the upfront expertise and infrastructure barriers, making it easy for a wider range of users to query large and diverse sources of data. This has made modern data pipelines more complex, harder to optimize, and therefore less resource efficient. As a result, the ongoing cost of data clouds can easily become prohibitively expensive. Further, since CDWs are general-purpose solutions that must serve a wide range of workloads, their out-of-box performance is sub-optimal for any single workload. Data teams therefore spend significant effort manually optimizing their queries and cloud infrastructure to curb costs while achieving reasonable performance. Aside from the opportunity cost of diverting data teams from business goals, manual optimization of millions of constantly changing queries is simply daunting. To the best of our knowledge, Keebo's Warehouse Optimization is the first fully-automated solution capable of making real-time optimization decisions that minimize the CDWs' overall cost while meeting the users' performance goals. Keebo learns from how users and applications interact with their CDW and uses its trained models to automatically optimize the warehouse settings, adjusts its resources (e.g., compute, memory), scale it up or down, suspend or resume it, and also self-correct in real-time based on the impact of its own actions.",
    "citationCount": 4,
    "referenceCount": 50
}