{
    "paperId": "86711aa590fbbaa22e991e1affceb61f745ae4f2",
    "title": "Efficient Data Access Paths for Mixed Vector-Relational Search",
    "year": 2024,
    "venue": "International Workshop on Data Management on New Hardware",
    "authors": [
        "Viktor Sanca",
        "Anastasia Ailamaki"
    ],
    "doi": "10.1145/3662010.3663448",
    "arxivId": "2403.15807",
    "url": "https://www.semanticscholar.org/paper/86711aa590fbbaa22e991e1affceb61f745ae4f2",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2403.15807",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of machine learning capabilities and the adoption of data processing methods using vector embeddings sparked a great interest in creating systems for vector data management. While the predominant approach of vector data management is to use specialized index structures for fast search over the entirety of the vector embeddings, once combined with other (meta)data, the search queries can also become selective on relational attributes - typical for analytical queries. As using vector indexes differs from traditional relational data access, we revisit and analyze alternative access paths for efficient mixed vector-relational search. We first evaluate the accurate but exhaustive scan-based search and propose hardware optimizations and alternative dense vector-based formulation and batching to offset the cost. We outline the complex access-path design space, primarily driven by relational selectivity, and the decisions to consider when selecting an exhaustive scan-based search against an approximate index-based approach. Since the vector index primarily avoids expensive computation across the entire dataset, contrary to the common relational knowledge, it is better to scan at lower relational selectivity and probe at higher, with a cross-point between the two approaches dictated by data dimensionality, vector index parameters, and the number of concurrent search queries.",
    "citationCount": 4,
    "referenceCount": 35
}