{
    "paperId": "86734c65ad1cd64f0c39e13bbc0084c04d1db8f2",
    "title": "Novel Grid Collection and Management Model of Remote Sensing Change Detection Samples",
    "year": 2023,
    "venue": "Remote Sensing",
    "authors": [
        "Daoye Zhu",
        "Bing Han",
        "Elisabete A. Silva",
        "Shuang Li",
        "Min Huang",
        "Fuhu Ren",
        "Chengqi Cheng"
    ],
    "doi": "10.3390/rs15235528",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/86734c65ad1cd64f0c39e13bbc0084c04d1db8f2",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-4292/15/23/5528/pdf?version=1701098421",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Remote sensing data have become an important data source for urban and regional change detection, owing to their advantages of authenticity, objectivity, immediacy, and low cost. The method of collection and management for remote sensing change detection samples (RS_CDS) assumes a crucial role in the effectiveness of remote sensing intelligent change detection (RSICD). To achieve rapid collection and real-time sharing of RS_CDS, this study proposes a grid collection and management model of RS_CDS based on GeoSOT (GCAM-GeoSOT), including the grid collection method of RS_CDS (GCM-SD) and grid management method of RS_CDS (GMM-SD). To verify the feasibility and retrieval efficiency of GMM-SD, Oracle and PostgreSQL databases were combined and the retrieval efficiency and database capacity were compared with the corresponding spatial databases, Oracle Spatial and PostgreSQL + PostGIS, respectively. The experimental results showed that GMM-SD not only ensures the reasonable capacity consumption of the database but also has a higher retrieval efficiency for the RS_CDS. This results in a noteworthy comprehensive performance enhancement, with a 47.63% improvement compared to Oracle Spatial and a 40.24% improvement compared to PostgreSQL + PostGIS.",
    "citationCount": 2,
    "referenceCount": 24
}