{
    "paperId": "870b21c5a4a0c1904ef6470010b3d8ff9417d94e",
    "title": "Serendipitous, Open Big Data Management and Analytics: The SeDaSOMA Framework",
    "year": 2024,
    "venue": "Modelling",
    "authors": [
        "Alfredo Cuzzocrea",
        "Paolo Ciancarini"
    ],
    "doi": "10.3390/modelling5030061",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/870b21c5a4a0c1904ef6470010b3d8ff9417d94e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/modelling5030061",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents and delves into the architecture and intricacies of SeDaSOMA, a sophisticated framework supporting Serendipitous, Data-as-a-Service-oriented, Open big data Management and Analytics. SeDaSOMA meticulously addresses the multifaceted challenges inherent in open big data management and analytics. SeDaSOMA stands as a testament to the evolving landscape of big data management and analytics, embodying a commitment to harnessing advanced functionalities through a synthesis of innovative research findings and cutting-edge tools. In the context of this framework, the paper not only elucidates its structural components but also underscores its pivotal role in facilitating the seamless integration, processing, and analysis of massive and diverse datasets. By providing a comprehensive overview of SeDaSOMA, this paper contributes to the ongoing discourse within the field of big data management and analytics, shedding light on the intricate interplay between technological innovation and practical application. Moreover, as a complement to the discussion on SeDaSOMA, the paper offers a critical exploration of the emerging topics in the realm of big data research. By delineating current state-of-the-art methodologies and forecasting future research trajectories, this overview enriches the scholarly dialogue surrounding the evolving landscape of big data management and analytics, offering insights into the broader implications and potential advancements in the field.",
    "citationCount": 1,
    "referenceCount": 94
}