{
    "paperId": "87132d4e2387c5840394c745db7b81841decd818",
    "title": "Exploring Research on the Construction and Application of Knowledge Graphs for Aircraft Fault Diagnosis",
    "year": 2023,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Xilang Tang",
        "Guo Chi",
        "Lijie Cui",
        "Andrew W. H. Ip",
        "Kai-Leung Yung",
        "Xiaoyue Xie"
    ],
    "doi": "10.3390/s23115295",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87132d4e2387c5840394c745db7b81841decd818",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/11/5295/pdf?version=1685699664",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fault diagnosis is crucial for repairing aircraft and ensuring their proper functioning. However, with the higher complexity of aircraft, some traditional diagnosis methods that rely on experience are becoming less effective. Therefore, this paper explores the construction and application of an aircraft fault knowledge graph to improve the efficiency of fault diagnosis for maintenance engineers. Firstly, this paper analyzes the knowledge elements required for aircraft fault diagnosis, and defines a schema layer of a fault knowledge graph. Secondly, with deep learning as the main method and heuristic rules as the auxiliary method, fault knowledge is extracted from structured and unstructured fault data, and a fault knowledge graph for a certain type of craft is constructed. Finally, a fault question-answering system based on a fault knowledge graph was developed, which can accurately answer questions from maintenance engineers. The practical implementation of our proposed methodology highlights how knowledge graphs provide an effective means of managing aircraft fault knowledge, ultimately assisting engineers in identifying fault roots accurately and quickly.",
    "citationCount": 22,
    "referenceCount": 54
}