{
    "paperId": "872ccbbe5ccdb02145f7ee7362a7a6f5b076187a",
    "title": "Exploring Automated Feature Engineering for Energy Consumption Forecasting with AutoML",
    "year": 2024,
    "venue": "IEEE International Conference on Systems, Man and Cybernetics",
    "authors": [
        "Nasser Alkhulaifi",
        "Alexander L. Bowler",
        "Direnc Pekaslan",
        "Isaac Triguero",
        "Nicholas J. Watson"
    ],
    "doi": "10.1109/SMC54092.2024.10831959",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/872ccbbe5ccdb02145f7ee7362a7a6f5b076187a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning methods are widely used to predict energy consumption, aiming to enhance efficiency and support environmental goals. However, developing these models is traditionally time-consuming and expert-dependent. While Automated Machine Learning (AutoML) has emerged as a valuable approach to streamlining machine learning pipelines, including appropriate preprocessing and learning algorithms, it may still require human experts. These experts might be needed to generate new, interpretable features that could significantly improve model performance. This is particularly relevant in complex settings such as the energy domain, where deep learning's automatic feature extraction lacks interpretability. To address this challenge, this exploratory work introduces an automated feature engineering method tailored for energy forecasting problems. It involves generating a comprehensive set of features that can be fed into AutoML, thereby reducing the need for domain knowledge in feature engineering. The proposed method has been validated using eleven datasets from various energy domains, including residential buildings, renewable energy, and regional energy consumption, with state-of-the-art AutoML methods, namely H20, TPOT, AutoGluon, and FLAML. The results demonstrate a noticeable reduction in prediction errors across all the examined datasets.",
    "citationCount": 2,
    "referenceCount": 31
}