{
    "paperId": "8746f4ebf8a6c05fc1cf64a4da0728e34072e725",
    "title": "Aixel: A Unified, Adaptive and Extensible System for AI-powered Data Analysis",
    "year": 2025,
    "venue": "",
    "authors": [
        "Meihui Zhang",
        "Liming Wang",
        "Chi Zhang",
        "Zhaojing Luo"
    ],
    "doi": null,
    "arxivId": "2510.12642",
    "url": "https://www.semanticscholar.org/paper/8746f4ebf8a6c05fc1cf64a4da0728e34072e725",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A growing trend in modern data analysis is the integration of data management with learning, guided by accuracy, latency, and cost requirements. In practice, applications draw data of different formats from many sources. In the meanwhile, the objectives and budgets change over time. Existing systems handle these applications across databases, analysis libraries, and tuning services. Such fragmentation leads to complex user interaction, limited adaptability, suboptimal performance, and poor extensibility across components. To address these challenges, we present Aixel, a unified, adaptive, and extensible system for AI-powered data analysis. The system organizes work across four layers: application, task, model, and data. The task layer provides a declarative interface to capture user intent, which is parsed into an executable operator plan. An optimizer compiles and schedules this plan to meet specified goals in accuracy, latency, and cost. The task layer coordinates the execution of data and model operators, with built-in support for reuse and caching to improve efficiency. The model layer offers versioned storage for index, metadata, tensors, and model artifacts. It supports adaptive construction, task-aligned drift detection, and safe updates that reuse shared components. The data layer provides unified data management capabilities, including indexing, constraint-aware discovery, task-aligned selection, and comprehensive feature management. With the above designed layers, Aixel delivers a user friendly, adaptive, efficient, and extensible system.",
    "citationCount": 0,
    "referenceCount": 53
}