{
    "paperId": "874770d15641013624e0152edcd60b6279937887",
    "title": "PcmSU-A Packet Classification Method Supporting High-Speed Search and Fast Update",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Y. Cheng",
        "Yihang Xu",
        "Qiuying Shi"
    ],
    "doi": "10.1109/ACCESS.2023.3281838",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/874770d15641013624e0152edcd60b6279937887",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/10005208/10141601.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Packet classification is the core technology that underpins software-defined networking (SDN). With the rapid development of network applications, the increasing complexity of flow tables in SDN brings challenges to update and classification time. In order to achieve fast search and update at the same time, this article proposes a high-performance packet classification method PcmSU based on decision tree. The method optimizes the search and update process in the traditional decision tree-based classification method, and the classification efficiency of the constructed decision tree has been greatly improved compared with that before optimization. Based on the characteristics of the small interval, the reconstruction of the decision tree is greatly reduced and the rule update efficiency is improved. In addition, based on the characteristics of the decision tree constructed by this method, there is no need to consider the specific location and sequence number of rule updates when adding rules, which can avoid introducing rule conflicts. Experimental results show that the PcmSU method not only supports high-speed packet classification and linear memory consumption, but also has fast rule update speed.",
    "citationCount": 0,
    "referenceCount": 30
}