{
    "paperId": "87753ae5ae297b69c203e5e6bfadba70e960aa69",
    "title": "Characterizing Deep Neural Networks on Edge Computing Systems for Object Classification in 3D Point Clouds",
    "year": 2022,
    "venue": "IEEE Sensors Journal",
    "authors": [
        "Cristian Wisultschew",
        "A. Pérez",
        "A. Otero",
        "Gabriel Mujica",
        "J. Portilla"
    ],
    "doi": "10.1109/JSEN.2022.3193060",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87753ae5ae297b69c203e5e6bfadba70e960aa69",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/7361/9873842/09843856.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The current trend of shifting computing from the cloud to the edge of the Internet of Things is influencing deep learning applications. Moving intelligence closer to the point of need entails advantages in terms of performance, power consumption, security, and privacy. The problem arises with data sources that generate a massive amount of information, making data processing challenging for edge devices. This is the case of point clouds generated by LIDAR sensors. Implementations at the edge become even more challenging when heavy processing algorithms such as deep neural networks are selected. However, deep neural networks are the state-of-the-art solution to carry out object classification tasks as they provide the best results in terms of accuracy when working with high data volumes. This work demonstrates that the processing of point cloud-based sensors using deep neural networks at the edge is becoming feasible with the emergence of new devices with high computing capacity combined with reduced power consumption. In this regard, a characterization of first-in-class deep learning classification algorithms working with point cloud data as inputs and running over different state-of-the-art edge processing architectures is provided. A broad range of devices, including CPUs, GPU-based, SoC FPGA-based, and deep learning neural accelerators, have been evaluated in terms of inference time, classification accuracy, and power consumption. As a result, it demonstrates that neural accelerators with integrated host CPUs represent the best trade-off between power consumption and performance, making them a perfect solution for IoT applications at the edge level.",
    "citationCount": 8,
    "referenceCount": 39
}