{
    "paperId": "87910dab09c0a29ef5f9380d6c7f25f484367aa9",
    "title": "Remote Sensing and Geospatial Analysis in the Big Data Era: A Survey",
    "year": 2025,
    "venue": "Remote Sensing",
    "authors": [
        "Elias Dritsas",
        "M. Trigka"
    ],
    "doi": "10.3390/rs17030550",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87910dab09c0a29ef5f9380d6c7f25f484367aa9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/rs17030550",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The present survey examines the role of big data analytics in advancing remote sensing and geospatial analysis. The increasing volume and complexity of geospatial data are driving the adoption of machine learning (ML) and artificial intelligence (AI) techniques, such as convolutional neural networks (CNNs) and long short-term memory (LSTM) networks, to extract meaningful insights from large, diverse datasets. These AI methods enhance the accuracy and efficiency of spatial and temporal data analysis, benefiting applications in environmental monitoring, urban planning, and disaster management. Despite these advancements, challenges related to computational efficiency, data integration, and model transparency remain. This paper also discusses emerging trends and highlights the potential of hybrid approaches, cloud computing, and edge processing in overcoming these challenges. The integration of AI with geospatial data is poised to significantly improve our ability to monitor and manage Earth systems, supporting more informed and sustainable decision-making.",
    "citationCount": 26,
    "referenceCount": 194
}