{
    "paperId": "87b8c8e05af10c55c89489852cf8aba7afe7525e",
    "title": "The promise of automated machine learning for the genetic analysis of complex traits",
    "year": 2021,
    "venue": "Human Genetics",
    "authors": [
        "E. Manduchi",
        "Joseph D. Romano",
        "J. H. Moore"
    ],
    "doi": "10.1007/s00439-021-02393-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87b8c8e05af10c55c89489852cf8aba7afe7525e",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00439-021-02393-x.pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The genetic analysis of complex traits has been dominated by parametric statistical methods due to their theoretical properties, ease of use, computational efficiency, and intuitive interpretation. However, there are likely to be patterns arising from complex genetic architectures which are more easily detected and modeled using machine learning methods. Unfortunately, selecting the right machine learning algorithm and tuning its hyperparameters can be daunting for experts and non-experts alike. The goal of automated machine learning (AutoML) is to let a computer algorithm identify the right algorithms and hyperparameters thus taking the guesswork out of the optimization process. We review the promises and challenges of AutoML for the genetic analysis of complex traits and give an overview of several approaches and some example applications to omics data. It is our hope that this review will motivate studies to develop and evaluate novel AutoML methods and software in the genetics and genomics space. The promise of AutoML is to enable anyone, regardless of training or expertise, to apply machine learning as part of their genetic analysis strategy.",
    "citationCount": 17,
    "referenceCount": 90
}