{
    "paperId": "87d0cb2b0864fd5f25b7d366f7217eb32e6c0695",
    "title": "Genome-wide identification and expression analysis of peach multiple organellar RNA editing factors reveals the roles of RNA editing in plant immunity",
    "year": 2022,
    "venue": "BMC Plant Biology",
    "authors": [
        "Aidi Zhang",
        "Yuhong Xiong",
        "Jing Fang",
        "Kangchen Liu",
        "Huixiang Peng",
        "Xiujun Zhang"
    ],
    "doi": "10.1186/s12870-022-03982-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87d0cb2b0864fd5f25b7d366f7217eb32e6c0695",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcplantbiol.biomedcentral.com/counter/pdf/10.1186/s12870-022-03982-2",
    "publicationTypes": [
        "JournalArticle",
        "MetaAnalysis"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background Multiple organellar RNA editing factor ( MORF ) genes play key roles in chloroplast developmental processes by mediating RNA editing of Cytosine-to-Uracil conversion. However, the function of MORF genes in peach ( Prunus persica ), a perennial horticultural crop species of Rosaceae, is still not well known, particularly the resistance to biotic and abiotic stresses that threaten peach yield seriously. Results In this study, to reveal the regulatory roles of RNA editing in plant immunity, we implemented genome-wide analysis of peach MORF (PpMORF) genes in response to biotic and abiotic stresses. The chromosomal and subcellular location analysis showed that the identified seven PpMORF genes distributed on three peach chromosomes were mainly localized in the mitochondria and chloroplast. All the PpMORF genes were classified into six groups and one pair of PpMORF genes was tandemly duplicated. Based on the meta-analysis of two types of public RNA-seq data under different treatments (biotic and abiotic stresses), we observed down-regulated expression of PpMORF genes and reduced chloroplast RNA editing, especially the different response of PpMORF2 and PpMORF9 to pathogens infection between resistant and susceptible peach varieties, indicating the roles of MORF genes in stress response by modulating the RNA editing extent in plant immunity. Three upstream transcription factors ( MYB3R-1 , ZAT10 , HSFB3 ) were identified under both stresses, they may regulate resistance adaption by modulating the PpMORF gene expression. Conclusion These results provided the foundation for further analyses of the functions of MORF genes, in particular the roles of RNA editing in plant immunity. In addition, our findings will be conducive to clarifying the resistance mechanisms in peaches and open up avenues for breeding new cultivars with high resistance.",
    "citationCount": 8,
    "referenceCount": 58
}