{
    "paperId": "87e03fead6852e17750b29de0c37d73792a7fb80",
    "title": "Artificial Intelligence in Software Engineering: Transforming Development Paradigms in Financial Services through Machine Learning Innovations",
    "year": 2019,
    "venue": "World Journal of Advanced Research and Reviews",
    "authors": [
        "Vishal Sresth",
        "Sudarshan Prasad Nagavalli",
        "Aakash Srivastava"
    ],
    "doi": "10.30574/wjarr.2019.2.1.0007",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/87e03fead6852e17750b29de0c37d73792a7fb80",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The use of AI in software engineering has made immense changes in the development paradigms, including the application of ML. This paper discusses how to improve traditional methods with the development of AI-based approaches in software engineering sciences up to 2019. In this paper, we specifically explore the advantages that have stemmed from ML innovations to determine how such technologies enhanced the productivity rates for the development systems, automated repetitive chores, optimized the development cycles, and addressed the issues of defect control. In this comparative study, different aspects of ML models and their growth and use over time have been described, along with yearly utilization and an analysis of graphs showing the trend of AI integration. Reflections based on this historical period stress the transformative processes in software engineering practices and the development of AI as an enabler. Lastly, the paper concludes the observed transformational effects of AI in applied domains, highlights the limitations and maps potential future directions for applying AI to address emerging and unresolved issues in software engineering. Overall, this work offers a fundamental angle of view to assessing AI as a critical actor in remaking program construction before 2020.",
    "citationCount": 1,
    "referenceCount": 27
}