{
    "paperId": "88080d422ef1ea596734af5d96e1c84c91252778",
    "title": "Artificial Intelligence for Enhancing Veterinary Healthcare: An Experiment",
    "year": 2025,
    "venue": "Indian Journal of Animal Research",
    "authors": [
        "Abdulrhman Alkhanifer",
        "A. Alzubi"
    ],
    "doi": "10.18805/ijar.bf-1763",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/88080d422ef1ea596734af5d96e1c84c91252778",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: The use of machine learning (ML) in veterinary medicine has gained significant attention, particularly for the early detection and classification of animal diseases. For example: lumpy Skin Disease (LSD) in cattle is one such condition that poses a substantial threat to livestock health. Traditional diagnostic methods can be labor-intensive and time-consuming. Therefore, leveraging ML techniques for automated disease detection could improve diagnostic efficiency and accuracy. Methods: In this study, a dataset comprising images of cattle from four breeds-Vechur, Swiss Holstein, Jersey and Ponwar-was collected to train a DenseNet-121 Convolutional Neural Network (CNN) model for identifying and classifying LSD in cattle. The dataset included both LSD-affected and non-affected cattle images, ensuring balanced representation across different breeds, ages and severity levels. Image preprocessing techniques such as resizing, normalization and data augmentation were applied to prepare the data for model training. The DenseNet-121 architecture was employed, utilizing a pretrained ImageNet model as the feature extractor, with additional layers for binary classification. Result: The model achieved excellent performance, with training accuracy reaching 99.76% and validation accuracy of 92.17%. The precision, recall and F1-score for the “Lumpy” class were 96.43%, 81.82% and 88.52%, respectively, while the “Normal” class had a precision of 92%, recall of 98.57% and F1-score of 95.17%. The overall accuracy of the model was 93.2%. Additionally, the model achieved an AUC score of 0.96 for both classes, indicating a high ability to distinguish between “Lumpy” and “Normal” cattle. These results highlight the potential of ML-based methods in enhancing the efficiency and accuracy of veterinary disease diagnostics.\n",
    "citationCount": 0,
    "referenceCount": 34
}