{
    "paperId": "883ea41a62f0fdd8aeaf61656734bc319cdca4da",
    "title": "DotHash: Estimating Set Similarity Metrics for Link Prediction and Document Deduplication",
    "year": 2023,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Igor Nunes",
        "Mike Heddes",
        "Pere Verg'es",
        "Danny Abraham",
        "A. Veidenbaum",
        "Alexandru Nicolau",
        "T. Givargis"
    ],
    "doi": "10.1145/3580305.3599314",
    "arxivId": "2305.17310",
    "url": "https://www.semanticscholar.org/paper/883ea41a62f0fdd8aeaf61656734bc319cdca4da",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3580305.3599314",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Metrics for set similarity are a core aspect of several data mining tasks. To remove duplicate results in a Web search, for example, a common approach looks at the Jaccard index between all pairs of pages. In social network analysis, a much-celebrated metric is the Adamic-Adar index, widely used to compare node neighborhood sets in the important problem of predicting links. However, with the increasing amount of data to be processed, calculating the exact similarity between all pairs can be intractable. The challenge of working at this scale has motivated research into efficient estimators for set similarity metrics. The two most popular estimators, MinHash and SimHash, are indeed used in applications such as document deduplication and recommender systems where large volumes of data need to be processed. Given the importance of these tasks, the demand for advancing estimators is evident. We propose DotHash, an unbiased estimator for the intersection size of two sets. DotHash can be used to estimate the Jaccard index and, to the best of our knowledge, is the first method that can also estimate the Adamic-Adar index and a family of related metrics. We formally define this family of metrics, provide theoretical bounds on the probability of estimate errors, and analyze its empirical performance. Our experimental results indicate that DotHash is more accurate than the other estimators in link prediction and detecting duplicate documents with the same complexity and similar comparison time.",
    "citationCount": 11,
    "referenceCount": 76
}