{
    "paperId": "885c71da7e81bff57b18d7c076fc8e9e350ed129",
    "title": "Beyond Bloom: A Tutorial on Future Feature-Rich Filters",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Prashant Pandey",
        "Martín Farach-Colton",
        "Niv Dayan",
        "Huanchen Zhang"
    ],
    "doi": "10.1145/3626246.3654681",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/885c71da7e81bff57b18d7c076fc8e9e350ed129",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Filters, such as Bloom, quotient, and cuckoo, save space by maintaining an approximate representation of a set and occasionally returning false positives. Filters play a critical role in building modern dataintensive applications and are used across various domains such as databases, storage engines, computational biology, cyber- security, and networks. There has been extensive research on filters in the past few decades resulting in filters with much improved performance and features. Yet modern data-intensive applications are still designed around the limitations of traditional filters resulting in complex designs and sub-optimal performance. This tutorial aims to bring together researchers at the forefront of filter data structure research to help the database community learn about the recent advancements in the theory and practice of filters. The tutorial will cover real-world case studies of redesigning applications using the modern filter APIs to achieve simplicity and improved application performance. The tutorial will further help uncover the open research problems, both in theory and systems, and increase interaction among researchers to tackle those problems.",
    "citationCount": 6,
    "referenceCount": 98
}