{
    "paperId": "88ade9aa07e5ce1165b279201760172b532f5d75",
    "title": "Privileged Prior Information Distillation for Image Matting",
    "year": 2022,
    "venue": "AAAI Conference on Artificial Intelligence",
    "authors": [
        "Chengzhi Lyu",
        "Jiake Xie",
        "Bo Xu",
        "Cheng Lu",
        "Han Huang",
        "Xin Huang",
        "Ming Wu",
        "Chuang Zhang",
        "Yong Tang"
    ],
    "doi": "10.48550/arXiv.2211.14036",
    "arxivId": "2211.14036",
    "url": "https://www.semanticscholar.org/paper/88ade9aa07e5ce1165b279201760172b532f5d75",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.14036",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Performance of trimap-free image matting methods is limited when trying to decouple the deterministic and undetermined regions, especially in the scenes where foregrounds are semantically ambiguous, chromaless, or high transmittance. In this paper, we propose a novel framework named Privileged Prior Information Distillation for Image Matting (PPID-IM) that can effectively transfer privileged prior environment-aware information to improve the performance of trimap-free students in solving hard foregrounds. The prior information of trimap regulates only the teacher model during the training stage, while not being fed into the student network during actual inference. To achieve effective privileged cross-modality (i.e. trimap and RGB) information distillation, we introduce a Cross-Level Semantic Distillation (CLSD) module that reinforces the students with more knowledgeable semantic representations and environment-aware information. We also propose an Attention-Guided Local Distillation module that efficiently transfers privileged local attributes from the trimap-based teacher to trimap-free students for the guidance of local-region optimization. Extensive experiments demonstrate the effectiveness and superiority of our PPID on image matting. The code will be released soon.",
    "citationCount": 2,
    "referenceCount": 54
}