{
    "paperId": "88b94167d8273b8bc080ae727ae2962327a5a089",
    "title": "LightSAGE: Graph Neural Networks for Large Scale Item Retrieval in Shopee’s Advertisement Recommendation",
    "year": 2023,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Dang Minh Nguyen",
        "Chenfei Wang",
        "Yan Shen",
        "Yifan Zeng"
    ],
    "doi": "10.1145/3604915.3608863",
    "arxivId": "2310.19394",
    "url": "https://www.semanticscholar.org/paper/88b94167d8273b8bc080ae727ae2962327a5a089",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.19394",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph Neural Network (GNN) is the trending solution for item retrieval in recommendation problems. Most recent reports, however, focus heavily on new model architectures. This may bring some gaps when applying GNN in the industrial setup, where, besides the model, constructing the graph and handling data sparsity also play critical roles in the overall success of the project. In this work, we report how GNN is applied for large-scale e-commerce item retrieval at Shopee. We introduce our simple yet novel and impactful techniques in graph construction, modeling, and handling data skewness. Specifically, we construct high-quality item graphs by combining strong-signal user behaviors with high-precision collaborative filtering (CF) algorithm. We then develop a new GNN architecture named LightSAGE to produce high-quality items’ embeddings for vector search. Finally, we design multiple strategies to handle cold-start and long-tail items, which are critical in an advertisement (ads) system. Our models bring improvement in offline evaluations, online A/B tests, and are deployed to the main traffic of Shopee’s Recommendation Advertisement system.",
    "citationCount": 7,
    "referenceCount": 18
}