{
    "paperId": "8910d458bd3b4560ff2ae5c81b15e6a4d99be4fa",
    "title": "SuPoolVisor: a visual analytics system for mining pool surveillance",
    "year": 2020,
    "venue": "Frontiers of Information Technology & Electronic Engineering",
    "authors": [
        "Jia-zhi Xia",
        "Yu-hong Zhang",
        "Hui Ye",
        "Ying Wang",
        "Guangqi Jiang",
        "Ying Zhao",
        "Cong Xie",
        "Xiao-yan Kui",
        "Sheng-hui Liao",
        "Wei-ping Wang"
    ],
    "doi": "10.1631/FITEE.1900532",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8910d458bd3b4560ff2ae5c81b15e6a4d99be4fa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cryptocurrencies represented by Bitcoin have fully demonstrated their advantages and great potential in payment and monetary systems during the last decade. The mining pool, which is considered the source of Bitcoin, is the cornerstone of market stability. The surveillance of the mining pool can help regulators effectively assess the overall health of Bitcoin and issues. However, the anonymity of mining-pool miners and the difficulty of analyzing large numbers of transactions limit in-depth analysis. It is also a challenge to achieve intuitive and comprehensive monitoring of multi-source heterogeneous data. In this study, we present SuPoolVisor, an interactive visual analytics system that supports surveillance of the mining pool and de-anonymization by visual reasoning. SuPoolVisor is divided into pool level and address level. At the pool level, we use a sorted stream graph to illustrate the evolution of computing power of pools over time, and glyphs are designed in two other views to demonstrate the influence scope of the mining pool and the migration of pool members. At the address level, we use a force-directed graph and a massive sequence view to present the dynamic address network in the mining pool. Particularly, these two views, together with the Radviz view, support an iterative visual reasoning process for de-anonymization of pool members and provide interactions for cross-view analysis and identity marking. Effectiveness and usability of SuPoolVisor are demonstrated using three cases, in which we cooperate closely with experts in this field.",
    "citationCount": 24,
    "referenceCount": 71
}