{
    "paperId": "89308a693e882c7415b9ff85e5c2ba1b47b1e18c",
    "title": "Research on SDP-BF Method with Low False Positive Face to Passive Detection System",
    "year": 2024,
    "venue": "Electronics",
    "authors": [
        "Chenzhuo Jiang",
        "Junjie Li",
        "Yuxiao Yang"
    ],
    "doi": "10.3390/electronics13163240",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89308a693e882c7415b9ff85e5c2ba1b47b1e18c",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/13/16/3240/pdf?version=1723714034",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development of 5G, UAV, and military communications, the data volume obtained by the non-cooperative perception system has increased exponentially, and the distributed system has become the development trend of the non-cooperative perception system. The data distribution service (DDS) produces a significant effect on the performance of distributed non-cooperative perception systems. However, the traditional DDS discovery protocol has problems such as false positive misjudgment and high flow overhead, so it can hardly adapt to a large multi-node distributed system. Therefore, the design of a DDS discovery protocol for large distributed system is technically challenging. In this paper, we proposed SDP-DCBF-SFF, a discovery protocol based on the Dynamic Counter Bloom Filter (DCBF) and Second Feedback Filter (SFF). The proposed discovery protocol coarsely filters the interested endpoints through DCBF and then accurately screens the uninterested endpoints through SFF to eliminate the connection requests of false positive endpoints and avoid extra flow overhead. The experimental results indicate that the proposed discovery protocol could effectively reduce the network overhead, and eliminate the false positive probability of endpoints in small, medium, large, and super large systems. In addition, it adopts the self-adaptive extension mechanism of BF to reduce the reconfiguration delay of BF and achieve the smallest system transmission delay. Therefore, the proposed discovery protocol has optimal comprehensive performance and system adaptability.",
    "citationCount": 0,
    "referenceCount": 21
}