{
    "paperId": "894499413af25c80fa78ee37ce4708ab718ab1a1",
    "title": "Deep Group Interest Modeling of Full Lifelong User Behaviors for CTR Prediction",
    "year": 2023,
    "venue": "",
    "authors": [
        "Qi Liu",
        "Xuyang Hou",
        "Haoran Jin",
        "Xiaolong Chen",
        "Jin Chen",
        "Defu Lian",
        "Zhe Wang",
        "Jia Cheng",
        "Jun Lei"
    ],
    "doi": null,
    "arxivId": "2311.10764",
    "url": "https://www.semanticscholar.org/paper/894499413af25c80fa78ee37ce4708ab718ab1a1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Extracting users' interests from their lifelong behavior sequence is crucial for predicting Click-Through Rate (CTR). Most current methods employ a two-stage process for efficiency: they first select historical behaviors related to the candidate item and then deduce the user's interest from this narrowed-down behavior sub-sequence. This two-stage paradigm, though effective, leads to information loss. Solely using users' lifelong click behaviors doesn't provide a complete picture of their interests, leading to suboptimal performance. In our research, we introduce the Deep Group Interest Network (DGIN), an end-to-end method to model the user's entire behavior history. This includes all post-registration actions, such as clicks, cart additions, purchases, and more, providing a nuanced user understanding. We start by grouping the full range of behaviors using a relevant key (like item_id) to enhance efficiency. This process reduces the behavior length significantly, from O(10^4) to O(10^2). To mitigate the potential loss of information due to grouping, we incorporate two categories of group attributes. Within each group, we calculate statistical information on various heterogeneous behaviors (like behavior counts) and employ self-attention mechanisms to highlight unique behavior characteristics (like behavior type). Based on this reorganized behavior data, the user's interests are derived using the Transformer technique. Additionally, we identify a subset of behaviors that share the same item_id with the candidate item from the lifelong behavior sequence. The insights from this subset reveal the user's decision-making process related to the candidate item, improving prediction accuracy. Our comprehensive evaluation, both on industrial and public datasets, validates DGIN's efficacy and efficiency.",
    "citationCount": 0,
    "referenceCount": 29
}