{
    "paperId": "89662e16bb106ec3d6f07c6ededa5e7703c31863",
    "title": "MACML: Marrying attention and convolution-based meta-learning method for few-shot IoT intrusion detection",
    "year": 2025,
    "venue": "PLoS ONE",
    "authors": [
        "Congyuan Xu",
        "Jun Yang",
        "Panpan Li"
    ],
    "doi": "10.1371/journal.pone.0331065",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89662e16bb106ec3d6f07c6ededa5e7703c31863",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The widespread deployment of Internet of Things (IoT) devices has made them prime targets for cyberattacks. Existing intrusion detection systems (IDSs) heavily rely on large-scale labeled datasets, which limits their effectiveness in detecting novel attacks under few-shot scenarios. To address this challenge, we propose a meta-learning-based intrusion detection method called MACML (Marrying Attention and Convolution-based Meta-Learning). It integrates a self-attention mechanism to capture global dependencies and a convolutional neural network to extract local features, thereby enhancing the model’s overall perception of traffic characteristics. MACML adopts an optimization-based meta-learning framework that enables rapid adaptation to new tasks using only a small number of training samples, improving detection performance and generalization capability. We evaluate MACML on the CICIDS2018 and CICIoT2023 datasets. Experimental results show that, with only 10 training samples, MACML achieves an average accuracy of 98.75% and a detection rate of 99.17% on the CICIDS2018 dataset. On the CICIoT2023 dataset, it reaches 94.47% accuracy and a 95.32% detection rate, outperforming existing state-of-the-art methods.",
    "citationCount": 0,
    "referenceCount": 46
}