{
    "paperId": "897f0a4aa81dac2ab2679541032fcdf7b8c7eff5",
    "title": "Deep Learning Enabled Graph Database for Complex Queries",
    "year": 2024,
    "venue": "2024 International Conference on Power, Energy, Control and Transmission Systems (ICPECTS)",
    "authors": [
        "U. Jayachandiran",
        "Sujaritha P",
        "Sahana A",
        "Surendhar J"
    ],
    "doi": "10.1109/ICPECTS62210.2024.10780400",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/897f0a4aa81dac2ab2679541032fcdf7b8c7eff5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The ability to comprehend and react to intricate logical questions is essential for the development of artificial intelligence. With the aid of an advanced query engine, graph store, and embedded store, this paper presents a novel method for answering complex logical queries by fusing deep learning techniques with intricate query processing and graph traversal patterns. The fundamental aspect of our methodology involves the smooth incorporation of graph traversal algorithms and deep learning models into a resilient query engine. In order to model the relationships and dependencies within the data and capture both the local and the global structures from the knowledge graph, we utilize a neural graph network architecture that combines Graph Neural Networks and Recurrent Neural Network. In order to extract semantic features and break down the query into its fundamental parts, the system encrypts the input first using a transformer-based model. A high-performance graph store knowledge graph is mapped onto these elements. In order to create logical paths required for query resolution, a graph traversal algorithm that has been refined through reinforcement learning investigates pertinent nodes and edges. Utilizing attention mechanisms to prioritize important nodes and edges during traversal, our approach includes a novel query processing pattern that uses attention mechanisms to prioritize important nodes and edges during traversal.",
    "citationCount": 0,
    "referenceCount": 13
}