{
    "paperId": "89821305edcd214b015d808a92d685baab54a19c",
    "title": "Report on the 2nd Search Futures Workshop at ECIR 2025",
    "year": 2025,
    "venue": "ACM SIGIR Forum",
    "authors": [
        "Charles L. A. Clarke",
        "Paul B. Kantor",
        "Adam Roegiest",
        "Johanne R Trippas",
        "Zhaochun Ren",
        "Maria Sofia Bucarelli",
        "Xiao Fu",
        "Yixing Fan",
        "Michael Granitzer",
        "David Graus",
        "Maria Heuss",
        "Jaap Kamps",
        "Yibin Lei",
        "Andrew Parry",
        "D. Reijnaers",
        "M. de Rijke",
        "Siddharth A. K. Singh",
        "Yubao Tang",
        "Suzan Verberne",
        "Jonas Wallat",
        "Yumeng Wang",
        "Chen Xu",
        "Andrew Yates",
        "Saber Zerhoudi",
        "Jujia Zhao"
    ],
    "doi": "10.1145/3769733.3769742",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89821305edcd214b015d808a92d685baab54a19c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Second Search Futures Workshop, in conjunction with the Forty-seventh European Conference on Information Retrieval (ECIR) 2025, looked into the future of search to ask questions such as: • How can we navigate data privacy in large language model (LLM)-based information retrieval (IR)? • How can we implement agentic IR for proactive knowledge synthesis? • How do we ensure trustworthy information access beyond citations in the age of language models? • How does deep search transition from matching to reasoning? • What is meant by information semantics, knowledge representation, and natural language in a world of LLM-powered search? • What are serendipity engines, and how do they explore proactive web search via LLM agents, retrieval augmented generation (RAG), and simulated user feedback? The second edition of the workshop opened with ten lightning talks from a diverse group of speakers. Rather than traditional paper presentations, these short talks offered concise overviews of emerging ideas and critical insights, enabling a rapid exchange across various topics. The format was designed to spark discussion and expose participants to a broad spectrum of future-facing research directions in a compact timeframe. This report, co-authored by the workshop organizers, presenters, and participants, summarizes the talks and key discussions. Our aim is to share these insights with the broader IR community and help seed further dialogue around the themes raised. Date: 10 April 2025. Website: https://searchfutures.github.io/.",
    "citationCount": 0,
    "referenceCount": 61
}