{
    "paperId": "89a41503f3c1e440fb1fced0a660ac5bd2b94ee0",
    "title": "Fuzzy Neural Network for Fuzzy Quadratic Programming With Penalty Function and Mean-Variance Markowitz Portfolio Model",
    "year": 2024,
    "venue": "Applied Computational Intelligence and Soft Computing",
    "authors": [
        "I. Khan",
        "Muhammad Aamir",
        "Mehran Ullah",
        "Muhammad Shahbaz Shah"
    ],
    "doi": "10.1155/2024/8694583",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89a41503f3c1e440fb1fced0a660ac5bd2b94ee0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1155/2024/8694583",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research tries to integrate fuzzy neural networks with penalty function to address the quadratic programming based on the mean‐variance Markowitz portfolio model. The fuzzy quadratic programming problem with penalty function consists of the lower, central, and upper models. The models utilize fuzzy neural networks to solve the models. The proposed method has been implemented on the six leading stocks in the Pakistan Stock Exchange. The approach identifies the ideal portfolios for potential investors in the Pakistan Stock Exchange. Data of the six popular stocks trading on the stock exchange from January 2016 to October 2020 are taken into consideration. The optimizers are RMSprop, Momentum, Adadelta, Adagrad, Adam, and gradient descent, respectively. The findings of all the optimizers at all three phases (lower, central, and upper) agree on identifying the optimal investment portfolios for investors. The optimizers recommend investing in either one of the two categories. The first group recommends investing in the FFC, ARPL, and UPFL portfolios. The second group recommends LUCK, AGTL, and IGIHL. The first group tends to enhance return, variability, and risk. It is a high‐risk group. The second group aims to reduce return variability while lowering risk. It is a risk‐averse group. It is evident that all of the optimizers recommend investing in FFC, ARPL, and UPFL, with the exception of the Adam and Adadelta optimizers, which recommends investment in IGIHL, AGTL, and LUCK. RMSprop, Momentum, Adagrad, and gradient descent increase variability, risk, and returns. Adam proves the best optimizer, then RMSprop, and finally, Adagrad. Adam, Adadelta, and RMSprop are sensitive, whereas momentum and gradient descent are irresponsive to fuzzy uncertain data. The percent improvement in the objective is 0.59% and 0.18% for the proposed Adagrad and Adadelta, respectively.",
    "citationCount": 1,
    "referenceCount": 57
}