{
    "paperId": "89abf30dc0909f63976d6cb5d73eb12d018db271",
    "title": "An Offline Profile-Guided Optimization Strategy for Function Reordering on Relational Databases",
    "year": 2023,
    "venue": "IEEE International Conference on Systems, Man and Cybernetics",
    "authors": [
        "Weibin Chen",
        "Yeh-Ching Chung"
    ],
    "doi": "10.1109/SMC53992.2023.10394026",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89abf30dc0909f63976d6cb5d73eb12d018db271",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Profile-guided optimization (PGO) is an advanced technique used to improve the performance of Relational Databases (RDBs). However, the most common strategy is to perform profiling on the production environment, which can lead to instability and performance loss for the Database System. To address this issue, we propose an offline profiling strategy that uses a query reduction strategy to obtain a reduced query set from the production environment's log file. We then run this sample on an offline test environment to collect profile data and use it to conduct function reorder optimization. To evaluate our approach, we compared the performance improvements achieved by running a reduced query set and a full query set on a MYSQL database. We generated function call graphs for both query sets and observed that the performance improvement achieved by the reduced query set was slightly lower than that of the full query set. These results demonstrate the effectiveness of our approach and highlight the potential benefits of offline profiling strategies for improving the performance of RDBs in production environments, while also avoiding performance losses and increasing stability.",
    "citationCount": 1,
    "referenceCount": 23
}