{
    "paperId": "89b73d162b2bd573948e62d78f747f348704c8b6",
    "title": "Multiphysics Simulation Methods in Computer Graphics",
    "year": 2025,
    "venue": "Computer graphics forum (Print)",
    "authors": [
        "Daniel Holz",
        "S. Jeske",
        "Fabian Löschner",
        "Jan Bender",
        "Yin Yang",
        "Sheldon Andrews"
    ],
    "doi": "10.1111/cgf.70082",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89b73d162b2bd573948e62d78f747f348704c8b6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Physics simulation is a cornerstone of many computer graphics applications, ranging from video games and virtual reality to visual effects and computational design. The number of techniques for physically‐based modeling and animation has thus skyrocketed over the past few decades, facilitating the simulation of a wide variety of materials and physical phenomena. This report captures the state‐of‐the‐art of multiphysics simulation for computer graphics applications. Although a lot of work has focused on simulating individual phenomena, here we put an emphasis on methods developed by the computer graphics community for simulating various physical phenomena and materials, as well as the interactions between them. These include combinations of discretization schemes, mathematical modeling frameworks, and coupling techniques. For the most commonly used methods we provide an overview of the state‐of‐the‐art and deliver valuable insights into the various approaches. A selection of software frameworks that offer out‐of‐the‐box multiphysics modeling capabilities is also presented. Finally, we touch on emerging trends in physics‐based animation that affect multiphysics simulation, including machine learning‐based methods which have become increasingly popular in recent years.",
    "citationCount": 2,
    "referenceCount": 380
}