{
    "paperId": "89d4a48c0dbef2350b82ac47881f8a4bcf4e19bb",
    "title": "An Advanced Hierarchical Identity-Based Security Mechanism by Blockchain in Named Data Networking",
    "year": 2022,
    "venue": "Journal of Network and Systems Management",
    "authors": [
        "Bing Li",
        "M. Ma"
    ],
    "doi": "10.1007/s10922-022-09689-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/89d4a48c0dbef2350b82ac47881f8a4bcf4e19bb",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10922-022-09689-x.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Named data networking (NDN) has been viewed as a promising future Internet architecture due to its data-centric design. It requires a new security model that is orienting data but not devices. In this paper, an advanced hierarchical identity-based security mechanism by blockchain (AHISM-B) is to be proposed for the NDN networks. On one hand, the hierarchical identity-based cryptology is used to bind the data name to a public key. The valid public parameters would be requested by consumers with the Interest packets so that consumers would compose producers’ public keys to authenticate producers and verify the integrity of the Data packets. On the other hand, a blockchain is employed to manage public parameters to avoid catastrophes due to a single node failure. Both of the security proof result and the formal validation result indicate that the proposed AHISM-B is secure. Moreover, the simulation results show that the performance of our AHISM-B outperforms that of the classic NDN scheme. Especially, the average response delay of the AHISM-B scheme is less by 8% than that of the classic NDN scheme. With the increase of the average arrival rate of Interest packets, the advantage of the AHISM-B could be enhanced further to 11%.",
    "citationCount": 12,
    "referenceCount": 36
}