{
    "paperId": "89e2413c3b5db4d48431e7d116c61ccff5e8d03e",
    "title": "Deep Learning in Deterministic Computational Mechanics",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "L. Herrmann",
        "Stefan Kollmannsberger"
    ],
    "doi": "10.48550/arXiv.2309.15421",
    "arxivId": "2309.15421",
    "url": "https://www.semanticscholar.org/paper/89e2413c3b5db4d48431e7d116c61ccff5e8d03e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.15421",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid growth of deep learning research, including within the field of computational mechanics, has resulted in an extensive and diverse body of literature. To help researchers identify key concepts and promising methodologies within this field, we provide an overview of deep learning in deterministic computational mechanics. Five main categories are identified and explored: simulation substitution, simulation enhancement, discretizations as neural networks, generative approaches, and deep reinforcement learning. This review focuses on deep learning methods rather than applications for computational mechanics, thereby enabling researchers to explore this field more effectively. As such, the review is not necessarily aimed at researchers with extensive knowledge of deep learning -- instead, the primary audience is researchers at the verge of entering this field or those who attempt to gain an overview of deep learning in computational mechanics. The discussed concepts are, therefore, explained as simple as possible.",
    "citationCount": 1,
    "referenceCount": 619
}