{
    "paperId": "8a21ed337aed179cebdc4131d0cc98058435bbf0",
    "title": "Lossless congestion control based on priority scheduling in named data networking",
    "year": 2024,
    "venue": "Journal of Physics: Conference Series",
    "authors": [
        "Wenlan Diao",
        "Jianping An",
        "Tong Li",
        "Xiaotian Wang",
        "Zhoujie Liu",
        "Zhenghan Li"
    ],
    "doi": "10.1088/1742-6596/2849/1/012096",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a21ed337aed179cebdc4131d0cc98058435bbf0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1088/1742-6596/2849/1/012096",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The LEO satellite network is an important component of the next-generation (6G) communication network, carrying a large amount of data exchange, which poses challenges to congestion control. The Named Data Networking (NDN) with the characteristics of in-network cache and content multicast can save the traffic consumed by data distribution. However, due to issues such as long control loops, packet loss, and lack of quality of service support, the existing congestion control methods in NDN cannot be applied to the LEO satellite networks. In this paper, we propose an easily deployable congestion control method: NDN Data Forwarding Control (NDFC). We improve the backhaul forwarding of data packets. According to the occupancy of the output queue in each interface, the data packet can be injected into the queue from the content store (CS), avoiding congestion and achieving packet loss-free forwarding. Besides, we design a forwarding dispatch table and priority-based scheduling to support the rapid transmission of data packets with high priority and the fair transmission of data packets with the same priority. The NDFC method has been evaluated and the simulation results show that compared with the practical congestion control scheme (PCON), the NDFC mechanism stabilizes high throughput, reduces the completion time of high-priority data flows by 50%, and evenly allocates bandwidth for data flows with the same priority.",
    "citationCount": 0,
    "referenceCount": 14
}