{
    "paperId": "8a3269601a18721a8486e88637886e38824cdf40",
    "title": "JSVulExplorer: a JavaScript vulnerability detection model based on transfer learning",
    "year": 2023,
    "venue": "Fifth International Conference on Computer Information Science and Artificial Intelligence",
    "authors": [
        "S. Chen",
        "Nan Jiang",
        "Zheng Wu",
        "Zichen Wang"
    ],
    "doi": "10.1117/12.2667324",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a3269601a18721a8486e88637886e38824cdf40",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Software vulnerabilities will make the system vulnerable to attack, affect the reliability of the software and cause information leakage, which will have a huge impact on enterprises or individuals. Vulnerabilities are inevitable in software development engineering. Therefore, relying on some methods or tools for continuous vulnerability analysis of code is the solution to minimize software vulnerabilities. We propose a neural network model, JSVulExplorer, for static vulnerability analysis of the dynamic programming language JavaScript. The JSVulExplorer focuses on feature enhancement of data. We use pre-training to learn the semantic similarity between code slices, utilize abstract syntax trees to generate path information, and design positional encoding to use the path information. Based on transfer learning, we combine the pre-trained model with path information to improve vulnerability detection performance. Experiments show that JSVulExplorer has significantly improved precision and recall compared to previous models. It is verified that the dynamic event-based programming language can also use the static analysis method for vulnerability detection.",
    "citationCount": 1,
    "referenceCount": 15
}