{
    "paperId": "8a3521488589a58c4b701fb0c8bd8dce482234ff",
    "title": "A Deep Learning-Based Framework for Environmental Risk Analysis of Household E-Waste",
    "year": 2025,
    "venue": "2025 6th International Conference on Data Intelligence and Cognitive Informatics (ICDICI)",
    "authors": [
        "Dr.A.Thilaka",
        "Dr.T.Nathiya",
        "Dr.B.Mahalakshmi",
        "th K.Maheswari",
        "E.Sundaravalli"
    ],
    "doi": "10.1109/ICDICI66477.2025.11135089",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a3521488589a58c4b701fb0c8bd8dce482234ff",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Electronic waste (e-waste) has become the booming most threatening waste flow in today's world. Frequent upgrades, limited lifespan, and repair difficulties of the electronic equipment lead the e-waste massively across the globe. The Sustainable Development Goals impose policies related to e-waste reduction and e-waste recycling directly and indirectly. E-waste management is very difficult in a country like India. The geographical structure, differences in culture and high population make it even worse. The generation of ewaste and mishandling of e-waste causes risks to human health, environmental bodies and changes. The prevention of ewaste generation is one of the necessary actions to build a sustainable environment. Household e-waste is a large and hidden component in the entire e-waste generation. It creates more risks to the public directly as it is generated and disposed of in residential areas. Many statistical models have proposed proper e-waste management and disposal to avoid e-waste risks. The deep learning models outperform the statistical approaches when it comes to handling huge data and complex problems, especially for household e-waste risk analysis. This paper deals with an analysis of the environmental risks which are caused by household e-waste. There are four deep learning models were developed to classify the household e-waste risks to the environment. The implementation of these four models was done with the help of two-layer FC neural network, Dual MLP, MLP using embedding layers and TabNet Classifier neural networks. The TabNet Classifier deep learning model provides $\\mathbf{9 5 \\%}$ accuracy compared to the other models.",
    "citationCount": 0,
    "referenceCount": 25
}