{
    "paperId": "8a599031f6ae94c598ff7e7830a72a9ec1a7337d",
    "title": "Reconstruction of Gene Regulatory Networks using sparse graph recovery models",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "H. Shrivastava"
    ],
    "doi": "10.1101/2023.04.02.535294",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a599031f6ae94c598ff7e7830a72a9ec1a7337d",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2023/04/04/2023.04.02.535294.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There is a considerable body of work in the field of computer science on the topic of sparse graph recovery, particularly with regards to the innovative deep learning approaches that have been recently introduced. Despite this abundance of research, however, these methods are often not applied to the recovery of Gene Regulatory Networks (GRNs). This work aims to initiate this trend by highlighting the potential benefits of using these computational techniques in the recovery of GRNs from single cell RNA sequencing or bulk sequencing based gene expression data. GRNs are directed graphs that capture the direct dependence between transcription factors (TFs) and their target genes. Understanding these interactions is vital for studying the mechanisms in cell differentiation, growth and development. We categorize graph recovery methods into four main types based on the underlying formulations: Regression-based, Graphical Lasso, Markov Networks and Directed Acyclic Graphs. We selected representative methods from each category and made modifications to incorporate transcription factor information as a prior to ensure successful reconstruction of GRNs.",
    "citationCount": 1,
    "referenceCount": 45
}