{
    "paperId": "8a591b4e3548b5641b55ab741bf5cd9eb6f46c43",
    "title": "Optimizing potato crop productivity: a meteorological analysis and machine learning approach",
    "year": 2025,
    "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)",
    "authors": [
        "Md. Jiabul Hoque",
        "Md. Saiful Islam",
        "Abdullah Al Noman",
        "Md. Abrarul Hoque",
        "Irfan A. Chowdhury",
        "Mohammed Saifuddin"
    ],
    "doi": "10.11591/ijai.v14.i2.pp1116-1129",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a591b4e3548b5641b55ab741bf5cd9eb6f46c43",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Motivated by the critical need to enhance potato production in Bangladesh, particularly in the face of a changing climate, this study investigates the significant impact of weather on potato yield. This research employs various statistical and machine-learning approaches to identify key weather factors influencing potato crops. We utilize ANOVA F regression and random forest (RF) with feature importance analysis to pinpoint crucial monthly weather variables. Additionally, a correlation study employing Pearson's and Spearman's coefficients alongside p-values is conducted to determine the relationships between weather conditions and crop yield. Seaborn's bivariate kernel density estimation is then used to visualize ideal weather conditions for optimal harvests. Furthermore, to predict future yields, the study implements thoroughly trained and validated machine learning models including k-nearest neighbors (KNN), RF, and support vector regressor (SVR). Our analysis reveals that the RF model emerges as the most reliable predictor, achieving a high correlation coefficient (R²=0.9990), and minimal error values (mean absolute percentage error (MAPE)=0.70, mean absolute error (MAE)=0.0803, and root mean square error (RMSE)=0.1114). These findings provide valuable insights to guide informed agricultural decisions and climate-related strategies, particularly for resource-limited countries like Bangladesh.",
    "citationCount": 0,
    "referenceCount": 35
}