{
    "paperId": "8a738a221af7fd1d0305ddc64bff314ad933a35a",
    "title": "Research on an evaluation index system of critical emergency management capability based on machine learning in a complex scientific environment",
    "year": 2023,
    "venue": "Frontiers in Ecology and Evolution",
    "authors": [
        "Xianli Zhao",
        "Zhenlong Hu"
    ],
    "doi": "10.3389/fevo.2023.1176872",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8a738a221af7fd1d0305ddc64bff314ad933a35a",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fevo.2023.1176872/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction A complex scientific environment requires multiple considerations for handling critical and emergency conditions with an addressing solution. Indexing and prioritizing are standard methods that are used in such settings to improve itinerary solutions. Significance of an indexing system relies on the benchmark solution and the strategy it implies. Methods The present study introduces an indexing strategy evaluation method (ISEM) to validate the efficiency of indexing systems. The proposed method identifies the root implication and the strategy parameters to address complex problems. The environmental and problem-specific parameters are determined to estimate the system's initial response. The capability through solution response, lag, and failure analysis is identified post the estimation through linear regression learning. The indexing system's operations are designed through linear itineraries to prevent interrupting failures. In addition, the environmental features are identified as augmenting factors to prevent strategy pausing across multiple indices. Results and discussion The proposed method employs linear analysis through itinerary levels of index evaluation for optimal, lagging, and failed implications. It also helps to identify specific reasons for solution improvement or retention from previous operations.",
    "citationCount": 0,
    "referenceCount": 30
}