{
    "paperId": "8aa026d590e877353d471c3349ed9c384a015f4a",
    "title": "Performance Characterization and Modeling of Serverless and HPC Streaming Applications",
    "year": 2019,
    "venue": "2019 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "André Luckow",
        "S. Jha"
    ],
    "doi": "10.1109/BigData47090.2019.9006530",
    "arxivId": "1909.06055",
    "url": "https://www.semanticscholar.org/paper/8aa026d590e877353d471c3349ed9c384a015f4a",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1909.06055",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Industrial and scientific streaming applications require support for different types of processing and the management of heterogeneous infrastructure over a dynamic range of scales: from the edge to the cloud and HPC, and intermediate resources. Serverless is an emerging service that combines high-level middleware services, such as distributed execution engines for managing tasks, with low-level infrastructure. It offers the potential of usability and scalability but adds to the complexity of managing heterogeneous and dynamic resources. In response, we extend Pilot-Streaming to support serverless platforms. Pilot-Streaming provides a unified abstraction for resource management for HPC, cloud, and serverless, and allocates resource containers independent of the application workload removing the need to write resource-specific code. Understanding the performance and scaling characteristics of streaming applications and infrastructure presents another challenge. StreamInsight provides insight into the performance of streaming applications and infrastructure, their selection, configuration, and scaling behavior. Underlying StreamInsight is the universal scalability law, which permits the accurate quantification of scalability properties of streaming applications. Using experiments on HPC and AWS Lambda, we demonstrate that StreamInsight provides an accurate model for a variety of application characteristics, e. g., machine learning model sizes and resource configurations.",
    "citationCount": 15,
    "referenceCount": 44
}