{
    "paperId": "8aad7ffb4e424a7969fe23c730ac225cdbbdb987",
    "title": "Uncertainty-Oriented Ensemble Data Visualization and Exploration using Variable Spatial Spreading",
    "year": 2020,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Mingdong Zhang",
        "Li Chen",
        "Quan Li",
        "Xiaoru Yuan",
        "Junhai Yong"
    ],
    "doi": "10.1109/TVCG.2020.3030377",
    "arxivId": "2011.01497",
    "url": "https://www.semanticscholar.org/paper/8aad7ffb4e424a7969fe23c730ac225cdbbdb987",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2011.01497",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As an important method of handling potential uncertainties in numerical simulations, ensemble simulation has been widely applied in many disciplines. Visualization is a promising and powerful ensemble simulation analysis method. However, conventional visualization methods mainly aim at data simplification and highlighting important information based on domain expertise instead of providing a flexible data exploration and intervention mechanism. Trial-and-error procedures have to be repeatedly conducted by such approaches. To resolve this issue, we propose a new perspective of ensemble data analysis using the attribute variable dimension as the primary analysis dimension. Particularly, we propose a variable uncertainty calculation method based on variable spatial spreading. Based on this method, we design an interactive ensemble analysis framework that provides a flexible interactive exploration of the ensemble data. Particularly, the proposed spreading curve view, the region stability heat map view, and the temporal analysis view, together with the commonly used 2D map view, jointly support uncertainty distribution perception, region selection, and temporal analysis, as well as other analysis requirements. We verify our approach by analyzing a real-world ensemble simulation dataset. Feedback collected from domain experts confirms the efficacy of our framework.",
    "citationCount": 14,
    "referenceCount": 52
}