{
    "paperId": "8abccd885f807e953a86cf3533f5fd1112699f97",
    "title": "Predictive Uncertainty for Runtime Assurance of a Real-Time Computer Vision-Based Landing System",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Romeo Valentin",
        "Sydney M. Katz",
        "Artur B. Carneiro",
        "Don Walker",
        "Mykel J. Kochenderfer"
    ],
    "doi": "10.48550/arXiv.2508.09732",
    "arxivId": "2508.09732",
    "url": "https://www.semanticscholar.org/paper/8abccd885f807e953a86cf3533f5fd1112699f97",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advances in data-driven computer vision have enabled robust autonomous navigation capabilities for civil aviation, including automated landing and runway detection. However, ensuring that these systems meet the robustness and safety requirements for aviation applications remains a major challenge. In this work, we present a practical vision-based pipeline for aircraft pose estimation from runway images that represents a step toward the ability to certify these systems for use in safety-critical aviation applications. Our approach features three key innovations: (i) an efficient, flexible neural architecture based on a spatial Soft Argmax operator for probabilistic keypoint regression, supporting diverse vision backbones with real-time inference; (ii) a principled loss function producing calibrated predictive uncertainties, which are evaluated via sharpness and calibration metrics; and (iii) an adaptation of Residual-based Receiver Autonomous Integrity Monitoring (RAIM), enabling runtime detection and rejection of faulty model outputs. We implement and evaluate our pose estimation pipeline on a dataset of runway images. We show that our model outperforms baseline architectures in terms of accuracy while also producing well-calibrated uncertainty estimates with sub-pixel precision that can be used downstream for fault detection.",
    "citationCount": 0,
    "referenceCount": 52
}