{
    "paperId": "8b118e4c39f0687862f15bb1da47deb41efc36a9",
    "title": "Hybrid Deep Learning Approaches for Improved Genomic Prediction in Crop Breeding",
    "year": 2025,
    "venue": "Agriculture",
    "authors": [
        "Ran Li",
        "D. Zhang",
        "Yan-yun Han",
        "Zhongqiang Liu",
        "Qiusi Zhang",
        "Qi Zhang",
        "Xiaofeng Wang",
        "Shouhui Pan",
        "Jiahao Sun",
        "Kaiyi Wang"
    ],
    "doi": "10.3390/agriculture15111171",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8b118e4c39f0687862f15bb1da47deb41efc36a9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Genomic selection plays a crucial role in breeding programs designed to improve quantitative traits, particularly considering the limitations of traditional methods in terms of accuracy and efficiency. Through the integration of genomic data, breeders are able to obtain more accurate predictions of breeding values. In this study, we proposed and evaluated four deep learning architectures—CNN-LSTM, CNN-ResNet, LSTM-ResNet, and CNN-ResNet-LSTM—that are specifically designed for genomic prediction in crops. After conducting a comprehensive evaluation across multiple datasets, including those for wheat, corn, and rice, the LSTM-ResNet model exhibited superior performance by achieving the highest prediction accuracy in 10 out of 18 traits across four datasets. Additionally, the CNN-ResNet-LSTM model demonstrated notable results, showcasing the best predictive performance for four traits. These findings underscore the efficacy of hybrid models in identifying complex patterns, as they integrate skip connections to mitigate the vanishing gradient problem and enable the extraction of hierarchical features while elucidating intricate relationships among genetic markers. Our analysis of SNP sampling indicated that maintaining SNP counts within the range of 1000 to the full set significantly influences prediction efficiency. Furthermore, we conducted a comprehensive comparative analysis of predictive performance among random selection, marker-assisted selection, and genomic selection utilizing wheat datasets. Collectively, these results provide significant insights into crop genetics, enhancing breeding predictions and advancing global food security and sustainability.",
    "citationCount": 1,
    "referenceCount": 53
}