{
    "paperId": "8b2962de12a32ceeb7005d932153d6f682c881ae",
    "title": "Evaluating how interactive visualizations can assist in finding samples where and how computer vision models make mistakes",
    "year": 2023,
    "venue": "IEEE Pacific Visualization Symposium",
    "authors": [
        "Hayeong Song",
        "Gonzalo A. Ramos",
        "P. Bodík"
    ],
    "doi": "10.1109/PacificVis60374.2024.00043",
    "arxivId": "2305.11927",
    "url": "https://www.semanticscholar.org/paper/8b2962de12a32ceeb7005d932153d6f682c881ae",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.11927",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Creating Computer Vision (CV) models remains a complex practice, despite their ubiquity. Access to data, the requirement for ML expertise, and model opacity are just a few points of complexity that limit the ability of end-users to build, inspect, and improve these models. Interactive ML perspectives have helped address some of these issues by considering a teacher in the loop where planning, teaching, and evaluating tasks take place. We present and evaluate two interactive visualizations in the context of Sprite, a system for creating CV classification and detection models for images originating from videos. We study how these visualizations help Sprite’s users identify (evaluate) and select (plan) images where a model is struggling and can lead to improved performance, compared to a baseline condition where users used a query language. We found that users who had used the visualizations found more images across a wider set of potential types of model errors.",
    "citationCount": 0,
    "referenceCount": 36
}