{
    "paperId": "8b293973061026d9d0eed90e71e30928e029171e",
    "title": "Memorization Without Overfitting: Analyzing the Training Dynamics of Large Language Models",
    "year": 2022,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Kushal Tirumala",
        "Aram H. Markosyan",
        "Luke Zettlemoyer",
        "Armen Aghajanyan"
    ],
    "doi": "10.48550/arXiv.2205.10770",
    "arxivId": "2205.10770",
    "url": "https://www.semanticscholar.org/paper/8b293973061026d9d0eed90e71e30928e029171e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2205.10770",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite their wide adoption, the underlying training and memorization dynamics of very large language models is not well understood. We empirically study exact memorization in causal and masked language modeling, across model sizes and throughout the training process. We measure the effects of dataset size, learning rate, and model size on memorization, finding that larger language models memorize training data faster across all settings. Surprisingly, we show that larger models can memorize a larger portion of the data before over-fitting and tend to forget less throughout the training process. We also analyze the memorization dynamics of different parts of speech and find that models memorize nouns and numbers first; we hypothesize and provide empirical evidence that nouns and numbers act as a unique identifier for memorizing individual training examples. Together, these findings present another piece of the broader puzzle of trying to understand what actually improves as models get bigger.",
    "citationCount": 228,
    "referenceCount": 106
}