{
    "paperId": "8b76e900bf433304cca1d2776e1b70b50e73dc8d",
    "title": "Automated Machine Learning to Evaluate the Information Content of Tropospheric Trace Gas Columns for Fine Particle Estimates Over India: A Modeling Testbed",
    "year": 2023,
    "venue": "Journal of Advances in Modeling Earth Systems",
    "authors": [
        "Zhonghua Zheng",
        "A. Fiore",
        "D. Westervelt",
        "G. Milly",
        "J. Goldsmith",
        "A. Karambelas",
        "G. Curci",
        "C. Randles",
        "Antonio R. Paiva",
        "Chi Wang",
        "Qingyun Wu",
        "S. Dey"
    ],
    "doi": "10.1029/2022MS003099",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8b76e900bf433304cca1d2776e1b70b50e73dc8d",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1029/2022MS003099",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "India is largely devoid of high‐quality and reliable on‐the‐ground measurements of fine particulate matter (PM2.5). Ground‐level PM2.5 concentrations are estimated from publicly available satellite Aerosol Optical Depth (AOD) products combined with other information. Prior research has largely overlooked the possibility of gaining additional accuracy and insights into the sources of PM using satellite retrievals of tropospheric trace gas columns. We evaluate the information content of tropospheric trace gas columns for PM2.5 estimates over India within a modeling testbed using an Automated Machine Learning (AutoML) approach, which selects from a menu of different machine learning tools based on the data set. We then quantify the relative information content of tropospheric trace gas columns, AOD, meteorological fields, and emissions for estimating PM2.5 over four Indian sub‐regions on daily and monthly time scales. Our findings suggest that, regardless of the specific machine learning model assumptions, incorporating trace gas modeled columns improves PM2.5 estimates. We use the ranking scores produced from the AutoML algorithm and Spearman’s rank correlation to infer or link the possible relative importance of primary versus secondary sources of PM2.5 as a first step toward estimating particle composition. Our comparison of AutoML‐derived models to selected baseline machine learning models demonstrates that AutoML is at least as good as user‐chosen models. The idealized pseudo‐observations (chemical‐transport model simulations) used in this work lay the groundwork for applying satellite retrievals of tropospheric trace gases to estimate fine particle concentrations in India and serve to illustrate the promise of AutoML applications in atmospheric and environmental research.",
    "citationCount": 12,
    "referenceCount": 57
}