{
    "paperId": "8bb48de3d506d46880653d0586768fa96ae5c52d",
    "title": "AutoConstruct: Automated Neural Surrogate Model Building and Deployment for HPC Applications",
    "year": 2023,
    "venue": "FlexScience@HPDC",
    "authors": [
        "Wenqian Dong",
        "Jie Ren"
    ],
    "doi": "10.1145/3589013.3596677",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8bb48de3d506d46880653d0586768fa96ae5c52d",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3589013.3596677",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Scientific Machine Learning (SciML), aiming at using machine learning methods to solve scientific computing problems, has been used in a wide range of HPC applications to improve the applications' performance. However, domain scientists, despite their rich expertise in their respective fields, often lack adequate knowledge in machine learning and computer systems. This gap makes it difficult for them to determine which computations can be replaced by neural network (NN) surrogates. Moreover, NN surrogates in HPC applications typically have sparse input features, necessitating system-level optimization to prevent memory resource overuse on accelerators. Consequently, constructing and deploying NN surrogates for HPC applications remains a significant challenge, with no existing tools to assist domain scientists in systematically building high-quality ML surrogates. To address these issues, we introduce AutoConstruct, a comprehensive solution for SciML in distributed systems. AutoConstruct consists of two components, the model-maker and deployment-helper, which operate automatically to select the appropriate ML surrogate architecture and deploy the surrogate model training and inference on specific accelerators, respectively. We showcase AutoConstruct's adaptability and performance through a series of HPC numerical benchmarks, real-world scientific applications, and computing platforms.",
    "citationCount": 0,
    "referenceCount": 89
}