{
    "paperId": "8bbdb1b36ee6577d8f11e2305178942d77674994",
    "title": "Comparative Analysis of Traditional and Deep Learning Based Customer Segmentation Models in Online Retail",
    "year": 2025,
    "venue": "2025 International Conference on Computational Robotics, Testing and Engineering Evaluation (ICCRTEE)",
    "authors": [
        "Hari Govind A M",
        "S. Subburaj"
    ],
    "doi": "10.1109/ICCRTEE64519.2025.11052920",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8bbdb1b36ee6577d8f11e2305178942d77674994",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Customer segmentation is the process by which customers are divided into different groups based on shared features, behaviors, or needs. This assists companies in optimizing resource allocation which enhances customer experience and customizing marketing tactics. This study uses a transactional data set of an online retail company to compare multiple customer segmentation models. It can help us determine how traditional customer segmentation models like RFM can fare against deep learning based models like LSTM. The clustering methods used here are K-Means and Hierarchical Clustering. RFM is a technique based on Recency, Frequency and Monetary features and their scores. This along with clustering is used to make customer segmentation models. LSTM generates feature representations from sequential data after which it is used for segmentation using clustering. Using each of the two clustering methods on the output from both LSTM and RFM, four customer segmentation models can be obtained. Clustering results are compared using Silhouette score, Davies–Bouldin index and Calinski-Harabasz index. It is found that the LSTM based clustering techniques outperform RFM based techniques.",
    "citationCount": 0,
    "referenceCount": 16
}