{
    "paperId": "8bc9bc960f21d24d1f5ab490071d2bc08bf17636",
    "title": "CRFTL: Cache Reallocation-Based Page-Level Flash Translation Layer for Smartphones",
    "year": 2023,
    "venue": "IEEE transactions on consumer electronics",
    "authors": [
        "Jianpeng Zhang",
        "Mingwei Lin",
        "Yubiao Pan",
        "Zeshui Xu"
    ],
    "doi": "10.1109/TCE.2023.3264217",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8bc9bc960f21d24d1f5ab490071d2bc08bf17636",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Because of its outstanding performance, NAND flash memory in the form of embedded flash drives like Universal Flash Storage (UFS) has been widely used in the modern smartphones. As the core software in UFS, the flash translation layer (FTL) is essential to the performance improvement of UFS. To consider all workloads, a balanced and fixed mapping cache allocation scheme is used in the existing FTLs. Confronted with frequent changes of I/O request patterns of applications in smartphones, the existing FTLs with the fixed mapping cache allocation scheme could not perform well. To consider the I/O characteristics of smartphones, a novel cache reallocation-based page-level flash translation layer, called CRFTL, is proposed in this paper. Through analyzing the life cycle of I/O requests of applications in smartphones, CRFTL stores the mapping entries of I/O requests with different life cycles in different mapping cache structures. CRFTL can be aware of the inner states of NAND flash memory and I/O request patterns, and adaptively adjusts the cache space allocation of the mapping cache structures by applying the approach combining the heuristics and reinforcement learning algorithms. The experimental results show that the performance of our proposed CRFTL is better than that of existing FTLs.",
    "citationCount": 22,
    "referenceCount": 35
}