{
    "paperId": "8be22347d5476b74e4930b4b14503c890c40854e",
    "title": "CMT: An Efficient Algorithm for Scalable Packet Classification",
    "year": 2021,
    "venue": "Computer/law journal",
    "authors": [
        "Shuhui Chen",
        "Jincheng Zhong",
        "Teng-Yi Huang",
        "Ziling Wei",
        "Shuang Zhao"
    ],
    "doi": "10.1093/COMJNL/BXAB005",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8be22347d5476b74e4930b4b14503c890c40854e",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/comjnl/article-pdf/64/6/941/38665441/bxab005.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Packet classification plays an essential role in diverse network functions such as quality of service, firewall filtering and load balancer. However, implementing an efficient packet classifier is a challenging problem. The problem even gets worse in the era of software-defined network, in which frequent rule updates are performed, and complex flow tables are used. This paper proposes CMT, a new software algorithm named by its novel data structure—common mask tree—to implement an efficient multi-field packet classifier. The core idea of CMT is to combine the strengths of both decision-tree and tuple-space schemes by employing tree-like structures and hash tables simultaneously. The objective of CMT is to achieve both high classification performance and fast rule updates. In the evaluation section, CMT is compared with decision-tree and tuple-space schemes. Compared to the state-of-the-art decision-tree methods, CMT performs rule updates at two orders of magnitude faster. CMT has a stable performance on different rulesets and achieves a 40% improvement in memory access compared to the state-of-the-art tuple-space method.",
    "citationCount": 5,
    "referenceCount": 49
}