{
    "paperId": "8beaa1d63436289cbcbae71d9a9336e0bdf58443",
    "title": "Smart Name Lookup for NDN Forwarding Plane via Neural Networks",
    "year": 2021,
    "venue": "IEEE/ACM Transactions on Networking",
    "authors": [
        "Zhuo Li",
        "Jindian Liu",
        "Liu Yan",
        "Beichuan Zhang",
        "Peng Luo",
        "Kaihua Liu"
    ],
    "doi": "10.1109/TNET.2021.3119769",
    "arxivId": "2105.05004",
    "url": "https://www.semanticscholar.org/paper/8beaa1d63436289cbcbae71d9a9336e0bdf58443",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2105.05004",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Name lookup is a key technology for the forwarding plane of content router in Named Data Networking (NDN). To realize the efficient name lookup, what counts is deploying a high-performance index in content routers. So far, the proposed indexes have shown good performance, most of which are optimized for or evaluated with URLs collected from the current Internet, as the large-scale NDN names are not available yet. Unfortunately, the performance of these indexes is always impacted in terms of lookup speed, memory consumption and false positive probability, as the distributions of URLs retrieved in memory may differ from those of real NDN names independently generated by content-centric applications online. Focusing on this gap, a smart mapping model named Pyramid-NN via neural networks is proposed to build an index called LNI for NDN forwarding plane. Through learning the distributions of the names retrieved in the static memory, LNI that will be trained by real NDN names offline and preset in content routers in the future can not only reduce the memory consumption and the probability of false positive, but also ensure the performance of real NDN name lookup. Experimental results show that LNI-based FIB can reduce the memory consumption to 58.258 MB. Moreover, as it can be deployed on SRAMs, the throughput is about 177 MSPS, which well meets the current network requirement for fast packet processing.",
    "citationCount": 12,
    "referenceCount": 72
}