{
    "paperId": "8bf719cc5c903c4dd49613387552a1ccd1385482",
    "title": "Multi-Agent Join",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Vahid Ghadakchi",
        "Mian Xie",
        "Arash Termehchy",
        "Bakhtiyar Doskenov",
        "Bharghav Srikhakollu",
        "Summit Haque",
        "Huazheng Wang"
    ],
    "doi": "10.48550/arXiv.2312.14291",
    "arxivId": "2312.14291",
    "url": "https://www.semanticscholar.org/paper/8bf719cc5c903c4dd49613387552a1ccd1385482",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "It is crucial to provide real-time performance in many applications, such as interactive and exploratory data analysis. In these settings, users often need to view subsets of query results quickly. It is challenging to deliver such results over large datasets for relational operators over multiple relations, such as join. Join algorithms usually spend a long time on scanning and attempting to join parts of relations that may not generate any result. Current solutions usually require lengthy and repeated preprocessing, which is costly and may not be possible to do in many settings. Also, they often support restricted types of joins. In this paper, we outline a novel approach for achieving efficient join processing in which a scan operator of the join learns during query execution, the portions of its relations that might satisfy the join predicate. We further improve this method using an algorithm in which both scan operators collaboratively learn an efficient join execution strategy. We also show that this approach generalizes traditional and non-learning methods for joining. Our extensive empirical studies using standard benchmarks indicate that this approach outperforms similar methods considerably.",
    "citationCount": 0,
    "referenceCount": 29
}