{
    "paperId": "8c14e64d87325d192c94bd918361df0478bc841f",
    "title": "Exploring Multimedia Movement Through Spatio-Temporal Indexing and Double-Cache Schemes",
    "year": 2024,
    "venue": "International Journal of Advanced Computer Science and Applications",
    "authors": [
        "Zhen Qin",
        "Lin Zhang"
    ],
    "doi": "10.14569/ijacsa.2024.0150954",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8c14e64d87325d192c94bd918361df0478bc841f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.14569/ijacsa.2024.0150954",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Art",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "—Conventional IP/TCP designs encounter several safety and scalability concerns with the growing demand for application services. A novel Internet design, like a Content Center Network (CCN), was introduced to address these issues comprehensively. Every hub within a CCN is responsible for data storage. The collaboration guarantees users quick data retrieval. By collaborating with dual caches, network peers can access data from their caches and leverage other peers' caches, resulting in improved cache utilization and overall network speed. The present study examines multimodal digital artworks' form, style, and action relationships and views them as holistic creative units. The study examines the complex structure of digital content following current information. We present a distributed index incorporating spatio-temporal information to address the challenges of storing and retrieving large amounts of spatio-temporal data. This distributed index combines internal R with external B+ trees to provide high concurrency and low latency indexing services for external applications. With double buffer technology and distributed index architecture, we can optimize the cache utility of content center networks and enhance the retrieval speed of multimedia data. Adopting the distributed index, designed to accommodate spatio-temporal data in the multimedia digital art design, can enhance large-scale storage and retrieval for Internet-future architectures.",
    "citationCount": 1,
    "referenceCount": 19
}