{
    "paperId": "8c288ecbad71d39f9a16c43318961f09054913ca",
    "title": "Efficient Coverage Path Planning for Mobile Disinfecting Robots Using Graph-Based Representation of Environment",
    "year": 2021,
    "venue": "Frontiers in Robotics and AI",
    "authors": [
        "B. Nasirian",
        "M. Mehrandezh",
        "F. Janabi-Sharifi"
    ],
    "doi": "10.3389/frobt.2021.624333",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8c288ecbad71d39f9a16c43318961f09054913ca",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/frobt.2021.624333/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The effective disinfection of hospitals is paramount in lowering the COVID-19 transmission risk to both patients and medical personnel. Autonomous mobile robots can perform the surface disinfection task in a timely and cost-effective manner, while preventing the direct contact of disinfecting agents with humans. This paper proposes an end-to-end coverage path planning technique that generates a continuous and uninterrupted collision-free path for a mobile robot to cover an area of interest. The aim of this work is to decrease the disinfection task completion time and cost by finding an optimal coverage path using a new graph-based representation of the environment. The results are compared with other existing state-of-the-art coverage path planning approaches. It is shown that the proposed approach generates a path with shorter total travelled distance (fewer number of overlaps) and smaller number of turns.",
    "citationCount": 39,
    "referenceCount": 21
}