{
    "paperId": "8c3ef9a58c095728c13a5c13fb0c5c9fbcf42a6c",
    "title": "Optimization Techniques in Data Management: A Survey",
    "year": 2021,
    "venue": "International Conferences on Computing and Data Engineering",
    "authors": [
        "Edjola K. Naka",
        "V. Guliashki"
    ],
    "doi": "10.1145/3456172.3456214",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8c3ef9a58c095728c13a5c13fb0c5c9fbcf42a6c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data Management can be defined as the process of extracting, storing, organizing, and maintaining the data created and collected in organizations. Today's organizations invest in data management solutions that provide an efficient way to manage data in a unified structure. The enormously growth of data in the last decades has created a necessity for the fast extracting, accessing, and processing of the data. Optimization has been a key component in improving the system's performance, searching and accessing data in different data management solutions. Optimization is a mathematical discipline that formulates mathematical models and finds the best solution among a set of feasible solutions. This paper aims to give a general overview of applications of optimization techniques and algorithms in different areas of data management in the last decades. Data management includes a large group of functionalities, but we will focus on studying and reviewing the recent development of optimization algorithms used in databases, data warehouses, big data and machine learning. Furthermore, this paper will identify applications of optimization in data management, reviews the current solutions proposed and emphasize future topics where there is a lack of studies in data management.",
    "citationCount": 0,
    "referenceCount": 66
}