{
    "paperId": "8c6945b6f8283fc2d0642ece41f4159246c43b2f",
    "title": "Learning to Rank Graph-based Application Objects on Heterogeneous Memories",
    "year": 2021,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "Diego Moura",
        "V. Petrucci",
        "D. Mossé"
    ],
    "doi": "10.1145/3488423.3519324",
    "arxivId": "2211.02195",
    "url": "https://www.semanticscholar.org/paper/8c6945b6f8283fc2d0642ece41f4159246c43b2f",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.02195",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Persistent Memory (PMEM), also known as Non-Volatile Memory (NVM), can deliver higher density and lower cost per bit when compared with DRAM. Its main drawback is that it is typically slower than DRAM. On the other hand, DRAM has scalability problems due to its cost and energy consumption. Soon, PMEM will likely coexist with DRAM in computer systems but the biggest challenge is to know which data to allocate on each type of memory. This paper describes a methodology for identifying and characterizing application objects that have the most influence on the application’s performance using Intel Optane DC Persistent Memory. In the first part of our work, we built a tool that automates the profiling and analysis of application objects. In the second part, we build a machine learning model to predict the most critical object within large-scale graph-based applications. Our results show that using isolated features does not bring the same benefit compared to using a carefully chosen set of features. By performing data placement using our predictive model, we can reduce the execution time degradation by 12% (average) and 30% (max) when compared to the baseline’s approach based on LLC misses indicator.",
    "citationCount": 3,
    "referenceCount": 38
}