{
    "paperId": "8c83ecaabb0ef033332b21697d5fbb981466ebdf",
    "title": "Improved Stochastic Texture Filtering Through Sample Reuse",
    "year": 2025,
    "venue": "Proceedings of the ACM on Computer Graphics and Interactive Techniques",
    "authors": [
        "Bartlomiej Wronski",
        "Matt Pharr",
        "Tomas Akenine-Möller"
    ],
    "doi": "10.1145/3728292",
    "arxivId": "2504.05562",
    "url": "https://www.semanticscholar.org/paper/8c83ecaabb0ef033332b21697d5fbb981466ebdf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Stochastic texture filtering (STF) has re-emerged as a technique that can bring down the cost of texture filtering of advanced texture compression methods, e.g., neural texture compression. However, during texture magnification, the swapped order of filtering and shading with STF can result in aliasing. The inability to smoothly interpolate material properties stored in textures, such as surface normals, leads to potentially undesirable appearance changes. We present a novel method to improve the quality of stochastically-filtered magnified textures and reduce the image difference compared to traditional texture filtering. When textures are magnified, nearby pixels filter similar sets of texels and we introduce techniques for sharing texel values among pixels with only a small increase in cost (0.04–0.14 ms per frame). We propose an improvement to weighted importance sampling that guarantees that our method never increases error beyond single-sample stochastic texture filtering. Under high magnification, our method has >10 dB higher PSNR than single-sample STF. Our results show greatly improved image quality both with and without spatiotemporal denoising.",
    "citationCount": 1,
    "referenceCount": 33
}