{
    "paperId": "8c8f54fd517c89ad85db47b827c7edfd696c992c",
    "title": "A Lightning Nowcasting Model Using GNSS PWV and Multisource Data",
    "year": 2024,
    "venue": "IEEE Transactions on Geoscience and Remote Sensing",
    "authors": [
        "Wenjie Yin",
        "Chen Zhou",
        "Fengyao Zhou",
        "Yuan Tian",
        "Xu Yang",
        "Xiang Wang",
        "Rong Tian",
        "Yin Xiao",
        "Wei Zhang",
        "J. Kong",
        "Yibin Yao"
    ],
    "doi": "10.1109/TGRS.2024.3487774",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8c8f54fd517c89ad85db47b827c7edfd696c992c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Precipitable water vapor (PWV) retrieved from Global Navigation Satellite System (GNSS) has been successfully applied in rainfall forecast. This article shifts to a new focus, aiming at nowcasting lightning, for its relatively scant GNSS-PWV investigation. Unlike previous studies that mainly explored statistical correlations between PWV and lightning, this approach integrates GNSS-PWV and other meteorological parameters with advanced automated machine-learning algorithms to accurately predict lightning occurrences with a lead-time up to 30 min. In this article, the relationship between lightning occurrences and PWV variations is first examined through comprehensive statistical analysis. Next, a machine-learning-based lightning nowcasting model is established in this study, with the input of GNSS-PWV and common meteorological parameters. The training and test datasets are sampled every 10 min from seven collocated GNSS stations and automatic weather stations (AWSs) along with the lightning location information during the period from 2018 to 2022 in Hong Kong. A comprehensive evaluation is conducted on the performance of the lightning nowcasting model. Results indicate that the proposed model possesses convincingly more excellent performances over four evaluation metrics: probability of detection (POD, 89%), false alarm ratio (FAR, 30%), threat score (TS, 0.64), and Heidke skill score (HSS, 0.77). It is also revealed that this model achieves impressive innovativeness, performance, and competitive advantages, compared with other existing methods and previous lightning forecast models.",
    "citationCount": 2,
    "referenceCount": 61
}