{
    "paperId": "8cbd7e65653add9787183e59589bb54cc3b25a4a",
    "title": "An Adaptive Hotspot-Aware Index for Oscillating Write-Heavy and Read-Heavy Workloads",
    "year": 2024,
    "venue": "",
    "authors": [
        "Lu Xing",
        "Ruihong Wang",
        "Walid G. Aref"
    ],
    "doi": null,
    "arxivId": "2406.09372",
    "url": "https://www.semanticscholar.org/paper/8cbd7e65653add9787183e59589bb54cc3b25a4a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "HTAP systems are designed to handle transactional and analytical workloads. Besides a mixed workload at any given time, the workload can also change over time. A popular type of continuously changing workload is one that oscillates between being write-heavy at times and being read-heavy at other times. Oscillating workloads can be observed in many applications. Indexes, e.g., the B+-tree and the LSM-tree, cannot perform equally well all the time. Conventional adaptive indexing does not solve this issue as it focuses on adapting in one direction. This paper studies how to support oscillating workloads with adaptive indexes that adapt the underlying index structures in both directions. With the observation that real-world datasets are skewed, the focus is to optimize the index within the hotspot regions. The Adaptive Hotspot-Aware Tree (or AHA-tree, for short) is introduced, where its adaptation is bi-directional. Experimental evaluation show that AHA-tree can behave competitively as compared to an LSM-tree for write-heavy transactional workloads. Upon switching to a read-heavy analytical workload, AHA-tree can gradually adapt and behave competitively, and can match the B+-tree in read performance.",
    "citationCount": 0,
    "referenceCount": 51
}