{
    "paperId": "8d0b68ed3fff10b254ba113ba0e8c275dc6f59c0",
    "title": "Out-of-Distribution-Aware Electric Vehicle Charging",
    "year": 2023,
    "venue": "IEEE Transactions on Transportation Electrification",
    "authors": [
        "Tongxin Li",
        "Chenxi Sun"
    ],
    "doi": "10.1109/TTE.2024.3434750",
    "arxivId": "2311.05941",
    "url": "https://www.semanticscholar.org/paper/8d0b68ed3fff10b254ba113ba0e8c275dc6f59c0",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2311.05941",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We tackle the challenge of learning to charge electric vehicles (EVs) with out-of-distribution (OOD) data. Traditional scheduling algorithms typically fail to balance near-optimal average performance with worst case guarantees, particularly with OOD data. Model predictive control (MPC) is often too conservative and data-independent, whereas reinforcement learning (RL) tends to be overly aggressive and fully trusts the data, hindering their ability to consistently achieve the best-of-both-worlds. To bridge this gap, we introduce a novel OOD-aware scheduling algorithm, denoted OOD-Charging. This algorithm uses a dynamic “awareness radius,” which updates in real-time based on the temporal difference (TD)-error that reflects the severity of OOD. The OOD-Charging algorithm allows for a more effective balance between consistency and robustness in EV charging schedules, thereby significantly enhancing adaptability and efficiency in real-world charging environments. Our results demonstrate that this approach improves the scheduling reward reliably under real OOD scenarios with remarkable shifts of EV charging behaviors caused by COVID-19 in the Caltech adaptive charging network (ACN)-Data.",
    "citationCount": 2,
    "referenceCount": 51
}