{
    "paperId": "8d39f9ff54e4741bd7b849767e0a0e1e8be7955e",
    "title": "Computational Task Scheduling Method Based on Energy Prediction",
    "year": 2025,
    "venue": "IEEE/IFIP Network Operations and Management Symposium",
    "authors": [
        "Zili Yao",
        "Ying Wang",
        "Manjun Zhang",
        "Qianqian Zhang",
        "Xuesong Qiu"
    ],
    "doi": "10.1109/NOMS57970.2025.11073586",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8d39f9ff54e4741bd7b849767e0a0e1e8be7955e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing demand for computational resources from AI, blockchain, and other technologies requires efficient task scheduling within the Computing Power Network (CPN). However, data centers in CPN often face energy inefficiency and high carbon emissions due to the uneven availability of clean energy. While some research has focused on machine learning-based energy prediction, existing methods often overlook the need for integrating these predictions into large-scale, real-world computational task scheduling frameworks. Furthermore, traditional computational task scheduling methods also fall short in addressing the inherent volatility of renewable energy supplies, limiting their effectiveness in scenarios that require real-time adaptation. This paper proposes a method that integrates clean energy prediction with computational task scheduling, employing a neural network for energy forecasting and an enhanced heuristic algorithm for task scheduling. Simulation results demonstrate that the proposed approach significantly outperforms the baseline, achieving over 95 % clean energy utilization with minimal fluctuations and reduced carbon emissions. These results underscore the potential of predictive task scheduling to improve energy efficiency in data centers, aligning with global sustainability goals.",
    "citationCount": 0,
    "referenceCount": 25
}