{
    "paperId": "8d486ff692fe026770549b42001502a769182ad7",
    "title": "A Survey on Side Information-Driven Session-Based Recommendation: From a Data-Centric Perspective",
    "year": 2025,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Xiaokun Zhang",
        "Bo Xu",
        "Chenliang Li",
        "Bowei He",
        "Hongfei Lin",
        "Chen Ma",
        "Fenglong Ma"
    ],
    "doi": "10.1109/TKDE.2025.3569549",
    "arxivId": "2505.12279",
    "url": "https://www.semanticscholar.org/paper/8d486ff692fe026770549b42001502a769182ad7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Session-based recommendation is gaining increasing attention due to its practical value in predicting the intents of anonymous users based on limited behaviors. Emerging efforts incorporate various side information to alleviate inherent data scarcity issues in this task, leading to impressive performance improvements. The core of side information-driven session-based recommendation is the discovery and utilization of diverse data. In this survey, we provide a comprehensive review of this task from a data-centric perspective. Specifically, this survey commences with a clear formulation of the task. This is followed by a detailed exploration of various benchmarks rich in side information that are pivotal for advancing research in this field. Afterwards, we delve into how different types of side information enhance the task, underscoring data characteristics and utility. Moreover, we discuss the usage of various side information, including data encoding, data injection, and involved techniques. A systematic review of research progress is then presented, with the taxonomy by the types of side information. Finally, we summarize the current limitations and present the future prospects of this vibrant topic.",
    "citationCount": 3,
    "referenceCount": 182
}