{
    "paperId": "8d657a8b52bf8c8900e6754a2369403baeda4b77",
    "title": "RHNAS: Realizable Hardware and Neural Architecture Search",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Yash Akhauri",
        "Adithya Niranjan",
        "Juan Pablo Muñoz",
        "Suvadeep Banerjee",
        "A. Davare",
        "P. Cocchini",
        "A. Sorokin",
        "R. Iyer",
        "Nilesh Jain"
    ],
    "doi": null,
    "arxivId": "2106.09180",
    "url": "https://www.semanticscholar.org/paper/8d657a8b52bf8c8900e6754a2369403baeda4b77",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapidly evolving field of Artificial Intelligence necessitates automated approaches to co-design neural network architecture and neural accelerators to maximize system efficiency and address productivity challenges. To enable joint optimization of this vast space, there has been growing interest in differentiable NN-HW co-design. Fully differentiable co-design has reduced the resource requirements for discovering optimized NN-HW configurations, but fail to adapt to general hardware accelerator search spaces. This is due to the existence of non-synthesizable (invalid) designs in the search space of many hardware accelerators. To enable efficient and realizable co-design of configurable hardware accelerators with arbitrary neural network search spaces, we introduce RHNAS. RHNAS is a method that combines reinforcement learning for hardware optimization with differentiable neural architecture search. RHNAS discovers realizable NN-HW designs with 1.84x lower latency and 1.86x lower energy-delay product (EDP) on ImageNet and 2.81x lower latency and 3.30x lower EDP on CIFAR-10 over the default hardware accelerator design.",
    "citationCount": 3,
    "referenceCount": 45
}