{
    "paperId": "8d6f0628c1de1b6fe2b531c74bad5fe585d455f6",
    "title": "The Integration of Artificial Intelligence Into Database Systems(AI-DB Integration Review)",
    "year": 2023,
    "venue": "International Journal on Cybernetics &amp; Informatics",
    "authors": [
        "Unuriode O. Austine",
        "Durojaiye M. Olalekan",
        "Yusuf Y. Babatunde",
        "Okunade O. Lateef"
    ],
    "doi": "10.5121/ijci.2023.120612",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8d6f0628c1de1b6fe2b531c74bad5fe585d455f6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5121/ijci.2023.120612",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent times, it can be deduced that a distributed workforce is the future of work, and the future is now. Therefore, it is essential to know that AI-DB integration is not only for the effective application of Artificial intelligence technology, and the development of database technology, but also for the next generation of computing, which will support future Intelligent Information Systems, and allow work to be more effective and productive. Hence, AI-DB Integration will contribute generally to the infrastructure of science and technology, businesses, and humanitarian applications of computers. With all the potential contributions in play, AI-DB Integration is considerably more important than might be assumed from its contribution to the enhancement of AI and DB technologies alone. In this review, different concepts were discussed by emphasizing some key areas like the design of Intelligent Database Interfaces (IDIs), Learnable databases, and Smart Query. The three fundamental areas geared us to investigate how AI enhances database efficiency by optimizing query performance, automating routine management tasks, and fortifying data security. Also, the paper presents short-term and long-term application areas where AI and databases have converged, providing a comprehensive overview of progress, challenges, and opportunities. The outcome of this review expresses some authors' or experts’ opinions on the need for and importance of AI-DB integration and on the future generation of computing.",
    "citationCount": 0,
    "referenceCount": 34
}