{
    "paperId": "8d9a72e2b07ba9173e0c0dd897f8ede810c452b4",
    "title": "PSBF: p-adic Integer Scalable Bloom Filter",
    "year": 2023,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Wenlong Yi",
        "Chuang Wang",
        "Qiliang Xie",
        "Yingding Zhao",
        "Jing Jia"
    ],
    "doi": "10.3390/s23187775",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8d9a72e2b07ba9173e0c0dd897f8ede810c452b4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/18/7775/pdf?version=1694481288",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Given the challenges associated with the dynamic expansion of the conventional bloom filter’s capacity, the prevalence of false positives, and the subpar access performance, this study employs the algebraic and topological characteristics of p-adic integers to introduce an innovative approach for dynamically expanding the p-adic Integer Scalable Bloom Filter (PSBF). The proposed method involves converting the target element into an integer using a string hash function, followed by the conversion of said integer into a p-adic integer through algebraic properties. This process automatically establishes the topological tree access structure of the PSBF. The experiment involved a comparison of access performance among the standard bloom filter, dynamic bloom filter, and scalable bloom filter. The findings indicate that the PSBF offers advantages such as avoidance of a linear storage structure, enhanced efficiency in element insertion and query, improved storage space utilization, and reduced likelihood of false positives. Consequently, the PSBF presents a novel approach to the dynamic extensibility of bloom filters.",
    "citationCount": 1,
    "referenceCount": 39
}