{
    "paperId": "8da92dcb6a307162996dc05fe89e10e6d7adf18c",
    "title": "An Advanced MPPT Scheme for Standalone Solar powered PV System using Neuro-Fuzzy Estimator based on measured data",
    "year": 2021,
    "venue": "Journal of Engineering Research",
    "authors": [
        "Ferdaws Ben Naceur",
        "A. Saidi",
        "J. Bhutto",
        "M. Mahjoub"
    ],
    "doi": "10.36909/jer.12535",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8da92dcb6a307162996dc05fe89e10e6d7adf18c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.36909/jer.12535",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper deals with the problem of the optimization of the power, delivered by the photovoltaic panel (PVP). To achieve this aim, a neuro-fuzzy estimator (NFE), followed by a conversion coefficient and a calculation stage of the optimal duty cycle, has been developed. The NFE is used to calculate the open circuit voltage corresponding to each solar radiation, based only on the standard open circuit voltage. A coefficient, determining for each climatic condition the voltage of the maximum power directly from the open circuit voltage, is estimated by a measured test. Finally, the optimal duty cycles, next, determined by the input/output equation of boost converter. The system performance, under different scenarios, has been checked carrying out MATLAB simulations, using an existing photovoltaic model and real weather data, and comparing the simulation results with the measured one. The results demonstrate the effectiveness of the present approach. The efficiency of the proposal maximum power point tracking (MPPT) is proved and it showed that this controller can generate almost 99% of the real PVP maximum power.",
    "citationCount": 6,
    "referenceCount": 27
}