{
    "paperId": "8dc992c09a5c977333f1226759d19e43e121bd4a",
    "title": "ARCH-COMP23 Category Report: Artificial Intelligence and Neural Network Control Systems (AINNCS) for Continuous and Hybrid Systems Plants",
    "year": 2023,
    "venue": "The Archivist",
    "authors": [
        "Diego Manzanas Lopez",
        "Matthias Althoff",
        "M. Forets",
        "Taylor T. Johnson",
        "Tobias Ladner",
        "Christian Schilling"
    ],
    "doi": "10.29007/x38n",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8dc992c09a5c977333f1226759d19e43e121bd4a",
    "isOpenAccess": true,
    "openAccessPdf": "https://easychair.org/publications/open/Vfq4b",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with artificial intelligence (AI) components. Specifically, machine learning (ML) components in cyber-physical systems (CPS), such as feedforward neural networks used as feedback controllers in closed-loop systems, are considered, which is a class of systems classically known as intelligent control systems, or in more modern and specific terms, neural network control systems (NNCS). We broadly refer to this category as AI and NNCS (AINNCS). The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2023. In the fifth edition of this AINNCS category at ARCH-COMP, three tools have been applied to solve ten different benchmark problems, which are CORA, JuliaReach and NNV. In reusing the benchmarks from the last iteration, we demonstrate the continuous progress in developing these tools: Two out of three tools can verify more instances than in the 2022 iteration. A novelty of this year’s iteration is the shared computation hardware that allows for a fairer comparison among the participants.",
    "citationCount": 24,
    "referenceCount": 63
}