{
    "paperId": "8de93ac46a8e8a66c3b5c45c32425aeb0a93d00f",
    "title": "TuneChain: An Online Configuration Auto-Tuning Approach for Permissioned Blockchain Systems",
    "year": 2024,
    "venue": "2024 IEEE International Conference on Web Services (ICWS)",
    "authors": [
        "Junxiong Lin",
        "Ruijun Deng",
        "Zhihui Lu",
        "Yiguang Zhang",
        "Qiang Duan"
    ],
    "doi": "10.1109/ICWS62655.2024.00072",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8de93ac46a8e8a66c3b5c45c32425aeb0a93d00f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing prevalence of blockchain technology has drawn significant attention to the need for effective Quality of Service (QoS) management in blockchain service provision. In this context, the online tuning of system configurations is pivotal for automatic blockchain services to meet QoS requirements. Past studies on configuration tuning have primarily focused on system adaptability to hardware and network environments, overlooking the dynamic nature of the highly diverse workloads, thus resulting in suboptimal system performance. This paper presents TuneChain, an online configuration auto-tuning approach for permissioned blockchain systems, which addresses the limitations of current methods, particularly in handling dynamic workloads while minimizing tuning costs. TuneChain leverages a Conflict Emergency Mechanism (CF-EM) to mitigate the impact of transaction conflicts on effective throughput and employs the Proximal Policy Optimization (PPO) algorithm coupled with a multi-instance mechanism to offer adaptive configuration recommendations tailored to diverse workloads. Additionally, TuneChain incorporates a Tuning Causal Model (TCModel) based on expert knowledge to guide decision-making in configuration tuning, thereby reducing unnecessary exploration and improving efficiency. Extensive evaluations demonstrate that TuneChain outperforms state-of-the-art approaches to configuration tuning in adapting to dynamic workloads, showcasing its efficacy in enhancing blockchain service performance.",
    "citationCount": 0,
    "referenceCount": 42
}