{
    "paperId": "8dea933d42a1ae6c13362b4f7a64dd3b34dd67e6",
    "title": "Expanding AI’s Role in Healthcare Applications: A Systematic Review of Emotional and Cognitive Analysis Techniques",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Prashant Kumar Nag",
        "Amit Bhagat",
        "R. Vishnu Priya"
    ],
    "doi": "10.1109/ACCESS.2025.3562131",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8dea933d42a1ae6c13362b4f7a64dd3b34dd67e6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2025.3562131",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This systematic literature review (SLR) analyzes the various applications of artificial intelligence (AI) in healthcare, with a particular emphasis on the integration of emotive and cognitive analytical frameworks. The primary aim of this investigation is to thoroughly evaluate the influence of AI technology on patient care by analyzing emotional processes and enabling patient-centered solutions. In this research, we investigate the cognitive and emotional approaches to sentiment analysis and other modeling and forecasting methods using AI. Primary sources include patients’ reviews, online health exchanges and doctors’ narratives. Key aspects of the present state of affairs are advances in the development of machine learning algorithms for emotion recognition, intracellular fusion of cognitive and affective modes of analysis, and the application of artificial intelligence for the enhancement of clinical support systems. Moreover, these technologies have significantly improved individualized clinical approaches, expedited the early identification of mental health problems, and strengthened the rationale for therapeutic treatments. Despite recent advancements, the discipline still faces numerous persistent obstacles. Pressing issues include the ethical implications of using artificial intelligence, the need to protect patient privacy, and the complexity of detecting biases in algorithms. Nevertheless, the impact of AI on healthcare practices is indisputable, indicating a future marked by a more intelligent, efficient, empathetic, and patient-centered healthcare system. This study examines the consequences of artificial intelligence in healthcare by analyzing its importance in emotional and cognitive computing, tracking ongoing developments, and promoting the use of AI in healthcare while considering individual requirements.",
    "citationCount": 3,
    "referenceCount": 147
}