{
    "paperId": "8e140a722136ff7af18c9fa97067226b2e7c7214",
    "title": "A maturity model for AI-empowered cloud-native databases: from the perspective of resource management",
    "year": 2022,
    "venue": "Journal of Cloud Computing",
    "authors": [
        "Xiaoyue Feng",
        "Chaopeng Guo",
        "Tianzhe Jiao",
        "Jie Song"
    ],
    "doi": "10.1186/s13677-022-00318-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8e140a722136ff7af18c9fa97067226b2e7c7214",
    "isOpenAccess": true,
    "openAccessPdf": "https://journalofcloudcomputing.springeropen.com/counter/pdf/10.1186/s13677-022-00318-1",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud-native database systems have started to gain broad support and popularity due to more and more applications and systems moving to the cloud. Various cloud-native databases have been emerging in recent years, but their developments are still in the primary stage. At this stage, database developers are generally confused about improving the performance of the database by applying AI technologies. The maturity model can help database developers formulate the measures and clarify the improvement path during development. However, the current maturity models are unsuitable for cloud-native databases since their architecture and resource management differ from traditional databases. Hence, we propose a maturity model for AI-empowered cloud-native databases from the perspective of resource management. We employ a systematic literature review and expert interviews to conduct the maturity model. Also, we develop an assessment tool based on the maturity model to help developers assess cloud-native databases. And we provide an assessment case to prove our maturity model. The assessment case results show that the database’s development direction conforms to the maturity model. It proves the effectiveness of the maturity model.",
    "citationCount": 3,
    "referenceCount": 55
}