{
    "paperId": "8e5619be46b1af82c77e069d60b7dda4f08b9217",
    "title": "A systematic review on diabetic retinopathy detection and classification based on deep learning techniques using fundus images",
    "year": 2024,
    "venue": "PeerJ Computer Science",
    "authors": [
        "Bhulakshmi Dasari",
        "D. Rajput"
    ],
    "doi": "10.7717/peerj-cs.1947",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8e5619be46b1af82c77e069d60b7dda4f08b9217",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7717/peerj-cs.1947",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Diabetic retinopathy (DR) is the leading cause of visual impairment globally. It occurs due to long-term diabetes with fluctuating blood glucose levels. It has become a significant concern for people in the working age group as it can lead to vision loss in the future. Manual examination of fundus images is time-consuming and requires much effort and expertise to determine the severity of the retinopathy. To diagnose and evaluate the disease, deep learning-based technologies have been used, which analyze blood vessels, microaneurysms, exudates, macula, optic discs, and hemorrhages also used for initial detection and grading of DR. This study examines the fundamentals of diabetes, its prevalence, complications, and treatment strategies that use artificial intelligence methods such as machine learning (ML), deep learning (DL), and federated learning (FL). The research covers future studies, performance assessments, biomarkers, screening methods, and current datasets. Various neural network designs, including recurrent neural networks (RNNs), generative adversarial networks (GANs), and applications of ML, DL, and FL in the processing of fundus images, such as convolutional neural networks (CNNs) and their variations, are thoroughly examined. The potential research methods, such as developing DL models and incorporating heterogeneous data sources, are also outlined. Finally, the challenges and future directions of this research are discussed.",
    "citationCount": 25,
    "referenceCount": 87
}