{
    "paperId": "8e9b5d66cacc5ce6b0adfb88a3286a353a2f8dee",
    "title": "Power System Decision Making in the Age of Deep Learning: A Comprehensive Review",
    "year": 2025,
    "venue": "Energies",
    "authors": [
        "Yeji Lim",
        "Minjae Son",
        "Kyungnam Park",
        "Minsoo Kim",
        "Keunju Song",
        "Haejoong Lee",
        "Hongseok Kim"
    ],
    "doi": "10.3390/en18184867",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8e9b5d66cacc5ce6b0adfb88a3286a353a2f8dee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern power systems are facing growing complexity and uncertainty due to electrification, large-scale renewable integration, and evolving consumption behaviors. These changes have pushed traditional numerical optimization methods to their practical limits in terms of scalability and real-time applicability. In response, deep learning approaches that offer fast inference and robustness to uncertainty are gaining significant attention. This paper presents, to the best of our knowledge, the first systematic review from a functional perspective of deep learning research supporting power system decision making. Taking a functional perspective, we classify neural networks into three core roles: learning to predict, learning to surrogate, and learning to optimize. In the first role, neural networks forecast exogenous uncertainties serving as the instance input to operational optimization problems. In the second role, they approximate complex physical constraints, enabling the efficient formulation of problems that would otherwise be analytically intractable. In the third role, neural networks act as learning-based optimizers that either replace or augment conventional solvers. The core purpose of this paper is to emphasize that neural networks should not simply be regarded as generic data-driven tools, but rather as models serving distinct functional roles—each with its own objectives and considerations. In this regard, we introduce diverse approaches aligned with these roles, offering conceptual foundations for principled application in practice. Such functional insights will ultimately guide the design of modular and hybrid architectures that integrate these roles, which in turn may provide the basis for developing domain-specific foundation models for power system operations.",
    "citationCount": 1,
    "referenceCount": 216
}