{
    "paperId": "8e9d66856d46b4863462dc65ee6fc0d1acbadeda",
    "title": "A depth-wise separable VGG19-capsule network for enhanced bell pepper and grape leaf disease classification with ensemble activation",
    "year": 2025,
    "venue": "Environmental Research Communications",
    "authors": [
        "Midhun P Mathew",
        "Sudheep Elayidom",
        "J. V. P.",
        "A. K M"
    ],
    "doi": "10.1088/2515-7620/adca02",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8e9d66856d46b4863462dc65ee6fc0d1acbadeda",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Crop disease is a significant problem in the agricultural sector, leading to decreased food production and causing substantial economic losses for farmers in farming regions. Nowadays, computer vision and deep learning models can detect and diagnose leaf diseases in their early stages, which may assist farmers and contribute to ensuring food security. This research introduces a hybrid Depth-Wise Separable Visual Geometric Group 19 (VGG19) and Capsule Network (CapsNet) architecture for automated leaf disease detection and classification in bell pepper and grape plants. The novel contribution lies in the enhanced VGG19 architecture, incorporating depth-wise separable convolution, batch normalization, and a 40% dropout by introducing convolutional layers before the primary capsule layer. The process involves extracting features from VGG19, flattening them into vectors, and utilizing them as input for the capsule layer. This ensures that the capsule network effectively captures spatial information and preserves the hierarchical relationships between features. A noteworthy aspect of this research work is introducing an ensemble activation function, fusing Leaky Rectified Linear Unit (Leaky ReLU) and Gaussian Error Linear Unit (GELU). A hybrid architecture combining VGG19 and CapsNet, using Depth Wise Separable Convolution (DWSC) and batch renormalization with a dropout rate of 0.4, a learning rate of 0.001, and a batch size of 9, successfully captures complex patterns for categorizing diseases in bell pepper and grape plants. The performance of the plant disease classification model is enhanced by using Leaky ReLU activation functions and GELU, which increase the non-linearity and ensemble learning of the VGG19 model. The proposed VGG19-CapsNet framework is developed and deployed in a 128-core Jetson Nano single-board computer with graphics processing support. The research outcomes set a benchmark for accuracy and present a paradigm shift in automated leaf disease classification. The benchmark datasets PlantifyDr, Plant village and custom dataset are used to train and develop the proposed VGG19-CapNet deep learning model. Through extensive comparative analyses on various datasets and field tests, the proposed architecture has demonstrated superior performance in terms of accuracy (99.81%, 99.84%), precision (99.84%, 99.84%), recall (99.79%, 99.84%), sensitivity (99.94%, 99.84%), F1-score (99.81%, 99.84%), and AUC (1.0, 1.0) for bell pepper, and grape leaves across different datasets. It demonstrates the potential to transform agriculture with innovative methodologies tailored for bell pepper and grape diseases.",
    "citationCount": 0,
    "referenceCount": 61
}