{
    "paperId": "8eb7fea65ce9d4c8927c2e2c45a47e58c9b965ba",
    "title": "Towards Elastic Memory Allocation of Serverless Functions in Disaggregated Memory Systems",
    "year": 2025,
    "venue": "HCDS",
    "authors": [
        "Achilleas Tzenetopoulos",
        "Dimosthenis Masouros",
        "Dimitrios Soudris",
        "Sotirios Xydis"
    ],
    "doi": "10.1145/3723851.3723855",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8eb7fea65ce9d4c8927c2e2c45a47e58c9b965ba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Serverless computing is an emerging paradigm adopted by several cloud service providers. Resource underutilization is a major challenge in data centers today that even the fine-grained functions and scaling-out techniques that overcome the physical server bounds cannot resolve. Memory disaggregation has emerged as a solution leveraging remote memory pools to reduce resource fragmentation. However, existing work in serverless computing primarily exploits remote memory only as a low-cost idle state for functions, leaving its full potential untapped. In this paper, we examine the potential of leveraging disaggregated memory for elastic memory allocations of serverless functions. By exploiting the latest Linux kernel’s weighted interleaving feature, we first discuss the challenges and opportunities of memory disaggregation, showcasing how remote memory elasticity impacts the latency of different functions and payload sizes. By utilizing Huawei’s invocation trace, we show that elastic memory allocation configurations, tailored to functions’ behavior, can lead to up to 25% total memory footprint reductions with negligible performance degradation.",
    "citationCount": 0,
    "referenceCount": 36
}