{
    "paperId": "8ec6d697f9a3e23543dd6279d6b20ac497db252b",
    "title": "DeTeCtive: Detecting AI-generated Text via Multi-Level Contrastive Learning",
    "year": 2024,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Xun Guo",
        "Shan Zhang",
        "Yongxin He",
        "Ting Zhang",
        "Wanquan Feng",
        "Haibin Huang",
        "Chongyang Ma"
    ],
    "doi": "10.48550/arXiv.2410.20964",
    "arxivId": "2410.20964",
    "url": "https://www.semanticscholar.org/paper/8ec6d697f9a3e23543dd6279d6b20ac497db252b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Current techniques for detecting AI-generated text are largely confined to manual feature crafting and supervised binary classification paradigms. These methodologies typically lead to performance bottlenecks and unsatisfactory generalizability. Consequently, these methods are often inapplicable for out-of-distribution (OOD) data and newly emerged large language models (LLMs). In this paper, we revisit the task of AI-generated text detection. We argue that the key to accomplishing this task lies in distinguishing writing styles of different authors, rather than simply classifying the text into human-written or AI-generated text. To this end, we propose DeTeCtive, a multi-task auxiliary, multi-level contrastive learning framework. DeTeCtive is designed to facilitate the learning of distinct writing styles, combined with a dense information retrieval pipeline for AI-generated text detection. Our method is compatible with a range of text encoders. Extensive experiments demonstrate that our method enhances the ability of various text encoders in detecting AI-generated text across multiple benchmarks and achieves state-of-the-art results. Notably, in OOD zero-shot evaluation, our method outperforms existing approaches by a large margin. Moreover, we find our method boasts a Training-Free Incremental Adaptation (TFIA) capability towards OOD data, further enhancing its efficacy in OOD detection scenarios. We will open-source our code and models in hopes that our work will spark new thoughts in the field of AI-generated text detection, ensuring safe application of LLMs and enhancing compliance. Our code is available at https://github.com/heyongxin233/DeTeCtive.",
    "citationCount": 31,
    "referenceCount": 80
}