{
    "paperId": "8f1b3b5b57e763047d5266d40b986a0c6b58abe6",
    "title": "An Open-Source RAG Architecture for LLMs",
    "year": 2024,
    "venue": "IEEE Region 10 Conference",
    "authors": [
        "Lakshmi Boppana",
        "Manav Bhadoria",
        "R. Kodali"
    ],
    "doi": "10.1109/TENCON61640.2024.10903064",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8f1b3b5b57e763047d5266d40b986a0c6b58abe6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate product classification in e-Commerce and supply chain management is essential to smooth operations and enhance the customer experience. While Large Language Models (LLMs) perform exceptionally in natural language processing, they encounter issues like model hallucination and dependence on outdated information. Furthermore, LLMs often rely on outdated data. This paper introduces an open source cloud-based RAG model, using Amazon Web Services (AWS) and vector databases to address these issues. The RAG architecture combines retrieval-based and generation-based methods, allowing them to supplement responses with up-to-date information from external sources, thus reducing the risk of model hallucination. The project employs a Vector DB deployed in EC2 to improve contextual understanding and retrieval capabilities of these large language models. Through comprehensive experimentation and AWS deployment, the RAG system improved contextual comprehension and increased the accuracy of the generated output. Semantic similarity search results significantly improve retrieval performance.",
    "citationCount": 0,
    "referenceCount": 6
}