{
    "paperId": "8f36e943fe827459ad72a73c13e40fd000cb2917",
    "title": "QUICwand: A Machine Learning Optimization-Based Hybrid Defense Approach Against QUIC Flooding Attacks",
    "year": 2024,
    "venue": "International Workshop on the Design of Reliable Communication Networks",
    "authors": [
        "Y. A. Joarder",
        "Carol J. Fung"
    ],
    "doi": "10.1109/DRCN60692.2024.10539170",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8f36e943fe827459ad72a73c13e40fd000cb2917",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "QUIC is an emerging transport layer network protocol which provides enhanced security and performance over traditional transport protocols such as TCP and UDP. QUIC aims to provide improved performance and security compared to TCP + TLS 1.3. It also serves as the foundation for HTTP/3. Nevertheless, QUIC is vulnerable to handshake flooding attacks because of its handshaking mechanism. In this paper, we propose “QUICwand,” a State-of-the-Art Network Security framework to defend against QUIC flooding attacks. QUICwand leverages Bayesian Optimization within a modified Bloom filter to defend against QUIC flooding attacks. Explicitly, QUICwand detects and mitigates QUIC flooding attacks to reduce false positive rates significantly, as demonstrated in empirical evaluations. A key design in QUICwand is the dynamic optimization of the Bloom Filter, which demonstrates significant improvement in detection rates and false positive rates over its predecessor QUICShield. The Machine Learning core of QUICwand automatically fine-tunes the defense mechanisms to ensure timely and effective detection and mitigation. Our experimental results demonstrate that QUICwand substantially advances network security and resiliency against QUIC flooding attacks.",
    "citationCount": 2,
    "referenceCount": 33
}