{
    "paperId": "8f588290c4c2cf09d7c26d28b8110f2adb73652b",
    "title": "Collaborative control of intelligent waste discharge and water curtain cooling systems in silk reeling workshop based on fuzzy logic",
    "year": 2024,
    "venue": "Other Conferences",
    "authors": [
        "Liren Huang",
        "Honghan Qin",
        "Hao Wang",
        "Jun Tang"
    ],
    "doi": "10.1117/12.3037988",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8f588290c4c2cf09d7c26d28b8110f2adb73652b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In today’s increasingly advanced industrial automation, intelligent manufacturing has become an important means to improve industrial production efficiency and environmental protection. This article adopted a method that combines an intelligent slag removal system based on fuzzy logic and a water curtain cooling system in the silk production workshop to achieve comprehensive optimization of workshop environmental quality and energy consumption. This article aimed to establish a fuzzy control model for the operation status of a slag removal cooling machine based on multiple key factors such as temperature, humidity, and dust concentration. On this basis, a real-time data acquisition and processing system based on sensor networks was developed for on-site monitoring of equipment such as furnaces and water curtains. When the humidity reached 47.5%, the system began to provide 10% cooling power. As the humidity further increased, the cooling power of the system gradually increased from 10% to 70%. Through a combination of simulation and on-site experiments, it has been proven that the adopted collaborative control scheme significantly improves the air quality and working environment of the workshop while reducing energy consumption and improving production efficiency. Through this study, new ideas and methods can be provided for the development of intelligent manufacturing technology.",
    "citationCount": 0,
    "referenceCount": 15
}