{
    "paperId": "8f9578f8b691680dada9c4a8f2114bd4c8d7691f",
    "title": "FedVS: Towards Federated Vector Similarity Search with Filters",
    "year": 2025,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Zeheng Fan",
        "Yuxiang Zeng",
        "Zhuanglin Zheng",
        "Binhan Yang",
        "Yongxin Tong"
    ],
    "doi": "10.1145/3711896.3736958",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8f9578f8b691680dada9c4a8f2114bd4c8d7691f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Vectors are used to represent unstructured data with their embeddings and associated attributes. Similarity search over large-scale vector datasets has gained significant interest from both industry and academia. It aims to identify the k nearest neighbors to a query object from vectors that satisfy a given attribute filter constraint. Despite its popularity, most solutions focus on single-sourced data and overlook the need for vector retrieval across federated datasets. To fill this gap, we introduce a new problem, federated vector similarity search with filters, which enables privacy-preserving vector retrieval over multi-sourced data held by mutually untrusted providers. While some solutions can be adapted, they struggle with low recall, excessive search latency, or high communication cost. To address these challenges, we propose FedVS, a privacy-preserving framework enhanced with indexing and pruning based on Trusted Execution Environment (TEE). We also provide a comprehensive theoretical analysis, including complexity, security, and approximation guarantees for recall. Moreover, we deploy our solution over real-world vector databases and conduct extensive experiments. The results demonstrate that our solution outperforms state-of-the-art methods in both effectiveness and efficiency.",
    "citationCount": 0,
    "referenceCount": 64
}