{
    "paperId": "8f9b7312d04c4287b201105ec50ce306dacd0c37",
    "title": "$\\mathtt {AutoView}$: An Autonomous Materialized View Management System With Encoder-Reducer",
    "year": 2023,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Yue Han",
        "Guoliang Li",
        "Haitao Yuan",
        "Ji Sun"
    ],
    "doi": "10.1109/TKDE.2022.3163195",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8f9b7312d04c4287b201105ec50ce306dacd0c37",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Materialized views (MVs) can significantly optimize the query processing in databases. However, it is hard to generate MVs for ordinary users because it relies on background knowledge, and existing methods rely on DBAs to generate and maintain MVs. However, DBAs cannot handle large-scale databases, especially cloud databases that have millions of database instances and support millions of users. Thus it calls for an autonomous MV management system. In this paper, we propose an autonomous materialized view management system, <inline-formula><tex-math notation=\"LaTeX\">$\\mathtt {AutoView}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"monospace\">AutoView</mml:mi></mml:math><inline-graphic xlink:href=\"li-ieq2-3163195.gif\"/></alternatives></inline-formula>. It analyzes query workloads, estimates the costs and benefits of materializing queries as views, and selects MVs to maximize the benefit within a space budget. We propose a serialization and encoding method that can encode the features of both queries and views into vectors. Then we design a sequence-to-sequence model, Encoder-Reducer, to estimate MVs’ cost/benefit by taking the encoding vectors as input. Next, we propose a deep reinforcement learning model to select high-quality MVs, which enriches the state representation with Encoder-Reducer’s output. Experimental results show that our method outperforms existing studies in terms of MV selection quality.",
    "citationCount": 2,
    "referenceCount": 48
}