{
    "paperId": "8fa23bd9a58965f0bca3bf40888afcf75be8486f",
    "title": "Streaming Analytics with Adaptive Near-data Processing",
    "year": 2022,
    "venue": "The Web Conference",
    "authors": [
        "Atul Sandur",
        "Chanho Park",
        "Stavros Volos",
        "G. Agha",
        "Myeongjae Jeon"
    ],
    "doi": "10.1145/3487553.3524858",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8fa23bd9a58965f0bca3bf40888afcf75be8486f",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3487553.3524858",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Streaming analytics applications need to process massive volumes of data in a timely manner, in domains ranging from datacenter telemetry and geo-distributed log analytics to Internet-of-Things systems. Such applications suffer from significant network transfer costs to transport the data to a stream processor and compute costs to analyze the data in a timely manner. Pushing the computation closer to the data source by partitioning the analytics query is an effective strategy to reduce resource costs for the stream processor. However, the partitioning strategy depends on the nature of resource bottleneck and resource variability that is encountered at the compute resources near the data source. In this paper, we investigate different issues which affect query partitioning strategies. We first study new partitioning techniques within cloud datacenters which operate under constrained compute conditions varying widely across data sources and different time slots. With insights obtained from the study, we suggest several different ways to improve the performance of stream analytics applications operating in different resource environments, by making effective partitioning decisions for a variety of use cases such as geo-distributed streaming analytics.",
    "citationCount": 1,
    "referenceCount": 16
}