{
    "paperId": "8fc39cca63e8eccb34b8e0041a01b56c472c4470",
    "title": "Auxo: A Scalable and Efficient Graph Stream Summarization Structure",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Zhiguo Jiang",
        "Hanhua Chen",
        "Hai Jin"
    ],
    "doi": "10.14778/3583140.3583154",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8fc39cca63e8eccb34b8e0041a01b56c472c4470",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A graph stream refers to a continuous stream of edges, forming a huge and fast-evolving graph. The vast volume and high update speed of a graph stream bring stringent requirements for the data management structure, including sublinear space cost, computation-efficient operation support, and scalability of the structure. Existing designs summarize a graph stream by leveraging a hash-based compressed matrix and representing an edge using its fingerprint to achieve practical storage for a graph stream with a known upper bound of data volume. However, they fail to support the dynamically extending of graph streams.\n \n In this paper, we propose Auxo, a scalable structure to support space/time efficient summarization of dynamic graph streams. Auxo is built on a proposed novel\n prefix embedded tree\n (PET) which leverages binary logarithmic search and common binary prefixes embedding to provide an efficient and scalable tree structure. PET reduces the item insert/query time from\n O\n (|\n E\n |) to\n O\n (\n log\n |\n E\n |) as well as reducing the total storage cost by a\n log\n |\n E\n | scale, where |\n E\n | is the size of the edge set in a graph stream. To further improve the memory utilization of PET during scaling, we propose a proportional PET structure that extends a higher level in a proportionally incremental style. We conduct comprehensive experiments on large-scale real-world datasets to evaluate the performance of this design. Results show that Auxo significantly reduces the insert and query time by one to two orders of magnitude compared to the state of the arts. Meanwhile, Auxo achieves efficiently and economically structure scaling with an average memory utilization of over 80%.\n",
    "citationCount": 14,
    "referenceCount": 40
}