{
    "paperId": "8fcc27635ea462b43b915d3e58ebbf9cd849dd15",
    "title": "Automatic, Illumination-Invariant and Real-Time Green-Screen Keying Using Deeply Guided Linear Models",
    "year": 2021,
    "venue": "Symmetry",
    "authors": [
        "Hanxi Li",
        "Wenyu Zhu",
        "Haiqiang Jin",
        "Yong Ma"
    ],
    "doi": "10.3390/sym13081454",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/8fcc27635ea462b43b915d3e58ebbf9cd849dd15",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2073-8994/13/8/1454/pdf?version=1628569208",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The conventional green screen keying method requires users’ interaction to guide the whole process and usually assumes a well-controlled illumination environment. In the era of “we-media”, millions of short videos are shared online every day, and most of them are produced by amateurs in relatively poor conditions. As a result, a fully automatic, real-time, and illumination-robust keying method would be very helpful and commercially promising in this era. In this paper, we propose a linear model guided by deep learning prediction to solve this problem. The simple, yet effective algorithm inherits the robustness of the deep-learning-based segmentation method, as well as the high matting quality of energy-minimization-based matting algorithms. Furthermore, thanks to the introduction of linear models, the proposed minimization problem is much less complex, and thus, real-time green screen keying is achieved. In the experiment, our algorithm achieved comparable keying performance to the manual keying software and deep-learning-based methods while beating other shallow matting algorithms in terms of accuracy. As for the matting speed and robustness, which are critical for a practical matting system, the proposed method significantly outperformed all the compared methods and showed superiority over all the off-the-self approaches.",
    "citationCount": 3,
    "referenceCount": 40
}