{
    "paperId": "9037777ddc3bf63d9fed0b8243f206a12fa0bbac",
    "title": "StrokeDNN: A Convolutional Neural Network and Gated Recurrent Unit Integrated Brain Stroke Prediction System",
    "year": 2024,
    "venue": "2024 3rd International Conference on Applied Artificial Intelligence and Computing (ICAAIC)",
    "authors": [
        "Tasmiah Tahrim",
        "Jannatul Farzana Tandra",
        "Sumaiya Tabassum",
        "Chamak Saha",
        "Somak Saha",
        "M. Reza"
    ],
    "doi": "10.1109/ICAAIC60222.2024.10574944",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9037777ddc3bf63d9fed0b8243f206a12fa0bbac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Stroke is a serious health hazard that occurs when there’s an obstacle with the blood flow which arises due to blocked blood vessels or bleeding in the brain. This condition can be fatal, causing death or permanent damage to the brain. To save many lives from long-term suffering from disability and to reduce the mortality caused by stroke, early prevention is pivotal. The main purpose of this study is to predict the possibility of brain stroke at an early stage. Therefore, this study proposes a unique deep learning model namely StrokeDNN which is a combination of 1D CNN and GRU. In this research, a dataset obtained from Kaggle is used and to deal with null values, three statistical imputation methods (Mean, Mode, Median) have been utilized. Besides, the SMOTEEN data balancing technique is applied since the dataset has a major class imbalance issue. In the performance evaluation, along with the 5-fold cross-validation method and after comprehensive experiments, it was noted that the Mean imputation method provided the best performance for the proposed StrokeDNN. With an average accuracy of 94.4%, the proposed model outperformed the methods of previous similar studies on the same dataset.",
    "citationCount": 2,
    "referenceCount": 20
}