{
    "paperId": "905cbe787b20fca3917d2afd6a7a5f073a50386e",
    "title": "MP-CodeCheck: Evolving Logical Expression Code Anomaly Learning with Iterative Self-Supervision",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Urs C. Muff",
        "Celine Lee",
        "Paul Gottschlich",
        "Justin Emile Gottschlich"
    ],
    "doi": "10.48550/arXiv.2204.07225",
    "arxivId": "2204.07225",
    "url": "https://www.semanticscholar.org/paper/905cbe787b20fca3917d2afd6a7a5f073a50386e",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2204.07225",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine programming (MP) is concerned with automating software development. According to studies, software engineers spend upwards of 50% of their development time debugging software. To help accelerate debugging, we present MP-CodeCheck (MPCC). MPCC is an MP system that at-tempts to identify anomalous code patterns within logical program expressions. In designing MPCC, we developed two novel programming language representations, the forma-tions of which are critical in its ability to exhaustively and efficiently process the billions of lines of code that are used in its self-supervised training. To quantify MPCC’s performance, we compare it against ControlFlag, a state-of-the-art self-supervised code anomaly detection system; we find that MPCC is more spatially and temporally efficient. We demonstrate MPCC’s anomalous code detection capabilities by exercising it on a variety of open-source GitHub repositories and one proprietary code base. We also provide a brief qualitative study on some of the different classes of code anomalies that MPCC can detect to provide an abbreviated insight into its capabilities. 1",
    "citationCount": 0,
    "referenceCount": 68
}