{
    "paperId": "908830a4950dfb7b5ba303f620597af688c4edb4",
    "title": "Open Geospatial Engine: A Cloud-based Spatiotemporal Computing Platform",
    "year": 2024,
    "venue": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences",
    "authors": [
        "Xianyuan Zhang",
        "Longgang Xiang",
        "P. Yue",
        "J. Gong",
        "Huayi Wu"
    ],
    "doi": "10.5194/isprs-annals-x-4-2024-453-2024",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/908830a4950dfb7b5ba303f620597af688c4edb4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract. The quantity and diversity of Earth spatiotemporal big data have significantly increased in recent years, providing the potential to comprehensively analyse complex spatiotemporal problems from new perspectives. However, integrating, managing, and applying multi-source heterogeneous Earth spatiotemporal big data remains a challenge. To address this issue, this study proposes a cloud-based spatiotemporal computing platform, the Open Geospatial Engine (OGE), for the unified organization and joint analysis of Earth spatiotemporal big data in multiple dimensions and scales. The framework of this platform comprises three modules: data management, computing engine, and service interface. The data management module adopts the GeoCube model to effectively integrate and manage multi-source heterogeneous spatiotemporal data through multi-dimensional aligned tiles. The computing engine module seamlessly maps the GeoCube model to the cloud environment by extending Spark RDD, making the GeoCube model capable of high-performance distributed computing. Following OGC specifications, the service interface module integrates and shares data, operators, and spatiotemporal analysis models through extensible APIs in an interactive development environment. Combined with a series of high-performance optimization techniques, OGE simplifies data queries and the construction of complex analytical applications by integrating these three modules. The applicability of OGE is demonstrated by case studies involving multi-dimensional queries and joint analysis of long-time-series and heterogeneous spatiotemporal data.\n",
    "citationCount": 1,
    "referenceCount": 7
}