{
    "paperId": "90b5f80f50f31f446a1a9371a0f8a2394e7ac4ef",
    "title": "Data Encryption-Enabled Cloud Cost Optimization and Energy Efficiency-Based Border Security Model",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Mohammed F. Alomari",
        "M. Mahmoud",
        "Yunus Bin Yusoff",
        "Niayesh Gharaei",
        "Reema Ahmed Abdalla",
        "S. Gunasekaran"
    ],
    "doi": "10.1109/ACCESS.2023.3317883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/90b5f80f50f31f446a1a9371a0f8a2394e7ac4ef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Effective monitoring of illegal border crossings is a complex problem. Therefore, Border Security Systems (BSS) are deployed at border crossings to detect unauthorised intrusions. Sensor nodes continuously monitor the environment in a BSS and send the generated data to a Control Station (CS). This is then synchronised with the online data storage in the cloud. However, the data that is not needed is also written to the cloud storage, which leads to an increase in the cost of the cloud service. In addition, sensor nodes have limitations in battery performance that lead to irreparable damage in BSSs. Therefore, to overcome the above limitations, a new solution is required to optimize cloud costs and provide energy services for BSSs. To this end, we present a data encryption-enabled cloud cost optimization and energy efficiency-based innovative border security model. In the proposed model, evaluators check the importance of the collected data and send only the data required to CS to reduce the cloud storage cost. Furthermore, the proposed model enhances the energy efficiency of the sensor nodes by utilizing a Power Transmitter Device (PTD) that can charge the consumer devices while moving along a predefined mobility pattern. The proposed model optimizes cloud costs by up to 93%, energy efficiency by up to 50%, and network throughput by up to 11%. Based on the simulation results, the proposed model is plausible and practical compared to similar models.",
    "citationCount": 4,
    "referenceCount": 53
}