{
    "paperId": "90f23394e47587f24367830fc1f17a76164bdc63",
    "title": "The State-Of-Art Applications of Conventional Probability Issues",
    "year": 2023,
    "venue": "Highlights in Science Engineering and Technology",
    "authors": [
        "Zilan Mao",
        "Tianlun Ni",
        "Haoyu Yin"
    ],
    "doi": "10.54097/hset.v68i.11917",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/90f23394e47587f24367830fc1f17a76164bdc63",
    "isOpenAccess": true,
    "openAccessPdf": "https://drpress.org/ojs/index.php/HSET/article/download/11917/11602",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Contemporarily, the applications of conventional statistics to state-of-art problems become increasingly ingenious and complicated. Specifically, poker games, secretary puzzles, and the newsvendor theory will be fully discussed and elaborated in this paper. First, we discuss how to select the initial hand poker cards with the same card power research. The experiment proves that the method of equal card power generation is effective and feasible. In addition, we discuss the secretary puzzle, based on the optimal stopping theory, with the basic condition discussed by using different methods, probability, and calculus. Finally, we elaborate on the application of the newsvendor theory to the hotel overbooking problem. The theory is suitable for helping make decisions in manufacturing and service industries. When resolving the hotel overbooking problem, we successfully decide the number of rooms that the hotel reservations need to overbook in order to maximize the profit through the newsvendor model and the probabilistic approach, whose results turn out to be the same. Overall, these results shed light on guiding further exploration of statistics and probability.",
    "citationCount": 0,
    "referenceCount": 21
}