{
    "paperId": "911b068fe51ec1f7aa9f69cedf8e56e684a450ee",
    "title": "OneRec Technical Report",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Guorui Zhou",
        "Jiaxin Deng",
        "Jinghao Zhang",
        "Kuo Cai",
        "Lejian Ren",
        "Qiang Luo",
        "Qianqian Wang",
        "Qigen Hu",
        "Rui Huang",
        "Shiyao Wang",
        "Weifeng Ding",
        "Wuchao Li",
        "Xinchen Luo",
        "Xing-Yao Wang",
        "Zexuan Cheng",
        "Zixing Zhang",
        "Bin Zhang",
        "Bo-Wen Wang",
        "Chao Ma",
        "Cheng-bin Song",
        "Chenhui Wang",
        "Di Wang",
        "Dongxue Meng",
        "Fan Yang",
        "Fang-Peng Zhang",
        "Feng Jiang",
        "Fuxing Zhang",
        "Gang Wang",
        "Guowang Zhang",
        "Han Li",
        "Hengrui Hu",
        "Hezheng Lin",
        "Hongtao Cheng",
        "Hong Cao",
        "Huanjie Wang",
        "Jiaming Huang",
        "Jiapeng Chen",
        "Jiaqian Liu",
        "Jinghui Jia",
        "Kun Gai",
        "Lantao Hu",
        "Liang Zeng",
        "Liao Yu",
        "Qiang Wang",
        "Qidong Zhou",
        "Shengzhe Wang",
        "Shi He",
        "Shuang Yang",
        "Shu-Jun Yang",
        "Sui Huang",
        "Tao Wu",
        "TIAN-CHEN He",
        "Tingting Gao",
        "Wei Yuan",
        "Xiaoyan Liang",
        "Xiao-Xue Xu",
        "Xugang Liu",
        "Yan Wang",
        "Yi Wang",
        "Yiwu Liu",
        "Yue Song",
        "Yufei Zhang",
        "Yun-Hong Wu",
        "Yunfeng Zhao",
        "Zhanyun Liu"
    ],
    "doi": "10.48550/arXiv.2506.13695",
    "arxivId": "2506.13695",
    "url": "https://www.semanticscholar.org/paper/911b068fe51ec1f7aa9f69cedf8e56e684a450ee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender systems have been widely used in various large-scale user-oriented platforms for many years. However, compared to the rapid developments in the AI community, recommendation systems have not achieved a breakthrough in recent years. For instance, they still rely on a multi-stage cascaded architecture rather than an end-to-end approach, leading to computational fragmentation and optimization inconsistencies, and hindering the effective application of key breakthrough technologies from the AI community in recommendation scenarios. To address these issues, we propose OneRec, which reshapes the recommendation system through an end-to-end generative approach and achieves promising results. Firstly, we have enhanced the computational FLOPs of the current recommendation model by 10 $\\times$ and have identified the scaling laws for recommendations within certain boundaries. Secondly, reinforcement learning techniques, previously difficult to apply for optimizing recommendations, show significant potential in this framework. Lastly, through infrastructure optimizations, we have achieved 23.7% and 28.8% Model FLOPs Utilization (MFU) on flagship GPUs during training and inference, respectively, aligning closely with the LLM community. This architecture significantly reduces communication and storage overhead, resulting in operating expense that is only 10.6% of traditional recommendation pipelines. Deployed in Kuaishou/Kuaishou Lite APP, it handles 25% of total queries per second, enhancing overall App Stay Time by 0.54% and 1.24%, respectively. Additionally, we have observed significant increases in metrics such as 7-day Lifetime, which is a crucial indicator of recommendation experience. We also provide practical lessons and insights derived from developing, optimizing, and maintaining a production-scale recommendation system with significant real-world impact.",
    "citationCount": 8,
    "referenceCount": 36
}