{
    "paperId": "91580b199345721da361a3a4bffdf5da4f5f811b",
    "title": "Deep Learning for Trajectory Data Management and Mining: A Survey and Beyond",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Wei Chen",
        "Yuxuan Liang",
        "Yuanshao Zhu",
        "Yanchuan Chang",
        "Kang Luo",
        "Haomin Wen",
        "Lei Li",
        "Yanwei Yu",
        "Qingsong Wen",
        "Chao Chen",
        "Kai Zheng",
        "Yunjun Gao",
        "Xiaofang Zhou",
        "Yu Zheng"
    ],
    "doi": "10.48550/arXiv.2403.14151",
    "arxivId": "2403.14151",
    "url": "https://www.semanticscholar.org/paper/91580b199345721da361a3a4bffdf5da4f5f811b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Trajectory computing is a pivotal domain encompassing trajectory data management and mining, garnering widespread attention due to its crucial role in various practical applications such as location services, urban traffic, and public safety. Traditional methods, focusing on simplistic spatio-temporal features, face challenges of complex calculations, limited scalability, and inadequate adaptability to real-world complexities. In this paper, we present a comprehensive review of the development and recent advances in deep learning for trajectory computing (DL4Traj). We first define trajectory data and provide a brief overview of widely-used deep learning models. Systematically, we explore deep learning applications in trajectory management (pre-processing, storage, analysis, and visualization) and mining (trajectory-related forecasting, trajectory-related recommendation, trajectory classification, travel time estimation, anomaly detection, and mobility generation). Notably, we encapsulate recent advancements in Large Language Models (LLMs) that hold the potential to augment trajectory computing. Additionally, we summarize application scenarios, public datasets, and toolkits. Finally, we outline current challenges in DL4Traj research and propose future directions. Relevant papers and open-source resources have been collated and are continuously updated at: \\href{https://github.com/yoshall/Awesome-Trajectory-Computing}{DL4Traj Repo}.",
    "citationCount": 37,
    "referenceCount": 336
}