{
    "paperId": "916d8f61904afa942891d2bc014d0c6b6a8a2c85",
    "title": "Relieving Compression-Induced Local Wear on Non-Volatile Memory Block via Sliding Writes",
    "year": 2023,
    "venue": "Micromachines",
    "authors": [
        "Kailun Jin",
        "Yajuan Du",
        "Mingzhe Zhang",
        "Zhenghao Yin",
        "Rachata Ausavarungnirun"
    ],
    "doi": "10.3390/mi14030568",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/916d8f61904afa942891d2bc014d0c6b6a8a2c85",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-666X/14/3/568/pdf?version=1679032813",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to its non-volatility and large capacity, NVM devices gradually take place at various levels of memories. However, their limited endurance is still a big concern for large-scale data centres. Compression algorithms have been used to save NVM space and enhance the efficiency of those lifetime extension methods. However, their own influence on the NVM lifetime is not clear. In order to fully investigate the impact of compression on NVM, this paper first studies bit flips involved in several typical compression algorithms. It is found that more bit flips would happen in the shrunken area of a memory block. This induces the phenomenon of intra-block wear unevenness, which sacrifices NVM lifetime. We propose a new metric called local bit flips to describe this phenomenon. In order to relieve the intra-block wear unevenness caused by compression, this paper proposes a sliding write method named SlidW to distribute the compressed data across the whole memory block. We first divide the memory block into several areas, and then consider five cases about the relationship between new data size and left space. Then, we place the new data according to the case. Comprehensive experimental results show that SlidW can efficiently balance wear and enhance NVM lifetime.",
    "citationCount": 1,
    "referenceCount": 41
}