{
    "paperId": "91a99228f35fb967c3b2fac188623cda3a4c2591",
    "title": "Towards Energy Efficient Memristor-based TCAM for Match-Action Processing",
    "year": 2022,
    "venue": "International Green and Sustainable Computing Conference",
    "authors": [
        "Saad Saleh",
        "A. Goossens",
        "T. Banerjee",
        "B. Koldehofe"
    ],
    "doi": "10.1109/IGSC55832.2022.9969354",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/91a99228f35fb967c3b2fac188623cda3a4c2591",
    "isOpenAccess": true,
    "openAccessPdf": "https://pure.rug.nl/ws/files/288847977/Towards_Energy_Efficient_Memristor_based_TCAM_for_Match_Action_Processing.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Match-action processors play a crucial role of communicating end-users in the Internet by computing network paths and enforcing administrator policies. The computation process uses a specialized memory called Ternary Content Addressable Memory (TCAM) to store processing rules and use header information of network packets to perform a match within a single clock cycle. Currently, TCAM memories consume huge amounts of energy resources due to the use of traditional transistor-based CMOS technology. In this article, we motivate the use of a novel component, the memristor, for the development of a TCAM architecture. Memristors can provide energy efficiency, non-volatility, and better resource density as compared to transistors. We have proposed a novel memristor-based TCAM architecture built upon the voltage divider principle for energy efficient match-action processing. Moreover, we have tested the performance of the memristor-based TCAM architecture using the experimental data of a novel Nb-doped SrTiO3 memristor. Energy analysis of the proposed TCAM architecture for given memristor shows promising power consumption statistics of 16 μ $W$ for a match operation and 1 $\\mu{W}$. for a mismatch operation.",
    "citationCount": 8,
    "referenceCount": 18
}