{
    "paperId": "91fcc641d6a24c06d2c6657f9a8ec6e506d3ef86",
    "title": "FOSS: A Self-Learned Doctor for Query Optimizer",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Kai Zhong",
        "Luming Sun",
        "Tao Ji",
        "Cuiping Li",
        "Hong Chen"
    ],
    "doi": "10.1109/ICDE60146.2024.00330",
    "arxivId": "2312.06357",
    "url": "https://www.semanticscholar.org/paper/91fcc641d6a24c06d2c6657f9a8ec6e506d3ef86",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Various works have utilized deep learning to address the query optimization problem in database system. They either learn to construct plans from scratch in a bottom-up manner or steer the plan generation behavior of traditional optimizer using hints. While these methods have achieved some success, they face challenges in either low training efficiency or limited plan search space. To address these challenges, we introduce FOSS, a novel framework for query optimization based on deep reinforcement learning. FOSS initiates optimization from the original plan generated by a traditional optimizer and incrementally refines suboptimal nodes of the plan through a sequence of actions. Additionally, we devise an asymmetric advantage model to evaluate the advantage between two plans. We integrate it with a traditional optimizer to form a simulated environment. Leveraging this simulated environment, FOSS can bootstrap itself to rapidly generate a large amount of high-quality simulated experiences. FOSS then learns from these experiences to improve its optimization capability. We evaluate the performance of FOSS on Join Order Benchmark, TPC-DS, and Stack Overflow. The experimental results demonstrate that FOSS outperforms the state-of-the-art methods in terms of latency performance. Compared to PostgreSQL, FOSS achieves speedup ranging from 1.15x to 8.33x in total latency across different benchmarks.",
    "citationCount": 1,
    "referenceCount": 43
}