{
    "paperId": "9214a7bf30cf35de930f75d262462ce2db07b08b",
    "title": "A Near Telomere‐To‐Telomere Genome Assembly of Coffea arabica (Mundo Novo) Provides Insights Into Its Secondary Metabolism",
    "year": 2025,
    "venue": "Molecular Ecology Resources",
    "authors": [
        "Yi Liu",
        "Hang Zong",
        "Yao‐Wu Xing",
        "Xi Jiao",
        "Zhuoya Liu",
        "Yusheng Niu",
        "Zhiling Yang",
        "Shimeng Liu",
        "Yongqiang Wang",
        "Haodong Zhao",
        "Xianqing Chen",
        "Zhenzhu Li",
        "Xiao Wang",
        "Jing Cai",
        "Wen Wang",
        "Zhongkai Wang"
    ],
    "doi": "10.1111/1755-0998.70053",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9214a7bf30cf35de930f75d262462ce2db07b08b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Arabica coffee (Coffea arabica) dominates global coffee production, accounting for over 60% of the world's coffee trade. The Mundo Novo cultivar, predominantly grown in Yunnan, China, represents a significant germplasm resource. However, the absence of a high‐quality reference genome has hindered comprehensive genetic research and in‐depth investigation of secondary metabolic pathways in Arabica. In this study, we present the first near telomere‐to‐telomere (T2T) genome assembly of Arabica, achieved through the integration of PacBio HiFi, Oxford Nanopore ultra‐long, and Hi‐C sequencing technologies, representing the highest‐quality Arabica genome to date. Phylogenetic analysis of N‐methyltransferases (NMTs), the key enzymes responsible for caffeine biosynthesis, revealed their independent evolution across caffeine‐producing clades including coffee, cacao, and tea. Furthermore, GO enrichment analysis of expanded gene families at the Arabica ancestral node, combined with fruit‐specific transcriptomic profiling, revealed that glycosyltransferases likely play a critical role in the secondary metabolism of Arabica. Notably, functional characterisation demonstrated that a UGT (uridine diphosphate glycosyltransferase, UGT) from the UGT29 subfamily, which exhibited increased gene copy number in the Arabica subgenome C than its ancestor, can directly convert Rebaudioside A (Reb A) into Rebaudioside M (Reb M) through a single‐step enzymatic glycosylation. This direct pathway represents a crucial advancement over conventional multi‐UGTs biosynthetic routes of Reb M, which is a highly desirable sweetener whereas with limited natural abundance. Taken together, this study not only provides a valuable genomic resource for studying the unique secondary metabolic processes in C. arabica but also accelerates innovative research frontiers for the synthetic biological production of the valuable sweetener Reb M.",
    "citationCount": 0,
    "referenceCount": 93
}