{
    "paperId": "92b45b5244503050b516365afbe96bfff7eab3ce",
    "title": "Substitution Attacks: A Catalyst to Reframe the DNA Manufacturing Cyberbiosecurity Landscape in the Age of Benchtop Synthesizers",
    "year": 2024,
    "venue": "Applied biosafety : journal of the American Biological Safety Association",
    "authors": [
        "Laura Adam",
        "George H. McArthur"
    ],
    "doi": "10.1089/apb.2023.0035",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/92b45b5244503050b516365afbe96bfff7eab3ce",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: The advent of easy-to-use benchtop DNA synthesizers has ushered in a transformative era in biotechnology, extending the capabilities of DNA synthesis to nonspecialists. However, this revolution in access to this technology exposes several vulnerabilities, notably in the form of substitution attacks. These attacks exploit the intricate interplay between the digital domain of DNA sequences and the physical reality of synthesis instruments, posing substantial threats to biosecurity. Content: This article delves deeply into the dynamic and multifaceted landscape of cyberbiosecurity, specifically emphasizing a novel attack vector that evades traditional screening algorithms. To achieve this, the article explores algorithmic approaches designed to screen DNA sequences, shedding light on the vulnerabilities exposed by substitution attacks and recontextualizing the cyberbiosecurity actor landscape in the context of the entire DNA manufacturing process. Summary: The exploration of cyberbiosecurity brings existing vulnerabilities in DNA screening algorithms to light and sets the stage for future research and policy considerations. By emphasizing opportunities for a comprehensive, multipronged approach rooted in end-to-end practical DNA manufacturing, this study provides a foundation for advancing both knowledge and strategies in the realm of cyberbiosecurity. Recommendations: This article serves as a clarion call for increased vigilance and innovation in navigating the intricate landscape of cyberbiosecurity. Effectively understanding and mitigating substitution attacks is necessary to safeguard the integrity of synthesized genetic material, particularly in the context of the democratization of DNA synthesis technology.",
    "citationCount": 0,
    "referenceCount": 31
}