{
    "paperId": "92b54ed600ae3b630c7d90975bc15c79b8991288",
    "title": "Hybrid Bidirectional GRU Approach for Crop Yield Prediction and Climate Change Impact Assessment in Agriculture",
    "year": 2025,
    "venue": "International Conference Computing Methodologies and Communication",
    "authors": [
        "Monika M",
        "Arun Kumar",
        "Kamlesh Kelwade",
        "Tegil J. John",
        "Krishna Prasad S",
        "Tanaya Nerlekar"
    ],
    "doi": "10.1109/ICCMC65190.2025.11140711",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/92b54ed600ae3b630c7d90975bc15c79b8991288",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The impacts of climate change induced by humans will be felt most acutely by the agriculture sector due to its extreme dependence on weather. To ensure a steady supply of food, it is necessary to study and anticipate the effects of climate change on agricultural output. The impact of climate change on agricultural yield predictions is examined in this study using a novel methodology. In the proposed model, preprocessing, feature extraction, and training are the main processes. Data pretreatment guarantees quality by cleaning and normalising the data, while the PCC is utilised for feature selection. The model utilises AM and BiGRU for usage with large datasets. Using word vectors, the word embedding layer improves contextual awareness. Experiment findings show that the model is accurate to within 98.31% and can withstand a wide range of climate conditions. Current state-of-the-art methods are vastly outperformed by it, with performance measures like as R2 = 0.921%, MAE = 0.127%, and RMSE = 0.158%. These findings show that agricultural strategists and lawmakers can use AM-BiGRU to assess the effects of climate change and build a more resilient food system.",
    "citationCount": 0,
    "referenceCount": 18
}