{
    "paperId": "92db409d73f90f3922674efba9f9384659a2a3bd",
    "title": "Efficient Neural Network Analysis with Sum-of-Infeasibilities",
    "year": 2022,
    "venue": "International Conference on Tools and Algorithms for Construction and Analysis of Systems",
    "authors": [
        "Haoze Wu",
        "Aleksandar Zelji'c",
        "Guy Katz",
        "Clark W. Barrett"
    ],
    "doi": "10.48550/arXiv.2203.11201",
    "arxivId": "2203.11201",
    "url": "https://www.semanticscholar.org/paper/92db409d73f90f3922674efba9f9384659a2a3bd",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2203.11201",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Inspired by sum-of-infeasibilities methods in convex optimization, we propose a novel procedure for analyzing verification queries on neural networks with piecewise-linear activation functions. Given a convex relaxation which over-approximates the non-convex activation functions, we encode the violations of activation functions as a cost function and optimize it with respect to the convex relaxation. The cost function, referred to as the Sum-of-Infeasibilities (SoI), is designed so that its minimum is zero and achieved only if all the activation functions are satisfied. We propose a stochastic procedure, DeepSoI, to efficiently minimize the SoI. An extension to a canonical case-analysis-based complete search procedure can be achieved by replacing the convex procedure executed at each search state with DeepSoI. Extending the complete search with DeepSoI achieves multiple simultaneous goals: 1) it guides the search towards a counter-example; 2) it enables more informed branching decisions; and 3) it creates additional opportunities for bound derivation. An extensive evaluation across different benchmarks and solvers demonstrates the benefit of the proposed techniques. In particular, we demonstrate that SoI significantly improves the performance of an existing complete search procedure. Moreover, the SoI-based implementation outperforms other state-of-the-art complete verifiers. We also show that our technique can efficiently improve upon the perturbation bound derived by a recent adversarial attack algorithm.",
    "citationCount": 32,
    "referenceCount": 76
}