{
    "paperId": "92ec2e88d0adc038314bc0060e41cb92a17a5258",
    "title": "Dynamic Queue Management System for Multi-Cashier Supermarkets Using IoT and Real-Time Monitoring",
    "year": 2024,
    "venue": "International Conference on Automation and Computing",
    "authors": [
        "Wuwani Perera",
        "Hiruni Perera",
        "Hasini Perera",
        "Savindee Suraweera",
        "S. Rathnayake",
        "Supipi Karunathilaka"
    ],
    "doi": "10.1109/ICAC64487.2024.10850938",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/92ec2e88d0adc038314bc0060e41cb92a17a5258",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimizing consumer satisfaction and operational efficiency in supermarkets hinges on effective queue management at cashier counters. In multi-cashier systems, customers often choose lines based on the number of people waiting, ignoring the number of items in each cart. This behavior leads to inefficient queue distribution, resulting in longer waits at counters with higher item counts and underutilized counters with fewer items, detracting from the shopping experience. This study proposes a dynamic queue management system leveraging Closed-Circuit Television (CCTV) cameras and Internet of Things (IoT) devices for real-time monitoring to enhance checkout efficiency. Our approach uses a robust object detection model, developed with PyTorch and Hugging Face Transformers, to accurately determine queue lengths and cart contents from CCTV footage, identifying and categorizing customers and cashiers. IoT sensors count the items in each customer's cart, and this data is combined with CCTV footage to calculate the optimal cashier allocation. This system dynamically assigns customers to cashier counters based on the number of customers and the complexity of their transactions, distributing the checkout load more evenly and efficiently. Processed images, including visual annotations of queue lengths and optimal cashier assignments, are uploaded to Firebase for real-time viewing and access. This technology streamlines the checkout process, enhancing customer satisfaction and optimizing queue management by reducing wait times. The results demonstrate that dynamic queue assignment and real-time item counting significantly improve operational efficiency and customer happiness. This study provides valuable insights and advances in retail queue management, offering a more efficient and customer-focused approach to supermarket operations.",
    "citationCount": 0,
    "referenceCount": 14
}