{
    "paperId": "93007cf963d3eee05ea98a08159cfb1f1cabe026",
    "title": "A SYSTEMATIC LITERATURE REVIEW: BENEFITS AND CHALLENGES OF CLOUD-BASED BIG DATA ANALYTICS",
    "year": 2023,
    "venue": "Issues in Information Systems",
    "authors": [
        "Zaineb Naamane"
    ],
    "doi": "10.48009/1_iis_2023_125",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/93007cf963d3eee05ea98a08159cfb1f1cabe026",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.48009/1_iis_2023_125",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the rapid growth of the Internet and digital economy, the amount of data being stored and analyzed continues to rise exponentially. As a result, big data has emerged as a paradigm for improving and enabling research and decision-support applications. However, as this trend continues, organizations face challenges in storing, transporting, processing, sharing, and visualizing Big Data. The use of cloud computing has become an essential component of Big Data advancements by addressing the challenges associated with shared computing resources such as computing, storage, networking, and analytics software. This study conducts a systematic literature review of research studies published in the last five years on big data analytics in the cloud computing environment. First, this article highlights the relationship between the two technologies – big data and cloud computing – by looking at the latest developments in this area. Next, it examines the different implementations in the cloud that are available for storing, processing, and accessing big data. Finally, it identifies the advantages and challenges of using cloud computing to address Big Data in the digital age.",
    "citationCount": 2,
    "referenceCount": 51
}