{
    "paperId": "9309a11b5c29e09957ed4907e41f6a2f97625bd1",
    "title": "When Quantum Computing Meets Database: A Hybrid Sampling Framework for Approximate Query Processing",
    "year": 2024,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Sai Wu",
        "Meng Shi",
        "Dongxiang Zhang",
        "Junbo Zhao",
        "Gongsheng Yuan",
        "Gang Chen"
    ],
    "doi": "10.1109/TKDE.2024.3480278",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9309a11b5c29e09957ed4907e41f6a2f97625bd1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Quantum computing represents a next-generation technology in data processing, promising to transcend the limitations of traditional computation. In this paper, we undertake an early exploration of the potential integration of quantum computing with database query optimization. We introduce a pioneering hybrid classical-quantum algorithm for sampling-based approximate query processing (AQP). The core concept of the algorithm revolves around identifying rare groups, which often follow a long-tail distribution, and applying distinct sampling methodologies to normal and rare groups. By leveraging the quantum capabilities of the diffusion gate and QRAM, the algorithm defines a novel quantum sampling approach that iteratively amplifies the signals of these infrequent groups. The algorithm operates without the need for preprocessing or prior knowledge of workloads or data. It utilizes the power of quadratic acceleration to achieve well-balanced sampling across various data categories. Experimental results demonstrate that in the context of AQP, the new sampling scheme provides higher accuracy at the same sampling cost. Additionally, the benefits of quantum computing become more pronounced as query selectivity increases.",
    "citationCount": 2,
    "referenceCount": 45
}