{
    "paperId": "931dcbe6bb037bc4733bc536aa970cbd3f80b0ed",
    "title": "NorBERT: NetwOrk Representations Through BERT for Network Analysis & Management",
    "year": 2022,
    "venue": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems",
    "authors": [
        "Franck Le",
        "Davis Wertheimer",
        "S. Calo",
        "E. Nahum"
    ],
    "doi": "10.1109/MASCOTS56607.2022.00012",
    "arxivId": "2206.10472",
    "url": "https://www.semanticscholar.org/paper/931dcbe6bb037bc4733bc536aa970cbd3f80b0ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep neural network models have been very successfully applied to Natural Language Processing (NLP) and Image based tasks. Their application to network analysis and management tasks is just recently being pursued. Our interest is in producing deep models that can be effectively generalized to perform well on multiple network tasks in different environments. A major challenge is that traditional deep models often rely on categorical features, but cannot handle unseen categorical values. One method for dealing with such problems is to learn contextual embeddings for categorical variables used by deep networks to improve their performance. In this paper, we adapt the NLP pre-training technique and associated deep model BERT to learn semantically meaningful numerical representations (embeddings) for Fully Qualified Domain Names (FQDNs) used in communication networks. We show through a series of experiments that such an approach can be used to generate models that maintain their effectiveness when applied to environments other than the one in which they were trained.",
    "citationCount": 4,
    "referenceCount": 48
}