{
    "paperId": "934892bbb74d9cac69061977f5937eba6fd8da52",
    "title": "Use of AI-methods over MD simulations in the sampling of conformational ensembles in IDPs",
    "year": 2025,
    "venue": "Frontiers in Molecular Biosciences",
    "authors": [
        "Souradeep Sil",
        "Ishita Datta",
        "Sankar Basu"
    ],
    "doi": "10.3389/fmolb.2025.1542267",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/934892bbb74d9cac69061977f5937eba6fd8da52",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3389/fmolb.2025.1542267",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Intrinsically Disordered Proteins (IDPs) challenge traditional structure-function paradigms by existing as dynamic ensembles rather than stable tertiary structures. Capturing these ensembles is critical to understanding their biological roles, yet Molecular Dynamics (MD) simulations, though accurate and widely used, are computationally expensive and struggle to sample rare, transient states. Artificial intelligence (AI) offers a transformative alternative, with deep learning (DL) enabling efficient and scalable conformational sampling. They leverage large-scale datasets to learn complex, non-linear, sequence-to-structure relationships, allowing for the modeling of conformational ensembles in IDPs without the constraints of traditional physics-based approaches. Such DL approaches have been shown to outperform MD in generating diverse ensembles with comparable accuracy. Most models rely primarily on simulated data for training and experimental data serves a critical role in validation, aligning the generated conformational ensembles with observable physical and biochemical properties. However, challenges remain, including dependence on data quality, limited interpretability, and scalability for larger proteins. Hybrid approaches combining AI and MD can bridge the gaps by integrating statistical learning with thermodynamic feasibility. Future directions include incorporating physics-based constraints and learning experimental observables into DL frameworks to refine predictions and enhance applicability. AI-driven methods hold significant promise in IDP research, offering novel insights into protein dynamics and therapeutic targeting while overcoming the limitations of traditional MD simulations.",
    "citationCount": 2,
    "referenceCount": 163
}