{
    "paperId": "939c32e105f940d6aa76577b4f6b627d89daccc5",
    "title": "Machine Learning Driven Routing Optimization for Named Data Networking in Mobile Adhoc Network",
    "year": 2024,
    "venue": "2024 8th International Conference on Computational System and Information Technology for Sustainable Solutions (CSITSS)",
    "authors": [
        "K. Manivannan",
        "P. A. Mary",
        "R.E. Franklin Jino",
        "P. Dineshkumar",
        "M.S. Harivisva",
        "P. Harikrishnan"
    ],
    "doi": "10.1109/CSITSS64042.2024.10816903",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/939c32e105f940d6aa76577b4f6b627d89daccc5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Named data networking (NDN) can enhance the efficiency of data acquisition for a Mobile Adhoc Network (MANET). In an NDN-based MANET, each data router monitors the Forward Information Base (FIB) and the Pending Interest Table (PIT). To start a data connection, the consumer sends a name and a message expressing interest. If the data router receiving the interest has the FIB entries for the destination name, it employs constrained flooding to transmit interest via each FIB entry. Intermediary data routers begin to develop PIT entries in order to construct reverse pathways during transmission of interest. In order to acquire data effectively, it creates a reverse path. However, in order to make the optimal routing options, there is a cost. This cost is reduced when content discovery is optimized through the use of machine learning. Taking this challenge into account, we propose using machine learning enhance the efficiency of routing in NDN-based MANET. Our approach aims to optimize routing decision by leveraging reinforcement machine learning algorithm adapt to dynamic network conditions by incorporating machine learning can learn from past experience and make informed routing decisions based on current network status, improving overall network performance. In the proposal, we explored the Q-learning technique to achieve the best routing to acquire data with reduced latency, enhanced security, improved resource utilization and enhanced scalability in NDN based MANET. The experimental results show that the proposed strategy successfully improves the routing choice, increases the data fetching success rate, and reduces the costs and delays related to data retrieval.",
    "citationCount": 8,
    "referenceCount": 31
}