{
    "paperId": "93a6427bbc8ecda5b3cb9521a47945bb623a34e3",
    "title": "A review of mechanistic learning in mathematical oncology",
    "year": 2023,
    "venue": "Frontiers in Immunology",
    "authors": [
        "John Metzcar",
        "C. Jutzeler",
        "Paul Macklin",
        "Alvaro Köhn-Luque",
        "Sarah C. Brüningk"
    ],
    "doi": "10.3389/fimmu.2024.1363144",
    "arxivId": "2312.07026",
    "url": "https://www.semanticscholar.org/paper/93a6427bbc8ecda5b3cb9521a47945bb623a34e3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2024.1363144/pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mechanistic learning refers to the synergistic combination of mechanistic mathematical modeling and data-driven machine or deep learning. This emerging field finds increasing applications in (mathematical) oncology. This review aims to capture the current state of the field and provides a perspective on how mechanistic learning may progress in the oncology domain. We highlight the synergistic potential of mechanistic learning and point out similarities and differences between purely data-driven and mechanistic approaches concerning model complexity, data requirements, outputs generated, and interpretability of the algorithms and their results. Four categories of mechanistic learning (sequential, parallel, extrinsic, intrinsic) of mechanistic learning are presented with specific examples. We discuss a range of techniques including physics-informed neural networks, surrogate model learning, and digital twins. Example applications address complex problems predominantly from the domain of oncology research such as longitudinal tumor response predictions or time-to-event modeling. As the field of mechanistic learning advances, we aim for this review and proposed categorization framework to foster additional collaboration between the data- and knowledge-driven modeling fields. Further collaboration will help address difficult issues in oncology such as limited data availability, requirements of model transparency, and complex input data which are embraced in a mechanistic learning framework",
    "citationCount": 37,
    "referenceCount": 134
}