{
    "paperId": "93c017bae53452776e1855793e86f86d20afde7b",
    "title": "RM-NET: Rasterizing Markov Signals to Images for Deep Learning",
    "year": 2023,
    "venue": "2023 International Conference on Cyber-Physical Social Intelligence (ICCSI)",
    "authors": [
        "Kajal Gupta",
        "Zhi Wei"
    ],
    "doi": "10.1109/ICCSI58851.2023.10303906",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/93c017bae53452776e1855793e86f86d20afde7b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Statistical machine learning approaches are quite famous for processing Markov signal data. They can model unobserved states and learn certain characteristics particular to a signal with good accuracy. However, with the advent of deep learning, the novice ways of solving a problem has shifted towards this more sophisticated algorithm, which is better, powerful and more accurate. Specifically, deep convolutional neural nets (CNNs) have shown many promising results on images and videos. In this paper we propose how CNN can be applied to a 1D Markov signal using signal rasterization. Rasterization is the process of taking a vector and converting it into a raster image. We start by rasterizing a 1D numeric Markov signal into an image followed by applying CNN to perform two basic tasks: signal classification and error segment localization. We call this process as RM-Net. We demonstrate the performance of our approach using CNN on simulated data bench-marked against statistical models as baseline. We also illustrate the supremacy of our proposed technique on real-word dataset ‘1000 Genomes Project Phase 3 Structural Variants (SV)’ where we try to estimate the location of Copy Number Variant (CNV) in a chromosome. Finally, we conclude using the metrics obtained on both the datasets that our proposed approach is better for classification and error segment localization, shows promising results and has scope for future improvements over traditional statistical machine learning approaches.",
    "citationCount": 1,
    "referenceCount": 52
}