{
    "paperId": "93cfe395a883b38440372053aea6834cffeacaf7",
    "title": "CTRL-Rec: Controlling Recommender Systems With Natural Language",
    "year": 2025,
    "venue": "",
    "authors": [
        "Michael Carroll",
        "Adeline Foote",
        "Marcus Williams",
        "Anca Dragan",
        "Brad Knox",
        "S. Milli"
    ],
    "doi": null,
    "arxivId": "2510.12742",
    "url": "https://www.semanticscholar.org/paper/93cfe395a883b38440372053aea6834cffeacaf7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "When users are dissatisfied with recommendations from a recommender system, they often lack fine-grained controls for changing them. Large language models (LLMs) offer a solution by allowing users to guide their recommendations through natural language requests (e.g.,\"I want to see respectful posts with a different perspective than mine\"). We propose a method, CTRL-Rec, that allows for natural language control of traditional recommender systems in real-time with computational efficiency. Specifically, at training time, we use an LLM to simulate whether users would approve of items based on their language requests, and we train embedding models that approximate such simulated judgments. We then integrate these user-request-based predictions into the standard weighting of signals that traditional recommender systems optimize. At deployment time, we require only a single LLM embedding computation per user request, allowing for real-time control of recommendations. In experiments with the MovieLens dataset, our method consistently allows for fine-grained control across a diversity of requests. In a study with 19 Letterboxd users, we find that CTRL-Rec was positively received by users and significantly enhanced users'sense of control and satisfaction with recommendations compared to traditional controls.",
    "citationCount": 0,
    "referenceCount": 68
}