{
    "paperId": "93d4e478ceb9a373b583f399f1e4fd010b95bd8c",
    "title": "Financial Fraud Identification Model of Listed Companies based on Time-Series Information",
    "year": 2024,
    "venue": "WSEAS Transactions on Computer Research",
    "authors": [
        "Lili Wang"
    ],
    "doi": "10.37394/232018.2024.12.21",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/93d4e478ceb9a373b583f399f1e4fd010b95bd8c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The aim of this research is to establish a high-precision financial fraud identification model for listed companies, which is mainly based on the financial indicators of time series. Support vector machine and K-means clustering algorithm are especially used in the research process. Firstly, local linear embedding is used to reduce the dimensionality of the selected financial indicators to extract the low-dimensional characteristics. Then the samples are classified into financial fraud and non-fraud by support vector machine, and the recognition model is constructed. At the same time, the research also uses K-means clustering algorithm to analyze the pattern of financial fraud. The experiment of dimensionality reduction proves that the model has a high effect on the processing of financial data, and the error between the data after dimensionality reduction and the original data is small. In addition, the clustering effect of the model also shows a clear pattern of fraud. In practical application, the accuracy rate of this model is as high as 94.89%, showing high accuracy and recall rate, and its F1 value is 87.08%, showing its feasibility and effectiveness in practice. The results highly prove that the performance of the financial fraud identification model proposed in this study is excellent, and it has a wide application prospect in the future.",
    "citationCount": 1,
    "referenceCount": 21
}