{
    "paperId": "9415a1403da7f21adf360a4db35151152c5bd40b",
    "title": "Learning to Hash for Recommendation: A Survey",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Fang Luo",
        "Honglei Zhang",
        "Tong Li",
        "Jun Wu"
    ],
    "doi": "10.48550/arXiv.2412.03875",
    "arxivId": "2412.03875",
    "url": "https://www.semanticscholar.org/paper/9415a1403da7f21adf360a4db35151152c5bd40b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the explosive growth of users and items, Recommender Systems are facing unprecedented challenges in terms of retrieval efficiency and storage overhead. Learning to Hash techniques have emerged as a promising solution to these issues by encoding high-dimensional data into compact hash codes. As a result, hashing-based recommendation methods (HashRec) have garnered growing attention for enabling large-scale and efficient recommendation services. This survey provides a comprehensive overview of state-of-the-art HashRec algorithms. Specifically, we begin by introducing the common two-tower architecture used in the recall stage and by detailing two predominant hash search strategies. Then, we categorize existing works into a three-tier taxonomy based on: (i) learning objectives, (ii) optimization strategies, and (iii) recommendation scenarios. Additionally, we summarize widely adopted evaluation metrics for assessing both the effectiveness and efficiency of HashRec algorithms. Finally, we discuss current limitations in the field and outline promising directions for future research. We index these HashRec methods at the repository \\href{https://github.com/Luo-Fangyuan/HashRec}{https://github.com/Luo-Fangyuan/HashRec}.",
    "citationCount": 1,
    "referenceCount": 134
}