{
    "paperId": "944efd1dcbac1b24199258c85b1e2d5a59c33c65",
    "title": "FpgaHub: Fpga-centric Hyper-heterogeneous Computing Platform for Big Data Analytics",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zeke Wang",
        "Jie Zhang",
        "Hongjing Huang",
        "Yingtao Li",
        "Xueying Zhu",
        "Mo Sun",
        "Zihan Yang",
        "De Ma",
        "Huajin Tang",
        "Gang Pan",
        "Fei Wu",
        "Bingsheng He",
        "Gustavo Alonso"
    ],
    "doi": "10.48550/arXiv.2503.09318",
    "arxivId": "2503.09318",
    "url": "https://www.semanticscholar.org/paper/944efd1dcbac1b24199258c85b1e2d5a59c33c65",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern data analytics requires a huge amount of computing power and processes a massive amount of data. At the same time, the underlying computing platform is becoming much more heterogeneous on both hardware and software. Even though specialized hardware, e.g., FPGA- or GPU- or TPU-based systems, often achieves better performance than a CPU-only system due to the slowing of Moore's law, such systems are limited in what they can do. For example, GPU-only approaches suffer from severe IO limitations. To truly exploit the potential of hardware heterogeneity, we present FpgaHub, an FPGA-centric hyper-heterogeneous computing platform for big data analytics. The key idea of FpgaHub is to use reconfigurable computing to implement a versatile hub complementing other processors (CPUs, GPUs, DPUs, programmable switches, computational storage, etc.). Using an FPGA as the basis, we can take advantage of its highly reconfigurable nature and rich IO interfaces such as PCIe, networking, and on-board memory, to place it at the center of the architecture and use it as a data and control plane for data movement, scheduling, pre-processing, etc. FpgaHub enables architectural flexibility to allow exploring the rich design space of heterogeneous computing platforms.",
    "citationCount": 0,
    "referenceCount": 102
}