{
    "paperId": "94b389e00214465e480b70d4731dd7f34f558525",
    "title": "FReD-ViQ: Fuzzy Reinforcement Learning Driven Adaptive Streaming Solution for Improved Video Quality of Experience",
    "year": 2024,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Abid Yaqoob",
        "Gabriel-Miro Muntean"
    ],
    "doi": "10.1109/TNSM.2024.3450014",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/94b389e00214465e480b70d4731dd7f34f558525",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Next-generation cellular networks strive to offer ubiquitous connectivity, enhanced transmission rates with increased capacity, and superior network coverage. However, they face significant challenges due to the growing demand for multimedia services across diverse devices. Adaptive multimedia streaming services are essential for achieving good viewer Quality of Experience (QoE) levels amidst these challenges. Yet, the existing adaptive video streaming solutions do not consider diverse QoE preferences or are limited to meeting specific QoE objectives. This paper presents FReD-ViQ, a Fuzzy Reinforcement Learning-Driven Adaptive Streaming Solution for Improved Video QoE that combines the strengths of fuzzy logic and advanced Deep Reinforcement Learning (DRL) mechanisms to deliver exceptional, individually tailored user experiences. FReD-ViQ is a sophisticated streaming solution that leverages efficient membership function modelling to achieve a more finely-grained representation of both input and output spaces. This advanced representation is augmented by a set of fuzzy rules that govern the decision-making process. In addition to its fuzzy logic capabilities, FReD-ViQ incorporates a novel DRL algorithm based on Dueling Double Deep Q-Network (Dueling DDQN), noisy networks, and prioritized experience replay (PER) techniques. This innovative fusion enables effective modelling of uncertain network dynamics and high-dimensional state spaces while optimizing exploration-exploitation trade-offs in adaptive streaming environments. Extensive performance evaluations in real-world simulation settings demonstrate that FReD-ViQ effectively surpasses existing solutions across multiple QoE models, yielding average improvements of 23.10% (Linear QoE), 23.97% (Log QoE), and 33.42% (HD QoE).",
    "citationCount": 1,
    "referenceCount": 64
}