{
    "paperId": "94cb9246487f57be30a2501e9b2d0799b20cbd3e",
    "title": "Research and application of cigarette trans-regional outflow risk prediction model based on data element value discovery",
    "year": 2023,
    "venue": "Conference on Intelligent Computing and Human-Computer Interaction",
    "authors": [
        "Fan Yang",
        "Shuming Wang",
        "Huafeng Yan"
    ],
    "doi": "10.1117/12.2655941",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/94cb9246487f57be30a2501e9b2d0799b20cbd3e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the particularity of tobacco as a commodity, the problem of cigarette trans-regional outflow has always been a difficult problem in the standardized management of the tobacco market supervision, mainly manifested in the lack of detection means, low identification accuracy, lagging early warning results and so on. To solve the above problems, this paper proposes a detection model TMSS (Tobacco Market Scientific Supervision), which can accurately identify the risk points related to tobacco operating by constructing an isolation forest algorithm, combining principal component analysis and grid search techniques, using multisource data fusion. This paper focuses on the working principle and algorithm design of the model TMSS. The accuracy and reliability of the TMSS are verified by selecting relevant application scenarios in Shiyan city, Hubei province. Through experimental verification, TMSS can effectively identify the risk points cause the transregional outflow phenomenon in the tobacco operation process in advance, which provides a significant breakthrough method and tool in the field of scientific supervision of tobacco market.",
    "citationCount": 0,
    "referenceCount": 7
}