{
    "paperId": "95022a057c830a9cbc9ac368bff95082a8f9603d",
    "title": "NULLS!: Revisiting Null Representation in Modern Columnar Formats",
    "year": 2024,
    "venue": "International Workshop on Data Management on New Hardware",
    "authors": [
        "Xinyu Zeng",
        "Ruijun Meng",
        "Andrew Pavlo",
        "Wes McKinney",
        "Huanchen Zhang"
    ],
    "doi": "10.1145/3662010.3663452",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/95022a057c830a9cbc9ac368bff95082a8f9603d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nulls are common in real-world data sets, yet recent research on columnar formats and encodings rarely address Null representations. Popular file formats like Parquet and ORC follow the same design as C-Store from nearly 20 years ago that only stores non-Null values contiguously. But recent formats store both non-Null and Null values, with Nulls being set to a placeholder value. In this work, we analyze each approach's pros and cons under different data distributions, encoding schemes (with different best SIMD ISA), and implementations. We optimize the bottlenecks in the traditional approach using AVX512. We also propose a Null-filling strategy called SmartNull, which can determine the Null values best for compression ratio at encoding time. From our micro-benchmarks, we argue that the optimal Null compression depends on several factors: decoding speed, data distribution, and Null ratio. Our analysis shows that the Compact layout performs better when Null ratio is high and the Placeholder layout is better when the Null ratio is low or the data is serial-correlated.",
    "citationCount": 4,
    "referenceCount": 31
}