{
    "paperId": "952827741052168eaaa1b587f05a07927fa025c3",
    "title": "Minato: A Read-Disturb-Aware Dynamic Buffer Management Scheme for NAND Flash Memory",
    "year": 2024,
    "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "authors": [
        "Shujie Pang",
        "Yuhui Deng",
        "Genxiong Zhang",
        "Jiande Huang",
        "Zhaorui Wu"
    ],
    "doi": "10.1109/TCAD.2024.3364109",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/952827741052168eaaa1b587f05a07927fa025c3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Read-disturb problem plays a pivotal factor in the performance of NAND flash memory, because it deteriorates the read-disturb errors of NAND flash. Although ECC, read retry, and read reclaim technologies are designed to correct read-disturb errors, these techniques drastically increase read latency and degrade read performance. Moreover, modern SSDs implement a buffer in the built-in DRAM to store frequently accessed data, which can cache hot-read data to alleviate the read-disturb problem. Unfortunately, the buffer primarily serves write requests to curtail write operations in flash memory, and ignores the ever-increasing requirement from users for read latency. To address this issue, we propose a read-disturb-aware dynamic buffer management scheme called Minato that reduces read-disturb errors with rationally read buffer management, aiming to improve the read performance of SSDs. Minato includes two distinctive and vital features. First, Minato dynamically adjusts the size of the read buffer and write buffer through the hit situation of requests, thus increasing the size of the read buffer while maintaining the write hit of the write buffer. Second, to further reduce read-disturb errors, Minato implements a read buffer filter to preferentially cache hot-read data disturbing more valid pages into the read buffer. We compare Minato with two state-of-art schemes—1) BPLRU and 2) GCaR in terms of write hit ratio, read-disturb counts, and read/write response time. The experimental results derived from nine real-world workload traces show that Minato efficiently alleviates the read-disturb problem of flash memory without affecting the write hit ratio, and significantly improves read/write performance. In particular, compared with the existing schemes, Minato slashes the read/write response time by an average of 34.6%.",
    "citationCount": 3,
    "referenceCount": 42
}