{
    "paperId": "9558f823e18b796a7b6fee9a226d21f77809e908",
    "title": "Hybrid pre trained model based feature extraction for enhanced indoor scene classification in federated learning environments",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Monica Dutta",
        "Deepali Gupta",
        "Vikas Khullar",
        "Sapna Juneja",
        "Roobaea Alroobaea",
        "Pooja Sapra"
    ],
    "doi": "10.1038/s41598-025-16673-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9558f823e18b796a7b6fee9a226d21f77809e908",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Classification of indoor scenes is a crucial task of computer vision. It has widespread applications like smart homes, smart cities, robotics, etc. Primitive classification methods like Support Vector Machines (SVM) and K-Nearest Neighbors (KNN), provide a compromised performance with complex indoor environments due to light variations, intra-class similarities, and occlusions. Deep Learning (DL) models, especially Convolutional Neural Networks (CNNs), have improved classification accuracy significantly by extracting the image features. This study proposes and implements a novel MultiData model, which integrates DL with Linear Discriminant Analysis (LDA) and Federated Learning (FL) to enhance classification performance while preserving data privacy. Comparative performance analysis of the MultiData model with VGG16, VGG19, and ResNet152 shows that MultiData achieves near-perfect accuracy (99.99%) and minimal validation loss (0%). The performance of the proposed model was further compared with FL-based training across four clients using IID and non-IID datasets. The results further confirm the model’s robustness, achieving 100% accuracy in training and over 95% in validation times respectively. This research is beneficial for stakeholders in healthcare, smart infrastructure, surveillance, and other IoT-based automation, aligning with SDG 9 (Industry, Innovation, and Infrastructure), SDG 11 (Sustainable Cities and Communities), and SDG 12 (Responsible Consumption and Production). By enabling efficient and privacy-preserving scene classification, this work contributes significantly to the development of smart and sustainable environments enhancing AI-based decision-making across various sectors.",
    "citationCount": 0,
    "referenceCount": 52
}