{
    "paperId": "95617789474a884cdbb07b7228178ec730bc1282",
    "title": "Model-Based Deep Learning: On the Intersection of Deep Learning and Optimization",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Nir Shlezinger",
        "Y. Eldar",
        "Stephen P. Boyd"
    ],
    "doi": "10.1109/ACCESS.2022.3218802",
    "arxivId": "2205.02640",
    "url": "https://www.semanticscholar.org/paper/95617789474a884cdbb07b7228178ec730bc1282",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09934915.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Decision making algorithms are used in a multitude of different applications. Conventional approaches for designing decision algorithms employ principled and simplified modelling, based on which one can determine decisions via tractable optimization. More recently, deep learning approaches that use highly parametric architectures tuned from data without relying on mathematical models, are becoming increasingly popular. Model-based optimization and data-centric deep learning are often considered to be distinct disciplines. Here, we characterize them as edges of a continuous spectrum varying in specificity and parameterization, and provide a tutorial-style presentation to the methodologies lying in the middle ground of this spectrum, referred to as model-based deep learning. We accompany our presentation with running examples in super-resolution and stochastic control, and show how they are expressed using the provided characterization and specialized in each of the detailed methodologies. The gains of combining model-based optimization and deep learning are demonstrated using experimental results in various applications, ranging from biomedical imaging to digital communications.",
    "citationCount": 142,
    "referenceCount": 55
}