{
    "paperId": "958c9f124e9b5c83e3332e1623b7553b084aae30",
    "title": "Efficient Soft-Error Detection for Low-precision Deep Learning Recommendation Models",
    "year": 2021,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Sihuan Li",
        "Jianyu Huang",
        "P. T. P. Tang",
        "D. Khudia",
        "Jongsoo Park",
        "H. Dixit",
        "Zizhong Chen"
    ],
    "doi": "10.1109/BigData55660.2022.10020972",
    "arxivId": "2103.00130",
    "url": "https://www.semanticscholar.org/paper/958c9f124e9b5c83e3332e1623b7553b084aae30",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2103.00130",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Soft error, namely silent corruption of signal or datum in a computer system, cannot be caverlierly ignored as compute and communication density grow exponentially. Soft error detection has been studied in the context of enterprise computing, high-performance computing and more recently in convolutional neural networks related to autonomous driving.Deep learning recommendation systems (DLRMs) have by now become ubiquitous and serve billions of users per day. Nevertheless, DLRM-specific soft error detection methods are hitherto missing. To fill the gap, this paper presents the first set of soft-error detection methods for low-precision quantized-arithmetic operators in DLRM including general matrix multiplication (GEMM) and EmbeddingBag. A practical method must detect error and do so with low overhead lest reduced inference speed degrades user experience. Exploiting the characteristics of both quantized arithmetic and the operators, we achieved more than 95% detection accuracy for GEMM with an overhead below 20%. For EmbeddingBag, we achieved 99% effectiveness in significant-bit-flips detection with less than 10% of false positives, while keeping overhead below 26%.",
    "citationCount": 14,
    "referenceCount": 31
}