{
    "paperId": "95ce3b262263b0e82ccf332bcde4a08727404fb9",
    "title": "Exploration of the Antibacterial Potential from Rice Eel Skin Mucus (Monopterus albus) Against Bacteria Aeromonas hydrophila, Escherichia coli, and Staphylococcus aureus",
    "year": 2024,
    "venue": "Media Kedokteran Hewan",
    "authors": [
        "Ratih Novita Praja",
        "Aditya Yudhana",
        "D. Handijatno",
        "Wardatul Qoryah Al-Madinah",
        "Jonathan Mark Hamonangan",
        "Alivia Khairina Insani",
        "Nindya Pradnya Prameswari",
        "Dhenatra Rifqy Prasetyo",
        "S. Praja"
    ],
    "doi": "10.20473/mkh.v35i3.2024.197-205",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/95ce3b262263b0e82ccf332bcde4a08727404fb9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.20473/mkh.v35i3.2024.197-205",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The skin mucus of the rice eel (Monopterus albus) contains various antibacterial compounds and has the potential as a synthetic antibiotic. This research was conducted to explore the potential antibacterial power of the rice eel skin mucus against some pathogenic bacteria in freshwater fish. The bacteria were isolated from five samples of rice eel cultivation ponds belonging to Mr. Sabwan and then challenged with the mucus of the eel's skin through diffusion tests using paper discs. The rice eel skin mucus tested its antibacterial activity against three species of freshwater bacteria, Aeromonas hydrophila, Escherichia coli, and Staphylococcus aureus, by testing sensitivity and inhibitory zones. The inhibitory zones of each bacterium were measured using Vernier caliper which refers to the standardization of the inhibitory zone: < 4 mm no activity, 5-9 mm weak, 10- 14 mm medium, and > 15 mm strong. Test results showed that the eels' skin mucus could inhibit the growth of bacteria Aeromonas hydrophila, Escherichia coli, and Staphylococcus aureus.",
    "citationCount": 0,
    "referenceCount": 21
}