{
    "paperId": "95ddab6fcd670090e341b1616e3cab3ecf682f43",
    "title": "Tackling the Matrix Multiplication Micro-Kernel Generation with Exo",
    "year": 2023,
    "venue": "IEEE/ACM International Symposium on Code Generation and Optimization",
    "authors": [
        "A. Castell'o",
        "Julian Bellavita",
        "Grace Dinh",
        "Yuka Ikarashi",
        "Héctor Martínez"
    ],
    "doi": "10.1109/CGO57630.2024.10444883",
    "arxivId": "2310.17408",
    "url": "https://www.semanticscholar.org/paper/95ddab6fcd670090e341b1616e3cab3ecf682f43",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.17408",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The optimization of the matrix multiplication (or GEMM) has been a need during the last decades. This operation is considered the flagship of current linear algebra libraries such as BLIS, OpenBLAS, or Intel OneAPI because of its widespread use in a large variety of scientific applications. The GEMM is usually implemented following the GotoBLAS philosophy, which tiles the GEMM operands and uses a series of nested loops for performance improvement. These approaches extract the maximum computational power of the architectures through small pieces of hardware-oriented, high-performance code called micro-kernel. However, this approach forces developers to generate, with a nonnegligible effort, a dedicated micro-kernel for each new hardware. In this work, we present a step-by-step procedure for generating micro-kernels with the Exo compiler that perform close to (or even better than) manually developed microkernels written with intrinsic functions or assembly language. Our solution also improves the portability of the generated code, since a hardware target is fully specified by a concise library-based description of its instructions.",
    "citationCount": 5,
    "referenceCount": 36
}