{
    "paperId": "95f5caa8fba7837230c4741be6481df6f1319417",
    "title": "Making Sense of Making Sense of Time: Longitudinal Narrative Research",
    "year": 2023,
    "venue": "International Journal of Qualitative Methods",
    "authors": [
        "E. McKibben",
        "M. Breheny"
    ],
    "doi": "10.1177/16094069231160928",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/95f5caa8fba7837230c4741be6481df6f1319417",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1177/16094069231160928",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Narratives, like the people who tell them, are fluid, changing through time and in response to context. Longitudinal narrative interviewing enables researchers to explore the meaning of stability and change in narratives over time. Despite much attention to and application of longitudinal narrative interviews in recent years, the ways that time is conceptualized and the ways it is applied are markedly different. In this paper the authors present a scoping review to examine the methodological and empirical literature on longitudinal narrative interviewing in health-related research. This research is used to highlight a methodological tension between narrative theorizing of time and analytic practice in research involving longitudinal narrative interviews. Longitudinal narrative research struggles to acknowledge time as both chronological and interpretative, and in doing so misses an opportunity to examine interviews as both multiple data collections and as multiple instances of narrative re-configuration. The authors suggest that future theorizing and empirical work can strive to bridge an onto-epistemological gap by intentionally foregrounding theoretical orientations to time within narrative analytic approaches using repeated interviews.",
    "citationCount": 7,
    "referenceCount": 55
}