{
    "paperId": "96199c65d118164ee47310a5decfd6df05937f96",
    "title": "Improving Pre-Trained Self-Supervised Embeddings Through Effective Entropy Maximization",
    "year": 2024,
    "venue": "International Conference on Artificial Intelligence and Statistics",
    "authors": [
        "Deep Chakraborty",
        "Yann LeCun",
        "Tim G. J. Rudner",
        "Erik Learned-Miller"
    ],
    "doi": "10.48550/arXiv.2411.15931",
    "arxivId": "2411.15931",
    "url": "https://www.semanticscholar.org/paper/96199c65d118164ee47310a5decfd6df05937f96",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A number of different architectures and loss functions have been applied to the problem of self-supervised learning (SSL), with the goal of developing embeddings that provide the best possible pre-training for as-yet-unknown, lightly supervised downstream tasks. One of these SSL criteria is to maximize the entropy of a set of embeddings in some compact space. But the goal of maximizing the embedding entropy often depends -- whether explicitly or implicitly -- upon high dimensional entropy estimates, which typically perform poorly in more than a few dimensions. In this paper, we motivate an effective entropy maximization criterion (E2MC), defined in terms of easy-to-estimate, low-dimensional constraints. We demonstrate that using it to continue training an already-trained SSL model for only a handful of epochs leads to a consistent and, in some cases, significant improvement in downstream performance. We perform careful ablation studies to show that the improved performance is due to the proposed add-on criterion. We also show that continued pre-training with alternative criteria does not lead to notable improvements, and in some cases, even degrades performance.",
    "citationCount": 2,
    "referenceCount": 40
}