{
    "paperId": "9625b19ee9b9d3007804a3dabb4beccbd3cc4143",
    "title": "SiriusBI: A Comprehensive LLM-powered Solution for Data Analytics in Business Intelligence",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Jie Jiang",
        "Haining Xie",
        "Yu Shen",
        "Zihan Zhang",
        "Meng Lei",
        "Yifeng Zheng",
        "Yide Fang",
        "Chunyou Li",
        "Danqing Huang",
        "Wentao Zhang",
        "Yang Li",
        "Xiaofeng Yang",
        "Bin Cui",
        "Peng Chen"
    ],
    "doi": "10.14778/3750601.3750610",
    "arxivId": "2411.06102",
    "url": "https://www.semanticscholar.org/paper/9625b19ee9b9d3007804a3dabb4beccbd3cc4143",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the proliferation of Large Language Models (LLMs) in Business Intelligence (BI), existing solutions face critical challenges in industrial deployments: functionality deficiencies from legacy systems failing to meet evolving LLM-era user demands, interaction limitations from single-round SQL generation paradigms inadequate for multi-round clarification, and cost for domain adaptation arising from cross-domain methods migration.\n We present SiriusBI, a practical LLM-powered BI system addressing the challenges of industrial deployments through three key innovations: (a) An end-to-end architecture integrating multi-module coordination to overcome functionality gaps in legacy systems; (b) A multi-round dialogue with querying mechanism, consisting of semantic completion, knowledge-guided clarification, and proactive querying processes, to resolve interaction constraints in SQL generation; (c) A data-conditioned SQL generation method selection strategy that supports both an efficient one-step Fine-Tuning approach and a two-step method leveraging Semantic Intermediate Representation for low-cost cross-domain applications. Experiments on both real-world datasets and public benchmarks demonstrate the effectiveness of SiriusBI. User studies further confirm that SiriusBI enhances both productivity and user experience.\n As an independent service on Tencent's data platform, SiriusBI is deployed across finance, advertising, and cloud sectors, serving dozens of enterprise clients. It achieves over 93% accuracy in SQL generation and reduces data analysts' query time from minutes to seconds in real-world applications.",
    "citationCount": 3,
    "referenceCount": 87
}