{
    "paperId": "9642f4273d8fd6edaa41ea063f428f944b8f4f80",
    "title": "Distributed Traffic Synthesis and Classification in Edge Networks: A Federated Self-Supervised Learning Approach",
    "year": 2023,
    "venue": "IEEE Transactions on Mobile Computing",
    "authors": [
        "Yong Xiao",
        "Rong Xia",
        "Yingyu Li",
        "Guangming Shi",
        "Diep N. Nguyen",
        "D. Hoang",
        "Dusist Niyato",
        "M. Krunz"
    ],
    "doi": "10.1109/TMC.2023.3240821",
    "arxivId": "2302.00207",
    "url": "https://www.semanticscholar.org/paper/9642f4273d8fd6edaa41ea063f428f944b8f4f80",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2302.00207",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rising demand for wireless services and increased awareness of the need for data protection, existing network traffic analysis and management architectures are facing unprecedented challenges in classifying and synthesizing the increasingly diverse services and applications. This paper proposes FS-GAN, a federated self-supervised learning framework to support automatic traffic analysis and synthesis over a large number of heterogeneous datasets. FS-GAN is composed of multiple distributed Generative Adversarial Networks (GANs), with a set of generators, each being designed to generate synthesized data samples following the distribution of an individual service traffic, and each discriminator being trained to differentiate the synthesized data samples and the real data samples of a local dataset. A federated learning-based framework is adopted to coordinate local model training processes of different GANs across different datasets. FS-GAN can classify data of unknown types of service and create synthetic samples that capture the traffic distribution of the unknown types. We prove that FS-GAN can minimize the Jensen-Shannon Divergence (JSD) between the distribution of real data across all the datasets and that of the synthesized data samples. FS-GAN also maximizes the JSD among the distributions of data samples created by different generators, resulting in each generator producing synthetic data samples that follow the same distribution as one particular service type. Extensive simulation results show that the classification accuracy of FS-GAN achieves over 20% improvement in average compared to the state-of-the-art clustering-based traffic analysis algorithms. FS-GAN also has the capability to synthesize highly complex mixtures of traffic types without requiring any human-labeled data samples.",
    "citationCount": 16,
    "referenceCount": 87
}