{
    "paperId": "9651def537445f19aa6ce62a81fc3336e898b6a1",
    "title": "Seven years since the launch of the Matchmaker Exchange: The evolution of genomic matchmaking",
    "year": 2022,
    "venue": "Human Mutation",
    "authors": [
        "K. Boycott",
        "Danielle R Azzariti",
        "A. Hamosh",
        "H. Rehm"
    ],
    "doi": "10.1002/humu.24373",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9651def537445f19aa6ce62a81fc3336e898b6a1",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1002/humu.24373",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Matchmaker Exchange (MME) was launched in 2015 to provide a robust mechanism to discover novel disease‐gene relationships. It operates as a federated network connecting databases holding relevant data using a common application programming interface, where two or more users are looking for a match for the same gene (two‐sided matchmaking). Seven years from its launch, it is clear that the MME is making outstanding contributions to understanding the morbid anatomy of the genome. The number of unique genes present across the MME has steadily increased over time; there are currently >13,520 unique genes (~68% of all protein‐coding genes) connected across the MME's eight genomic matchmaking nodes, GeneMatcher, DECIPHER, PhenomeCentral, MyGene2, seqr, Initiative on Rare and Undiagnosed Disease, PatientMatcher, and the RD‐Connect Genome‐Phenome Analysis Platform. The collective data set accessible across the MME currently includes more than 120,000 cases from over 12,000 contributors in 98 countries. The discovery of potential new disease‐gene relationships is happening daily and international collaborative teams are moving these advances forward to publication, now numbering well over 500. Expansion of data sharing into routine clinical practice by clinicians, genetic counselors, and clinical laboratories has ensured access to discovery for even more individuals with undiagnosed rare genetic diseases. Tens of thousands of patients and their family members have been directly or indirectly impacted by the discoveries facilitated by two‐sided genomic matchmaking. MME supports further connections to the literature (PubCaseFinder) and to human and model organism resources (Monarch Initiative) and scientists (ModelMatcher). Efforts are now underway to explore additional approaches to matchmaking at the gene or variant level where there is only one querier (one‐sided matchmaking). Genomic matchmaking has proven its utility over the past 7 years and will continue to facilitate discoveries in the years to come.",
    "citationCount": 37,
    "referenceCount": 63
}