{
    "paperId": "965f720c93fba8734cc0b73cd1cebcc937a211c7",
    "title": "Improved Chaotic Firefly Optimization Based Deep Neural Network for Security Preservation in Smart Healthcare",
    "year": 2025,
    "venue": "2025 International Conference in Advances in Power, Signal, and Information Technology (APSIT)",
    "authors": [
        "Pooja Puspita Priyadarshani",
        "Janmenjoy Nayak",
        "Pandit Byomakesha Dash"
    ],
    "doi": "10.1109/APSIT63993.2025.11086281",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/965f720c93fba8734cc0b73cd1cebcc937a211c7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Healthcare is a crucial pillar for a nation's economy and growth, affecting longevity, physical strength, energy levels and overall vitality. A standardized, high-quality medical system is a fundamental right to which all citizens should have access; protecting private health information is equally essential. The Internet of Medical Things (IoMT) enhances patient response, lowers healthcare expenses and raises healthcare quality; however, it also poses security risks to patient data privacy. This research explores the utilization of advanced DL techniques for enhancement of intrusion detection in an IoMT environment. Nonetheless, as attackers improve their techniques, there is a rising trend towards using Deep Neural Networks (DNN) for improved and anticipatory attack detection. This research describes a DNN with Chaotic Firefly Optimization (CFO_DNN) based IDS designed specifically for the IoMT scenario. To address the issues of underfitting and overfitting, the DNN model's hyper-parameters are fine-tuned employing the CFO approach. The proposed model's performance has been thoroughly analyzed by comparing it to current IDS models for the IoMT, such as the DNN, that employs particle swarm optimization (PSO) and firefly algorithm (FA). The experimental outcomes indicated that the proposed model embraces an astounding detection rate of 99.96%, indicating its efficacy in detecting intrusions. The experimental findings of this research contribute to the development of an effective and more accurate intrusion detection system (IDS) for IoMT environments.",
    "citationCount": 0,
    "referenceCount": 23
}