{
    "paperId": "967733d62d1819986b96bb123d3eaa3fb3d6c4d4",
    "title": "Pig pangenome graph reveals functional features of non-reference sequences",
    "year": 2024,
    "venue": "Journal of Animal Science and Biotechnology",
    "authors": [
        "Jian Miao",
        "Xingyu Wei",
        "Caiyun Cao",
        "Jiabao Sun",
        "Yuejin Xu",
        "Zhe Zhang",
        "Qishan Wang",
        "Yuchun Pan",
        "Zhen Wang"
    ],
    "doi": "10.1186/s40104-023-00984-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/967733d62d1819986b96bb123d3eaa3fb3d6c4d4",
    "isOpenAccess": true,
    "openAccessPdf": "https://jasbsci.biomedcentral.com/counter/pdf/10.1186/s40104-023-00984-4",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background The reliance on a solitary linear reference genome has imposed a significant constraint on our comprehensive understanding of genetic variation in animals. This constraint is particularly pronounced for non-reference sequences (NRSs), which have not been extensively studied. Results In this study, we constructed a pig pangenome graph using 21 pig assemblies and identified 23,831 NRSs with a total length of 105 Mb. Our findings revealed that NRSs were more prevalent in breeds exhibiting greater genetic divergence from the reference genome. Furthermore, we observed that NRSs were rarely found within coding sequences, while NRS insertions were enriched in immune-related Gene Ontology terms. Notably, our investigation also unveiled a close association between novel genes and the immune capacity of pigs. We observed substantial differences in terms of frequencies of NRSs between Eastern and Western pigs, and the heat-resistant pigs exhibited a substantial number of NRS insertions in an 11.6 Mb interval on chromosome X. Additionally, we discovered a 665 bp insertion in the fourth intron of the TNFRSF19 gene that may be associated with the ability of heat tolerance in Southern Chinese pigs. Conclusions Our findings demonstrate the potential of a graph genome approach to reveal important functional features of NRSs in pig populations.",
    "citationCount": 5,
    "referenceCount": 74
}