{
    "paperId": "96b5009bbd03b6826fe73267a54f57a911c450cc",
    "title": "“I See You!”: A Design Framework for Interface Cues about Agent Visual Perception from a Thematic Analysis of Videogames",
    "year": 2022,
    "venue": "International Conference on Human Factors in Computing Systems",
    "authors": [
        "Matthew Rueben",
        "M. R. Horrocks",
        "J. E. Martinez",
        "M. Cormier",
        "Embry-Riddle Aeronautical",
        "Nicolas J. Lalone",
        "Toups Dugas"
    ],
    "doi": "10.1145/3491102.3517699",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/96b5009bbd03b6826fe73267a54f57a911c450cc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As artificial agents proliferate, there will be more and more situations in which they must communicate their capabilities to humans, including what they can “see.” Artificial agents have existed for decades in the form of computer-controlled agents in videogames. We analyze videogames in order to not only inspire the design of better agents, but to stop agent designers from replicating research that has already been theorized, designed, and tested in-depth. We present a qualitative thematic analysis of sight cues in videogames and develop a framework to support human-agent interaction design. The framework identifies the different locations and stimulus types – both visualizations and sonifications – available to designers and the types of information they can convey as sight cues. Insights from several other cue properties are also presented. We close with suggestions for implementing such cues with existing technologies to improve the safety, privacy, and efficiency of human-agent interactions.",
    "citationCount": 4,
    "referenceCount": 150
}