{
    "paperId": "96bd614cd395265599f3c74d34e768360f322ab5",
    "title": "Design Space Exploration of Heterogeneous-Accelerator SoCs with Hyperparameter Optimization",
    "year": 2021,
    "venue": "Asia and South Pacific Design Automation Conference",
    "authors": [
        "Thanh Cong",
        "François Charot"
    ],
    "doi": "10.1145/3394885.3431415",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/96bd614cd395265599f3c74d34e768360f322ab5",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.inria.fr/hal-03119732/file/cong_aspdac2021.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern SoC systems consist of general-purpose processor cores augmented with large numbers of specialized accelerators. Building such systems requires a design flow allowing the design space to be explored at the system level with an appropriate strategy. In this paper, we describe a methodology allowing to explore the design space of power-performance heterogeneous SoCs by combining an architecture simulator (gem5-Aladdin) and a hyperparameter optimization method (Hyperopt). This methodology allows different types of parallelism with loop unrolling strategies and memory coherency interfaces to be swept. The flow has been applied to a convolutional neural network algorithm. We show that the most energy efficient architecture achieves a 2x to 4x improvement in energy-delay-product compared to an architecture without parallelism. Furthermore, the obtained solution is more efficient than commonly implemented architectures (Systolic, 2D-mapping, and Tiling). We also applied the methodology to find the optimal architecture including its coherency interface for a complex SoC made up of six accelerated-workloads. We show that a hybrid interface appears to be the most efficient; it reaches 22% and 12% improvement in energy-delay-product compared to just only using non-coherent and only LLC-coherent models, respectively.",
    "citationCount": 2,
    "referenceCount": 28
}