{
    "paperId": "96e8dad822628d4f3dd1f1ce316bc988f3ce7495",
    "title": "Research and implementation of a site matching algorithm based on mobile phone signaling data",
    "year": 2023,
    "venue": "Other Conferences",
    "authors": [
        "Lihua Song",
        "Lei Yu",
        "Yang Zhang"
    ],
    "doi": "10.1117/12.3011604",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/96e8dad822628d4f3dd1f1ce316bc988f3ce7495",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aiming at the problem of difficult accurate differentiation between public transportation and private cars in current research, a station matching algorithm based on mobile phone signaling data is proposed to address issues such as low frequency and unstable collection frequency of mobile phone signaling data, and low positioning accuracy. The algorithm utilizes the average speed between neighboring base stations that the user's phone is connected to during travel to infer the traffic status of a road segment. By comparing the average speed of the road segment with the median average speed of the entire trajectory, the algorithm determines whether the road segment contains important traffic nodes, such as bus stops or intersections, and calculates the station density of the entire trajectory to further verify the results predicted by the existing classification model. Experimental results show that the algorithm can significantly improve the identification accuracy of buses and private cars. Compared with using machine classification methods alone, the accuracy has increased by 11%, reaching 94%, which can provide strong support for the collection and analysis of traffic information.",
    "citationCount": 0,
    "referenceCount": 11
}