{
    "paperId": "9714251f4bdbd8ecfce7464a1305422ec46fbd9a",
    "title": "Robust machine-learned algorithms for efficient grid operation",
    "year": 2025,
    "venue": "Environmental Data Science",
    "authors": [
        "Nicolas Christianson",
        "Christopher Yeh",
        "Tongxin Li",
        "Mehdi Hosseini",
        "Mahdi Torabi Rad",
        "A. Golmohammadi",
        "Adam Wierman"
    ],
    "doi": "10.1017/eds.2024.28",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9714251f4bdbd8ecfce7464a1305422ec46fbd9a",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1017/eds.2024.28",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Increasing penetration of variable and intermittent renewable energy resources on the energy grid poses a challenge for reliable and efficient grid operation, necessitating the development of algorithms that are robust to this uncertainty. However, standard algorithms incorporating uncertainty for generation dispatch are computationally intractable when costs are nonconvex, and machine learning-based approaches lack worst-case guarantees on their performance. In this work, we propose a learning-augmented algorithm, RobustML, that exploits the good average-case performance of a machine-learned algorithm for minimizing dispatch and ramping costs of dispatchable generation resources while providing provable worst-case guarantees on cost. We evaluate the algorithm on a realistic model of a combined cycle cogeneration plant, where it exhibits robustness to distribution shift while enabling improved efficiency as renewables penetration increases.",
    "citationCount": 0,
    "referenceCount": 46
}