{
    "paperId": "975617a16d701594a9268b6c37c538569b2a5190",
    "title": "An Effective Feature Extraction Method for Tomato Leafminer - Tuta Absoluta (Meyrick) (Lepidoptera: Gelechiidae) Classification",
    "year": 2025,
    "venue": "Brazilian Archives of Biology and Technology",
    "authors": [
        "Tahsin Uygun",
        "Serhat Kılıçarslan",
        "Cemil Közkurt",
        "M. Ozguven"
    ],
    "doi": "10.1590/1678-4324-2025240501",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/975617a16d701594a9268b6c37c538569b2a5190",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1590/1678-4324-2025240501",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Global warming caused by climate change causes some problems in agricultural production. One of these problems is the increase in various pest populations. This increase poses a serious threat to agricultural products and significantly negatively affects productivity and quality. Insecticides are commonly used to combat pests. However, most of the time, farmers' lack of knowledge in recognizing pests and understanding their effects results in incorrect and excessive spray applications. While excessive use of insecticides harms human health and environmental pollution, it also increases production costs, causes changes in the genetic structures of pests, causing them to become more resistant, and makes agricultural control difficult. Therefore, early detection of pests and their damage to the plant is extremely important. This study aims to develop an accurate and efficient method to detect damage caused by the tomato leaf miner, Tuta absoluta, on tomato leaves. A dataset comprising healthy and damaged tomato leaves was created. Using a hybrid approach, features were extracted through Convolutional Neural Networks (CNNs) with transfer learning and classified using traditional machine learning techniques. Among the methods evaluated, SVM-Linear achieved the highest accuracy with 97.83%, outperforming other classifiers such as Random Forest with 96.14%, Rotation Forest with 95.89%, and SVM-RBF with 90.70%. These results highlight the potential of combining deep learning-based feature extraction with conventional machine learning for early pest detection. This approach offers a practical solution to reduce the misuse of insecticides and improve pest management strategies, contributing to sustainable agriculture.",
    "citationCount": 0,
    "referenceCount": 53
}