{
    "paperId": "97779bc0f3888140fc2bf5d978c2ae54d52f303f",
    "title": "Reinforcement Learning-Based Dynamic Voltage and Frequency Scaling for Energy-Efficient Computing",
    "year": 2024,
    "venue": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)",
    "authors": [
        "Prasanta Panda",
        "Aruna Tripathy",
        "Kanhu Charan Bhuyan"
    ],
    "doi": "10.1109/ICDCECE60827.2024.10549241",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/97779bc0f3888140fc2bf5d978c2ae54d52f303f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The surge in demand for energy-efficient computing has spurred the exploration of cutting-edge techniques to optimize power consumption in modern computing systems. Though the traditional implementation of Dynamic Voltage and Frequency Scaling (DVFS) has proven effective, their traditional implementations lack adaptability, limiting their ability to fully exploit dynamic workload variations. This research presents an innovative solution by integrating proposed Reinforcement Learning (RL) algorithms into DVFS, addressing the limitations of conventional methods. The proposed RL algorithm employs Q-Iearning, a model-free RL technique, to iteratively learn the optimal policy for adjusting CPU voltage and frequency. Our customized algorithm enables autonomous real-time adjustments of voltage and frequency levels, showcasing a remarkable 20% power saving compared to conventional DVFS. The model's adaptability is evident in its capacity to achieve optimal configurations across diverse workloads, emphasizing RL's potential for enhancing energy efficiency in computing systems. As energy efficiency gains paramount importance, this research underscores the pivotal role of RL, in achieving sustainable and optimal performance in computing systems.",
    "citationCount": 1,
    "referenceCount": 17
}