{
    "paperId": "97e8e9ad3862629bacb28b994f2d5d52a2371c00",
    "title": "Extract-Transform-Load for Video Streams",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Ferdinand Kossmann",
        "Ziniu Wu",
        "Eugenie Lai",
        "N. Tatbul",
        "Lei Cao",
        "Tim Kraska",
        "S. Madden"
    ],
    "doi": "10.14778/3598581.3598600",
    "arxivId": "2310.04830",
    "url": "https://www.semanticscholar.org/paper/97e8e9ad3862629bacb28b994f2d5d52a2371c00",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.04830",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Social media, self-driving cars, and traffic cameras produce video streams at large scales and cheap cost. However, storing and querying video at such scales is prohibitively expensive. We propose to treat large-scale video analytics as a data warehousing problem: Video is a format that is easy to produce but needs to be transformed into an application-specific format that is easy to query. Analogously, we define the problem of Video Extract-Transform-Load (\n V-ETL\n ).\n V-ETL\n systems need to reduce the cost of running a user-defined\n V-ETL\n job while also giving throughput guarantees to keep up with the rate at which data is produced. We find that no current system sufficiently fulfills both needs and therefore propose\n Skyscraper\n , a system tailored to\n V-ETL. Skyscraper\n can execute arbitrary video ingestion pipelines and adaptively tunes them to reduce cost at minimal or no quality degradation, e.g., by adjusting sampling rates and resolutions to the ingested content.\n Skyscraper\n can hereby be provisioned with cheap on-premises compute and uses a combination of buffering and cloud bursting to deal with peaks in workload caused by expensive processing configurations. In our experiments, we find that\n Skyscraper\n significantly reduces the cost of\n V-ETL\n ingestion compared to adaptions of current SOTA systems, while at the same time giving robustness guarantees that these systems are lacking.\n",
    "citationCount": 17,
    "referenceCount": 93
}