{
    "paperId": "987d599084f580313ac269b608dc165cf3c37460",
    "title": "A Survey of Machine Learning-Based System Performance Optimization Techniques",
    "year": 2021,
    "venue": "Applied Sciences",
    "authors": [
        "Hyejeong Choi",
        "Sejin Park"
    ],
    "doi": "10.3390/APP11073235",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/987d599084f580313ac269b608dc165cf3c37460",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/11/7/3235/pdf?version=1617940253",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, the machine learning research trend expands to the system performance optimization field, where it has still been proposed by researchers based on their intuitions and heuristics. Compared to conventional major machine learning research areas such as image or speech recognition, machine learning-based system performance optimization fields are at the beginning stage. However, recent papers show that this approach is promising and has significant potential. This paper reviews 11 machine learning-based system performance optimization approaches from nine recent papers based on well-known machine learning models such as perceptron, LSTM, and RNN. This survey provides a detailed design and summarizes model, input, output, and prediction method of each approach. This paper covers various system performance areas from the data structure to essential system components of a computer system such as index structure, branch predictor, sort, and cache management. The result shows that machine learning-based system performance optimization has an important potential for future research. We expect that this paper shows a wide range of applicability of machine learning technology and provides a new perspective for system performance optimization.",
    "citationCount": 18,
    "referenceCount": 39
}