{
    "paperId": "989812379b9cdc65b1f4c31b25a573221c7f45df",
    "title": "Performance, Energy and Parallelism: Using Near Data Processing in Utility and Cloud Computing",
    "year": 2022,
    "venue": "International Conference on Utility and Cloud Computing",
    "authors": [
        "G. Agha",
        "Dipayan Mukherjee",
        "Atul Sandur"
    ],
    "doi": "10.1109/UCC56403.2022.00031",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/989812379b9cdc65b1f4c31b25a573221c7f45df",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Massive amounts of data are generated by sensor networks, edge computers, IoT devices, and enterprise networks. To process this volume of data requires (1) a scalable programming model that is not only concurrent and distributed, but supports the mobility of data and processes (actors), and (2) algorithms to distribute computations between nodes in a manner that improves overall performance while considering energy use in the system. With appropriate programming tools, we can distribute a given computation in a way that makes effective use of edge devices to improve performance while lowering energy consumption. The paper describes our work building on ideas based on the Actor model of computation. These include characterizing the relation of performance and energy consumption in parallel computation, and methods to support scalable placement mechanisms under dynamically changing network conditions and computational loads on edge devices. The paper will conclude with a presentation with a summary of open research problems.",
    "citationCount": 1,
    "referenceCount": 43
}