{
    "paperId": "98cd78e31451b64940ba7f0e82322bc662acfb52",
    "title": "AQORA: A Fast Learned Adaptive Query Optimizer with Stage-Level Feedback for Spark SQL",
    "year": 2025,
    "venue": "",
    "authors": [
        "Jiahao He",
        "Yutao Cui",
        "Cuiping Li",
        "Jikang Jiang",
        "Yuheng Hou",
        "Hong Chen"
    ],
    "doi": null,
    "arxivId": "2510.10580",
    "url": "https://www.semanticscholar.org/paper/98cd78e31451b64940ba7f0e82322bc662acfb52",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent studies have identified two main approaches to improve query optimization: learned query optimization (LQO), which generates or selects better query plans before execution based on models trained in advance, and adaptive query processing (AQP), which adapts the query plan during execution based on statistical feedback collected at runtime. Although both approaches have shown promise, they also face critical limitations. LQO must commit to a fixed plan without access to actual cardinalities and typically rely on a single end-to-end feedback signal, making learning inefficient. On the other hand, AQP depends heavily on rule-based heuristics and lacks the ability to learn from experience. In this paper, we present AQORA, a learned adaptive query optimizer that continuously refines query plans through stage-level feedback, unifying pre-execution and in-execution optimization within a single learning process. AQORA addresses the above challenges through four core strategies: (1) realistic feature encoding, (2) query stage-level feedback and intervention, (3) automatic strategy adaptation, and (4) low-cost integration. Experiments show that AQORA reduces end-to-end execution time by up to 90% compared to other learned methods and by up to 70% compared to Spark SQL's default configuration with adaptive query execution.",
    "citationCount": 0,
    "referenceCount": 38
}