{
    "paperId": "98eac6ec3cc354cf8f0cf59174289f47d3678e5c",
    "title": "Rate-Splitting MIMO Multiple Access — An Amortized Optimization Approach",
    "year": 2024,
    "venue": "Asilomar Conference on Signals, Systems and Computers",
    "authors": [
        "Jeremy Johnston",
        "Xiaodong Wang"
    ],
    "doi": "10.1109/IEEECONF60004.2024.10943008",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/98eac6ec3cc354cf8f0cf59174289f47d3678e5c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Next-generation wireless technologies such as rate-splitting multiple access (RSMA) and massive MIMO are char-acterized by optimization problems too complex to solve in real-time, hence suboptimal heuristics are adopted in practice. As we explore in this paper, machine learning techniques have the potential to upend this paradigm, offering new algorithms for obtaining near-optimal solutions to a desired class of optimization problems. We consider downlink beamforming optimization (sum rate maximization and max-min fairness) for a MISO interference channel employing RSMA and a large antenna array (up to 64 elements). At such a scale, the linear-MMSE beamformers are the state-of-the-art since the optimal beamformers are too complex to compute. We apply the framework of amortized opti-mization to obtain an iterative operator that designs beamformers with much less computation than existing optimization algorithms (weighted-MMSE) and whose complexity scales linearly with the size of the antenna array. Our simulation results show that the learned optimizer is competitive with state-of-the-art numerical optimization in terms of sum rate, but requires a fraction of the computational cost. For the max-min fairness problem, the learned optimizer outperforms all baseline methods.",
    "citationCount": 0,
    "referenceCount": 16
}