{
    "paperId": "991acb01b86210559c67ad0b350690d5d3536652",
    "title": "Conformal Prediction for STL Runtime Verification",
    "year": 2022,
    "venue": "Allerton Conference on Communication, Control, and Computing",
    "authors": [
        "Lars Lindemann",
        "Xin Qin",
        "Jyotirmoy V. Deshmukh",
        "George Pappas"
    ],
    "doi": "10.1145/3576841.3585927",
    "arxivId": "2211.01539",
    "url": "https://www.semanticscholar.org/paper/991acb01b86210559c67ad0b350690d5d3536652",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.01539",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We are interested in predicting failures of learning-enabled systems during their operation. Particularly, we consider stochastic learning-enabled systems and signal temporal logic specifications, and we want to calculate the probability that the current system trajectory will violate the specification. The paper presents two predictive runtime verification algorithms that predict future system states from the current observed system trajectory. As these predictions may not be accurate, we construct prediction regions that quantify prediction uncertainty by using conformal prediction, a statistical tool for uncertainty quantification. Our first algorithm directly constructs a prediction region for the satisfaction measure of the specification so that we can predict specification violations with a desired confidence. The second algorithm constructs prediction regions for future system states first, and uses these to obtain a prediction region for the satisfaction measure. To the best of our knowledge, these are the first formal guarantees for a predictive runtime verification algorithm that applies to widely used trajectory predictors such as RNNs and LSTMs, while being computationally simple and making no assumptions on the underlying distribution. We present numerical experiments of an F-16 aircraft and a self-driving car.",
    "citationCount": 58,
    "referenceCount": 93
}