{
    "paperId": "997eb230e687424c2efdf78a46ddb726511fa8cd",
    "title": "Foodborne Event Detection Based on Social Media Mining: A Systematic Review",
    "year": 2025,
    "venue": "Foods",
    "authors": [
        "Silvano Salaris",
        "H. Ocagli",
        "Alessandra Casamento",
        "C. Lanera",
        "D. Gregori"
    ],
    "doi": "10.3390/foods14020239",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/997eb230e687424c2efdf78a46ddb726511fa8cd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Foodborne illnesses represent a significant global health challenge, causing substantial morbidity and mortality. Conventional surveillance methods, such as laboratory-based reporting and physician notifications, often fail to enable early detection, prompting the exploration of innovative solutions. Social media platforms, combined with machine learning (ML), offer new opportunities for real-time monitoring and outbreak analysis. This systematic review evaluated the role of social networks in detecting and managing foodborne illnesses, particularly through the use of ML techniques to identify unreported events and enhance outbreak response. This review analyzed studies published up to December 2024 that utilized social media data and data mining to predict and prevent foodborne diseases. A comprehensive search was conducted across PubMed, EMBASE, CINAHL, Arxiv, Scopus, and Web of Science databases, excluding clinical trials, case reports, and reviews. Two independent reviewers screened studies using Covidence, with a third resolving conflicts. Study variables included social media platforms, ML techniques (shallow and deep learning), and model performance, with a risk of bias assessed using the PROBAST tool. The results highlighted Twitter and Yelp as primary data sources, with shallow learning models dominating the field. Many studies were identified as having high or unclear risk of bias. This review underscored the potential of social media and ML in foodborne disease surveillance and emphasizes the need for standardized methodologies and further exploration of deep learning models.",
    "citationCount": 3,
    "referenceCount": 64
}