{
    "paperId": "9998119cea46871748f86a53d2516ad0b0d8c459",
    "title": "Energy Consumption Prediction Using Machine Learning; A Review",
    "year": 2019,
    "venue": "",
    "authors": [
        "Amir Mosavi",
        "A. Bahmani"
    ],
    "doi": "10.20944/PREPRINTS201903.0131.V1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9998119cea46871748f86a53d2516ad0b0d8c459",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.20944/preprints201903.0131.v1",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) methods has recently contributed very well in the advancement of the prediction models used for energy consumption. Such models highly improve the accuracy, robustness, and precision and the generalization ability of the conventional time series forecasting tools. This article reviews the state of the art of machine learning models used in the general application of energy consumption. Through a novel search and taxonomy the most relevant literature in the field are classified according to the ML modeling technique, energy type, perdition type, and the application area. A comprehensive review of the literature identifies the major ML methods, their application and a discussion on the evaluation of their effectiveness in energy consumption prediction. This paper further makes a conclusion on the trend and the effectiveness of the ML models. As the result, this research reports an outstanding rise in the accuracy and an ever increasing performance of the prediction technologies using the novel hybrid and ensemble prediction models.",
    "citationCount": 53,
    "referenceCount": 524
}