{
    "paperId": "99b49a53cc427d048a97dfea97378d63d9eee10b",
    "title": "A Six-Word Story on the Future of VLSI: AI-driven, Software-defined, and Uncomfortably Exciting",
    "year": 2023,
    "venue": "2023 IEEE Symposium on VLSI Technology and Circuits (VLSI Technology and Circuits)",
    "authors": [
        "Parthasarathy Ranganathan"
    ],
    "doi": "10.23919/VLSITechnologyandCir57934.2023.10185339",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/99b49a53cc427d048a97dfea97378d63d9eee10b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We are at an interesting inflection point in the design of computing systems. On one hand, demand for computing is accelerating at phenomenal rates, powered by the AI revolution and ever deeper processing on larger volumes of data, and amplified by smart edge devices and cloud computing. On the other hand, Moore’s law is slowing down. This is challenging traditional assumptions around cheaper and more energy-efficient systems every generation, and leading to a significant supply-demand gap for future computing systems. In this paper, we discuss how this current computing landscape motivates a significant rethinking of how we design future hardware. We present two broad themes around (1) efficient design of hardware through custom silicon accelerators and (2) efficient utilization of hardware through software-defined systems design. Summarizing our experience in these areas, we identify key learnings and future opportunities for innovation. Looking ahead, we discuss some additional grand challenges and opportunities for the community, specifically touching on key themes around agility, modularity, reliability, and sustainability, as well as the disruptive potential of using machine learning for hardware design, and the opportunities beyond compute, around storage.",
    "citationCount": 1,
    "referenceCount": 21
}