{
    "paperId": "99e8ea1ec61bb4fc1beabefb5d73c0ee78f4ad30",
    "title": "Learning-Augmented Decentralized Online Convex Optimization in Networks",
    "year": 2025,
    "venue": "Measurement and Modeling of Computer Systems",
    "authors": [
        "Pengfei Li",
        "Jianyi Yang",
        "Adam Wierman",
        "Shaolei Ren"
    ],
    "doi": "10.1145/3744970.3727293",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/99e8ea1ec61bb4fc1beabefb5d73c0ee78f4ad30",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper studies learning-augmented decentralized online convex optimization in a networked multi-agent system, a challenging setting that has remained under-explored. We first consider a linear learning-augmented decentralized online algorithm (LADO-Lin) that combines a machine learning (ML) policy with a baseline expert policy in a linear manner. We show that, while LADO-Lin can exploit the potential of ML predictions to improve the average cost performance, it cannot have guaranteed worst-case performance. To address this limitation, we propose a novel online algorithm (LADO) that adaptively combines the ML policy and expert policy to safeguard the ML predictions to achieve strong competitiveness guarantees. We also prove the average cost bound for LADO, revealing the tradeoff between average performance and worst-case robustness and demonstrating the advantage of training the ML policy by explicitly considering the robustness requirement. Finally, we run an experiment on decentralized battery management. Our results highlight the potential of ML augmentation to improve the average performance as well as the guaranteed worst-case performance of LADO.",
    "citationCount": 1,
    "referenceCount": 5
}