{
    "paperId": "9a0123ef15273442aede2aca40a3402be3494cf3",
    "title": "FiNN: A toolbox for neurophysiological network analysis",
    "year": 2022,
    "venue": "bioRxiv",
    "authors": [
        "Maximilian Scherer",
        "Tianlu Wang",
        "R. Guggenberger",
        "L. Milosevic",
        "A. Gharabaghi"
    ],
    "doi": "10.1162/netn_a_00265",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a0123ef15273442aede2aca40a3402be3494cf3",
    "isOpenAccess": true,
    "openAccessPdf": "https://direct.mit.edu/netn/article-pdf/doi/10.1162/netn_a_00265/2054775/netn_a_00265.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, neuroscience has seen a shift from localist approaches to network-wide investigations of brain function. Neurophysiological signals across different spatial and temporal scales provide an informative insight into neural communication. However, additional methodological considerations arise when investigating network-wide brain dynamics rather than local effects. Specifically, larger amounts of data, investigated across a higher dimensional space, are necessary. Here, we present FiNN (Find Neurophysiological Networks), a novel toolbox for the analysis of neurophysiological data with a focus on functional and effective connectivity. FiNN provides a wide range of data processing methods, introduces new methodological developments to acquire efficient and reliable connectivity estimates that build on already existing concepts, and statistical and visualization tools to facilitate inspection of connectivity estimates and the resulting metrics of brain dynamics. The toolbox is freely available in Python (https://github.com/neurophysiological-analysis/FiNN), and complemented by online documentation (https://neurophysiological-analysis.github.io/FiNN/). To highlight the properties of our toolbox, we evaluated FiNN against a number of established frameworks on both a conceptual and an implementation level. We found FiNN to require much less processing time and memory than other toolboxes. In addition, FiNN adheres to a design philosophy of easy access and modifiability, while providing efficient data processing implementations. Since the investigation of network-level neural dynamics is experiencing increasing interest, we place FiNN at the disposal of the neuroscientific community as open-source software. Highlights - Investigation of network-wide brain dynamics requires specialized software. - We provide a toolbox to ease the pre-processing and analysis steps of the investigation. - FiNN requires less processing time and memory in comparison to other toolboxes. - Extensive documentation facilitates usage by users from various technical backgrounds.",
    "citationCount": 9,
    "referenceCount": 84
}