{
    "paperId": "9a0860720d61104bd8eebdeb5ded2e029433c7b0",
    "title": "Db2une: Tuning Under Pressure via Deep Learning",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Alexander Bianchi",
        "Andrew Chai",
        "Vincent Corvinelli",
        "P. Godfrey",
        "Jaroslaw Szlichta",
        "C. Zuzarte"
    ],
    "doi": "10.14778/3685800.3685811",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a0860720d61104bd8eebdeb5ded2e029433c7b0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Modern database systems including IBM Db2 have numerous parameters, \"knobs,\" that require precise configuration to achieve optimal workload performance. Even for experts, manually \"tuning\" these knobs is a challenging process. We present Db2une, an automatic query-aware tuning system that leverages\n deep learning\n to maximize performance while minimizing resource usage. Via a specialized transformer-based query-embedding pipeline we name QBERT, Db2une generates context-aware representations of query workloads to feed as input to a stability-oriented, on-policy deep reinforcement learning model. In Db2une, we introduce a multi-phased, database meta-data driven training approach---which incorporates cost estimates, interpolation of these costs, and database statistics---to efficiently discover optimal tuning configurations without the need to execute queries. Thus, our model can scale to very large workloads, for which executing queries would be prohibitively expensive. Through experimental evaluation, we demonstrate Db2une's efficiency and effectiveness over a variety of workloads. We compare it against the state-of-the-art query-aware tuning systems and show that the system provides recommendations that surpass those of IBM experts.\n",
    "citationCount": 3,
    "referenceCount": 44
}