{
    "paperId": "9a2aa9faa228d12f994d12190fd404f5d1fad36a",
    "title": "Exploring Topography Downscaling Methods for Hyper‐Resolution Land Surface Modeling",
    "year": 2024,
    "venue": "Journal of Geophysical Research: Atmospheres",
    "authors": [
        "Sisi Chen",
        "Lu Li",
        "Zhongwang Wei",
        "Nan Wei",
        "Yonggen Zhang",
        "Shupeng Zhang",
        "Hua Yuan",
        "Shangguan Wei",
        "Shulei Zhang",
        "Qingliang Li",
        "Yongjiu Dai"
    ],
    "doi": "10.1029/2024JD041338",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a2aa9faa228d12f994d12190fd404f5d1fad36a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hyper‐resolution land surface modeling provides an unprecedented opportunity to simulate locally relevant water and energy cycles. However, the available meteorological forcing data is often insufficient to fulfill the requirements of hyper‐resolution modeling. Here, we developed a comprehensive downscaling framework based on topography‐adjusted methods and automated machine learning (AutoML). With this framework, a 90 m and hourly atmospheric forcing data set was developed from ERA5 data at a 0.25° resolution, and the Common Land Model (CoLM) was then forced with the developed forcing data over two complex terrain regions (the Heihe River Basin and Upper Colorado River Basin). We systematically evaluated the downscaled forcing and the CoLM outputs against both in situ observations and gridded data. The ground‐based validation results suggested consistent improvements for all downscaled forcing variables with mean RMSE improved by 6.362%–95.86%. The downscaled forcings, which incorporated detailed topographic features, offered improved magnitude estimates, achieving a comparable level of performance to that of regional reanalysis forcing data. The downscaled forcing driving the CoLM model showed comparable or better skills in simulating water and energy fluxes, as verified by in situ validations. The hyper‐resolution simulations provided a detailed and more reasonable description of land surface processes and attained similar spatial patterns and magnitudes with high‐resolution land surface data, especially over highly elevated areas. Additionally, this study highlighted the benefits of using mountain radiation theory‐based shortwave radiation downscaling models and AutoML‐assisted precipitation downscaling models. These findings emphasized the significance of integrating topography‐based downscaling methods for hillslope‐scale simulations.",
    "citationCount": 3,
    "referenceCount": 33
}