{
    "paperId": "9a3329514b1de66ef2839324a33bfaf3d91f2e2b",
    "title": "AI Meets Database: AI4DB and DB4AI",
    "year": 2021,
    "venue": "SIGMOD Conference",
    "authors": [
        "Guoliang Li",
        "Xuanhe Zhou",
        "Lei Cao"
    ],
    "doi": "10.1145/3448016.3457542",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a3329514b1de66ef2839324a33bfaf3d91f2e2b",
    "isOpenAccess": true,
    "openAccessPdf": "https://dspace.mit.edu/bitstream/1721.1/145960/1/3448016.3457542.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database and Artificial Intelligence (AI) can benefit from each other. On one hand, AI can make database more intelligent (AI4DB). For example, traditional empirical database optimization techniques (e.g., cost estimation, join order selection, knob tuning, index and view advisor) cannot meet the high-performance requirement for large-scale database instances, various applications and diversified users, especially on the cloud. Fortunately, learning-based techniques can alleviate this problem. On the other hand, database techniques can optimize AI models (DB4AI). For example, AI is hard to deploy, because it requires developers to write complex codes and train complicated models. Database techniques can be used to reduce the complexity of using AI models, accelerate AI algorithms and provide AI capability inside databases. DB4AI and AI4DB have been extensively studied recently. In this tutorial, we review existing studies on AI4DB and DB4AI. For AI4DB, we review the techniques on learning-based database configuration, optimization, design, monitoring, and security. For DB4AI, we review AI-oriented declarative language, data governance, training acceleration, and inference acceleration. Finally, we provide research challenges and future directions in AI4DB and DB4AI.",
    "citationCount": 100,
    "referenceCount": 89
}