{
    "paperId": "9a48df72b4d789929b636cd528cc25820d33ae16",
    "title": "The Vertical Cuckoo Filters: A Family of Insertion-friendly Sketches for Online Applications",
    "year": 2021,
    "venue": "IEEE International Conference on Distributed Computing Systems",
    "authors": [
        "Pengtao Fu",
        "Lailong Luo",
        "Shangsen Li",
        "Deke Guo",
        "Geyao Cheng",
        "Yun Zhou"
    ],
    "doi": "10.1109/ICDCS51616.2021.00015",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a48df72b4d789929b636cd528cc25820d33ae16",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cuckoo filter (CF) and its variants are emerging as replacements of Bloom filters in various networking and distributed systems to support efficient set representation and membership testing. Cuckoo filters store item fingerprints directly with two candidate buckets and a reallocation scheme is implemented to mitigate the bucket overflow problem for higher space utilization. Such a reallocation scheme, once triggered, however, can be time-consuming. This shortcoming makes the existing CFs not applicable for insertion-intensive scenarios such as online applications wherein the items join and leave frequently. To this end, in this paper, we propose the Vertical Cuckoo filter (VCF) which extends the standard Cuckoo filter by providing more candidate buckets to each item. Another challenging issue with such a design is how to ensure that the candidate buckets can be indexed by each other such that no additional hash computation and item access are necessary during fingerprint reallocation. Therefore, we present the vertical hashing, which indexes the candidate buckets with the fingerprint and given bitmasks. We further generalize and improve the VCF by realizing $k$ (≥ 4) candidate buckets and avoiding unnecessary computation. The comprehensive experiments indicate that VCF outperforms its same kinds in terms of space utilization and insertion throughput, with a slight compromise of lookup speed.",
    "citationCount": 8,
    "referenceCount": 26
}