{
    "paperId": "9a4cb7416ccf567b9065e350dbd97eff64c9e336",
    "title": "Query Processing in Blockchain Systems: Current State and Future Challenges",
    "year": 2021,
    "venue": "Future Internet",
    "authors": [
        "Dennis Przytarski",
        "Christoph Stach",
        "Clémentine Gritti",
        "B. Mitschang"
    ],
    "doi": "10.3390/fi14010001",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a4cb7416ccf567b9065e350dbd97eff64c9e336",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1999-5903/14/1/1/pdf?version=1640090762",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "When, in 2008, Satoshi Nakamoto envisioned the first distributed database management system that relied on cryptographically secured chain of blocks to store data in an immutable and tamper-resistant manner, his primary use case was the introduction of a digital currency. Owing to this use case, the blockchain system was geared towards efficient storage of data, whereas the processing of complex queries, such as provenance analyses of data history, is out of focus. The increasing use of Internet of Things technologies and the resulting digitization in many domains, however, have led to a plethora of novel use cases for a secure digital ledger. For instance, in the healthcare sector, blockchain systems are used for the secure storage and sharing of electronic health records, while the food industry applies such systems to enable a reliable food-chain traceability, e.g., to prove compliance with cold chains. In these application domains, however, querying the current state is not sufficient—comprehensive history queries are required instead. Due to these altered usage modes involving more complex query types, it is questionable whether today’s blockchain systems are prepared for this type of usage and whether such queries can be processed efficiently by them. In our paper, we therefore investigate novel use cases for blockchain systems and elicit their requirements towards a data store in terms of query capabilities. We reflect the state of the art in terms of query support in blockchain systems and assess whether it is capable of meeting the requirements of such more sophisticated use cases. As a result, we identify future research challenges with regard to query processing in blockchain systems.",
    "citationCount": 24,
    "referenceCount": 149
}