{
    "paperId": "9a605d3df4e9be1acf4b675eccf9d1e5f8edb563",
    "title": "BUAV: A blockchain based secure UAV-assisted data acquisition scheme in Internet of Things",
    "year": 2019,
    "venue": "Journal of Communications and Networks",
    "authors": [
        "A. Islam",
        "Soo Young Shin"
    ],
    "doi": "10.1109/JCN.2019.000050",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a605d3df4e9be1acf4b675eccf9d1e5f8edb563",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/5449605/8896188/08896190.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Internet of things (IoT), mobile edge computing (MEC), and unmanned aerial vehicle (UAV) have attracted significant attention in both industry and academic research. By consolidating these technologies, IoT can be facilitated with improved connectivity, better data transmission, energy saving, and other advantages. However, the communication between these entities is subject to potential cyber threats. In addition, the integrity of the data must be maintained after storing into local storage. Blockchain is a data structure that supports features like pseudonymity, data integrity etc. This paper represents a blockchain based data acquisition process in which information is gathered from IoTs using UAV as a relay and is securely kept in blockchain at MEC server. In the proposed scheme, data are encrypted prior to transfer to MEC server with the assistance of a UAV. Upon receiving the data, MEC server validates the data and the identity of the sender. Successful validation is followed by stocking of the data into blockchain, subsequent to obtaining consent from the validators. Security analysis is conducted in order to show the feasibility of the proposed secure scheme. Finally, the performance of the proposed scheme is analyzed via simulation and implementation.",
    "citationCount": 72,
    "referenceCount": 49
}