{
    "paperId": "9a62b90916250d77ba4dbd44b6b1d86416e872b2",
    "title": "Leaving no patient behind! Expert recommendation in the use of innovative technologies for diagnosing rare diseases",
    "year": 2024,
    "venue": "Orphanet Journal of Rare Diseases",
    "authors": [
        "C. V. van Karnebeek",
        "A. O’Donnell-Luria",
        "Gareth Baynam",
        "A. Baudot",
        "T. Groza",
        "J. J. M. Jans",
        "Timo Lassmann",
        "M. C. V. Letinturier",
        "Stephen B. Montgomery",
        "Peter N. Robinson",
        "S. Sansen",
        "R. Mehrian-Shai",
        "Charles Steward",
        "K. Kosaki",
        "Patricia Durão",
        "B. Sadikovic"
    ],
    "doi": "10.1186/s13023-024-03361-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a62b90916250d77ba4dbd44b6b1d86416e872b2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s13023-024-03361-0",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Genetic diagnosis plays a crucial role in rare diseases, particularly with the increasing availability of emerging and accessible treatments. The International Rare Diseases Research Consortium (IRDiRC) has set its primary goal as: “Ensuring that all patients who present with a suspected rare disease receive a diagnosis within one year if their disorder is documented in the medical literature”. Despite significant advances in genomic sequencing technologies, more than half of the patients with suspected Mendelian disorders remain undiagnosed. In response, IRDiRC proposes the establishment of “a globally coordinated diagnostic and research pipeline”. To help facilitate this, IRDiRC formed the Task Force on Integrating New Technologies for Rare Disease Diagnosis. This multi-stakeholder Task Force aims to provide an overview of the current state of innovative diagnostic technologies for clinicians and researchers, focusing on the patient’s diagnostic journey. Herein, we provide an overview of a broad spectrum of emerging diagnostic technologies involving genomics, epigenomics and multi-omics, functional testing and model systems, data sharing, bioinformatics, and Artificial Intelligence (AI), highlighting their advantages, limitations, and the current state of clinical adaption. We provide expert recommendations outlining the stepwise application of these innovative technologies in the diagnostic pathways while considering global differences in accessibility. The importance of FAIR (Findability, Accessibility, Interoperability, and Reusability) and CARE (Collective benefit, Authority to control, Responsibility, and Ethics) data management is emphasized, along with the need for enhanced and continuing education in medical genomics. We provide a perspective on future technological developments in genome diagnostics and their integration into clinical practice. Lastly, we summarize the challenges related to genomic diversity and accessibility, highlighting the significance of innovative diagnostic technologies, global collaboration, and equitable access to diagnosis and treatment for people living with rare disease.",
    "citationCount": 9,
    "referenceCount": 117
}