{
    "paperId": "9a6c4a55b3aa569bddb595ca17369d8456fd8035",
    "title": "Route Planning Based on Parallel Optimization in the Air-Ground Integrated Network",
    "year": 2023,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Ken Cai",
        "Tianlun Dai",
        "Qinyong Lin",
        "Xinyang Song",
        "Wei Zhou",
        "Qian Zhou",
        "Jinzhan Wei",
        "Feng Wang",
        "Huazhou Chen",
        "Bohan Li"
    ],
    "doi": "10.1109/TITS.2023.3234936",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a6c4a55b3aa569bddb595ca17369d8456fd8035",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advancement in propulsion technologies to reduce the need for travel or increase the share of sustainable unmanned devices has accelerated the shift toward sustainable transport. To achieve the optimization of route planning in the air-ground integrated network (AGIN), we design an optimization strategy of accompanying graph navigation for unmanned devices, which aims to reduce the power consumption and $CO_{2}$ gas emissions. The optimization of accompanying graph navigation is composed of three strategies, namely, the navigation based on the complete maps, the navigation based on the partitioned maps, and the navigation without maps. We propose a Two-tiered Grid (TG) index and Distributed AGIN Navigation (DAN) to navigate on partitioned maps. The top layer of the TG-index is composed of the border vertices of the global road network, which reflects the overall traffic conditions of the global road network and provides coarse-grained navigation routes. The bottom layer is a grid index composed of subgraphs, which reflects traffic conditions in local areas and provides fine-grained navigation routes. The navigation optimization is implemented in several segments, which can be run by multi-processors and realize rapid response to a large number of concurrent queries.",
    "citationCount": 1,
    "referenceCount": 49
}