{
    "paperId": "9a7777c531c1dee089177418d22a022515d4da85",
    "title": "Querying for Interactions",
    "year": 2023,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Ioannis Xarchakos",
        "Nick Koudas"
    ],
    "doi": "10.1109/TKDE.2021.3094997",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9a7777c531c1dee089177418d22a022515d4da85",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep Learning and Computer Vision advances enabled sophisticated information extraction out of images and videos. Recent research aims to make objects, their types and relative locations, first class citizens for query processing purposes. We initiate research to explore declarative queries for real time video streams involving objects and their interactions. We seek to efficiently identify frames in which an object is interacting with another in a specific way. We propose progressive filters (PF) algorithm which deploys a sequence of inexpensive and less accurate filters to detect the presence of query specified objects on frames. We demonstrate that PF derives a least cost sequence of filters given the query objects’ current selectivities. Since selectivities may vary as the video evolves, we present a statistical test to determine when to trigger filters’ re-optimization. Finally, we present Interaction Sheave, a filtering approach that uses learned spatial information about objects and interactions to prune frames that are unlikely to involve the query specified action between them, thus improving the frame processing rate. We present the results of a thorough experimental evaluation involving real datasets. We experimentally demonstrate that our techniques can improve query performance (up to an order of magnitude) while maintaining competitive F1-score.",
    "citationCount": 10,
    "referenceCount": 57
}