{
    "paperId": "9abf0ee98f1ead46253828489a23daa26593190f",
    "title": "Data Analytics and Techniques",
    "year": 2022,
    "venue": "ARO. The Scientific Journal of Koya University",
    "authors": [
        "Safa S. Abdul-Jabbar",
        "Alaa K. Farhan"
    ],
    "doi": "10.14500/aro.10975",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9abf0ee98f1ead46253828489a23daa26593190f",
    "isOpenAccess": true,
    "openAccessPdf": "https://aro.koyauniversity.org/index.php/aro/article/download/975/279",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Big data of different types, such as texts and images, are rapidly generated from the internet and other applications. Dealing with this data using traditional methods is not practical since it is available in various sizes, types, and processing speed requirements. Therefore, data analytics has become an important tool because only meaningful information is analyzed and extracted, which makes it essential for big data applications to analyze and extract useful information. This paper presents several innovative methods that use data analytics techniques to improve the analysis process and data management. Furthermore, this paper discusses how the revolution of data analytics based on artificial intelligence algorithms might provide improvements for many applications. In addition, critical challenges and research issues were provided based on published paper limitations to help researchers distinguish between various analytics techniques to develop highly consistent, logical, and information-rich analyses based on valuable features. Furthermore, the findings of this paper may be used to identify the best methods in each sector used in these publications, assist future researchers in their studies for more systematic and comprehensive analysis and identify areas for developing a unique or hybrid technique for data analysis.",
    "citationCount": 9,
    "referenceCount": 86
}