{
    "paperId": "9ac271160eb4af6db0dbc34450eaa176dc1903d9",
    "title": "Genetic alterations in juvenile cervical clear cell adenocarcinoma unrelated to human papillomavirus",
    "year": 2023,
    "venue": "Frontiers in Medicine",
    "authors": [
        "Yuehui Su",
        "Yiming Zhang",
        "Mengjia Zhou",
        "Ruijin Zhang",
        "Siang-Jyun Chen",
        "Lili Zhang",
        "Hao Wang",
        "D. Zhang",
        "Ting Zhang",
        "Xinqiang Li",
        "Chunyan Zhang",
        "Bingjie Wang",
        "Shuyu Yuan",
        "Mengzhuo Zhang",
        "Ying Zhou",
        "Lili Cao",
        "Mengzhen Zhang",
        "Jianjun Luo"
    ],
    "doi": "10.3389/fmed.2023.1211888",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9ac271160eb4af6db0dbc34450eaa176dc1903d9",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fmed.2023.1211888/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Clear cell adenocarcinoma of the cervix (CCAC) is a special type of HPV-independent cervical cancer. It has a low incidence rate, can be difficult to diagnose early, has a poor prognosis. Its peak incidence is in adolescence, which poses a great threat to women’s health. Therefore, it is very important to explore the pathogenesis of cervical clear cell adenocarcinoma to guide subsequent treatment and prevention. This study analyzed 3 juvenile patients with CCAC diagnosed at the First Affiliated Hospital of Zhengzhou University. Using next-generation sequencing methods, we analyzed the pathogenesis of the patients and their close relatives by analyzing the genetic alterations of patients. CMTM5 was identified as the only shared mutated gene. Using published literature and comparative analyses of related disease-causing genes, 6 of the 19 genes (ALKBH7, MYCBP, MZF1, RNF207, RRS1, and TUSC2) were screened as genes with mutations in patients and had higher mutation rates in reproductive cancers. Pathway analysis showed that downregulated genes in non-HPV cervical cancer were mainly related to the immune system response, suggesting that non-HPV cervical cancer differs from HPV-infected cervical cancer in that the immune response is weaker, which is consistent with the weak correlation with viral infection.",
    "citationCount": 0,
    "referenceCount": 51
}