{
    "paperId": "9ac46fb476a5b49cc4f301c481614390c2783e87",
    "title": "IDToolkit: A Toolkit for Benchmarking and Developing Inverse Design Algorithms in Nanophotonics",
    "year": 2023,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Jia-Qi Yang",
        "Yucheng Xu",
        "Jianwei Shen",
        "Ke-Bin Fan",
        "De-chuan Zhan",
        "Yang Yang"
    ],
    "doi": "10.1145/3580305.3599385",
    "arxivId": "2305.18978",
    "url": "https://www.semanticscholar.org/paper/9ac46fb476a5b49cc4f301c481614390c2783e87",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2305.18978",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aiding humans with scientific designs is one of the most exciting of artificial intelligence (AI) and machine learning (ML), due to their potential for the discovery of new drugs, design of new materials and chemical compounds, etc. However, scientific design typically requires complex domain knowledge that is not familiar to AI researchers. Further, scientific studies involve professional skills to perform experiments and evaluations. These obstacles prevent AI researchers from developing specialized methods for scientific designs. To take a step towards easy-to-understand and reproducible research of scientific design, we propose a benchmark for the inverse design of nanophotonic devices, which can be verified computationally and accurately. Specifically, we implemented three different nanophotonic design problems, namely a radiative cooler, a selective emitter for thermophotovoltaics, and structural color filters, all of which are different in design parameter spaces, complexity, and design targets. The benchmark environments are implemented with an open-source simulator. We further implemented 10 different inverse design algorithms and compared them in a reproducible and fair framework. The results revealed the strengths and weaknesses of existing methods, which shed light on several future directions for developing more efficient inverse design algorithms. Our benchmark can also serve as the starting point for more challenging scientific design problems. The code of IDToolkit is available at https://github.com/ThyrixYang/IDToolkit.",
    "citationCount": 1,
    "referenceCount": 71
}