{
    "paperId": "9b2001dafd505016be1a0774be3ddec41b29ed3d",
    "title": "Uncovering Key Genes Associated with the Short-Winged Trait in Faba Bean (Vicia faba L.) Through Re-Sequencing and Genome-Wide Association Studies (GWASs)",
    "year": 2025,
    "venue": "International Journal of Molecular Sciences",
    "authors": [
        "H. Yu",
        "Chao-Xin Hu",
        "Xin Yang",
        "Qiong Li",
        "Yubao Wang",
        "Zhengming Dai",
        "Jie Cun",
        "Aiqing Zheng",
        "Yanhua Jiang",
        "Qinfang Wang",
        "Meiyuan Lv",
        "Feng Yang",
        "Yuhua He"
    ],
    "doi": "10.3390/ijms26062733",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9b2001dafd505016be1a0774be3ddec41b29ed3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Faba bean (Vicia faba L.) is a globally significant legume valued for its applications in food, vegetables, and green manure, yet its high outcrossing rate (30–80%) poses challenges for production development. A rare short-winged trait identified in Yunnan, China, offers promise for developing low-outcrossing varieties, reducing outcrossing rates to below 5%. Scanning electron microscopy (SEM) and transmission electron microscopy (TEM) analyses revealed that the epidermal cells of normal wing petals are conical, while those of short-wing petals are tubular. This study examined 200 F2 lines from crosses between ‘K0692’ (short-winged) and ‘Yundou 1183’, as well as ‘Yundoulvxin 1’ (short-winged) and ‘Yundou 1183’. The GWASs identified 10 SNP loci across chromosomes 2, 3, 4, and 5, with SNP_chr4::1013887633 explaining 22.20% of the wing trait variation. Key candidate genes were identified, such as VFH_III145120, which influences floral identity; and VFH_III149200, associated with epidermal differentiation. GO enrichment analysis demonstrated significant gene involvement in RNA localization, ribosome biogenesis, and preribosome metabolism, while KEGG analysis linked these genes to pathways in amino acid, nucleotide, and purine metabolism; ubiquitin-mediated proteolysis; and protein processing in the endoplasmic reticulum. These findings lay a foundation for breeding low-outcrossing faba bean varieties and enhancing sustainable faba bean cultivation.",
    "citationCount": 0,
    "referenceCount": 51
}