{
    "paperId": "9b4b999116337098d70ce85d53e0f0607f552756",
    "title": "The Power of Tailoring a Government-Funded Heart Health Program for Marginalized Women: Lessons from WISEWOMAN and Mujer Poderosa/Powerful Woman",
    "year": 2024,
    "venue": "Journal of Public Health Management and Practice",
    "authors": [
        "Molly M. Eggleston",
        "Leigh Anne Schmidt",
        "A. Chaudhari",
        "Thistle I Elias"
    ],
    "doi": "10.1097/PHH.0000000000001922",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9b4b999116337098d70ce85d53e0f0607f552756",
    "isOpenAccess": true,
    "openAccessPdf": "https://journals.lww.com/jphmp/fulltext/2024/07001/the_power_of_tailoring_a_government_funded_heart.5.aspx",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Centers for Disease Control and Prevention’s DP18-1816 Well-Integrated Screening and Evaluation for Women Across the Nation (WISEWOMAN) award to the Pennsylvania Department of Health combats the leading cause of death in Pennsylvania, cardiovascular disease. Pennsylvania’s program (PA-WISE) includes an innovative approach to engage low-income women in cardiovascular disease prevention. PA-WISE collaborated with Latino Connection to pilot Mujer Poderosa/Powerful Woman (MP/PW), utilizing bilingual community health workers to engage, educate, and empower marginalized women to improve their health. Latino Connection discovered different approaches were needed by each community for engaging women and connecting with resources. MP/PW tailored outreach and intervention approaches to women’s needs and expectations, responding to differences in education levels, acculturation, immigration status, and levels of trust. The experiences of MP/PW provide lessons on the importance of having and maintaining flexibility in responding to women’s backgrounds and community characteristics and tailoring to meet the needs of marginalized women.",
    "citationCount": 1,
    "referenceCount": 24
}