{
    "paperId": "9b5e02ca861ea90cc3c70dfb0b60eee88e513420",
    "title": "Understanding Data Access Patterns for dCache System",
    "year": 2024,
    "venue": "EPJ Web of Conferences",
    "authors": [
        "Julian Bellavita",
        "Caitlin Sim",
        "Kesheng Wu",
        "Alex Sim",
        "Shinjae Yoo",
        "Hiro Ito",
        "V. Garonne",
        "E. Lançon"
    ],
    "doi": "10.1051/epjconf/202429501053",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9b5e02ca861ea90cc3c70dfb0b60eee88e513420",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.epj-conferences.org/articles/epjconf/pdf/2024/05/epjconf_chep2024_01053.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The storage management system dCache acts as a disk cache for high-energy physics (HEP) data from the US ATLAS community. Since its disk capacity is considerably smaller than the total volume of ATLAS data, a heuristic is needed to determine what data should be kept on disks. An effective heuristic would be to keep the data files that are expected to be heavily accessed in the near future. Through a careful study of access statistics, we find a few most popular datasets are accessed much more frequently than others, even though these popular datasets change over time. If we could predict the near-term popularity of datasets, we could pin the most popular ones in the disk cache to prevent their accidental removal and guarantee their availability. To predict a dataset popularity, we present several methods for forecasting the number of times a dataset will be accessed in the next day. Test results show that these methods could predict the next-day access counts of popular datasets reliably. This observation is confirmed with dCache logs from two separate time ranges.",
    "citationCount": 1,
    "referenceCount": 10
}