{
    "paperId": "9bb08833e9d84a49d933b1d76c08945704d39296",
    "title": "Genomic Selection in Alfalfa Across Multiple Ploidy Levels: A Comparative Study Using Machine Learning and Bayesian Methods",
    "year": 2024,
    "venue": "Agronomy",
    "authors": [
        "Xiaoyue Zhu",
        "Ruixin Zhang",
        "Tianxiang Zhang",
        "Changhong Guo",
        "Y. Shu"
    ],
    "doi": "10.3390/agronomy14122768",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9bb08833e9d84a49d933b1d76c08945704d39296",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/agronomy14122768",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Agronomic traits and quality traits of alfalfa are of great importance to the feed industry. Genomic selection (GS) based on genotyping-by-sequencing (GBS) data, if it achieves moderate to high accuracy, has the potential to significantly shorten breeding cycles for complex traits and accelerate genetic progress. This study aims to investigate the effect of different reference genomes on the prediction accuracy of genomic selection. A total of 11 Bayesian and machine learning models and nine different reference genomes were used to conduct genomic selection on five traits in 385 alfalfa accessions. The accuracy of GS was evaluated using five-fold cross-validation, based on the correlation between genomic estimated breeding values (GEBVs) and estimated breeding values (EBVs). For the five traits, it was found that traits with high heritability exhibited significantly higher prediction accuracy. The prediction accuracy fluctuated minimally across different reference genomes, with the diploid genome showing relatively higher accuracy. For two high-heritability traits, fall dormancy and plant height, predictions were made after SNP density reduction, and it was observed that density had little effect on prediction accuracy. However, for the fall dormancy trait in the diploid genome, more than half of the models showed regular fluctuations, with prediction accuracy increasing as SNP density increased. In conclusion, this study provides a theoretical basis for precision breeding of alfalfa and other polyploid crops by combining different reference genomes and models, and offers important guidance for optimizing future genomic selection strategies.",
    "citationCount": 1,
    "referenceCount": 48
}