{
    "paperId": "9bc2ef59586ea42ae8a16d9a4d86672addfbd765",
    "title": "Attacks Against Mobility Prediction in 5G Networks",
    "year": 2023,
    "venue": "International Conference on Trust, Security and Privacy in Computing and Communications",
    "authors": [
        "Syafiq Al Atiiq",
        "Yachao Yuan",
        "Christian Gehrmann",
        "Jakob Sternby",
        "Luis Barriga"
    ],
    "doi": "10.1109/TrustCom60117.2023.00205",
    "arxivId": "2402.19319",
    "url": "https://www.semanticscholar.org/paper/9bc2ef59586ea42ae8a16d9a4d86672addfbd765",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2402.19319",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The 5th generation of mobile networks introduces a new Network Function (NF) that was not present in previous generations, namely the Network Data Analytics Function (NWDAF). Its primary objective is to provide advanced analytics services to various entities within the network and also towards external application services in the 5G ecosystem. One of the key use cases of NWDAF is mobility trajectory prediction, which aims to accurately support efficient mobility management of User Equipment (UE) in the network by allocating \"just in time\" necessary network resources. In this paper, we show that there are potential mobility attacks that can compromise the accuracy of these predictions. In a semi-realistic scenario with 10,000 subscribers, we demonstrate that an adversary equipped with the ability to hijack cellular mobile devices and clone them can significantly reduce the prediction accuracy from 75% to 40% using just 100 adversarial UEs. While a defense mechanism largely depends on the attack and the mobility types in a particular area, we prove that a basic KMeans clustering is effective in distinguishing legitimate and adversarial UEs.",
    "citationCount": 2,
    "referenceCount": 42
}