{
    "paperId": "9be11ca48e7f723821941665c02b2386bbcf2a57",
    "title": "Template Matching for 3D Objects in Large Point Clouds Using DBMS",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "D. Varga",
        "J. Szalai-Gindl",
        "B. Formanek",
        "Péter Vaderna",
        "L. Dobos",
        "S. Laki"
    ],
    "doi": "10.1109/ACCESS.2021.3082848",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9be11ca48e7f723821941665c02b2386bbcf2a57",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9312710/09438660.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "LIDAR and depth cameras have gone through a profound technological evolution, making large-scale recording of 3D point cloud data possible which raises new challenges for data processing. Most of the existing 3D point cloud processing methods were developed to work properly when the entire data set fits into the memory of a single server. When point clouds are significantly larger than the main memory and data are only available on slow storage, new approaches are necessary. In this paper, we propose a DBMS-based point cloud processing pipeline that solves the template matching problem, i.e., finding the – potentially multiple – occurrences of a small query point cloud in an extensive scene data set that is preprocessed and stored in a database. The storage layer uses a compact and novel data representation to exploit the benefits of efficient indexing structures whereas the query algorithm consists of a novel combination of existing point cloud processing and matching methods. To the best of our knowledge, this is the first template matching proposal in the literature that exploits the benefits of databases.",
    "citationCount": 4,
    "referenceCount": 46
}