{
    "paperId": "9bed6dd0c08b48841ac7674ecd471b849874cd00",
    "title": "VISUEL - A Web Dynamic Dashboard for DataVisualization",
    "year": 2022,
    "venue": "Journal of Computational Science and Technology",
    "authors": [
        "A. Antonini",
        "M. L. Ganuza",
        "S. Castro"
    ],
    "doi": "10.24215/16666038.22.e03",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9bed6dd0c08b48841ac7674ecd471b849874cd00",
    "isOpenAccess": true,
    "openAccessPdf": "https://journal.info.unlp.edu.ar/JCST/article/download/1949/1569",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data visualization aims to explore and analyze data quickly, interactively, and intuitively using visual representations. Faced with the constant growth of data in terms of volume and diversity, visualization techniques must confront the challenge of dealing with increasingly large datasets in terms of representation, interaction, and performance. Therefore, these techniques must be able to effectively convey the characteristics of the information space and inspire discovery.In this article, we present VISUEL, a web dynamic dashboard for data visualization. VISUEL supports multiple coordinated views, integrating visualization techniques such as scatter plots, parallel coordinates, and box plots, and interactive schematic maps to represent information enriched with spatial references.VISUEL is fully interactive, supporting traditional interactions like filtering, selection, brushing and linking, and zooming, among others. It also allows the user to configure the visual representation of their data, by selecting the color and shape of the representations.We illustrate the usefulness of this tool using real-life data related to the wine industry in Argentina. Important aspects of our case study are discovered through the construction and analysis of multiple views.",
    "citationCount": 4,
    "referenceCount": 56
}