{
    "paperId": "9bfccd237f3e5026ea0be2cef8ad0de885335fbd",
    "title": "With Great Power Comes Great Responsibility: The Role of Software Engineers",
    "year": 2024,
    "venue": "ACM Transactions on Software Engineering and Methodology",
    "authors": [
        "Stefanie Betz",
        "Birgit Penzenstadler"
    ],
    "doi": "10.1145/3715112",
    "arxivId": "2407.08823",
    "url": "https://www.semanticscholar.org/paper/9bfccd237f3e5026ea0be2cef8ad0de885335fbd",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2407.08823",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The landscape of Software Engineering evolves rapidly amidst digital transformation and the ascendancy of AI, leading to profound shifts in the role and responsibilities of Software Engineers. This evolution encompasses both immediate changes, such as the adoption of Large Language Model-based approaches to coding, and deeper shifts driven by the profound societal and environmental impacts of technology. Despite the urgency, there persists a lag in adapting to these evolving roles. This roadmap article proposes 10 research challenges to develop a new generation of Software Engineers equipped to navigate the technical and social complexities as well as ethical considerations inherent in their evolving profession. Furthermore, the challenges target role definition, integration of AI, education transformation, standards evolution, and impact assessment to equip future Software Engineers to skillfully and responsibly handle the obstacles within their transforming discipline.",
    "citationCount": 3,
    "referenceCount": 140
}