{
    "paperId": "9c1b979b8ba820a712e3198f5cede008a89acbbd",
    "title": "On the Potential of Execution Traces for Batch Processing Workload Optimization in Public Clouds",
    "year": 2021,
    "venue": "2021 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Dominik Scheinert",
        "Alireza Alamgiralem",
        "Jonathan Bader",
        "Jonathan Will",
        "Thorsten Wittkopp",
        "L. Thamsen"
    ],
    "doi": "10.1109/BigData52589.2021.9671275",
    "arxivId": "2111.08759",
    "url": "https://www.semanticscholar.org/paper/9c1b979b8ba820a712e3198f5cede008a89acbbd",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.gla.ac.uk/268167/1/268167.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the growing amount of data, data processing workloads and the management of their resource usage becomes increasingly important. Since managing a dedicated infrastructure is in many situations infeasible or uneconomical, users progressively execute their respective workloads in the cloud. As the configuration of workloads and resources is often challenging, various methods have been proposed that either quickly profile towards a good configuration or determine one based on data from previous runs. Still, performance data to train such methods is often lacking and must be costly collected.In this paper, we propose a collaborative approach for sharing anonymized workload execution traces among users, mining them for general patterns, and exploiting clusters of historical workloads for future optimizations. We evaluate our prototype implementation for mining workload execution graphs on a publicly available trace dataset and demonstrate the predictive value of workload clusters determined through traces only.",
    "citationCount": 10,
    "referenceCount": 31
}