{
    "paperId": "9c29ba4d7dedb219aee59ae1864e27bd2db9b322",
    "title": "Optimizing Geophysical Workloads in High-Performance Computing: Leveraging Machine Learning and Transformer Models for Enhanced Parallelism and Processor Allocation",
    "year": 2024,
    "venue": "2024 Third International Conference on Distributed Computing and High Performance Computing (DCHPC)",
    "authors": [
        "André Brasil Vieira Wyzykowski",
        "Gabriel Mascarenhas Costa De Sousa",
        "Breno S. Coelho",
        "Lucas Batista Santos",
        "Darlan Anschau"
    ],
    "doi": "10.1109/DCHPC60845.2024.10454084",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9c29ba4d7dedb219aee59ae1864e27bd2db9b322",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-performance computing (HPC) is essential in processing complex models, a necessity particularly emphasized in geophysics imaging. Its superiority over personal computing lies in its ability to implement parallelism by distributing workloads across supercomputer clusters. However, users often face challenges in selecting the most effective machine configuration for their specific computational tasks, which is crucial for optimizing speed and efficiency. This paper addresses this issue and presents a machine learning-based toolkit specifically tailored for geophysics workloads as a solution. The focus in this domain ensures that the toolkit’s recommendations are highly relevant for applications within this field. The toolkit pre-emptively evaluates various machine configurations, offering users personalized recommendations for their geophysics computational tasks. Significant results from our processor classifier network demonstrate the toolkit’s efficacy. It achieved an overall accuracy of 70%, with mean precision, recall, and F1-score of 0.73, 0.70, and 0.64, respectively. A notable performance was observed in processors like the AMD EPYC 7773X 64-Core and various Intel(R) Xeon(R) models, some achieving perfect precision and recall scores. This toolkit, with its focus on geophysics workloads, empowers users to make informed decisions, greatly enhancing the efficiency of selecting optimal HPC configurations for specific needs in geophysics imaging and related applications.",
    "citationCount": 0,
    "referenceCount": 29
}