{
    "paperId": "9c74c8813d8ce308caab51853bf2308dc149261a",
    "title": "Optimizing Grouped Convolutions on Edge Devices",
    "year": 2020,
    "venue": "IEEE International Conference on Application-Specific Systems, Architectures, and Processors",
    "authors": [
        "Perry Gibson",
        "José Cano",
        "Jack Turner",
        "Elliot J. Crowley",
        "M. O’Boyle",
        "A. Storkey"
    ],
    "doi": "10.1109/ASAP49362.2020.00039",
    "arxivId": "2006.09791",
    "url": "https://www.semanticscholar.org/paper/9c74c8813d8ce308caab51853bf2308dc149261a",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.gla.ac.uk/221586/1/221586.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "When deploying a deep neural network on con-strained hardware, it is possible to replace the network’s standard convolutions with grouped convolutions. This allows for substantial memory savings with minimal loss of accuracy. However, current implementations of grouped convolutions in modern deep learning frameworks are far from performing optimally in terms of speed. In this paper we propose Grouped Spatial Pack Convolutions (GSPC), a new implementation of grouped convolutions that outperforms existing solutions. We implement GSPC in TVM, which provides state-of-the-art performance on edge devices. We analyze a set of networks utilizing different types of grouped convolutions and evaluate their performance in terms of inference time on several edge devices. We observe that our new implementation scales well with the number of groups and provides the best inference times in all settings, improving the existing implementations of grouped convolutions in TVM, PyTorch and TensorFlow Lite by $3.4\\times, 8\\times$ and $ 4\\times$ on average respectively. Code is available at https://github.com/gecLAB/tvm-GSPC/",
    "citationCount": 26,
    "referenceCount": 33
}