{
    "paperId": "9cb1b54d0dfe85ae4316bccd7a96923253620275",
    "title": "AXI4MLIR: User-Driven Automatic Host Code Generation for Custom AXI-Based Accelerators",
    "year": 2023,
    "venue": "IEEE/ACM International Symposium on Code Generation and Optimization",
    "authors": [
        "N. Agostini",
        "Jude Haris",
        "Perry Gibson",
        "Malith Jayaweera",
        "Norman Rubin",
        "Antonino Tumeo",
        "José L. Abellán",
        "José Cano",
        "D. Kaeli"
    ],
    "doi": "10.1109/CGO57630.2024.10444801",
    "arxivId": "2312.14821",
    "url": "https://www.semanticscholar.org/paper/9cb1b54d0dfe85ae4316bccd7a96923253620275",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.gla.ac.uk/311284/2/311284.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper addresses the need for automatic and efficient generation of host driver code for arbitrary custom AXI-based accelerators targeting linear algebra algorithms, an important workload in various applications, including machine learning and scientific computing. While existing tools have focused on automating accelerator prototyping, little attention has been paid to the host-accelerator interaction. This paper introduces AXI4MLIR, an extension of the MLIR compiler framework designed to facilitate the automated generation of host-accelerator driver code. With new MLIR attributes and transformations, AXI4MLIR empowers users to specify accelerator features (including their instructions) and communication patterns and exploit the host memory hierarchy. We demonstrate AXI4MLIR's versatility across different types of accelerators and problems, showcasing significant CPU cache reference reductions (up to 56%) and up to a 1.65× speedup compared to manually optimized driver code implementations. AXI4MLIR implementation is open-source and available at: https:/7github.com/AXI4MLIR/axi4mlir.",
    "citationCount": 1,
    "referenceCount": 60
}