{
    "paperId": "9cf0972f48867a09e15062a1dc6506e2587d1b27",
    "title": "Resources and tools for rare disease variant interpretation",
    "year": 2023,
    "venue": "Frontiers in Molecular Biosciences",
    "authors": [
        "L. Licata",
        "A. Via",
        "P. Turina",
        "G. Babbi",
        "Silvia Benevenuta",
        "C. Carta",
        "R. Casadio",
        "Andrea Cicconardi",
        "A. Facchiano",
        "P. Fariselli",
        "D. Giordano",
        "Federica Isidori",
        "A. Marabotti",
        "P. Martelli",
        "S. Pascarella",
        "M. Pinelli",
        "T. Pippucci",
        "R. Russo",
        "Castrense Savojardo",
        "B. Scafuri",
        "L. Valeriani",
        "E. Capriotti"
    ],
    "doi": "10.3389/fmolb.2023.1169109",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9cf0972f48867a09e15062a1dc6506e2587d1b27",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fmolb.2023.1169109/pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Collectively, rare genetic disorders affect a substantial portion of the world’s population. In most cases, those affected face difficulties in receiving a clinical diagnosis and genetic characterization. The understanding of the molecular mechanisms of these diseases and the development of therapeutic treatments for patients are also challenging. However, the application of recent advancements in genome sequencing/analysis technologies and computer-aided tools for predicting phenotype-genotype associations can bring significant benefits to this field. In this review, we highlight the most relevant online resources and computational tools for genome interpretation that can enhance the diagnosis, clinical management, and development of treatments for rare disorders. Our focus is on resources for interpreting single nucleotide variants. Additionally, we present use cases for interpreting genetic variants in clinical settings and review the limitations of these results and prediction tools. Finally, we have compiled a curated set of core resources and tools for analyzing rare disease genomes. Such resources and tools can be utilized to develop standardized protocols that will enhance the accuracy and effectiveness of rare disease diagnosis.",
    "citationCount": 9,
    "referenceCount": 217
}