{
    "paperId": "9cfc905781431bf242593dde3c84235ee44de573",
    "title": "Tomographic Imaging with Enhanced Spatial Structures Via a Physics-Aware 3D Reconstruction Network",
    "year": 2023,
    "venue": "IEEE International Geoscience and Remote Sensing Symposium",
    "authors": [
        "Xiangdong Ma",
        "Xiaoling Zhang",
        "Yu Ren",
        "Xu Zhan",
        "Jun Shi",
        "Shunjun Wei",
        "Tianjiao Zeng"
    ],
    "doi": "10.1109/IGARSS52108.2023.10283316",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9cfc905781431bf242593dde3c84235ee44de573",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "TomoSAR imaging is a classical inverse problem. Learning to optimize is a newly emerging technique for solving such problems in a deep-learning way. This technique may facilitate the efficiency and accuracy of the inverse process. In this research, we apply this framework to TomoSAR imaging and aim to enhance spatial structures within the framework. We establish a two-part imaging optimization model. One part is a regularization term for the forward observation process, and the other part is for constraining the sparsity of structures in the gradient domain. Using the methodology of learning to optimize, we design basic neural network modules and stack them in a cascaded manner to solve the model. We validate the proposed network using a public TomoSAR dataset. The results show that the proposed method obtains buildings with much more complete overall surfaces and more apparent edges.",
    "citationCount": 0,
    "referenceCount": 6
}