{
    "paperId": "9d2c9a7c3ff8f760b43fdd6a7082069a467c8956",
    "title": "Adapting Large Language Models by Integrating Collaborative Semantics for Recommendation",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Bowen Zheng",
        "Yupeng Hou",
        "Hongyu Lu",
        "Yu Chen",
        "Wayne Xin Zhao",
        "Ji-rong Wen"
    ],
    "doi": "10.1109/ICDE60146.2024.00118",
    "arxivId": "2311.09049",
    "url": "https://www.semanticscholar.org/paper/9d2c9a7c3ff8f760b43fdd6a7082069a467c8956",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2311.09049",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, large language models (LLMs) have shown great potential in recommender systems, either improving existing recommendation models or serving as the backbone. However, there exists a large semantic gap between LLMs and recommender systems, since items to be recommended are often indexed by discrete identifiers (item ID) out of the LLM's vocabulary. In essence, LLMs capture language semantics while recommender systems imply collaborative semantics, making it difficult to sufficiently leverage the model capacity of LLMs for recommendation. To address this challenge, in this paper, we propose a new LLM-based recommendation model called LC-Rec, which can better integrate language and collaborative semantics for recommender systems. Our approach can directly generate items from the entire item set for recommendation, without relying on candidate items. Specifically, we make two major contributions in our approach. For item indexing, we design a learning-based vector quantization method with uniform semantic mapping, which can assign meaningful and non-conflicting IDs (called item indices) for items. For alignment tuning, we propose a series of specially designed tuning tasks to enhance the integration of collaborative semantics in LLMs. Our fine-tuning tasks enforce LLMs to deeply integrate language and collaborative semantics (characterized by the learned item indices), so as to achieve an effective adaptation to recommender systems. Extensive experiments demonstrate the effectiveness of our method, showing that our approach can outperform a number of competitive baselines including traditional recommenders and existing LLM-based recommenders. Our code is available at https://github.com/RUCAIBox/LC-Rec/.",
    "citationCount": 178,
    "referenceCount": 65
}