{
    "paperId": "9d2da20bb3ba3a4f33f5ed10b4499fe9712cb6fe",
    "title": "Demonstrating paths for unlocking the value of cloud genomics through cross cohort analysis",
    "year": 2023,
    "venue": "Nature Communications",
    "authors": [
        "N. Deflaux",
        "M. Selvaraj",
        "H. Condon",
        "Kelsey Mayo",
        "Sara Haidermota",
        "Melissa A. Basford",
        "C. Lunt",
        "A. Philippakis",
        "D. Roden",
        "Joshua C. Denny",
        "A. Musick",
        "R. Collins",
        "Naomi E. Allen",
        "Mark Effingham",
        "David Glazer",
        "P. Natarajan",
        "A. Bick"
    ],
    "doi": "10.1038/s41467-023-41185-x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9d2da20bb3ba3a4f33f5ed10b4499fe9712cb6fe",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41467-023-41185-x.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, large scale genomic projects such as All of Us and the UK Biobank have introduced a new research paradigm where data are stored centrally in cloud-based Trusted Research Environments (TREs). To characterize the advantages and drawbacks of different TRE attributes in facilitating cross-cohort analysis, we conduct a Genome-Wide Association Study of standard lipid measures using two approaches: meta-analysis and pooled analysis. Comparison of full summary data from both approaches with an external study shows strong correlation of known loci with lipid levels (R2 ~ 83–97%). Importantly, 90 variants meet the significance threshold only in the meta-analysis and 64 variants are significant only in pooled analysis, with approximately 20% of variants in each of those groups being most prevalent in non-European, non-Asian ancestry individuals. These findings have important implications, as technical and policy choices lead to cross-cohort analyses generating similar, but not identical results, particularly for non-European ancestral populations.",
    "citationCount": 15,
    "referenceCount": 30
}