{
    "paperId": "9d2f31fe2c026f3039b108982822c3c82af94b12",
    "title": "Online demand peak shaving with machine‐learned advice in digital twins",
    "year": 2024,
    "venue": "Digital Twins and Applications",
    "authors": [
        "Minxi Feng",
        "Wei Li",
        "Bo Qin",
        "Albert Y. Zomaya"
    ],
    "doi": "10.1049/dgt2.12012",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9d2f31fe2c026f3039b108982822c3c82af94b12",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1049/dgt2.12012",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the use of physical instruments grows, control algorithms are being increasingly deployed to enhance efficiency and reliability through digital twin technology. Demand load management is central to energy systems within digital twins, which significantly impacts operational costs. Peak demand loads can lead to substantial monthly utility expenses without proper management. AMPAMOD, a randomised online algorithm incorporating machine‐learned insights is introduced to optimise battery operations and mitigate peak demand loads. AMPAMOD leverages limited‐bit information from machine learning models to inform its online decision‐making process for cost‐effective load management. We provide theoretical evidence demonstrating that AMPAMOD maintains minimal advice complexity, has a linear computational cost, and achieves a bounded competitive ratio. Extensive trace‐driven experiments with real‐world household data reveal that AMPAMOD successfully reduces peak loads by over 90%, outperforming other benchmarks by at least 50%. These experimental findings align with our theoretical assertions, showcasing the effectiveness of AMPAMOD.",
    "citationCount": 0,
    "referenceCount": 29
}