{
    "paperId": "9d53f3475f9e443e270a3d84cae60b6817ec3497",
    "title": "Evolution beats random chance: Performance-dependent network evolution for enhanced computational capacity.",
    "year": 2024,
    "venue": "Physical Review E",
    "authors": [
        "Manish Yadav",
        "Sudeshna Sinha",
        "M. Stender"
    ],
    "doi": "10.1103/physreve.111.014320",
    "arxivId": "2403.15869",
    "url": "https://www.semanticscholar.org/paper/9d53f3475f9e443e270a3d84cae60b6817ec3497",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2403.15869",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The quest to understand structure-function relationships in networks across scientific disciplines has intensified. However, the optimal network architecture remains elusive, particularly for complex information processing. Therefore, we investigate how optimal and specific network structures form to efficiently solve distinct tasks using a framework of performance-dependent network evolution, leveraging reservoir computing principles. Our study demonstrates that task-specific minimal network structures obtained through this framework consistently outperform networks generated by alternative growth strategies and Erdős-Rényi random networks. Evolved networks exhibit unexpected sparsity and adhere to scaling laws in node-density space while showcasing a distinctive asymmetry in input and information readout node distribution. Consequently, we propose a heuristic for quantifying task complexity from performance-dependently evolved networks, offering valuable insights into the evolutionary dynamics of the network structure-function relationship. Our findings advance the fundamental understanding of process-specific network evolution and shed light on the design and optimization of complex information processing mechanisms, notably in machine learning.",
    "citationCount": 8,
    "referenceCount": 56
}