{
    "paperId": "9d57cfddf0ee35f67763823150848b6e1509bfd0",
    "title": "Optimizing Solar PV Placement for Enhanced Integration in Radial Distribution Networks using Deep Learning Techniques",
    "year": 2024,
    "venue": "Engineering, Technology &amp; Applied Science Research",
    "authors": [
        "M. A. Zdiri",
        "Bilel Dhouib",
        "Z. Alaas",
        "H. Hadj Abdallah"
    ],
    "doi": "10.48084/etasr.6818",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9d57cfddf0ee35f67763823150848b6e1509bfd0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.48084/etasr.6818",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study introduces a highly effective technique to address the load flow challenge in Radial Distribution Networks (RDNs). The proposed approach leverages two matrices derived from the topological features of distribution networks to provide an optimal solution to handle load flow challenges. To assess the efficacy of this technique, simulations were executed on an IEEE 33-bus radial distribution system using MATLAB. Deep Learning (DL) has become a powerful artificial intelligence technique that excels at interpreting power grid datasets. Thus, a data-driven methodology is presented that incorporates an advanced Long-Short-Term-Memory (LSTM) network. Employing the Recurrent Neural Network with the LSTM (RNN-LSTM) technique based on these simulations, the study precisely identifies the optimal placement of an integrated PV generator within the radial network. The application of DL techniques, specifically LSTM networks, exemplifies the potential of data-driven approaches in enhancing decision-making processes. The results of this study highlight the potential of RNN-LSTM for the optimal integration of PV generators and for ameliorating the reliability of RDNs.",
    "citationCount": 3,
    "referenceCount": 27
}