{
    "paperId": "9d7d0ccf77aceb450c898a5667549d4c4f83a446",
    "title": "Text-Guided Portrait Image Matting",
    "year": 2024,
    "venue": "IEEE Transactions on Artificial Intelligence",
    "authors": [
        "Yong Xu",
        "Xin Yao",
        "Baoling Liu",
        "Yuhui Quan",
        "Hui Ji"
    ],
    "doi": "10.1109/TAI.2024.3363120",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9d7d0ccf77aceb450c898a5667549d4c4f83a446",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image matting is a technique used to separate the foreground of an image from the background, which estimates an alpha matte that indicates pixel-wise degree of transparency. To precisely extract target objects and address the ambiguity of solutions in image matting, many existing approaches employ a trimap or background image provided by the user as additional input to guide the matting process. This article introduces a novel matting paradigm termed text-guided image matting, utilizing a textual description of the foreground object as a guiding element. In contrast to trimap or background-based methods, text-guided matting offers a user-friendly interface, providing semantic clues for the objects of interest. Moreover, it facilitates batch processing across multiple frames featuring the same objects of interest. The proposed text-guided matting approach is implemented through a deep neural network (NN) comprising three-stage cross-modal feature fusion and two-step alpha matte prediction. Experimental results on portrait matting demonstrate the competitive performance of our text-guided approach compared to existing trimap-based and background-based methods.",
    "citationCount": 1,
    "referenceCount": 68
}