{
    "paperId": "9db031dd2aef8becb291c913899a2bd659f29822",
    "title": "In-Network Probabilistic Monitoring Primitives under the Influence of Adversarial Network Inputs",
    "year": 2023,
    "venue": "Asia-Pacific Workshop on Networking",
    "authors": [
        "Harish S A",
        "K. S. Kumar",
        "Anibrata Majee",
        "Amogh Bedarakota",
        "Praveen Tammana",
        "Pravein G. Kannan",
        "Rinku Shah"
    ],
    "doi": "10.1145/3600061.3600086",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9db031dd2aef8becb291c913899a2bd659f29822",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Network management tasks heavily rely on network telemetry data. Programmable data planes provide novel ways to collect this telemetry data efficiently using probabilistic data structures like bloom filters and their variants. Despite the benefits of the data structures (and associated data plane primitives), their exposure increases the attack surface. That is, they are at risk of adversarial network inputs. In this work, we examine the effects of adversarial network inputs to bloom filters that are integral to data plane primitives. Bloom filters are probabilistic and inherently susceptible to pollution attacks which increase their false positive rates. To quantify the impact, we demonstrate the feasibility of pollution attacks on FlowRadar, a network monitoring and debugging system that employs a data plane primitive to collect traffic statistics. We observe that the adversary can corrupt traffic statistics with a few well-crafted malicious flows (tens of flows), leading to a 99% drop in the accuracy of the core functionality of the FlowRadar system.",
    "citationCount": 4,
    "referenceCount": 48
}