{
    "paperId": "9dbd0a732751a3d43300713f88c4aa3284f46e0b",
    "title": "B2-Tree: Page-Based String Indexing in Concurrent Environments",
    "year": 2022,
    "venue": "Datenbank-Spektrum",
    "authors": [
        "Josef Schmeißer",
        "Maximilian E. Schüle",
        "Viktor Leis",
        "Thomas Neumann",
        "A. Kemper"
    ],
    "doi": "10.1007/s13222-022-00409-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9dbd0a732751a3d43300713f88c4aa3284f46e0b",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s13222-022-00409-y.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently proposed index structures, that combine trie-based and comparison-based search mechanisms, considerably improve retrieval throughput for in-memory database systems. However, most of these index structures allocate small memory chunks when required. This stands in contrast to block-based index structures, that are necessary for disk-accesses of beyond main-memory database systems such as Umbra. We therefore present the B2-tree. The outer structure is identical to that of an ordinary B+-tree. It still stores elements in a dense array in sorted order, enabling efficient range scan operations. However, B2-tree is composed of multiple trees, each page integrates another trie-based search tree, which is used to determine a small memory region where a sought entry may be found. An embedded tree thereby consists of decision nodes, which operate on a single byte at a time, and span nodes, which are used to store common prefixes. This architecture usually accesses fewer cache lines than a vanilla B+-tree as shown in our performance evaluation. As a result, the B2-tree answers point queries considerably faster. Concurrent access to B2-tree pages are managed by an optimistic locking protocol which results in high utilization of the available hardware resources. Our evaluation of read-write workloads attests more than competitive performance for the B2-tree compared to a traditional B+-tree.",
    "citationCount": 5,
    "referenceCount": 29
}