{
    "paperId": "9dc7836f5210e6692021aeac37de35e03a07fc42",
    "title": "A Novel Traffic Flow Reduction Method Based on Incomplete Vehicle History Spatio-Temporal Trajectory Data",
    "year": 2022,
    "venue": "ISPRS Int. J. Geo Inf.",
    "authors": [
        "Bo Yang",
        "Zunhao Liu",
        "Zhi Cai",
        "Dongze Li",
        "Xing Su",
        "Limin Guo",
        "Zhiming Ding"
    ],
    "doi": "10.3390/ijgi11030209",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9dc7836f5210e6692021aeac37de35e03a07fc42",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2220-9964/11/3/209/pdf?version=1647853799",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In order to improve the effect of path planning in emergencies, the missing position imputation and velocity restoration in vehicle trajectory provide data support for emergency path planning and analysis. At present, there are many methods to fill in the missing trajectory information, but they basically restore the missing trajectory after analyzing a large number of datasets. However, the trajectory reduction method with few training sets needs to be further explored. For this purpose, a novel trajectory data cube model (TDC) is designed to store time, position, and velocity information hierarchically in the trajectory data. Based on this model, three trajectory Hierarchical Trace-Back algorithms HTB-p, HTB-v, and HTB-KF are proposed in this paper. Finally, experiments verify that conduct in a different number of sample sets, it has a satisfactory performance on information restoration of individual points of the trajectory and information restoration of trajectory segments.",
    "citationCount": 2,
    "referenceCount": 21
}