{
    "paperId": "9e025966125d51dcf0df0364dbec03c124853a1a",
    "title": "Mapping Commercial Forests Infected by the Novel Variant of Elsinoë masingae, Using Unmanned Aerial Technology in Southern Africa",
    "year": 2025,
    "venue": "Forests",
    "authors": [
        "K. Peerbhay",
        "Nishka Devsaran",
        "R. Lottering",
        "N. Agjee",
        "Mikka Parag"
    ],
    "doi": "10.3390/f16060966",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9e025966125d51dcf0df0364dbec03c124853a1a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Eucalyptus scab disease (Elsinoë) is a harmful plant fungus that can disrupt various ecological and economic services provided by commercial forests. To effectively control and monitor the occurrence of forest pathogens, it is important to understand their spatial distribution within the infected area. Consistent monitoring, together with high-resolution imagery obtained from unmanned aerial vehicles (UAVs), has become important in forest management. Therefore, this study focuses on detecting and mapping the spatial distribution of E. masingae within commercial forests using image texture and vegetation indices (VIs) computed from a UAV sensor with machine learning (ML) and deep learning (DL) models. The fast large margin (FLM), random forest (RF), and deep learning (DL) models were used to determine which model effectively mapped the spatial distribution of the disease. The results indicated that image texture significantly increased the model accuracies (FLM = 94.8%; RF = 98.9%; DL = 98.9%) as opposed to the results without the use of image texture (FLM = 84.4%; RF = 76.1%; DL = 81.7%). Since the DL model obtained the fastest model run time and was proven to be the most significant model, it selected the mean, homogeneity, second moment, and correlation texture parameters which were predominantly determined from the red and blue bands of the UAV sensor containing visible bands. Additionally, the 3 × 3 moving window size was ideal for detecting E. masingae since the estimation of texture parameters was reduced efficiently. Overall, this study showcases the ability of UAVs to effectively map forest disease. Together with that, it has proven that the DL model outperformed the conventional ML models.",
    "citationCount": 0,
    "referenceCount": 60
}