{
    "paperId": "9e14e14fbec98e973e8a198c872e4aff4d48cb5a",
    "title": "SGIR-Tree: Integrating R-Tree Spatial Indexing as Subgraphs in Graph Database Management Systems",
    "year": 2024,
    "venue": "ISPRS Int. J. Geo Inf.",
    "authors": [
        "Juyoung Kim",
        "Seoyoung Hong",
        "Seungchan Jeong",
        "Seula Park",
        "Kiyun Yu"
    ],
    "doi": "10.3390/ijgi13100346",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9e14e14fbec98e973e8a198c872e4aff4d48cb5a",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/ijgi13100346",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient spatial query processing in Graph Database Management Systems (GDBMSs) has become increasingly important owing to the prevalence of spatial graph data. However, current GDBMSs lack effective spatial indexing, causing performance issues with complex spatial graph queries. This study proposes a spatial index called Subgraph Integrated R-Tree (SGIR-Tree) for efficient spatial query processing in GDBMSs. The SGIR-Tree integrates the hierarchical R-Tree structure with the graph structure of GDBMSs by converting R-Tree elements into graph components like nodes and edges. The Minimum Bounding Rectangle (MBR) information of spatial objects and R-Tree nodes is stored as properties of these graph elements, and the leaf nodes are directly connected to the spatial nodes. This approach combines the efficiency of spatial indexing with the flexibility of graph databases, thereby allowing spatial query results to be directly utilized in graph traversal. Experiments using OpenStreetMap datasets demonstrate that the SGIR-Tree outperforms the previous approaches in terms of query overhead and index overhead. The results are expected to improve spatial graph data processing in various fields, including location-based service and urban planning, significantly advancing spatial data management in GDBMSs.",
    "citationCount": 1,
    "referenceCount": 37
}