{
    "paperId": "9e5e47c10b4a2f8bf5f9c607f28693bf106d7e38",
    "title": "EdgeAnchor: A Rapid and Balanced File Storage Strategy at the Network Edge",
    "year": 2023,
    "venue": "International Conference on Parallel and Distributed Systems",
    "authors": [
        "Han Liu",
        "Xingrui Xie",
        "Zhuopu Zhang",
        "Geyao Cheng",
        "Lailong Luo",
        "Deke Guo"
    ],
    "doi": "10.1109/icpads60453.2023.00310",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9e5e47c10b4a2f8bf5f9c607f28693bf106d7e38",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Storing files at the network edge has become a new paradigm of storage systems, which is promising to mitigate network congestion and reduce file retrieval latency. However, the traditional file storage scheme cannot effectively meet the requirements of rapid indexing and load balance when applied directly to the edge. Moreover, due to the dynamic nature of the edge environment where edge servers can join or leave at will, it is necessary for the storage scheme to adjust with minimal disruption. In this paper, we propose EdgeAnchor, a novel edge storage strategy that is composed of the two-layer hash mappings. The first layer, file-to-bucket mapping, adopts the pseudo-deletion algorithm to deal with the variations in file size, while the second layer utilizes the multiple bucket-to-server mapping to adapt to the heterogeneity in the servers’ storage capacities. Furthermore, EdgeAnchor constructs a list of deleted or added working sets for each bucket and creates a dictionary for the mappings between buckets and edge servers. In the manner, EdgeAnchor ensures a rapid file index and balances server load at the dynamic network edge. We also attach the mathematical analyses to EdgeAnchor, which theoretically proves its logarithmic complexity of hash operations and memory accesses. The experiments conducted on real-world datasets demonstrate that EdgeAnchor achieves the file index throughput twice as high as that of Consistent Hashing, under the constraints of load balance. Additionally, it ensures a low and stable data migration volume, when adding or removing edge servers consecutively.",
    "citationCount": 0,
    "referenceCount": 8
}