{
    "paperId": "9eed249a48977bce765259f21cee8f2be497661c",
    "title": "Enhancing Bitcoin Forecast Accuracy by Integrating AI,Sentiment Analysis, and Financial Models",
    "year": 2025,
    "venue": "International Journal of Computing and Digital Systems",
    "authors": [
        "Mohamad El Abaji",
        "Ramzi A. Haraty"
    ],
    "doi": "10.12785/ijcds/1571026011",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9eed249a48977bce765259f21cee8f2be497661c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": This study explores the enhancement of Bitcoin price prediction by integrating advanced AI models (LSTM, Prophet, SARIMAX) with sentiment analysis from digital platforms like Twitter and Yahoo, processed through Large Language Models (LLMs). The research assesses the impact of incorporating qualitative sentiment data with quantitative financial models. Key findings indicate that sentiment analysis can significantly refine forecasting accuracy. Specifically, the LSTM model demonstrated a reduction in Mean Absolute Percentage Error (MAPE) from 15.59% to 12.75% and an increase in accuracy from 84.41% to 87.25% when sentiment analysis was included. However, the Prophet model showed a decrease in performance, with MAPE increasing to 28.04% and accuracy dropping to 71.96%. The SARIMAX model displayed inconsistent results with sentiment integration. These insights highlight the complexities and potential benefits of combining traditional econometric models with sentiment analysis for improved predictive accuracy in financial forecasting.",
    "citationCount": 0,
    "referenceCount": 70
}