{
    "paperId": "9ef465bfe2bfc3a20b78a7d2cd9a22bad392b3a3",
    "title": "Sublinear Time Algorithm for Online Weighted Bipartite Matching",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Han Hu",
        "Zhao Song",
        "Runzhou Tao",
        "Zhaozhuo Xu",
        "Danyang Zhuo"
    ],
    "doi": "10.48550/arXiv.2208.03367",
    "arxivId": "2208.03367",
    "url": "https://www.semanticscholar.org/paper/9ef465bfe2bfc3a20b78a7d2cd9a22bad392b3a3",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2208.03367",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online bipartite matching is a fundamental problem in online algorithms. The goal is to match two sets of vertices to maximize the sum of the edge weights, where for one set of vertices, each vertex and its corresponding edge weights appear in a sequence. Currently, in the practical recommendation system or search engine, the weights are decided by the inner product between the deep representation of a user and the deep representation of an item. The standard online matching needs to pay $nd$ time to linear scan all the $n$ items, computing weight (assuming each representation vector has length $d$), and then deciding the matching based on the weights. However, in reality, the $n$ could be very large, e.g. in online e-commerce platforms. Thus, improving the time of computing weights is a problem of practical significance. In this work, we provide the theoretical foundation for computing the weights approximately. We show that, with our proposed randomized data structures, the weights can be computed in sublinear time while still preserving the competitive ratio of the matching algorithm.",
    "citationCount": 7,
    "referenceCount": 62
}