{
    "paperId": "9f03c3d8833ade420d18dbcaed54539479500bfe",
    "title": "Quickly Calculating the Activity Coefficient of a NaCl Solution Based on Machine Learning Algorithms",
    "year": 2024,
    "venue": "ACS Omega",
    "authors": [
        "Bowen Qin",
        "Yizhong Zhang",
        "Long Yang",
        "Yuxin Yang",
        "Maolin Zhang",
        "Yurui Zhou",
        "Yantan Yang"
    ],
    "doi": "10.1021/acsomega.4c08313",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9f03c3d8833ade420d18dbcaed54539479500bfe",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1021/acsomega.4c08313",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The activity coefficient represents the deviation between an actual solution and an ideal solution, influencing the solubility and diffusion of CO2 within a saltwater layer. Consequently, it serves as a crucial parameter for numerical simulations of CO2 storage in deep saltwater layers. However, in numerical simulations of CO2 geological storage, the majority of studies rely on the Helgeson–Kirkham–Flowers (HKF) equation to compute activity coefficients, which necessitates obtaining Debye–Hückel (DH) parameters. The conventional method calculates the DH parameters via an interpolation algorithm, which requires a long computation time during the numerical simulation. Therefore, developing a method to quickly and accurately calculate activity coefficients is vital for the overall model efficiency. This study employed machine learning algorithms to train DH parameters derived from the IAPWS-95 method. It could establish empirical formulas for DH parameters as functions of temperature and pressure, which were then substituted into the HKF equation to swiftly compute activity coefficients. The results demonstrate that the activity coefficients obtained using this method exhibit a small relative deviation from experimental values, with an average coefficient of determination of 0.9463 and an average relative error of 2.28%. Furthermore, the computational speed was improved by 48%. This approach reduces the calculation time for activity coefficients in geochemical reaction modeling, enabling DH parameters to be calculated solely based on temperature and pressure, which is easy to use and has high accuracy. It facilitates rapid calculation of activity coefficients for solutions within a temperature range of 0 to 300 °C and a pressure range of 0 to 200 MPa. Ultimately, this study holds significant importance for the numerical simulation of geochemical reactions.",
    "citationCount": 2,
    "referenceCount": 34
}