{
    "paperId": "9f27f435877b125138c4a3f45f2c4e550a4336e8",
    "title": "The help-seeking process and predictors of mental health care use among individuals with depressive symptoms: a machine learning approach",
    "year": 2024,
    "venue": "Frontiers in Public Health",
    "authors": [
        "V. Juergensen",
        "Lina-Jolien Peter",
        "D. Steyrl",
        "C. Lor",
        "Anh Phi Bui",
        "T. McLaren",
        "H. Muehlan",
        "S. Tomczyk",
        "S. Schmidt",
        "Georg Schomerus"
    ],
    "doi": "10.3389/fpubh.2024.1504720",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9f27f435877b125138c4a3f45f2c4e550a4336e8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose The goal of the study was to identify the most important influences on professional healthcare use of people with depressive symptoms. We incorporated findings from research areas of health behaviors, stigma, and motivation to predict the help-seeking process variables from a wide range of personal factors and attitudes. Methods A sample of 1,368 adults with untreated depressive symptoms participated in an online survey with three-and six-month follow-ups. We conducted multiple linear regressions for (a) help-seeking attitudes, and (b) help-seeking intentions, and logistic regression for (c) help-seeking behavior with machine learning methods. Results While self-stigma and treatment experience are important influences on help-seeking attitudes, complaint perception is relevant for intention. The best predictor for healthcare use remains the intention. Along the help-seeking process, we detected a shift of relevant factors from broader perceptions of mental illness and help-seeking to concrete suffering, i.e., subjective symptom perception. Conclusion The results suggest a spectrum of influencing factors ranging from personal, self-determined factors to socially normalized factors. We discuss social influences on professional help-seeking and the use of combined public health programs and tailored help-seeking interventions. Clinical trial registration German Clinical Trials Register (https://drks.de/search/en): Identifier DRKS00023557.",
    "citationCount": 1,
    "referenceCount": 94
}