{
    "paperId": "9f5fee746176ce629696b6bb0f648e8209b8fbb9",
    "title": "Chimera: Leveraging Hybrid Offsets for Efficient Data Prefetching",
    "year": 2024,
    "venue": "International Conference on Parallel Architectures and Compilation Techniques",
    "authors": [
        "Shuiyi He",
        "Zicong Wang",
        "Xuan Tang",
        "Qiyao Sun",
        "Dezun Dong"
    ],
    "doi": "10.1145/3656019.3689613",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9f5fee746176ce629696b6bb0f648e8209b8fbb9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data prefetching is an essential technique in contemporary high-performance processors for mitigating the effects of long-latency memory accesses. With the increasing demand for prefetcher to learn complex memory access patterns, many state-of-the-art prefetch-ers adopt methods such as using the program counter or access delta to separate memory access streams. This allows them to learn detailed memory access features and thereby improve memory system performance. However, the separation-based approach is prone to missing global correlations, leading to miss prefetching opportunities. In this paper, we propose Chimera, a hybrid offsets prefetcher that captures multiple offset features from the overall stream of memory access instructions, thus overcoming the drawbacks of traditional prefetchers that tend to lose memory access information when learning from one-sided features. We evaluated Chimera using SPEC CPU 2006 and 2017 through simulation, and the results show that Chimera improves system performance by 39.5% over a baseline with no data prefetcher and by 6.6% over the state-of-the-art data prefetcher.",
    "citationCount": 3,
    "referenceCount": 43
}