{
    "paperId": "9f62ed8a896d5126ebaba5f5e3f3aa2c8c6985e3",
    "title": "SHAP-driven insights into multimodal data: behavior phase prediction for industrial safety applications",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Xiangchun Li",
        "Shuhao Zhang",
        "Xiaowei Li",
        "Jianhua Zeng",
        "Yuzhen Long",
        "Baisheng Nie",
        "Chenbo Zhao"
    ],
    "doi": "10.1038/s41598-025-18889-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9f62ed8a896d5126ebaba5f5e3f3aa2c8c6985e3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Unsafe behaviors among coal miners are a primary factor contributing to accidents, posing significant challenges for safety management. This study develops a behavior state prediction framework using artificial intelligence and machine learning (ML) to investigate the relationship between workers’ behavioral states and physiological characteristics. The framework employs AI-driven data analysis to support early warning systems and real-time interventions, enhancing coal mine safety protocols. Eight ML algorithms, including K-Nearest Neighbor (KNN), Light Gradient Boosting Machine (LightGBM), and Extreme Gradient Boosting (XGBoost), are evaluated. XGBoost achieves the highest performance, with 97.78% accuracy, 98.25% recall, and 97.86% F1-score, demonstrating strong generalization in complex coal mining scenarios. Key features influencing behavior prediction are identified using SHAP (Shapley Additive Explanations) analysis, including the total power of the heart rate variability spectrum (TP/ms2), the median frequency of electromyography signals (EMF), the difference between maximum and minimum respiration values (Range), and the root mean square of electromyography signals (RMS). TP/ms2 and EMF exhibit accelerated growth patterns, whereas Range and RMS show boundary effects. Decision tree segmentation reveals relationships between feature values and SHAP contributions, providing actionable rules to improve safety. This study uses university student participants, which may limit generalizability; future validation with actual miners is recommended. Overall, the results highlight the predictive power of physiological features and the potential of wearable monitoring systems for real-time safety management. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18889-9.",
    "citationCount": 0,
    "referenceCount": 46
}