{
    "paperId": "9fbc7984c3a5ed788c9780ed3d1891cdefa5564b",
    "title": "Improved Cubic Function Negative-Determination Condition: Application to Delayed Load Frequency Control Power System With Electric Vehicle",
    "year": 2025,
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "authors": [
        "Renfu Luo",
        "Jiaojiao Ren",
        "K. Shi",
        "Eryang Chen"
    ],
    "doi": "10.1109/TITS.2025.3546227",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9fbc7984c3a5ed788c9780ed3d1891cdefa5564b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper investigates the stability of a delayed load frequency control (LFC) power system. Firstly, a dynamic LFC model is reconstructed to facilitate the development of a suitable Lyapunov-Krasovskii functional (LKF), which enables the derivation of stability conditions with reduced numerical complexity. Electric vehicles (EVs) are also incorporated into the LFC model to help mitigate frequency fluctuations. Secondly, a parameter-adjustable cubic function negative-determination condition is proposed, generalizing the existing condition in the literature as a special case and reducing its conservatism. Then, by combining the proposed negative-determination condition with the suitable LKF, new stability conditions are derived, enabling a more accurate determination of the allowable delay upper bound (ADUB). Furthermore, to improve computational efficiency in determining the ADUB, the suitable LKF not only provides stability conditions with lower complexity, reducing time per iteration, but also incorporates a binary search algorithm, significantly minimizing the total number of iterations required. Finally, case studies are presented to demonstrate the effectiveness of the proposed methods.",
    "citationCount": 2,
    "referenceCount": 44
}