{
    "paperId": "9fc65af0d86225acd33a83a9a08c24b970895931",
    "title": "A MLP-Hedge-Algebras Admittance Controller for Physical Human–Robot Interaction",
    "year": 2021,
    "venue": "Applied Sciences",
    "authors": [
        "N. Toan",
        "P. Khoi",
        "S. Yi"
    ],
    "doi": "10.3390/APP11125459",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9fc65af0d86225acd33a83a9a08c24b970895931",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/11/12/5459/pdf?version=1623488567",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, the identification of inertia and damping matrices (IIDM) and safety issues, as well as natural cooperation, are interestingly considered to enhance the quality of the physical human–robot interaction (pHRI). To cover all of these issues, advanced admittance controllers, such as those based on fuzzy logic or hedge algebras, have been formulated and successfully applied in several industrial problems. However, the inference mechanism of those kinds of controllers causes the discreteness of the super surface describing the input–output relationship in the Cartesian coordinates. As a consequence, the quality of the safe-natural cooperation between humans and robots is negatively affected. This paper presents an alternative admittance controller for pHRI by using a combination of hedge algebras and multilayer perceptron neural network (MLP), whose purpose is to create a more accurate inference mechanism for the admittance controller. To our best knowledge, this is the first time that such a neural network is considered for the inference mechanism of hedge algebras and also the first time that such an admittance controller is used for pHRI. The proposed admittance controller is verified on a teaching task using a 6-DOF manipulator. Experimental results have shown that the proposed method provides better cooperation compared with previous methods.",
    "citationCount": 5,
    "referenceCount": 68
}