{
    "paperId": "9fc8fdfdc4bfa3dc5e7052cb5da6c1570bd41fad",
    "title": "A Comprehensive Survey on Graph Summarization With Graph Neural Networks",
    "year": 2023,
    "venue": "IEEE Transactions on Artificial Intelligence",
    "authors": [
        "Nasrin Shabani",
        "Jia Wu",
        "A. Beheshti",
        "Quan.Z Sheng",
        "Jin Foo",
        "Venus Haghighi",
        "Ambreen Hanif",
        "Maryam Shahabikargar"
    ],
    "doi": "10.1109/TAI.2024.3350545",
    "arxivId": "2302.06114",
    "url": "https://www.semanticscholar.org/paper/9fc8fdfdc4bfa3dc5e7052cb5da6c1570bd41fad",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2302.06114",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As large-scale graphs become more widespread, more and more computational challenges with extracting, processing, and interpreting large graph data are being exposed. It is therefore natural to search for ways to summarize these expansive graphs while preserving their key characteristics. In the past, most graph summarization techniques sought to capture the most important part of a graph statistically. However, today, the high dimensionality and complexity of modern graph data are making deep learning techniques more popular. Hence, this article presents a comprehensive survey of progress in deep learning summarization techniques that rely on graph neural networks (GNNs). Our investigation includes a review of the current state-of-the-art approaches, including recurrent GNNs, convolutional GNNs, graph autoencoders, and graph attention networks. A new burgeoning line of research is also discussed where graph reinforcement learning is being used to evaluate and improve the quality of graph summaries. Additionally, the survey provides details of benchmark datasets, evaluation metrics, and open-source tools that are often employed in experimentation settings, along with a detailed comparison, discussion, and takeaways for the research community focused on graph summarization. Finally, the survey concludes with a number of open research challenges to motivate further study in this area.",
    "citationCount": 21,
    "referenceCount": 179
}