{
    "paperId": "9fde253fc2df9a3923b5cfcb06c6928f97fcf11d",
    "title": "Smart Cache Insertion and Promotion Policy for Content Delivery Networks",
    "year": 2023,
    "venue": "International Conference on Parallel Processing",
    "authors": [
        "Peng Wang",
        "Yu Liu",
        "Zhelong Zhao",
        "Ke Zhou",
        "Zhihai Huang",
        "Yanxiong Chen"
    ],
    "doi": "10.1145/3605573.3605581",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/9fde253fc2df9a3923b5cfcb06c6928f97fcf11d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Improving hit rates can be achieved by enhancing cache replacement algorithms with the identification of zero-reuse objects (ZROs) and inserting them at the end of the cache queue. Note that the promotion policy needs to achieve a similar task as the above insertion policy since the hit object may immediately become a ZRO (called P-ZRO) that is not suitable for placement at the front of the queue. However, existing studies have yet to consider P-ZROs, and current insertion algorithms struggle to simultaneously identify both ZROs and P-ZROs. To address these issues, we propose integrating the insertion and promotion policies. We do this by treating hit objects as special missing objects and employing reinforcement learning to create a unified model for both policies, where the learning function recognizes the relationship between performance changes and the emergence of ZROs and P-ZROs. Our proposed solution is a smart cache insertion and promotion policy (SCIP) that dynamically adjusts the insertion position using a bimodal insertion policy for both missing and hit objects, guided by the model. Extensive experiments demonstrate that SCIP significantly improves overall performance in real-world content delivery network systems and outperforms state-of-the-art insertion policies in terms of miss ratios in the simulator. In addition, deploying SCIP on optimal cache replacement algorithms can further decrease their miss ratios.",
    "citationCount": 1,
    "referenceCount": 31
}