{
    "paperId": "a02eecf0e04bd366492f72284c6193535be07dcb",
    "title": "Automated Mineralization Prediction System Driven by Large Language Models",
    "year": 2025,
    "venue": "2025 5th International Conference on Artificial Intelligence, Big Data and Algorithms (CAIBDA)",
    "authors": [
        "Liujia Yang"
    ],
    "doi": "10.1109/CAIBDA65784.2025.11182767",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a02eecf0e04bd366492f72284c6193535be07dcb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a mineralization prediction system driven by a large language model (LLM) agent, aiming to explore the automation process of mineralization prediction tasks, reduce the accessibility threshold, and improve prediction efficiency. The system integrates functionalities such as data preprocessing, model selection, training, and result visualization, achieving a modular design through a function-calling mechanism that allows users to flexibly invoke the required features. The plug-and-play nature of the system ensures the flexible replacement of functions and models, catering to the needs of various fields. Case study results indicate that the LLM-based system can complete various aspects of mineralization prediction tasks according to user requirements, thus supporting the automation process in mineral exploration. Furthermore, a comparative analysis with traditional methodologies reveals that the LLM-based system significantly enhances prediction efficiency and user-friendliness. This framework lowers the accessibility threshold in the field of mineral exploration, making prediction tasks more approachable for a wider range of users and fostering greater participation and innovation.",
    "citationCount": 0,
    "referenceCount": 29
}