{
    "paperId": "a03c5126bd7eb15f47b2936c9b4ccf8d4b12a125",
    "title": "Animal Feed Formulation—Connecting Technologies to Build a Resilient and Sustainable System",
    "year": 2024,
    "venue": "Animals",
    "authors": [
        "Oreofeoluwa Akintan",
        "Kifle G. Gebremedhin",
        "D. D. Uyeh"
    ],
    "doi": "10.3390/ani14101497",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a03c5126bd7eb15f47b2936c9b4ccf8d4b12a125",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-2615/14/10/1497/pdf?version=1715954080",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Simple Summary In response to the challenges posed by a growing global population, the livestock industry must increase food production while ensuring environmental sustainability. This paper explores how feed producers can tackle these challenges using advanced formulation techniques. By leveraging AI decision support systems, producers can optimize feed composition to promote animal health and environmental stewardship. The study’s findings offer valuable insights into improving animal feed production, supporting the livestock industry in achieving sustainability goals and contributing to global environmental conservation efforts. Abstract The unprecedented challenges presented by the increase in global population have placed substantial demands on the livestock industry for human nutrition, necessitating heightened animal productivity and leading to an increased demand for natural resources to produce animal feed. Feed producers are leading the charge, consistently refining formulations to adapt to the evolving needs of livestock, driven in part by the cost of over 50% associated with feed production. This paper critically analyses the pressing issues within feed formulation, addressing the requirement for environmentally sustainable practices amidst the challenges of climate change. The exploration extends to how advanced decision support tools can enhance formulation techniques and profitability and contribute to environmental sustainability. Through an in-depth review of current feed formulation technologies, encompassing their applications and limitations, this study aims to enhance the existing knowledge base. Additionally, we examined future trends, highlighting the essential role of connecting technologies to establish a resilient and sustainable system. The emphasis is on the potential of formulation techniques to positively impact the environment and enhance the overall quality and performance of the animals. This paper provides actionable insights to improve animal production by examining feed formulation models and decision support tools. The anticipated outcome is a more informed and sustainable decision-making process, addressing the multifaceted challenges confronted by the livestock industry and making contributions to global efforts in climate change mitigation and environmental stewardship in animal production agriculture.",
    "citationCount": 24,
    "referenceCount": 94
}