{
    "paperId": "a064a566961a0d9c68c733fc56c0f6b4c72b0721",
    "title": "RiceMapEngine: A Google Earth Engine-Based Web Application for Fast Paddy Rice Mapping",
    "year": 2023,
    "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing",
    "authors": [
        "Zhiqi Yu",
        "L. Di",
        "S. Shrestha",
        "Chen Zhang",
        "Liying Guo",
        "Faisal Qamar",
        "Timothy J. Mayer"
    ],
    "doi": "10.1109/JSTARS.2023.3290677",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a064a566961a0d9c68c733fc56c0f6b4c72b0721",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/4609443/4609444/10168222.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mapping rice area is a critical resource planning task in many South Asia countries where rice is the primary crop. Remote-sensing-based methods typically rely on domain knowledge, such as crop calendar and crop phenology, and supervised classification with ground truth samples. Applying such methods on Google Earth engine (GEE) has been proven effective, especially at large scale owing to the comprehensive and up-to-date data catalog and massive server-side processing power. However, writing scripts through the code editor requires users to program in JavaScript and understand GEE application programming interface (API), which can be challenging for many researchers. Thus, this article presents a GEE-based web application that aims to eliminate the programming requirements for data selection, preprocessing, and visualizations so that users can easily produce rice maps and refine ground truth collections through intuitive graphical user interfaces (GUI). This software includes three submodule apps, namely the ground truth collection app, threshold-based rice mapping app, and classification-based rice mapping app. Users can customize data processing flow using GUI designed with Bootstrap, and the backend server uses GEE Python API, and a Google service account for authentication to execute the workflow on Google cloud servers. The experiment shows that both the overall accuracy and Kappa scores of the mapping result are higher than 0.9, which suggests that RiceMapEngine can significantly reduce the complexity and time costs it takes to produce the accurate rice area maps and meet the demands of real-world stakeholders.",
    "citationCount": 10,
    "referenceCount": 53
}