{
    "paperId": "a06d45df3ab7dfa29cf5ca9f7ddd9a360a9f9eaf",
    "title": "OneVision: An End-to-End Generative Framework for Multi-view E-commerce Vision Search",
    "year": 2025,
    "venue": "",
    "authors": [
        "Zexin Zheng",
        "Huangyu Dai",
        "Lingtao Mao",
        "Xinyu Sun",
        "Zihan Liang",
        "Ben Chen",
        "Yuqing Ding",
        "Chenyi Lei",
        "Wenwu Ou",
        "Han Li",
        "Kun Gai"
    ],
    "doi": null,
    "arxivId": "2510.05759",
    "url": "https://www.semanticscholar.org/paper/a06d45df3ab7dfa29cf5ca9f7ddd9a360a9f9eaf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional vision search, similar to search and recommendation systems, follows the multi-stage cascading architecture (MCA) paradigm to balance efficiency and conversion. Specifically, the query image undergoes feature extraction, recall, pre-ranking, and ranking stages, ultimately presenting the user with semantically similar products that meet their preferences. This multi-view representation discrepancy of the same object in the query and the optimization objective collide across these stages, making it difficult to achieve Pareto optimality in both user experience and conversion. In this paper, an end-to-end generative framework, OneVision, is proposed to address these problems. OneVision builds on VRQ, a vision-aligned residual quantization encoding, which can align the vastly different representations of an object across multiple viewpoints while preserving the distinctive features of each product as much as possible. Then a multi-stage semantic alignment scheme is adopted to maintain strong visual similarity priors while effectively incorporating user-specific information for personalized preference generation. In offline evaluations, OneVision performs on par with online MCA, while improving inference efficiency by 21% through dynamic pruning. In A/B tests, it achieves significant online improvements: +2.15% item CTR, +2.27% CVR, and +3.12% order volume. These results demonstrate that a semantic ID centric, generative architecture can unify retrieval and personalization while simplifying the serving pathway.",
    "citationCount": 0,
    "referenceCount": 50
}