{
    "paperId": "a074d0a1238dc7891f178e51001b57ed8a5c7304",
    "title": "DACE: A Database-Agnostic Cost Estimator",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Zibo Liang",
        "Xu Chen",
        "Yuyang Xia",
        "Runfan Ye",
        "Haitian Chen",
        "Jiandong Xie",
        "Kai Zheng"
    ],
    "doi": "10.1109/ICDE60146.2024.00374",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a074d0a1238dc7891f178e51001b57ed8a5c7304",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cost estimation is of great importance in query optimization. However, traditional optimizers compute the cost based on heuristics, sacrificing accuracy for efficiency. In recent years, learning-based cost estimation models have achieved high accuracy. However, their poor robustness and inefficiency lead to their failure to meet the needs of practical scenarios. We propose a lightweight and Database-Agnostic Cost Estimation model (DACE) to address the above limitations. To further improve the effectiveness of DACE, we design a tree-structure-based loss adjustment strategy to learn sub-plan information and solve the information redundancy problem. As a pretrained estimator, DACE can efficiently make accurate predictions on unseen databases. For more complex scenarios, we fine-tune DACE with LoRA. The excellent efficiency allows DACE to adapt to challenging scenarios with minimal effort. As a pretrained encoder, DACE can improve the accuracy and robustness of other cost estimation models through knowledge integration and solve the notorious cold start problem. Extensive experiments have shown that DACE's accuracy, efficiency, and robustness are much better than existing methods.",
    "citationCount": 6,
    "referenceCount": 41
}