{
    "paperId": "a08fcfbb026a15b290206c87b7ce7c3a1e746f66",
    "title": "Efficient Query Obfuscation with Keyqueries",
    "year": 2021,
    "venue": "WI/IAT",
    "authors": [
        "Maik Fröbe",
        "Eric Schmidt",
        "Matthias Hagen"
    ],
    "doi": "10.1145/3486622.3493950",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a08fcfbb026a15b290206c87b7ce7c3a1e746f66",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Search engine users who do not want a sensitive query to actually appear in a search engine’s query log can use query obfuscation or scrambling techniques to keep their information need private. However, the practical applicability of the state-of-the-art obfuscation technique is rather limited since it compares hundreds of thousands of candidate queries on a local corpus to select the final obfuscated queries. We propose a new approach to query obfuscation combining an efficient enumeration algorithm with so-called keyqueries. Generating only hundreds of candidate queries, our approach is orders of magnitude faster and makes close to real-time obfuscation of sensitive information needs feasible. Our experiments in TREC scenarios on the ClueWeb corpora show that our approach achieves a retrieval effectiveness comparable to the previous exhaustive candidate generation at a run time of only seconds instead of hours. Overall, 75% of the private information needs can be obfuscated while retrieving at least one relevant document of the original private query—that itself will not appear in the search engine logs. To further improve a user’s privacy, the query obfuscation can easily be combined with other client-side tools like TrackMeNot or PEAS fake queries, and TOR routing.",
    "citationCount": 8,
    "referenceCount": 42
}