{
    "paperId": "a0b1a8bdc4ef170d61baba29e5d05863bf5d49a3",
    "title": "Fine-Grained Visual Computing Based on Deep Learning",
    "year": 2021,
    "venue": "ACM Trans. Multim. Comput. Commun. Appl.",
    "authors": [
        "Zhihan Lv",
        "Liang Qiao",
        "A. Singh",
        "Qingjun Wang"
    ],
    "doi": "10.1145/3418215",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a0b1a8bdc4ef170d61baba29e5d05863bf5d49a3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With increasing amounts of information, the image information received by people also increases exponentially. To perform fine-grained categorization and recognition of images and visual calculations, this study combines the Visual Geometry Group Network 16 model of convolutional neural networks and the vision attention mechanism to build a multi-level fine-grained image feature categorization model. Finally, the TensorFlow platform is utilized to simulate the fine-grained image classification model based on the visual attention mechanism. The results show that in terms of accuracy and required training time, the fine-grained image categorization effect of the multi-level feature categorization model constructed by this study is optimal, with an accuracy rate of 85.3% and a minimum training time of 108 s. In the similarity effect analysis, it is found that the chi-square distance between Log Gabor features and the degree of image distortion show a strong positive correlation; in addition, the validity of this measure is verified. Therefore, through the research in this study, it is found that the constructed fine-grained image categorization model has higher accuracy in image recognition categorization, shorter training time, and significantly better performance in similar feature effects, which provides an experimental reference for the visual computing of fine-grained images in the future.",
    "citationCount": 40,
    "referenceCount": 39
}