{
    "paperId": "a0c4424f851760ead4d6957b54ce0bbd52ddf66b",
    "title": "EvoStencils: a grammar-based genetic programming approach for constructing efficient geometric multigrid methods",
    "year": 2021,
    "venue": "Genetic Programming and Evolvable Machines",
    "authors": [
        "J. Schmitt",
        "S. Kuckuk",
        "H. Köstler"
    ],
    "doi": "10.1007/s10710-021-09412-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a0c4424f851760ead4d6957b54ce0bbd52ddf66b",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10710-021-09412-w.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For many systems of linear equations that arise from the discretization of partial differential equations, the construction of an efficient multigrid solver is challenging. Here we present EvoStencils, a novel approach for optimizing geometric multigrid methods with grammar-guided genetic programming, a stochastic program optimization technique inspired by the principle of natural evolution. A multigrid solver is represented as a tree of mathematical expressions that we generate based on a formal grammar. The quality of each solver is evaluated in terms of convergence and compute performance by automatically generating an optimized implementation using code generation that is then executed on the target platform to measure all relevant performance metrics. Based on this, a multi-objective optimization is performed using a non-dominated sorting-based selection. To evaluate a large number of solvers in parallel, they are distributed to multiple compute nodes. We demonstrate the effectiveness of our implementation by constructing geometric multigrid solvers that are able to outperform hand-crafted methods for Poisson’s equation and a linear elastic boundary value problem with up to 16 million unknowns on multi-core processors with Ivy Bridge and Broadwell microarchitecture.",
    "citationCount": 7,
    "referenceCount": 40
}