{
    "paperId": "a0eab87e158ce4f7e6dd7b0ba0cb7bf356b3f1bc",
    "title": "Exploring the 6G Potentials: Immersive, Hyperreliable, and Low-Latency Communication",
    "year": 2024,
    "venue": "IEEE Vehicular Technology Magazine",
    "authors": [
        "Afsoon Alidadi Shamsabadi",
        "Animesh Yadav",
        "Yasser Gadallah",
        "H. Yanikomeroglu"
    ],
    "doi": "10.1109/MVT.2025.3531346",
    "arxivId": "2407.11051",
    "url": "https://www.semanticscholar.org/paper/a0eab87e158ce4f7e6dd7b0ba0cb7bf356b3f1bc",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2407.11051",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The transition toward 6G wireless telecommunications networks introduces significant challenges for researchers and industry stakeholders. The 6G technology aims to enhance existing usage scenarios by supporting innovative applications that require stringent key performance indicators (KPIs). In some critical use cases of 6G, multiple KPIs, including immersive throughput, with an envisioned peak data rate of 1 Tb/s, hyperreliability, in the range of 10–5 to 10–7, and hyperlow latency, between 0.1 and 1 ms, must be achieved simultaneously to deliver the expected service experience. However, this is challenging because of the conflicting nature of these KPIs. This article proposes a new service class of 6G as immersive, hyperreliable, and low-latency communications and introduces a potential network architecture to achieve the associated KPIs. Specifically, enhanced technologies, such as ultramassive multiple-input, multiple-output-aided terahertz communications, reconfigurable intelligent surfaces, and nonterrestrial networks, are viewed as the key enablers for achieving immersive data rates and hyperreliability. Given the computational complexity involved in employing these technologies, we propose mathematical and computational enabling technologies, such as learning to optimize, generative artificial intelligence, quantum computing, and network digital twins, to complement the proposed architecture and optimize the latency.",
    "citationCount": 12,
    "referenceCount": 20
}