{
    "paperId": "a16c8162fc6c943bd950f1b7f7481a32b252bd7b",
    "title": "BiasBuster: a Neural Approach for Accurate Estimation of Population Statistics using Biased Location Data",
    "year": 2024,
    "venue": "International Conference on Mobile Data Management",
    "authors": [
        "Sepanta Zeighami",
        "Cyrus Shahabi"
    ],
    "doi": "10.1109/MDM61037.2024.00022",
    "arxivId": "2402.11318",
    "url": "https://www.semanticscholar.org/paper/a16c8162fc6c943bd950f1b7f7481a32b252bd7b",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2402.11318",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While extremely useful (e.g., for COVID-19 forecasting and policy-making, urban mobility analysis and marketing, and obtaining business insights), location data collected from mobile devices often contain data from a biased population subset, with some communities over or underrepresented in the collected datasets. As a result, aggregate statistics calculated from such datasets (as is done by various companies including Safegraph, Google, and Facebook), while ignoring the bias, leads to an inaccurate representation of population statistics. Such statistics will not only be generally inaccurate, but the error will disproportionately impact different population subgroups (e.g., because they ignore the underrepresented communities). This has dire consequences, as these datasets are used for sensitive decision-making such as COVID-19 policymaking. This paper tackles the problem of providing accurate population statistics using such biased datasets. We show that statistical debiasing, although in some cases useful, often fails to improve accuracy. We then propose BiasBuster, a neural network approach that utilizes the correlations between population statistics and location characteristics to provide accurate estimates of population statistics. Extensive experiments on real-world data show that BiasBuster improves accuracy by up to 2 times in general and up to 3 times for underrepresented populations.",
    "citationCount": 0,
    "referenceCount": 40
}