{
    "paperId": "a179bcd5a13646f3e359b0181337e51992770f2d",
    "title": "Unusual response of O3 and CH4 to NO2 emissions reduction in Japan during the COVID-19 pandemic",
    "year": 2023,
    "venue": "International Journal of Digital Earth",
    "authors": [
        "Anh Phan",
        "Hiromichi Fukui"
    ],
    "doi": "10.1080/17538947.2023.2297844",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a179bcd5a13646f3e359b0181337e51992770f2d",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/17538947.2023.2297844?needAccess=true",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT We investigate the impact of NO2 emissions reduction on O3 and CH4 levels in 14 metropolitan areas of Japan in 2020. To account for meteorological variations, we employ business-as-usual air quality time series generated by machine learning models. Additionally, we use satellite observations and biogeochemical model simulations to analyse air quality changes. During the lockdown period from April 7 to May 25 in 2020, we observed a NO2 reduction that equated to a decrease equivalent to 3.4 and 5 years of the corresponding trends in roadside and ambient air quality recorded from 2010 to 2019. After meteorological normalization, NO2 decreased by 14.5% at ambient air stations and 19.1% at roadside stations. Surprisingly, the NO2 reduction did not immediately lead to increased O3. Instead, O3 levels rose after the lockdown, specifically in August due to favorable sunny conditions. This finding is important for Japan and has not been reported in previous studies. We found that changes in NO2 and CO marginally contributed to variations in CH4 levels across the study areas. It is recommended to simultaneously reduce NOx as well as non-methane volatile organic compounds to mitigate their adverse effects on future policies.",
    "citationCount": 3,
    "referenceCount": 39
}