{
    "paperId": "a17e9788f7a66ac9576d715d46dd0f9909892fcf",
    "title": "Retrieval with Learned Similarities",
    "year": 2024,
    "venue": "The Web Conference",
    "authors": [
        "Bailu Ding",
        "Jiaqi Zhai"
    ],
    "doi": "10.1145/3696410.3714822",
    "arxivId": "2407.15462",
    "url": "https://www.semanticscholar.org/paper/a17e9788f7a66ac9576d715d46dd0f9909892fcf",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2407.15462",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Retrieval plays a fundamental role in recommendation systems, search, and natural language processing (NLP) by efficiently finding relevant items from a large corpus given a query. Dot products have been widely used as the similarity function in such tasks, enabled by Maximum Inner Product Search (MIPS) algorithms for efficient retrieval. However, state-of-the-art retrieval algorithms have migrated to learned similarities. These advanced approaches encompass multiple query embeddings, complex neural networks, direct item ID decoding via beam search, and hybrid solutions. Unfortunately, we lack efficient solutions for retrieval in these state-of-the-art setups. Our work addresses this gap by investigating efficient retrieval techniques with expressive learned similarity functions. We establish Mixture-of-Logits (MoL) as a universal approximator of similarity functions, demonstrate that MoL's expressiveness can be realized empirically to achieve superior performance on diverse retrieval scenarios, and propose techniques to retrieve the approximate top-k results using MoL with tight error bounds. Through extensive experimentation, we show that MoL, enhanced by our proposed mutual information-based load balancing loss, sets new state-of-the-art results across heterogeneous scenarios, including sequential retrieval models in recommendation systems and finetuning language models for question answering; and our approximate top-k algorithms outperform baselines by up to 66× in latency while achieving >.99 recall rate compared to exact algorithms.",
    "citationCount": 1,
    "referenceCount": 65
}