{
    "paperId": "a1997a2242cb26bb9b6056a58dd043440d421797",
    "title": "Cardinality Estimation in Inner Product Space",
    "year": 2022,
    "venue": "IEEE Open Journal of the Computer Society",
    "authors": [
        "Kohei Hirata",
        "Daichi Amagata",
        "Takahiro Hara"
    ],
    "doi": "10.1109/OJCS.2022.3215206",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a1997a2242cb26bb9b6056a58dd043440d421797",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/8782664/9682503/09921325.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article addresses the problem of cardinality estimation in inner product spaces. Given a set of high-dimensional vectors, a query, and a threshold, this problem estimates the number of vectors such that their inner products with the query are not less than the threshold. This is an important problem for recent machine-learning applications that maintain objects, such as users and items, by using matrices. The important requirements for solutions of this problem are high efficiency and accuracy. To satisfy these requirements, we propose a sampling-based algorithm. We build trees of vectors via transformation to a Euclidean space and dimensionality reduction in a pre-processing phase. Then our algorithm samples vectors existing in the nodes that intersect with a search range on one of the trees. Our algorithm is surprisingly simple, but it is theoretically and practically fast and effective. We conduct extensive experiments on real datasets, and the results demonstrate that our algorithm shows superior performance compared with existing techniques.",
    "citationCount": 5,
    "referenceCount": 36
}