{
    "paperId": "a1b2326d95c17a6254b521488f049f8cc818ea87",
    "title": "Deep Learning Approaches for Sunflower Disease Classification: A Study of Convolutional Neural Networks with Squeeze and Excitation Attention Blocks",
    "year": 2024,
    "venue": "Bitlis Eren Üniversitesi Fen Bilimleri Dergisi",
    "authors": [
        "Yavuz Ünal",
        "Muhammet Nuri Dudak"
    ],
    "doi": "10.17798/bitlisfen.1380995",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a1b2326d95c17a6254b521488f049f8cc818ea87",
    "isOpenAccess": true,
    "openAccessPdf": "https://dergipark.org.tr/en/download/article-file/3495810",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Diseases in agricultural plants are one of the most important problems of agricultural production. These diseases cause decreases in production and this poses a serious problem for food safety. One of the agricultural products is sunflower. Helianthus annuus, generally known as sunflower, is an agricultural plant with high economic value grown due to its drought-resistant and oil seeds. In this study, it is aimed to classify the diseases seen in sunflower leaves and flowers by applying deep learning models. First of all, it was classified with ResNet101 and ResNext101, which are pre-trained CNN models, and then it was classified by adding squeeze and excitation blocks to these networks and the results were compared. In the study, a data set containing gray mold, downy mildew, and leaf scars diseases affecting the sunflower crop was used. In our study, original Resnet101, SE-Resnet101, ResNext101, and SE-ResNext101 deep-learning models were used to classify sunflower diseases. For the original images, the classification accuracy of 91.48% with Resnet101, 92.55% with SE-Resnet101, 92.55% with ResNext101, and 94.68% with SE-ResNext101 was achieved. The same models were also suitable for augmented images and classification accuracies of Resnet101 99.20%, SE-Resnet101 99.47%, ResNext101 98.94%, and SE-ResNext101 99.84% were achieved. The study revealed a comparative analysis of deep learning models for the classification of some diseases in the Sunflower plant. In the analysis, it was seen that SE blocks increased the classification performance for this dataset. Application of these models to real-world agricultural scenarios holds promise for early disease detection and response and may help reduce potential crop losses.",
    "citationCount": 4,
    "referenceCount": 24
}