{
    "paperId": "a1c491d4e07995a0a7e7837fb7ad463c7a01da2f",
    "title": "Online Uniform Sampling: Randomized Learning-Augmented Approximation Algorithms with Application to Digital Health",
    "year": 2024,
    "venue": "",
    "authors": [
        "Xueqing Liu",
        "Kyra Gan",
        "Esmaeil Keyvanshokooh",
        "Susan Murphy"
    ],
    "doi": null,
    "arxivId": "2402.01995",
    "url": "https://www.semanticscholar.org/paper/a1c491d4e07995a0a7e7837fb7ad463c7a01da2f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Motivated by applications in digital health, this work studies the novel problem of online uniform sampling (OUS), where the goal is to distribute a sampling budget uniformly across unknown decision times. In the OUS problem, the algorithm is given a budget $b$ and a time horizon $T$, and an adversary then chooses a value $\\tau^* \\in [b,T]$, which is revealed to the algorithm online. At each decision time $i \\in [\\tau^*]$, the algorithm must determine a sampling probability that maximizes the budget spent throughout the horizon, respecting budget constraint $b$, while achieving as uniform a distribution as possible over $\\tau^*$. We present the first randomized algorithm designed for this problem and subsequently extend it to incorporate learning augmentation. We provide worst-case approximation guarantees for both algorithms, and illustrate the utility of the algorithms through both synthetic experiments and a real-world case study involving the HeartSteps mobile application. Our numerical results show strong empirical average performance of our proposed randomized algorithms against previously proposed heuristic solutions.",
    "citationCount": 1,
    "referenceCount": 28
}