{
    "paperId": "a1c8b094a04462a5b1fe8242a10745594b78dc69",
    "title": "Deep Convolutional Neural Networks With Transfer Learning for Automobile Damage Image Classification",
    "year": 2022,
    "venue": "Journal of Database Management",
    "authors": [
        "Xiaoguang Tian",
        "Henry Han"
    ],
    "doi": "10.4018/jdm.309738",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a1c8b094a04462a5b1fe8242a10745594b78dc69",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning models are more capable of handling large and complex datasets that generally appear in the insurance industry than traditional machine learning models. In this study, transfer learning was employed to build and optimize a simulated automobile damage assessment system. Several classic deep learning methods were applied to extract features from original and augmented automobile damage images. Then, traditional machine learning and cross-validation techniques were applied to train and validate the system. The proposed deep learning model demonstrated advantages over traditional machine learning models regarding features extraction and accuracy. Deep learning approaches fused with logistic regression and support vector machine were found performing as well as those with artificial neural networks under two simulated scenarios. With the proposed method, automobile damage images can be evaluated for insurance adjustment purposes automatically, based on the acquired input. Hence, insurers can automate the claim and adjustment process, thereby achieving cost and time savings.",
    "citationCount": 8,
    "referenceCount": 28
}