{
    "paperId": "a1ce075fea25aa0164b1a40cdd29e58ef134a7f4",
    "title": "LTL-Net-Based Scene Recognition for GNSS/SINS Adaptive Fusion Positioning",
    "year": 2025,
    "venue": "IEEE Transactions on Instrumentation and Measurement",
    "authors": [
        "Yunjian Guo",
        "Jinguang Jiang",
        "Jiaji Wu",
        "Ziyan Yu",
        "Yuying Li",
        "Qiyuan Zheng",
        "Jingnan Liu"
    ],
    "doi": "10.1109/TIM.2025.3597007",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a1ce075fea25aa0164b1a40cdd29e58ef134a7f4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The high-precision positioning services provided by the Global Navigation Satellite System (GNSS) are crucial for the safe operation of autonomous vehicles. However, GNSS degradation in complex urban environments can lead to a decline in the performance of integrated navigation systems. To address this issue, this article proposes a scene-adaptive Kalman filtering (SAKF) algorithm for detecting urban scene categories and providing stable and reliable fusion positioning results. First, we design a lightweight Transformer-LSTM network (LTL-net) based on an attention mechanism, which is used to identify the scene type in which the vehicle is located. Second, we introduce a new adaptive factor based on the scene recognition results, enabling the Kalman filter (KF) to adjust the observation noise covariance matrix according to the specific scene, thereby achieving adaptive and robust correction of the KF. Vehicle-based experimental results conducted in complex urban scenes demonstrate that the proposed LTL-net can accurately identify urban scene types, and the designed scene-adaptive factor significantly improves the positioning performance of the integrated navigation system. This approach offers a more accurate, reliable, and intelligent solution for positioning services in complex urban environments.",
    "citationCount": 0,
    "referenceCount": 57
}