{
    "paperId": "a1fa30f4e12a6ea768f0a389a2dd0cbb7a799e1e",
    "title": "Winter Wheat Yield Prediction Using Satellite Remote Sensing Data and Deep Learning Models",
    "year": 2025,
    "venue": "Agronomy",
    "authors": [
        "Hongkun Fu",
        "Jian Lu",
        "Jian Li",
        "Wenlong Zou",
        "Xuhui Tang",
        "Xiangyu Ning",
        "Yue Sun"
    ],
    "doi": "10.3390/agronomy15010205",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a1fa30f4e12a6ea768f0a389a2dd0cbb7a799e1e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/agronomy15010205",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate crop yield prediction is crucial for formulating agricultural policies, guiding agricultural management, and optimizing resource allocation. This study proposes a method for predicting yields in China’s major winter wheat-producing regions using MOD13A1 data and a deep learning model which incorporates an Improved Gray Wolf Optimization (IGWO) algorithm. By adjusting the key parameters of the Convolutional Neural Network (CNN) with IGWO, the prediction accuracy is significantly enhanced. Additionally, the study explores the potential of the Green Normalized Difference Vegetation Index (GNDVI) in yield prediction. The research utilizes data collected from March to May between 2001 and 2010, encompassing vegetation indices, environmental variables, and yield statistics. The results indicate that the IGWO-CNN model outperforms traditional machine learning approaches and standalone CNN models in terms of prediction accuracy, achieving the highest performance with an R2 of 0.7587, an RMSE of 593.6 kg/ha, an MAE of 486.5577 kg/ha, and an MAPE of 11.39%. The study finds that April is the optimal period for early yield prediction of winter wheat. This research validates the effectiveness of combining deep learning with remote sensing data in crop yield prediction, providing technical support for precision agriculture and contributing to global food security and sustainable agricultural development.",
    "citationCount": 9,
    "referenceCount": 64
}