{
    "paperId": "a28ea481c180c8e66542078f2e973ba7e5ed7fca",
    "title": "Combined Genome-Wide Association Study and Transcriptome Analysis Reveal Candidate Genes for Resistance to Rust (Puccinia graminis) in Dactylis glomerata.",
    "year": 2024,
    "venue": "Plant Disease",
    "authors": [
        "Yarong Jin",
        "G. Feng",
        "Jinchan Luo",
        "Haidong Yan",
        "Min Sun",
        "Tingting Jing",
        "Yuchen Yang",
        "Jiyuan Jia",
        "Xin Zhu",
        "Xiaoshan Wang",
        "Xinquan Zhang",
        "Linkai Huang"
    ],
    "doi": "10.1094/PDIS-02-24-0360-RE",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a28ea481c180c8e66542078f2e973ba7e5ed7fca",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rust disease is a common plant disease that can cause wilting, slow growth of plant leaves, and even affect the growth and development of plants. Orchardgrass (Dactylis glomerata L.) is native to temperate regions of Europe, which has been introduced as a superior forage grass in temperate regions worldwide. Orchardgrass has rich genetic diversity and is widely distributed in the world, which may contain rust resistance genes not found in other crops. Therefore, we collected a total of 333 orchardgrass accessions from different regions around the world. Through a genome-wide association study (GWAS) analysis conducted in four different environments, 91 genes that overlap or are adjacent to significant single nucleotide polymorphisms (SNPs) were identified as potential rust disease resistance genes. Combining transcriptome data from susceptible (PI292589) and resistant (PI251814) accessions, the GWAS candidate gene DG5C04160.1 encoding glutathione S-transferase (GST) was found to be important for orchardgrass rust (Puccinia graminis) resistance. Interestingly, by comparing the number of GST gene family members in seven species, it was found that orchardgrass has the most GST gene family members, containing 119 GST genes. Among them, 23 GST genes showed significant differential expression after inoculation with the rust pathogen in resistant and susceptible accessions; 82% of the genes still showed significantly increased expression 14 days after inoculation in resistant accessions, while the expression level significantly decreased in susceptible accessions. These results indicate that GST genes play an important role in orchardgrass resistance to rust (P. graminis) stress by encoding GST to reduce its oxidative stress response.",
    "citationCount": 2,
    "referenceCount": 43
}