{
    "paperId": "a31cabb596ab0d589e2774180dca856363569ced",
    "title": "VLC and D2D Heterogeneous Network Optimization: A Reinforcement Learning Approach Based on Equilibrium Problems With Equilibrium Constraints",
    "year": 2019,
    "venue": "IEEE Transactions on Wireless Communications",
    "authors": [
        "Neetu Raveendran",
        "Huaqing Zhang",
        "Dusist Niyato",
        "Fang Yang",
        "Jian Song",
        "Zhu Han"
    ],
    "doi": "10.1109/TWC.2018.2890057",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a31cabb596ab0d589e2774180dca856363569ced",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/twc.2018.2890057",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The radio frequency spectrum crunch has triggered the harnessing of other sources of bandwidth, for which visible light is a promising candidate. Even though visible light communication (VLC) ensures high capacity, coverage is limited. This necessitates the integration of VLC and device-to-device (D2D) technologies into heterogeneous networks. In particular, mobile users which are accessible by the VLC transmitters can relay data to mobile users which are not, by means of D2D communication. However, due to the distributed behaviors of mobile users, determining optimal data transmission routes from VLC transmitters to end mobile devices is a major challenge. In this paper, we propose a reinforcement learning (RL)-based approach to determine multi-hop data transmission routes in an indoor VLC-D2D heterogeneous network. We obtain the rewards for the RL-based method dynamically, by formulating the interactions between the mobile users relaying the data as an equilibrium problem with equilibrium constraints and using alternating direction method of multipliers to solve it. The proposed technique can achieve optimal data transmission routes in a distributed manner. The simulation results demonstrate the effectiveness of the proposed approach, showing that transmission routes with low delays and high capacities can be achieved through the learning algorithm.",
    "citationCount": 23,
    "referenceCount": 50
}