{
    "paperId": "a339d6c19f0ed4383baab96a75bb5b1d0a917503",
    "title": "NetChain: Authenticated Blockchain Top-k Graph Data Queries and its Application in Asset Management",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Hongguang Zhao",
        "Xu Yang",
        "Saiyu Qi",
        "Qiuhao Wang",
        "Ke Li"
    ],
    "doi": "10.48550/arXiv.2501.15077",
    "arxivId": "2501.15077",
    "url": "https://www.semanticscholar.org/paper/a339d6c19f0ed4383baab96a75bb5b1d0a917503",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a valuable digital resource, graph data is an important data asset, which has been widely utilized across various fields to optimize decision-making and enable smarter solutions. To manage data assets, blockchain is widely used to enable data sharing and trading, but it cannot supply complex analytical queries. vChain was proposed to achieve verifiable boolean queries over blockchain by designing an embedded authenticated data structure (ADS). However, for generating (non-)existence proofs, vChain suffers from expensive storage and computation costs in ADS construction, along with high communication and verification costs. In this paper, we propose a novel NetChain framework that enables efficient top-k queries over on-chain graph data with verifiability. Specifically, we design a novel authenticated two-layer index that supports (non-)existence proof generation in block-level and built-in verifiability for matched objects. To further alleviate the computation and verification overhead, an optimized variant NetChain+ is derived. The authenticity of our frameworks is validated through security analysis. Evaluations show that NetChain and NetChain+ outperform vChain, respectively achieving up to 85X and 31X improvements on ADS construction. Moreover, compared with vChain, NetChain+ reduces the communication and verification costs by 87% and 96% respectively.",
    "citationCount": 0,
    "referenceCount": 19
}