{
    "paperId": "a360759a48ba29827ae1b590defe3676d12fe3c1",
    "title": "Efficient Strongly Polynomial Algorithms for Quantile Regression",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Suraj Shetiya",
        "Shohedul Hasan",
        "Abolfazl Asudeh",
        "Gautam Das"
    ],
    "doi": "10.48550/arXiv.2307.08706",
    "arxivId": "2307.08706",
    "url": "https://www.semanticscholar.org/paper/a360759a48ba29827ae1b590defe3676d12fe3c1",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2307.08706",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Linear Regression is a seminal technique in statistics and machine learning, where the objective is to build linear predictive models between a response (i.e., dependent) variable and one or more predictor (i.e., independent) variables. In this paper, we revisit the classical technique of Quantile Regression (QR), which is statistically a more robust alternative to the other classical technique of Ordinary Least Square Regression (OLS). However, while there exist efficient algorithms for OLS, almost all of the known results for QR are only weakly polynomial. Towards filling this gap, this paper proposes several efficient strongly polynomial algorithms for QR for various settings. For two dimensional QR, making a connection to the geometric concept of $k$-set, we propose an algorithm with a deterministic worst-case time complexity of $\\mathcal{O}(n^{4/3} polylog(n))$ and an expected time complexity of $\\mathcal{O}(n^{4/3})$ for the randomized version. We also propose a randomized divide-and-conquer algorithm -- RandomizedQR with an expected time complexity of $\\mathcal{O}(n\\log^2{(n)})$ for two dimensional QR problem. For the general case with more than two dimensions, our RandomizedQR algorithm has an expected time complexity of $\\mathcal{O}(n^{d-1}\\log^2{(n)})$.",
    "citationCount": 0,
    "referenceCount": 29
}