{
    "paperId": "a363f3edc16a3986aace82d2a6c2563a84407825",
    "title": "Learning the Use of Artificial Intelligence in Heterogeneous Catalysis",
    "year": 2021,
    "venue": "Frontiers in Chemical Engineering",
    "authors": [
        "X. Bokhimi"
    ],
    "doi": "10.3389/fceng.2021.740270",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a363f3edc16a3986aace82d2a6c2563a84407825",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fceng.2021.740270/pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We describe the use of artificial intelligence techniques in heterogeneous catalysis. This description is intended to give readers some clues for the use of these techniques in their research or industrial processes related to hydrodesulfurization. Since the description corresponds to supervised learning, first of all, we give a brief introduction to this type of learning, emphasizing the variables X and Y that define it. For each description, there is a particular emphasis on highlighting these variables. This emphasis will help define them when one works on a new application. The descriptions that we present relate to the construction of learning machines that infer adsorption energies, surface areas, adsorption isotherms of nanoporous materials, novel catalysts, and the sulfur content after hydrodesulfurization. These learning machines can predict adsorption energies with mean absolute errors of 0.15 eV for a diverse chemical space. They predict more precise surface areas of porous materials than the BET technique and can calculate their isotherms much faster than the Monte Carlo method. These machines can also predict new catalysts by learning from the catalytic behavior of materials generated through atomic substitutions. When the machines learn from the variables associated with a hydrodesulfurization process, they can predict the sulfur content in the final product.",
    "citationCount": 5,
    "referenceCount": 87
}