{
    "paperId": "a3827f9954b504aa153333470c29a1edd09c3cba",
    "title": "Evaluating Smart Home Privacy: The Relationship Between Encrypted Sensor Data and Occupancy Prediction Through Machine Learning",
    "year": 2025,
    "venue": "Computer Science Symposium in Russia",
    "authors": [
        "Sneha Mohanty",
        "Demetrios N. Papadopoulos",
        "Christian Schindelhauer"
    ],
    "doi": "10.1109/CSR64739.2025.11129999",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a3827f9954b504aa153333470c29a1edd09c3cba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The widespread adoption of smart meters and other IoT devices in smart homes has revolutionized residential energy management. However, this convenience comes with significant privacy risks, as malicious individuals can exploit leaked data to predict household occupancy, potentially enabling crimes like burglary and theft. Therefore, to safeguard occupancy data in a given household, we introduce a novel, efficient and robust cryptographic scheme subdivided into two. Both methods involve a robust two-fold encryption process, i.e.; performing Customized Fernet-256 encryption with random shuffling vs Customized Fernet-256 encryption with strategy based operations on household data, respectively. To test the effectiveness of these two methods, we predict the occupancy using an AutoML classifier on encrypted and unencrypted data. The random shuffling method steadily reduces the classifier’s accuracy as the percentage of encryption increases. In contrast, the strategic method achieves strong protection against intrusion even with minimal intervention, although its performance improvement plateaus after an initial decline. This is a significant improvement over unencrypted data, where attackers could have achieved $\\gt95 \\%$ across all performance metrics. Furthermore, we found that the strategic method attains a remarkable F1-Score of 0.447 for predicting absence at $100 \\%$ encryption level, underscoring the difficulty of the attacker in accurately predicting household occupancy status during the test period. The corresponding value for the random shuffling method is 0.005, illustrating its superiority in terms of F1-Score. These findings signify the importance of encryption as a privacy-preserving measure in smart homes and demonstrate its ability to prevent unauthorized occupancy inference.",
    "citationCount": 0,
    "referenceCount": 23
}