{
    "paperId": "a38f27233b56056bd8ce5d674e95b59db9732df0",
    "title": "Network Intrusion Detection Scheme Based on Federated Learning in Heterogeneous Network Environments",
    "year": 2024,
    "venue": "International Conference on Communications, Circuits and Systems",
    "authors": [
        "Yuedi Zhu",
        "Chao Li",
        "Yong Wang"
    ],
    "doi": "10.1109/ICCCAS62034.2024.10652649",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a38f27233b56056bd8ce5d674e95b59db9732df0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The ongoing evolution of digital transformation poses new challenges for our society. In the domain of networks, we confront a series of challenges related to dependence and the implementation of security through design. As a result, strategies centered around data and machine learning techniques become effective options for ensuring the security of extensive network systems. However, in the field of network security, solutions based on machine learning encounter challenges regarding generalization across different contexts and privacy. In other words, solutions relying on specific network data often encounter limitations in terms of performance when applied to different networks. The paper introduces a federated learning (FL) approach tailored for Network Intrusion Detection Systems (NIDS). By integrating the Energy Flow Classifier with the Gaussian Mixture Model clustering algorithm into the federated learning strategy, the proposed method performs well when handling non-IID (Non-Independent Identically Distributed) data and provides a viable solution for achieving generalization across diverse networks.",
    "citationCount": 0,
    "referenceCount": 21
}