{
    "paperId": "a3abf77fe92ab689b482c105afeee4c8eafd0987",
    "title": "Integrating QTL mapping, BSA-seq and RNA-seq to identify candidate genes regulating seed storability from Dongxiang wild rice",
    "year": 2025,
    "venue": "Frontiers in Plant Science",
    "authors": [
        "Shiqi Zhou",
        "Ting Wu",
        "Shilin Wang",
        "Jiwai He",
        "Biaolin Hu"
    ],
    "doi": "10.3389/fpls.2025.1644153",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a3abf77fe92ab689b482c105afeee4c8eafd0987",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rice seed storability (SS) is crucial for germplasm preservation, agricultural production, grain storage, and food security. Dongxiang wild rice (Oryza rufipogon Griff., hereafter DXWR) is a common wild rice adapted to the northernmost area worldwide and possesses strong SS. Xieqingzao B (XB) is a maintainer line widely used in hybrid rice. DXWR and XB were crossed and subsequently backcrossed with XB four times to develop the strong -SS line 19H19 in the BC4F2. Subsequently, 19H19, XB, and their 120 BC5F2 lines were employed to study SS under artificial aging. A genetic map identified four quantitative trait loci (QTLs), and BSA-seq identified another four QTLs; qSS6.1 was co-identified by both approaches. By combining QTL mapping, BSA-seq, and RNA-seq, 31 candidate genes were identified in total for SS. Among these, the gene Os06g0287500 within the qSS6.1 interval was associated with “defense response.” It was downregulated in 19H19 but upregulated in XB after aging, likely due to nonsynonymous mutations and deletions in the exon of parental XB. Genetic analysis confirmed that Os06g0287500 was significantly associated with SS in rice. Haplotype analysis of Os06g0287500 among 141 core germplasm accessions revealed that the Hap1/DXWR(19H19)-type accessions had significantly stronger SS than the Hap2/XB -type and Hap3 accessions under artificial aging. The Hap1/DXWR (19H19) group exhibited the strongest SS among the three haplotypes under both artificial and natural aging conditions. A gene interaction network regulating SS in rice was constructed based on a STRING database assay, wherein differentially expressed genes (DEGs) related to “kinase activity” interacted with Os06g0287500. Therefore, Os06g0287500 is a promising candidate gene involved in SS in rice. These findings not only provide critical insight into the genetic mechanisms regulating SS in rice but also offer novel genetic resources for broadening the gene pool of cultivated rice and developing new varieties with enhanced SS through QTL pyramiding.",
    "citationCount": 0,
    "referenceCount": 57
}