{
    "paperId": "a3b132eeac2c78dee390453ca4d8d010a4b91752",
    "title": "Multi-Temporal Satellite Investigation of gas Flaring in Iraq and Iran: The DAFI Porting on Collection 2 Landsat 8/9 and Sentinel 2A/B",
    "year": 2023,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "M. Faruolo",
        "N. Genzano",
        "F. Marchese",
        "N. Pergola"
    ],
    "doi": "10.3390/s23125734",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a3b132eeac2c78dee390453ca4d8d010a4b91752",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/12/5734/pdf?version=1687248896",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The synergic use of satellite data at moderate spatial resolution (i.e., 20–30 m) from the new Collection 2 (C2) Landsat-8/9 (L8/9) Operational Land Imager (OLI) and Sentinel-2 (S2) Multispectral Instrument (MSI) provides a new perspective in the remote sensing applications for gas flaring (GF) identification and monitoring, thanks to a significant improvement in the revisiting time (up to ~3 days). In this study, the daytime approach for gas flaring investigation (DAFI), recently developed for identifying, mapping and monitoring GF sites on a global scale using the L8 infrared radiances, has been ported on a virtual constellation (VC) (formed by C2 L8/9 + S2) to assess its capability in understanding the GF characteristics in the space-time domain. The findings achieved for the regions of Iraq and Iran, ranked at the second and third level among the top 10 gas flaring countries in 2022, demonstrate the reliability of the developed system, with improved levels of accuracy and sensitivity (+52%). As an outcome of this study, a more realistic picture of GF sites and their behavior is achieved. A new step aimed at quantifying the GFs radiative power (RP) has been added in the original DAFI configuration. The preliminary analysis of the daily OLI- and MSI-based RP, provided for all the sites by means of a modified RP formulation, revealed their good matching. An agreement of 90% and 70% between the annual RPs computed in Iraq and Iran and both their gas-flared volumes and carbon dioxide emissions were also recorded. Being that gas flaring is one of the main sources of greenhouse gases (GHG) worldwide, the RP products may concur to infer globally the GHGs GF emissions at finer spatial scales. For the presented achievements, DAFI can be seen as a powerful satellite tool able to automatically assess the gas flaring dimension on a global scale.",
    "citationCount": 6,
    "referenceCount": 40
}