{
    "paperId": "a3b4d47705f4ef623d22006eeab405a0863eee99",
    "title": "On a Scale-Invariant Approach to Bundle Recommendations in Candy Crush Saga",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Styliani Katsarou",
        "Francesca Carminati",
        "Martin Dlask",
        "Marta Braojos",
        "Lavena Patra",
        "Richard Perkins",
        "Carlos García Ling",
        "Maria Paskevich"
    ],
    "doi": "10.48550/arXiv.2408.06799",
    "arxivId": "2408.06799",
    "url": "https://www.semanticscholar.org/paper/a3b4d47705f4ef623d22006eeab405a0863eee99",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A good understanding of player preferences is crucial for increasing content relevancy, especially in mobile games. This paper illustrates the use of attentive models for producing item recommendations in a mobile game scenario. The methodology comprises a combination of supervised and unsupervised approaches to create user-level recommendations while introducing a novel scale-invariant approach to the prediction. The methodology is subsequently applied to a bundle recommendation in Candy Crush Saga. The strategy of deployment, maintenance, and monitoring of ML models that are scaled up to serve millions of users is presented, along with the best practices and design patterns adopted to minimize technical debt typical of ML systems. The recommendation approach is evaluated both offline and online, with a focus on understanding the increase in engagement, click- and take rates, novelty effects, recommendation diversity, and the impact of degenerate feedback loops. We have demonstrated that the recommendation enhances user engagement by 30% concerning click rate and by more than 40% concerning take rate. In addition, we empirically quantify the diminishing effects of recommendation accuracy on user engagement.",
    "citationCount": 0,
    "referenceCount": 41
}