{
    "paperId": "a3f3feac1cdd9e2d4f5367a979d06d1504df602f",
    "title": "Artificial Intelligence for Safety-Critical Systems in Industrial and Transportation Domains: A Survey",
    "year": 2023,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Jon Pérez-Cerrolaza",
        "Jaume Abella",
        "Markus Borg",
        "Carlo Donzella",
        "Jesús Cerquides",
        "F. Cazorla",
        "Cristofer Englund",
        "Markus Tauber",
        "G. Nikolakopoulos",
        "Jose Luis Flores"
    ],
    "doi": "10.1145/3626314",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a3f3feac1cdd9e2d4f5367a979d06d1504df602f",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3626314",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial Intelligence (AI) can enable the development of next-generation autonomous safety-critical systems in which Machine Learning (ML) algorithms learn optimized and safe solutions. AI can also support and assist human safety engineers in developing safety-critical systems. However, reconciling both cutting-edge and state-of-the-art AI technology with safety engineering processes and safety standards is an open challenge that must be addressed before AI can be fully embraced in safety-critical systems. Many works already address this challenge, resulting in a vast and fragmented literature. Focusing on the industrial and transportation domains, this survey structures and analyzes challenges, techniques, and methods for developing AI-based safety-critical systems, from traditional functional safety systems to autonomous systems. AI trustworthiness spans several dimensions, such as engineering, ethics and legal, and this survey focuses on the safety engineering dimension.",
    "citationCount": 82,
    "referenceCount": 289
}