{
    "paperId": "a3f3ecb5772890139ab719ff1ba25b3ecfdc9f71",
    "title": "Towards Large-scale Generative Ranking",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yanhua Huang",
        "Yuqi Chen",
        "Xiong Cao",
        "Rui Yang",
        "Mingliang Qi",
        "Ying Zhu",
        "Qingchang Han",
        "Yaowei Liu",
        "Zhaoyu Liu",
        "Xuefeng Yao",
        "Yuting Jia",
        "Leilei Ma",
        "Yinqi Zhang",
        "Taoyu Zhu",
        "Liujie Zhang",
        "Lei Chen",
        "Weihang Chen",
        "Mingdong Zhu",
        "Ruiwen Xu",
        "Lei Zhang"
    ],
    "doi": "10.48550/arXiv.2505.04180",
    "arxivId": "2505.04180",
    "url": "https://www.semanticscholar.org/paper/a3f3ecb5772890139ab719ff1ba25b3ecfdc9f71",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative recommendation has recently emerged as a promising paradigm in information retrieval. However, generative ranking systems are still understudied, particularly with respect to their effectiveness and feasibility in large-scale industrial settings. This paper investigates this topic at the ranking stage of Xiaohongshu's Explore Feed, a recommender system that serves hundreds of millions of users. Specifically, we first examine how generative ranking outperforms current industrial recommenders. Through theoretical and empirical analyses, we find that the primary improvement in effectiveness stems from the generative architecture, rather than the training paradigm. To facilitate efficient deployment of generative ranking, we introduce GenRank, a novel generative architecture for ranking. We validate the effectiveness and efficiency of our solution through online A/B experiments. The results show that GenRank achieves significant improvements in user satisfaction with nearly equivalent computational resources compared to the existing production system.",
    "citationCount": 4,
    "referenceCount": 29
}