{
    "paperId": "a425bb902ad8217efd5c6efc957364a31890eb93",
    "title": "How Good Are Modern Spatial Libraries?",
    "year": 2020,
    "venue": "Data Science and Engineering",
    "authors": [
        "Varun Pandey",
        "Alexander van Renen",
        "Andreas Kipf",
        "A. Kemper"
    ],
    "doi": "10.1007/s41019-020-00147-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a425bb902ad8217efd5c6efc957364a31890eb93",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s41019-020-00147-9.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many applications today like Uber, Yelp, Tinder, etc. rely on spatial data or locations from its users. These applications and services either build their own spatial data management systems or rely on existing solutions. JTS Topology Suite (JTS), its C++ port GEOS, Google S2, ESRI Geometry API, and Java Spatial Index (JSI) are some of the spatial processing libraries that these systems build upon. These applications and services depend on indexing capabilities available in these libraries for high-performance spatial query processing. In this work, we compare these libraries qualitatively and quantitatively based on four different spatial queries using two real world datasets. We also compare these libraries with an open-source implementation of the Vantage Point Tree—an index structure that has been well studied in image retrieval and nearest-neighbor search algorithms for high-dimensional data. We found that Vantage Point Trees are very competitive and even outperform the aforementioned libraries in two queries.",
    "citationCount": 20,
    "referenceCount": 75
}