{
    "paperId": "a428c44a7024044badcbac12020bcce4a0afd113",
    "title": "LePaRD: A Large-Scale Dataset of Judicial Citations to Precedent",
    "year": 2024,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Robert Mahari",
        "Dominik Stammbach",
        "Elliott Ash",
        "A. Pentland"
    ],
    "doi": "10.18653/v1/2024.acl-long.532",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a428c44a7024044badcbac12020bcce4a0afd113",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present the Legal Passage Retrieval Dataset, LePaRD. LePaRD contains millions of examples of U.S. federal judges citing precedent in context. The dataset aims to facilitate work on legal passage retrieval, a challenging practice-oriented legal retrieval and reasoning task. Legal passage retrieval seeks to predict relevant passages from precedential court decisions given the context of a legal argument. We extensively evaluate various approaches on LePaRD, and find that classification-based retrieval appears to work best. Our best models only achieve a recall of 59% when trained on data corresponding to the 10,000 most-cited passages, underscoring the difficulty of legal passage retrieval. By publishing LePaRD, we provide a large-scale and high quality resource to foster further research on legal passage retrieval. We hope that research on this practice-oriented NLP task will help expand access to justice by reducing the burden associated with legal research via computational assistance. Warning: Extracts from judicial opinions may contain offensive language.",
    "citationCount": 5,
    "referenceCount": 45
}