{
    "paperId": "a43c169b7f4aebee148a14efafac8b14c5f49f04",
    "title": "Estimating a potential without the agony of the partition function",
    "year": 2022,
    "venue": "SIAM Journal on Mathematics of Data Science",
    "authors": [
        "E. Haber",
        "Moshe Eliasof",
        "L. Tenorio"
    ],
    "doi": "10.48550/arXiv.2208.09433",
    "arxivId": "2208.09433",
    "url": "https://www.semanticscholar.org/paper/a43c169b7f4aebee148a14efafac8b14c5f49f04",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2208.09433",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Estimating a Gibbs density function given a sample is an important problem in computational statistics and statistical learning. Although the well established maximum likelihood method is commonly used, it requires the computation of the partition function (i.e., the normalization of the density). This function can be easily calculated for simple low-dimensional problems but its computation is difficult or even intractable for general densities and high-dimensional problems. In this paper we propose an alternative approach based on Maximum A-Posteriori (MAP) estimators, we name Maximum Recovery MAP (MR-MAP), to derive estimators that do not require the computation of the partition function, and reformulate the problem as an optimization problem. We further propose a least-action type potential that allows us to quickly solve the optimization problem as a feed-forward hyperbolic neural network. We demonstrate the effectiveness of our methods on some standard data sets.",
    "citationCount": 2,
    "referenceCount": 53
}