{
    "paperId": "a48cfb5fd094d34062b6b38ee0d32f471c485518",
    "title": "Poison exon annotations improve the yield of clinically relevant variants in genomic diagnostic testing",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "S. Felker",
        "J. Lawlor",
        "S. Hiatt",
        "M. Thompson",
        "D. Latner",
        "C. Finnila",
        "K. Bowling",
        "Zachary T Bonnstetter",
        "Katherine E Bonini",
        "Nicole R Kelly",
        "W. Kelley",
        "A. Hurst",
        "Salman Rashid",
        "M. Kelly",
        "Ghunwa A. Nakouzi",
        "L. Hendon",
        "E. Bebin",
        "E. Kenny",
        "G. Cooper"
    ],
    "doi": "10.1101/2023.01.12.523654",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a48cfb5fd094d34062b6b38ee0d32f471c485518",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1016/j.gim.2023.100884",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose Neurodevelopmental disorders (NDDs) often result from rare genetic variation, but genomic testing yield for NDDs remains around 50%, suggesting some clinically relevant rare variants may be missed by standard analyses. Here we analyze “poison exons” (PEs) which, while often absent from standard gene annotations, are alternative exons whose inclusion results in a premature termination codon. Variants that alter PE inclusion can lead to loss-of-function and may be highly penetrant contributors to disease. Methods We curated published RNA-seq data from developing mouse cortex to define 1,937 PE regions conserved between humans and mice and potentially relevant to NDDs. We then analyzed variants found by genome sequencing in multiple NDD cohorts. Results Across 2,999 probands, we found six clinically relevant variants in PE regions that were previously overlooked. Five of these variants are in genes that are part of the sodium voltage-gated channel alpha subunit family (SCN1A, SCN2A, and SCN8A), associated with epilepsies. One variant is in SNRPB, associated with Cerebrocostomandibular Syndrome. These variants have moderate to high computational impact assessments, are absent from population variant databases, and were observed in probands with features consistent with those reported for the associated gene. Conclusion With only a minimal increase in variant analysis burden (most probands had zero or one candidate PE variants in a known NDD gene, with an average of 0.77 per proband), annotation of PEs can improve diagnostic yield for NDDs and likely other congenital conditions.",
    "citationCount": 6,
    "referenceCount": 54
}