{
    "paperId": "a4c3ccf1fac6deca9842a9545910a418eb5d276c",
    "title": "Security Enhanced Dynamic Bandwidth Allocation-Based Reinforcement Learning",
    "year": 2024,
    "venue": "WSEAS Transactions on Information Science and Applications",
    "authors": [
        "Ashraf Abu-Ein",
        "Waleed Abdelkarim Abuain",
        "Mohannad Alhafnawi",
        "Obaida M. Al-hazaimeh"
    ],
    "doi": "10.37394/23209.2025.22.3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a4c3ccf1fac6deca9842a9545910a418eb5d276c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, the problem of allocating bandwidth has arisen due to the limitation of bandwidth resources. Reinforcement learning is a good technique that can be used for improving throughput, and efficiency and minimizing the overall blocking of the network. To optimize performance metrics such as throughput and Quality of Service (e.g., QoS), this research employs Reinforcement Learning (e.g., RL) and models bandwidth allocation in networking as a Markov Decision Process (e.g., MDP). Interacting with the network and modifying rewards-based policies, the agent acquires the ability to allocate bandwidth efficiently using RL techniques like Q-learning. Resource management, quality of service (e.g., QoS), fairness, security, and privacy are among the challenges the approach addresses in Dynamic Bandwidth Allocation (e.g., DBA). This approach illustrates how RL can enhance network performance and decision-making across a variety of applications. The obtained results indicate that RL algorithms are more effective in enhancing network performance, Quality of Service (e.g., QoS), and user fairness.",
    "citationCount": 5,
    "referenceCount": 26
}