{
    "paperId": "a4ccd881151b20a8692e539fa5b3ddb10e4f9a00",
    "title": "MANN: Multi-head Attention Network Model for Estimating Cardinality in Multi-model Databases",
    "year": 2024,
    "venue": "Proceedings of the 2024 7th International Conference on Computer Information Science and Artificial Intelligence",
    "authors": [
        "Ruihai Deng",
        "Aihua Wu"
    ],
    "doi": "10.1145/3703187.3703270",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a4ccd881151b20a8692e539fa5b3ddb10e4f9a00",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In database query optimization, cardinality estimation is the key to determine the efficiency of query planning. Traditional methods often encounter accuracy challenges when processing complex queries, prompting researchers to explore machine learning techniques to enhance estimation quality. Numerous studies have shown that machine learning methods can effectively solve the problem of cardinality estimation, but in the field of multi model databases, research on machine learning based cardinality estimation is still in its infancy. This article focuses on the problem of query cardinality estimation on multi model databases and applies a multi head attention mechanism to construct a neural network model, namely Multi head Attention Neural Network (MANN), which can effectively capture complex relationships between tables or predicates, thereby improving estimation accuracy. MANN decomposes query statements into multiple sub query sets based on table names, and normalizes the query features within each set. It uses multi head attention mechanism to train, recognize, and learn the correlations between tables or predicates. This model supports SQL and Arango Query Language (AQL) queries and is suitable for multi model databases such as ArangoDB. Experiments were conducted on the synthetic dataset UniBench and the real dataset IMDb, and the results showed that MANN exhibited higher accuracy and efficiency in handling cardinality estimation problems compared to existing techniques. Its performance was particularly outstanding in handling high predicate relevance queries, with the median error 39% better than existing state-of-the-art methods.",
    "citationCount": 0,
    "referenceCount": 20
}