{
    "paperId": "a4e887a5f20289603448eaad607265adc29c778d",
    "title": "Structure and Semantics Preserving Document Representations",
    "year": 2022,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Natraj Raman",
        "Sameena Shah",
        "M. Veloso"
    ],
    "doi": "10.1145/3477495.3532062",
    "arxivId": "2201.03720",
    "url": "https://www.semanticscholar.org/paper/a4e887a5f20289603448eaad607265adc29c778d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2201.03720",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Retrieving relevant documents from a corpus is typically based on the semantic similarity between the document content and query text. The inclusion of structural relationship between documents can benefit the retrieval mechanism by addressing semantic gaps. However, incorporating these relationships requires tractable mechanisms that balance structure with semantics and take advantage of the prevalent pre-train/fine-tune paradigm. We propose here a holistic approach to learning document representations by integrating intra-document content with inter-document relations. Our deep metric learning solution analyzes the complex neighborhood structure in the relationship network to efficiently sample similar/dissimilar document pairs and defines a novel quintuplet loss function that simultaneously encourages document pairs that are semantically relevant to be closer and structurally unrelated to be far apart in the representation space. Furthermore, the separation margins between the documents are varied flexibly to encode the heterogeneity in relationship strengths. The model is fully fine-tunable and natively supports query projection during inference. We demonstrate that it outperforms competing methods on multiple datasets for document retrieval tasks.",
    "citationCount": 2,
    "referenceCount": 49
}