{
    "paperId": "a4ff9ea7d26615daf0634524dedd1f57b1d85beb",
    "title": "Online Resource Allocation with Samples",
    "year": 2022,
    "venue": "Social Science Research Network",
    "authors": [
        "Negin Golrezaei",
        "Patrick Jaillet",
        "Zijie Zhou"
    ],
    "doi": "10.2139/ssrn.4054796",
    "arxivId": "2210.04774",
    "url": "https://www.semanticscholar.org/paper/a4ff9ea7d26615daf0634524dedd1f57b1d85beb",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.04774",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The problem of online allocation of scarce resources is one of the most important problems faced by gov-ernments (e.g., during a pandemic crisis), hospitals, e-commerce, etc. We study an online resource allocation problem where we have uncertainty about demand and the reward of each type of demand (agents) for resources. While dealing with demand uncertainty in resource allocation problems has been the topic of many papers in the literature, the challenge of not knowing rewards has been barely explored. The lack of knowledge about agents’ rewards is inspired by the problem of allocating new resources (e.g., newly developed vaccines or drugs) with unknown effectiveness/value. For such settings, we assume that we have the ability to test the market before the allocation period starts. During the test period, we collect some limited information, called sample information , about agents’ expected rewards, as well as, the size of the market for each type of agent. We study how to optimally exploit the sample information in our online resource allocation problem under adversarial arrival processes. We present an asymptotically optimal protection level algorithm that achieves 1 − Θ(1 / √ m ) competitive ratio, where m is the number of resources. Via presenting an upper bound on the competitive ratio of any randomized and deterministic algorithms, we show that our competitive ratio of 1 − Θ(1 / √ m ) is tight. We further demonstrate the efficacy of our proposed algorithm using a dataset that contains the number of COVID-19 related hospitalized patients across different age groups.",
    "citationCount": 8,
    "referenceCount": 41
}