{
    "paperId": "a509145040708e9295dcfefae35d29e1dbf14608",
    "title": "Association of mutations in Mycobacterium tuberculosis complex (MTBC) respiration chain genes with hyper-transmission",
    "year": 2024,
    "venue": "BMC Genomics",
    "authors": [
        "Ya-meng Li",
        "Yifan Li",
        "Yao Liu",
        "Xiang-long Kong",
        "Ningning Tao",
        "Yawei Hou",
        "Ting-ting Wang",
        "Qi-lin Han",
        "Yu-zhen Zhang",
        "Fei Long",
        "Huaichen Li"
    ],
    "doi": "10.1186/s12864-024-10726-z",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a509145040708e9295dcfefae35d29e1dbf14608",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s12864-024-10726-z",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background The respiratory chain plays a key role in the growth of Mycobacterium tuberculosis complex (MTBC). However, the exact regulatory mechanisms of this system still need to be elucidated, and only a few studies have investigated the impact of genetic mutations within the respiratory chain on MTBC transmission. This study aims to explore the impact of respiratory chain gene mutations on the global spread of MTBC. Results A total of 13,402 isolates of MTBC were included in this study. The majority of the isolates (n = 6,382, 47.62%) belonged to lineage 4, followed by lineage 2 (n = 5,123, 38.23%). Our findings revealed significant associations between Single Nucleotide Polymorphisms (SNPs) of specific genes and transmission clusters. These SNPs include Rv0087 (hycE, G178T), Rv1307 (atpH, C650T), Rv2195 (qcrA, G181C), Rv2196 (qcrB, G1250T), Rv3145 (nuoA, C35T), Rv3149 (nuoE, G121C), Rv3150 (nuoF, G700A), Rv3151 (nuoG, A1810G), Rv3152 (nuoH, G493A), and Rv3157 (nuoM, A1243G). Furthermore, our results showed that the SNPs of atpH C73G, atpA G271C, qcrA G181C, nuoJ G115A, nuoM G772A, and nuoN G1084T were positively correlated with cross-country transmission clades and cross-regional transmission clades. Conclusions Our study uncovered an association between mutations in respiratory chain genes and the transmission of MTBC. This important finding provides new insights for future research and will help to further explore new mechanisms of MTBC pathogenicity. By uncovering this association, we gain a more complete understanding of the processes by which MTBC increases virulence and spread, providing potential targets and strategies for preventing and treating tuberculosis. Supplementary Information The online version contains supplementary material available at 10.1186/s12864-024-10726-z.",
    "citationCount": 0,
    "referenceCount": 36
}