{
    "paperId": "a5125c0eab822af20f55c969696aeaff6f4fdcf9",
    "title": "Attention Scheme Inspired Softmax Regression",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Yichuan Deng",
        "Zhihang Li",
        "Zhao Song"
    ],
    "doi": "10.48550/arXiv.2304.10411",
    "arxivId": "2304.10411",
    "url": "https://www.semanticscholar.org/paper/a5125c0eab822af20f55c969696aeaff6f4fdcf9",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2304.10411",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large language models (LLMs) have made transformed changes for human society. One of the key computation in LLMs is the softmax unit. This operation is important in LLMs because it allows the model to generate a distribution over possible next words or phrases, given a sequence of input words. This distribution is then used to select the most likely next word or phrase, based on the probabilities assigned by the model. The softmax unit plays a crucial role in training LLMs, as it allows the model to learn from the data by adjusting the weights and biases of the neural network. In the area of convex optimization such as using central path method to solve linear programming. The softmax function has been used a crucial tool for controlling the progress and stability of potential function [Cohen, Lee and Song STOC 2019, Brand SODA 2020]. In this work, inspired the softmax unit, we define a softmax regression problem. Formally speaking, given a matrix $A \\in \\mathbb{R}^{n \\times d}$ and a vector $b \\in \\mathbb{R}^n$, the goal is to use greedy type algorithm to solve \\begin{align*} \\min_{x} \\| \\langle \\exp(Ax), {\\bf 1}_n \\rangle^{-1} \\exp(Ax) - b \\|_2^2. \\end{align*} In certain sense, our provable convergence result provides theoretical support for why we can use greedy algorithm to train softmax function in practice.",
    "citationCount": 44,
    "referenceCount": 64
}