{
    "paperId": "a52df0b58a4c31589f9cabbcbfd7da35b39f2720",
    "title": "Using MDE for Teaching Database Query Optimizer",
    "year": 2021,
    "venue": "International Conference on Evaluation of Novel Approaches to Software Engineering",
    "authors": [
        "Abdelkader Ouared",
        "Abdelhafid Chadli"
    ],
    "doi": "10.5220/0010535105290536",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a52df0b58a4c31589f9cabbcbfd7da35b39f2720",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5220/0010535105290536",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Query optimization is considered as an important part of Data Base Management Systems (DBMS) and plays a major role in database research community (e.g. SQL, Spark, Map-reduce). Generally, this optimization is done using Cost Base Optimization (CBO), which is difficult to understand due to the complexity of platform, database, query and DBMS. Moreover, database query optimizer is usually a very complex process, with difficult concepts depending on the behaviour of the query engine of DBMS. Therefore, users (e.g. novice user, developer, DB administrator) have difficulties to understand and build a mental image of database query optimizer in order to produce more efficient queries. In this paper, we propose a Framework based on the model-driven engineering (MDE) paradigm to facilitate understanding and improving query performance. Indeed, MDE approach has been proven useful for developing new software applications, and its adoption for a teaching perspective presents a major challenge. We illustrate our proposal with use case and proof-ofconcept prototype for the whole provided process.",
    "citationCount": 5,
    "referenceCount": 18
}