{
    "paperId": "a531e61bc189fc94c3aa977babe37ac78a072619",
    "title": "High-Density Neuromorphic Inference Platform (HDNIP) with 10 Million Neurons",
    "year": 2025,
    "venue": "Electronics",
    "authors": [
        "Y. Zuo",
        "N. Ning",
        "K. Cao",
        "Rui Zhang",
        "Cheng Fu",
        "Shengxin Wang",
        "L. Meng",
        "R. Ma",
        "G. Qiao",
        "Yang Liu",
        "Shaogang Hu"
    ],
    "doi": "10.3390/electronics14173412",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a531e61bc189fc94c3aa977babe37ac78a072619",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern neuromorphic processors exhibit neuron densities that are orders of magnitude lower than those of the biological cortex, hindering the deployment of large-scale spiking neural networks (SNNs) on single chips. To bridge this gap, we propose HDNIP, a 40 nm high-density neuromorphic inference platform with a density-first architecture. By eliminating area-intensive on-chip SRAM and using 1280 compact cores with a time-division multiplexing factor of up to 8192, HDNIP integrates 10 million neurons and 80 billion synapses within a 44.39 mm2 synthesized area. This achieves an unprecedented neuron density of 225 k neurons/mm2, over 100 times greater than prior art. The resulting bandwidth challenges are mitigated by a ReRAM-based near-memory computation strategy combined with input reuse, reducing off-chip data transfer by approximately 95%. Furthermore, adaptive TDM and dynamic core fusion ensure high hardware utilization across diverse network topologies. Emulator-based validation using large SNNs, demonstrates a throughput of 13 GSOP/s at a low power consumption of 146 mW. HDNIP establishes a scalable pathway towards single-chip, low-SWaP neuromorphic systems for complex edge intelligence applications.",
    "citationCount": 0,
    "referenceCount": 34
}