{
    "paperId": "a5333be04ec243cc6b367fced6840d0921c8c8d2",
    "title": "Engineering Sustainable Data Architectures for Modern Financial Institutions",
    "year": 2025,
    "venue": "Electronics",
    "authors": [
        "Sergiu-Alexandru Ionescu",
        "Vlad Diaconita",
        "Andreea-Oana Radu"
    ],
    "doi": "10.3390/electronics14081650",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a5333be04ec243cc6b367fced6840d0921c8c8d2",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/electronics14081650",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern financial institutions now manage increasingly advanced data-related activities and place a growing emphasis on environmental and energy impacts. In financial modeling, relational databases, big data systems, and the cloud are integrated, taking into consideration resource optimization and sustainable computing. We suggest a four-layer architecture to address financial data processing issues. The layers of our design are for data sources, data integration, processing, and storage. Data ingestion processes market feeds, transaction records, and customer data. Real-time data are captured by Kafka and transformed by Extract-Transform-Load (ETL) pipelines. The processing layer is composed of Apache Spark for real-time data analysis, Hadoop for batch processing, and an Machine Learning (ML) infrastructure that supports predictive modeling. In order to optimize access patterns, the storage layer includes various data layer components. The test results indicate that the processing of market data in real-time, compliance reporting, risk evaluations, and customer analyses can be conducted in fulfillment of environmental sustainability goals. The metrics from the test deployment support the implementation strategies and technical specifications of the architectural components. We also looked at integration models and data flow improvements, with applications in finance. This study aims to enhance enterprise data architecture in the financial context and includes guidance on modernizing data infrastructure.",
    "citationCount": 5,
    "referenceCount": 58
}