{
    "paperId": "a54d6e0a19b254b75ff389bf59a63378cac4c051",
    "title": "Rearchitecting Datacenter Networks: A New Paradigm with Optical Core and Optical Edge",
    "year": 2024,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Sushovan Das",
        "Arlei Silva",
        "T. S. E. Ng"
    ],
    "doi": "10.1109/INFOCOM52122.2024.10621224",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a54d6e0a19b254b75ff389bf59a63378cac4c051",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "All-optical circuit-switching (OCS) technology is the key to design energy-efficient and high-performance datacenter network (DCN) architectures for the future. However, existing round-robin based OCS cores perform poorly under realistic workloads having high traffic skewness and high volume of inter-rack traffic. To address this issue, we propose a novel DCN architecture OSSV: a combination of OCS-based core (between ToR switches) and OCS-based reconfigurable edge (between servers and ToR switches). On one hand, the OCS core is traffic agnostic and realizes reconfigurably non-blocking ToR-level connectivity. On the other hand, OCS-based edge reconfigures itself to reshape the incoming traffic in order to jointly minimize traffic skewness and inter-rack traffic volume. Our novel optimization framework can obtain the right balance between these intertwined objectives. Our extensive simulations and testbed evaluation show that OSSV can achieve high performance under diverse DCN traffic while consuming low power and incurring low cost.",
    "citationCount": 2,
    "referenceCount": 46
}