{
    "paperId": "a56bb080019a223ea0dfbd2c44eec4846f5ca595",
    "title": "Emergent Design and Unanticipated Ideas in Asynchronous Online Focus Groups: Finding an Unexpected Silver Lining in Apparent Methodological Compromise",
    "year": 2024,
    "venue": "International Journal of Qualitative Methods",
    "authors": [
        "Emily A. Buddle",
        "R. Ankeny",
        "R. Paxton",
        "Rebekah J. Harms",
        "H. Bray"
    ],
    "doi": "10.1177/16094069241289295",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a56bb080019a223ea0dfbd2c44eec4846f5ca595",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1177/16094069241289295",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article explores methodological advantages and limitations of using asynchronous online focus groups (AOFGs) as an approach to investigating community attitudes and values relating to biotechnology in food production. We describe our experiences using AOFGs during the COVID-19 pandemic as a form of emergent design. We highlight the methodological advantages and limitations of such research approaches, particularly to explore unanticipated ideas relating to community attitudes and values associated with biotechnology in food production. Although AOFGs are not a direct substitute for traditional methodologies, there are clear advantages that can outweigh typical concerns, depending on the research questions and goals, particularly when research aims to involve participants from diverse demographic groups and engage in more emergent methods allowing unanticipated ideas to be explored. As a result of having to pivot our methods to produce the required analyses during the COVID-19 pandemic, this paper provides valuable insights into the use of AOFGs to capture qualitative data when use of traditional methods is restricted or may be less desirable.",
    "citationCount": 0,
    "referenceCount": 72
}