{
    "paperId": "a57948be5df9669eb704711a79372a6f2af8e15a",
    "title": "Scheduling HPC Workflows with Intel Optane Persistent Memory",
    "year": 2021,
    "venue": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum",
    "authors": [
        "R. Venkatesh",
        "Tony Mason",
        "Pradeep R. Fernando",
        "G. Eisenhauer",
        "Ada Gavrilovska"
    ],
    "doi": "10.1109/IPDPSW52791.2021.00017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a57948be5df9669eb704711a79372a6f2af8e15a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "HPC workloads and their Increasing data processing demands have led to using in situ execution, which couples simulation and analytics to reduce cross node memory accesses and their negative impact on overall performance. In situ executions can benefit from new classes of persistent memory technologies, such as Intel® Optane™ DC Persistent Memory (PMEM), which provide a denser, lower cost, and lower performance memory option for server class machines. However, PMEM creates a new set of trade-offs that must be considered to further improve performance for these HPC workloads and to realize the expected benefits. Prior work has only focused on describing how to tune for a single workload component, which may not yield optimal results for the entire workload.In this paper, we use a suite of workflows with different characteristics to understand the impact of using PMEM for in situ workflow executions with respect to different decisions on how PMEM is shared. Based on our experimental observations, we make recommendations for the considerations that must be incorporated for future workflow schedulers to maximize the benefits of the PMEM resource.",
    "citationCount": 4,
    "referenceCount": 17
}