{
    "paperId": "a592d980b91d2704d44191f3b0ac66daa31d2e2d",
    "title": "Modeling Average False Positive Rates of Recycling Bloom Filters",
    "year": 2024,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Kahlil Dozier",
        "Loqman Salamatian",
        "Dan Rubenstein"
    ],
    "doi": "10.1109/INFOCOM52122.2024.10621226",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a592d980b91d2704d44191f3b0ac66daa31d2e2d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bloom Filters are a space-efficient data structure used for the testing of membership in a set that errs only in the False Positive direction. However, the standard analysis that measures this False Positive rate provides a form of worst case bound that is both overly conservative for the majority of network applications that utilize Bloom Filters, and reduces accuracy by not taking into account the actual state (number of bits set) of the Bloom Filter after each arrival. In this paper, we more accurately characterize the False Positive dynamics of Bloom Filters as they are commonly used in networking applications. In particular, network applications often utilize a Bloom Filter that “recycles”: it repeatedly fills, and upon reaching a certain level of saturation, empties and fills again. In this context, it makes more sense to evaluate performance using the average False Positive rate instead of the worst case bound. We show how to efficiently compute the average False Positive rate of recycling Bloom Filter variants via renewal and Markov models. We apply our models to both the standard Bloom Filter and a \"two-phase\" variant, verify the accuracy of our model with simulations, and find that the previous analysis’ worst-case formulation leads to up to a 30% reduction in the efficiency of Bloom Filter when applied in network applications, while two-phase overhead diminishes as the needed False Positive rate is tightened.",
    "citationCount": 2,
    "referenceCount": 33
}