{
    "paperId": "a5fdc24058ea68bb3e2df684e2784712e0eb9ffb",
    "title": "ROGER: Ranking-Oriented Generative Retrieval",
    "year": 2024,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Yujia Zhou",
        "Jing Yao",
        "Zhicheng Dou",
        "Yiteng Tu",
        "Ledell Wu",
        "Tat-seng Chua",
        "Ji-Rong Wen"
    ],
    "doi": "10.1145/3603167",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a5fdc24058ea68bb3e2df684e2784712e0eb9ffb",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3603167",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, various dense retrieval methods have been developed to improve the performance of search engines with a vectorized index. However, these approaches require a large pre-computed index and have a limited capacity to memorize all semantics in a document within a single vector. To address these issues, researchers have explored end-to-end generative retrieval models that use a seq-to-seq generative model to directly return identifiers of relevant documents. Although these models have been effective, they are often trained with the MLE method. It only encourages the model to assign a high probability to the relevant document identifier, ignoring the relevance comparisons of other documents. This may lead to performance degradation in ranking tasks, where the core is to compare the relevance between documents. To address this issue, we propose a ranking-oriented generative retrieval model that incorporates relevance signals to better estimate the relative relevance of different documents in ranking tasks. Based upon the analysis of the optimization objectives of dense retrieval and generative retrieval, we propose utilizing dense retrieval to provide relevance feedback for generative retrieval. Under an alternate training framework, the generative retrieval model gradually acquires higher-quality ranking signals to optimize the model. Experimental results show that our approach increasing Recall@1 by 12.9% with respect to the baselines on MS MARCO dataset.",
    "citationCount": 4,
    "referenceCount": 61
}