{
    "paperId": "a6835673fb996a8c53a8d1d49bd20578bf023518",
    "title": "Solar Pv Based Micro Grid Integrated With Battery Energy Storage System Converter",
    "year": 2023,
    "venue": "2023 International Conference on Emerging Research in Computational Science (ICERCS)",
    "authors": [
        "R. Sethuraman",
        "A. Amudha",
        "G. Emayavaramban",
        "T. Selvaganapathi",
        "K. Elavarasi",
        "R. V. Arunmozhi"
    ],
    "doi": "10.1109/ICERCS57948.2023.10434000",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6835673fb996a8c53a8d1d49bd20578bf023518",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PV/battery-based distributed generation system, rural electrification architectural layout with low dispersal losses, structure that may be scaled in increments and without the need for constant We should strive for mastery. Consequently, in an effort to correct disadvantages inherent with distributed control systems We introduce a dynamic I-V controller for DC microgrids that is distributed. Using a droop approach, a PV-based system can be controlled remotely. DGDSA for the DC microgrid, an option for remote areas electrification. When multiple micro grids pool their resources, everyone benefits. is managed to stay within the bounds of what can be in either the supply or demand phase of operation. energy transfer between the nano grid and its users (charging and battery drain, or discharge. This division of labour proportionate to the number of available resources, an algorithm that can alter the amount of voltage drop produced by an I-V converter. dip according to regional dc bus voltage readings and percentage of battery life. The proposed regulation is also system guarantees quick dynamics and can handle by coordinating the PV systems under demanding operational conditions, power generating potential of isolated nano grids by combining the grid stability and local load requirements via a regional controller, which can switch between detecting the maximum power point and operating between it modes of maximum power point tracking (MPPT) and current regulation. Due to the local conditions to implement the proposed control strategy. parameters such as load current, PV output, and battery state of charge combined with a dc bus voltage; hence, no AC power dialogue to facilitate cooperative power distribution among what the nano grids are contributing. Accordingly, the proposed A PV-based DGDSA is an adaptive control method that incorporates the benefits of both of the current architectures, namely, modularity, scalability, reduced distribution losses, and a in a strong, unified, and uncommunicative autonomy from command and control. This is why a decentralized system is preferable. can be thought of as a promising prospect for the rural electrification project rollouts in undeveloped countries regions. measurements of load current, PV generation, battery SOC, and dc bus voltage, therefore does not require communication for the coordinated power sharing among the contributing nano grids.",
    "citationCount": 0,
    "referenceCount": 17
}