{
    "paperId": "a68a78814d4c8f1b48efbaf3c18d2c617436b862",
    "title": "Optimization Search Strategy for Task Offloading From Collaborative Edge Computing",
    "year": 2023,
    "venue": "IEEE Transactions on Services Computing",
    "authors": [
        "Jine Tang",
        "Taishan Qin",
        "Yang Xiang",
        "Zhangbing Zhou",
        "Junhua Gu"
    ],
    "doi": "10.1109/TSC.2022.3203700",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a68a78814d4c8f1b48efbaf3c18d2c617436b862",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Edge computing is a popular paradigm in solving the problems of long time delay and high energy consumption in Internet of Things (IoT) network, which can effectively realize the IoT task offloading by collaboration of multiple edge servers. Nevertheless, how to choose the appropriate edge servers for offloading the dependent subtasks is still a big challenge, considering the limited resources and computing power of the edge servers as well as the start and end execution time of each subtask. These factors have a great impact on the execution efficiency of the whole task. At present, most of the research works focus on single-hop or multi-hop task offloading, where the edge servers farther away are not considered in the offloading decision. Such task offloading strategy is not optimal, and difficult to achieve high parallel execution of tasks, resulting in some delay-sensitive tasks not being completed within the specified time. In this article, a two-stage optimization method is proposed to solve the resource allocation problem between edge servers and tasks. In the first stage, we group tasks according to their priorities, and the group with a higher priority is given the preference to resource allocation, thereby ensuring the timeliness of delay-sensitive tasks. Within the same group, resources are competed according to the game theory, and the total delay of all tasks is optimized. In the second stage, we aim to optimize the energy consumption of each task without increasing its completion time by allocating the computing resources to its subtasks based on their maximum completion time. For group resource allocation, we propose a spatial index tree to store the information of all edge servers for optimal server selection. During the selection process, an online learning based double prediction model is utilized to reduce the energy consumption caused by information transmission. We have evaluated the performance of the experiment on iFogSim simulator, and the experimental results show that our proposed method can achieve better performance in terms of time delay and energy consumption.",
    "citationCount": 7,
    "referenceCount": 41
}