{
    "paperId": "a6aad6281c744223d5161b50df5e5e483402806e",
    "title": "Fully Decentralized Data Distribution for Exascale-HPC: End of the Provider-Demander Matching Puzzle",
    "year": 2024,
    "venue": "IEEE International Conference on Cluster Computing",
    "authors": [
        "Mingtian Shao",
        "Wenzhe Zhang",
        "Ruibo Wang",
        "Huijun Wu",
        "Yiqin Dai",
        "Kai Lu"
    ],
    "doi": "10.1109/CLUSTER59578.2024.00034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6aad6281c744223d5161b50df5e5e483402806e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "For many years, in the HPC data distribution scenario, as the scale of the HPC system continues to increase, manufacturers have to increase the number of data providers to improve the IO parallelism to match the data demanders. In the era of Exascale Computing, this mode of decoupling the demander and provider has limited scalability and huge costs. In our view, only a distribution model in which the demander also acts as the provider can fundamentally cope with changes in scale and have the best scalability, which is called all-to-all data distribution mode in this paper. We design and implement the BitTorrent protocol on computing networks in HPC systems and propose FD3, a fully decentralized data distribution method. We design the Requested-to-Validated Table (RVT) and the Nearest and Longest consecutive piece Segment First (NLSF) policy based on the features of the HPC networking environment to improve the performance of FD3. Experimental results show that FD3 can scale smoothly to 11k+ computing nodes, and its performance is much better than that of the parallel file system. Compared with the original BitTorrent, the performance is improved by 7–11 times. FD3 shows the great potential of the all-to-all model in HPC data distribution scenarios. At the same time, the work of this paper can further stimulate the exploration of future distributed parallel file systems and provide a foundation and inspiration for the design of data access patterns for Exscale HPC systems.",
    "citationCount": 0,
    "referenceCount": 29
}