{
    "paperId": "a6b044bd94987953a6d0200e7eaf86ffabc643f2",
    "title": "Cover Trees Revisited: Exploiting Unused Distance and Direction Information",
    "year": 2023,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Zhi-Jie Wang",
        "Mengdie Nie",
        "Kaiqi Zhao",
        "Zhe Quan",
        "Bin Yao"
    ],
    "doi": "10.1109/TKDE.2022.3231781",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6b044bd94987953a6d0200e7eaf86ffabc643f2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The cover tree (CT) and its improved version are hierarchical data structures that simplified navigating nets while maintaining good runtime guarantees. They can perform nearest neighbor search in logarithmic time and provide efficient computation in practice. In this article, we revisit cover trees for nearest neighbor search, and propose a more competitive method. The central idea of our method is to fully exploit the unused distance and direction information. More specially, our method introduces three novel concepts/techniques: (i) range list, (ii) quadrant information, and (iii) vectorial angle cosine. These techniques are seamlessly integrated into our suggested data structure and search algorithms. As an extra bonus, we explore approximate nearest neighbor and <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math><alternatives><mml:math><mml:mi>k</mml:mi></mml:math><inline-graphic xlink:href=\"wang-ieq1-3231781.gif\"/></alternatives></inline-formula> nearest neighbor based on the proposed techniques, and present algorithms for handling updates. Extensive experimental results, based on both real and synthetic datasets, consistently demonstrate that our method is attractive and competitive, compared against existing cover tree structures for nearest neighbor search and its variants.",
    "citationCount": 2,
    "referenceCount": 42
}