{
    "paperId": "a6ce2c2f48bec7f0abf8af4fefeaf791178379a3",
    "title": "AI coupled to pharmacometric modelling to tailor malaria and tuberculosis treatment in Africa",
    "year": 2024,
    "venue": "medRxiv",
    "authors": [
        "G. Turon",
        "M. Mulubwa",
        "A. Montaner",
        "M. Njoroge",
        "K. Chibale",
        "M. Duran-Frigola"
    ],
    "doi": "10.1101/2024.11.07.24316884",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6ce2c2f48bec7f0abf8af4fefeaf791178379a3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.medrxiv.org/content/medrxiv/early/2024/11/07/2024.11.07.24316884.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Africa's vast genetic diversity poses challenges for optimising drug treatments in the continent, which is exacerbated by the fact that drug discovery and development efforts have historically been performed outside Africa. This has led to suboptimal therapeutic outcomes in African populations and overall scarcity of relevant pharmacogenetic data, including characteristic genotypes as well as drugs prescribed in the continent to treat infectious diseases. Here, we propose a general approach to identify drug-gene pairs with potential pharmacogenetic interest. Furthermore, we delve deeper into the analysis of malaria and tuberculosis therapies, many of which remain uncharacterised from a pharmacogenetic perspective. Our pipeline leverages artificial intelligence and the latest advances in knowledge embedding techniques to exploit currently available biomedical data and subsequently prioritise pharmacogenes for each drug. Predicted pharmacogenes are then incorporated into pharmacometric modelling to hypothesise which ones might be of clinical interest, and which dose adjustments could be made to provide better treatment outcomes for the African population.",
    "citationCount": 0,
    "referenceCount": 45
}