{
    "paperId": "a6d4dcb3cf087c3dcfb3edf3665cd287b59fae80",
    "title": "Memory-Based Computing for Energy-Efficient AI: Grand Challenges",
    "year": 2023,
    "venue": "IEEE/IFIP International Conference on Very Large Scale Integration of System-on-Chip",
    "authors": [
        "Foroozan Karimzadeh",
        "Mohsen Imani",
        "Bahar Asgari",
        "Ningyuan Cao",
        "Yingyan Lin",
        "Yan Fang"
    ],
    "doi": "10.1109/VLSI-SoC57769.2023.10321880",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6d4dcb3cf087c3dcfb3edf3665cd287b59fae80",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The remarkable progress in artificial intelligence (AI) has ushered in a new era characterized by models with billions of parameters, enabling extraordinary capabilities across diverse domains. However, these achievements come at a significant cost in terms of memory and energy consumption. The growing demand for computational resources raises grand challenges for the sustainable development of energy-efficient AI systems. This paper delves into the paradigm of memory-based computing as a promising avenue to address these challenges. By capitalizing on the inherent characteristics of memory and its efficient utilization, memory-based computing offers a novel approach to enhance AI performance while reducing the associated energy costs. Our paper systematically analyzes the multifaceted aspects of this paradigm, highlighting its potential benefits and outlining the challenges it poses. Through an exploration of various methodologies, architectures, and algorithms, we elucidate the intricate interplay between memory utilization, computational efficiency, and AI model complexity. Furthermore, we review the evolving area of hardware and software solutions for memory-based computing, underscoring their implications for achieving energy-efficient AI systems. As AI continues its rapid evolution, identifying the key challenges and insights presented in this paper serve as a foundational guide for researchers striving to navigate the complex field of memory-based computing and its pivotal role in shaping the future of energy-efficient AI.",
    "citationCount": 2,
    "referenceCount": 89
}