{
    "paperId": "a6de5def8eb48a43afde3afdb05c1e67082f7c7c",
    "title": "Deep learning models for forecasting sour gas generation in a petroleum refinery",
    "year": 2025,
    "venue": "Canadian Journal of Chemical Engineering",
    "authors": [
        "Balakrishnan Dharmalingam",
        "Gnanaprakasam Arul Jesu",
        "T. Marimuthu"
    ],
    "doi": "10.1002/cjce.25590",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6de5def8eb48a43afde3afdb05c1e67082f7c7c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sour water stripping is a critical process in petroleum refineries, essential for the safe handling and disposal of wastewater that contains hazardous components such as hydrogen sulphide (H₂S) and ammonia (NH₃). Effective management of sour gas, the product of sour water stripping, is crucial to minimize environmental impacts of release of pollutants like sulphur dioxide (SO₂) and nitrogen oxides (NOₓ). This study explores the application of advanced deep learning models for forecasting sour gas generation in a refinery setting. Utilizing a comprehensive dataset from a sour water stripper unit, various deep learning architectures, such as recurrent neural networks (RNNs), long short‐term memory networks (LSTMs), bidirectional LSTMs (BiLSTMs), one dimensional convolutional neural network (1D‐CNN), and few hybrid models were employed to predict sour gas output. The evaluation metrics indicate that the 1D‐CNN and two‐layer LSTM models outperformed the other models, whereas the CNN‐LSTM encoder–decoder model did not result in good prediction among all the models studied. These findings underscore the capability of deep learning techniques to improve predictive accuracy and enhance operational efficiency in refinery sour gas management.",
    "citationCount": 0,
    "referenceCount": 36
}