{
    "paperId": "a6ff754d2ec35ff94bc42dcabd26d64d89fe4a31",
    "title": "A video processing algorithm using temporal intuitionistic fuzzy sets",
    "year": 2022,
    "venue": "Journal of Intelligent & Fuzzy Systems",
    "authors": [
        "Zhihua Chen",
        "S. Kosari",
        "S. P. Kaarmukilan",
        "C. Yuvapriya",
        "K. Atanassov",
        "R. Parvathi",
        "H. Rashmanlou"
    ],
    "doi": "10.3233/JIFS-220928",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a6ff754d2ec35ff94bc42dcabd26d64d89fe4a31",
    "isOpenAccess": true,
    "openAccessPdf": "https://content.iospress.com:443/download/journal-of-intelligent-and-fuzzy-systems/ifs220928?id=journal-of-intelligent-and-fuzzy-systems%2Fifs220928",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Video Processing has found enormous applications in recent times from security systems to interplanetary missions. In real-life situations, most of the videos are fuzzy/vague/uncertain. Intuitionistic fuzzy set (IFS) is one of the effective tools for handling uncertainty. Among many extensions of IFSs, temporal intuitionistic fuzzy sets (TIFSs) are very interesting as they are time-dependent. Hence, TIFSs are suitable to define a video, which is dynamic and hence depends on time-moment. In this way, this work introduces a novel VIdeo PROCessing (VIPROC) algorithm, using temporal intuitionistic fuzzy sets to enhance videos, which is first of its kind in existence. The comparison is made with fuzzy contrast intensification operation. VIPROC algorithm is designed using contrast intensification operation for video enhancement. The results are encouraging in comparison with the original test videos. The results are discussed taking into account the several frames of the test video. Further, the proposed algorithm can be applied/extended to engineering applications like motion tracking, traffic detection systems, real time videos captured through mobile (hand-held) devices, and so on. As no such algorithms are existing which use TIFSs to process a video, the authors got motivated to design and develop VIPROC algorithm.",
    "citationCount": 6,
    "referenceCount": 52
}