{
    "paperId": "a70f042707d1ce201c28995cbe0b84652d1fb89a",
    "title": "Equilibrated Zeroth-Order Unrolled Deep Network for Parallel MR Imaging",
    "year": 2023,
    "venue": "IEEE Transactions on Medical Imaging",
    "authors": [
        "Zhuoxu Cui",
        "Seng Jia",
        "Jing Cheng",
        "Qingyong Zhu",
        "Yuanyuan Liu",
        "Kankan Zhao",
        "Ziwen Ke",
        "Wenqi Huang",
        "Haifeng Wang",
        "Yanjie Zhu",
        "L. Ying",
        "Dong Liang"
    ],
    "doi": "10.1109/TMI.2023.3293826",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a70f042707d1ce201c28995cbe0b84652d1fb89a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent times, model-driven deep learning has evolved an iterative algorithm into a cascade network by replacing the regularizer’s first-order information, such as the (sub)gradient or proximal operator, with a network module. This approach offers greater explainability and predictability compared to typical data-driven networks. However, in theory, there is no assurance that a functional regularizer exists whose first-order information matches the substituted network module. This implies that the unrolled network output may not align with the regularization models. Furthermore, there are few established theories that guarantee global convergence and robustness (regularity) of unrolled networks under practical assumptions. To address this gap, we propose a safeguarded methodology for network unrolling. Specifically, for parallel MR imaging, we unroll a zeroth-order algorithm, where the network module serves as a regularizer itself, allowing the network output to be covered by a regularization model. Additionally, inspired by deep equilibrium models, we conduct the unrolled network before backpropagation to converge to a fixed point and then demonstrate that it can tightly approximate the actual MR image. We also prove that the proposed network is robust against noisy interferences if the measurement data contain noise. Finally, numerical experiments indicate that the proposed network consistently outperforms state-of-the-art MRI reconstruction methods, including traditional regularization and unrolled deep learning techniques.",
    "citationCount": 11,
    "referenceCount": 56
}