{
    "paperId": "a7690f95949c4b574fde9c6da6ce6ddc57b85c09",
    "title": "Offline Evaluation by Maximum Similarity to an Ideal Ranking",
    "year": 2020,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "C. Clarke",
        "Mark D. Smucker",
        "Alexandra Vtyurina"
    ],
    "doi": "10.1145/3340531.3411915",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a7690f95949c4b574fde9c6da6ce6ddc57b85c09",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "NDCG and similar measures remain standard for the offline evaluation of search, recommendation, question answering and similar systems. These measures require definitions for two or more relevance levels, which human assessors then apply to judge individual documents. Due to this dependence on a definition of relevance, it can be difficult to extend these measures to account for factors beyond relevance. Rather than propose extensions to these measures, we instead propose a radical simplification to replace them. For each query, we define a set of ideal rankings and compute the maximum rank similarity between members of this set and an actual ranking generated by a system. This maximum similarity to an ideal ranking becomes our effectiveness measure, replacing NDCG and similar measures. We propose rank biased overlap (RBO) to compute this rank similarity, since it was specifically created to address the requirements of rank similarity between search results. As examples, we explore ideal rankings that account for document length, diversity, and correctness.",
    "citationCount": 23,
    "referenceCount": 51
}