{
    "paperId": "a77fe32c1c6c072e7b2aa0e1a956e976145efbee",
    "title": "Achieving High Efficiency for Datacenter Multicast using Skewed Bloom Filter",
    "year": 2024,
    "venue": "International Conference on Parallel Processing",
    "authors": [
        "Jiawei Huang",
        "Zihao Chen",
        "Yiting Wang",
        "Hui Li",
        "Zhaoyi Li",
        "Qile Wang",
        "Sitan Li",
        "Zhidong He",
        "Wanchun Jiang"
    ],
    "doi": "10.1145/3673038.3673126",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a77fe32c1c6c072e7b2aa0e1a956e976145efbee",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multicast serves as an important approach for one-to-many communication in data center networks. To reduce overhead and improve scalability, bloom filters are employed in current multicast approaches to store forwarding ports of switches. However, the well-known false positive issue of bloom filter incurs wrong forwarding behaviors and redundant traffic in multicast tree, degrading transmission efficiency and increasing the risk of data leakage. Inspired by the fact that, given the same false positive ratio, the switch in the upper layers of multicast tree generates more redundant traffic, we propose RSBF, a fine-grained and resource-aware multicast approach using skewed bloom filters. Specifically, RSBF maintains multiple bloom filters corresponding to different layers of multicast tree, and allocates more ample space to the bloom filter of the upper layer switches, thereby reducing the overall redundant traffic. The test results of large-scale simulation demonstrate that RSBF reduces both redundant traffic and header overhead by up to 64% and 49% compared with the state-of-the-art approaches, respectively.",
    "citationCount": 0,
    "referenceCount": 39
}