{
    "paperId": "a7a3ca2260f036688b53ecc08e1c2a054ca9a3c3",
    "title": "Industrial Semiconductor GPT: A Question-and-Answer System that Provides Professional Advice and Problem-Solving Methods for Semiconductor and Factory Equipment and Process",
    "year": 2024,
    "venue": "International Symposium on Industrial Electronics",
    "authors": [
        "Yi-Cheng Yu",
        "Cheng-Fu Liou",
        "Shang-Wen Chuang",
        "Chen-Yi Lee"
    ],
    "doi": "10.1109/ISIE54533.2024.10595824",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a7a3ca2260f036688b53ecc08e1c2a054ca9a3c3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Research on PHM(Predictive Health Management) for detecting or predicting abnormalities in semiconductors and factory equipment and processes typically focuses on improving accuracy and reducing model size. However, in actual factory settings, on-site personnel not only need to accurately detect and predict abnormalities in processes and equipment but also require an understanding of how to handle the encountered abnormal problems when they occur. This study proposes Industrial Semiconductor GPT technology, which embeds relevant professional technical documents of process equipment into a vector database and generates possible professional questions and answers. When on-site personnel inquire, a natural language processing algorithm is used to compare the generated answers with actual answers. Furthermore, this study verifies the collected expert data through prompting engineering, resulting in an approximately $9.39 \\%$ increase in similarity, ensuring that factory personnel can obtain accurate and helpful answers when facing abnormal situations.",
    "citationCount": 0,
    "referenceCount": 24
}