{
    "paperId": "a7b77af6582d3ac66a6cb3d0c45e767be8f825d1",
    "title": "In-depth Analysis of Graph-based RAG in a Unified Framework",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yingli Zhou",
        "Yaodong Su",
        "Youran Sun",
        "Shu Wang",
        "Taotao Wang",
        "Runyuan He",
        "Yongwei Zhang",
        "Sicong Liang",
        "Xilin Liu",
        "Yuchi Ma",
        "Yixiang Fang"
    ],
    "doi": "10.48550/arXiv.2503.04338",
    "arxivId": "2503.04338",
    "url": "https://www.semanticscholar.org/paper/a7b77af6582d3ac66a6cb3d0c45e767be8f825d1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph-based Retrieval-Augmented Generation (RAG) has proven effective in integrating external knowledge into large language models (LLMs), improving their factual accuracy, adaptability, interpretability, and trustworthiness. A number of graph-based RAG methods have been proposed in the literature. However, these methods have not been systematically and comprehensively compared under the same experimental settings. In this paper, we first summarize a unified framework to incorporate all graph-based RAG methods from a high-level perspective. We then extensively compare representative graph-based RAG methods over a range of questing-answering (QA) datasets -- from specific questions to abstract questions -- and examine the effectiveness of all methods, providing a thorough analysis of graph-based RAG approaches. As a byproduct of our experimental analysis, we are also able to identify new variants of the graph-based RAG methods over specific QA and abstract QA tasks respectively, by combining existing techniques, which outperform the state-of-the-art methods. Finally, based on these findings, we offer promising research opportunities. We believe that a deeper understanding of the behavior of existing methods can provide new valuable insights for future research.",
    "citationCount": 14,
    "referenceCount": 79
}