{
    "paperId": "a7f40dd51c626005d34a252b73856a6c927682a7",
    "title": "Trimmer: Cost-Efficient Deep Learning Auto-tuning for Cloud Datacenters",
    "year": 2022,
    "venue": "IEEE International Conference on Cloud Computing",
    "authors": [
        "Damian Borowiec",
        "Gingfung Yeung",
        "A. Friday",
        "Richard Harper",
        "Peter Garraghan"
    ],
    "doi": "10.1109/CLOUD55607.2022.00061",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a7f40dd51c626005d34a252b73856a6c927682a7",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.lancs.ac.uk/id/eprint/170274/1/CLOUD22_Trimmer_Author_Accepted_Version.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud datacenters capable of provisioning high performance Machine Learning-as-a-Service (MLaaS) at reduced resource cost is achieved via auto-tuning: automated tensor program optimization of Deep Learning models to minimize inference latency within a hardware device. However given the extensive heterogeneity of Deep Learning models, libraries, and hardware devices, performing auto-tuning within Cloud datacenters incurs a significant time, compute resource, and energy cost of which state-of-the-art auto-tuning is not designed to mitigate. In this paper we propose Trimmer, a high performance and cost-efficient Deep Learning auto-tuning framework for Cloud datacenters. Trimmer maximizes DL model performance and tensor program cost-efficiency by preempting tensor program implementations exhibiting poor optimization improvement; and applying an ML-based filtering method to replace expensive low performing tensor programs to provide greater likelihood of selecting low latency tensor programs. Through an empirical study exploring the cost of DL model optimization techniques, our analysis indicates that 26–43% of total energy is expended on measuring tensor program implementations that do not positively contribute towards auto-tuning. Experiment results show that Trimmer achieves high auto-tuning cost-efficiency across different DL models, and reduces auto-tuning energy use by 21.8–40.9% for Cloud clusters whilst achieving DL model latency equivalent to state-of-the-art techniques.",
    "citationCount": 0,
    "referenceCount": 44
}