{
    "paperId": "a7f4ad71c9a80aeb023d779be533478e78511a62",
    "title": "A Survey of Trustworthy Federated Learning with Perspectives on Security, Robustness and Privacy",
    "year": 2023,
    "venue": "The Web Conference",
    "authors": [
        "Yifei Zhang",
        "Dun Zeng",
        "Jinglong Luo",
        "Zenglin Xu",
        "Irwin King"
    ],
    "doi": "10.1145/3543873.3587681",
    "arxivId": "2302.10637",
    "url": "https://www.semanticscholar.org/paper/a7f4ad71c9a80aeb023d779be533478e78511a62",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2302.10637",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Trustworthy artificial intelligence (AI) technology has revolutionized daily life and greatly benefited human society. Among various AI technologies, Federated Learning (FL) stands out as a promising solution for diverse real-world scenarios, ranging from risk evaluation systems in finance to cutting-edge technologies like drug discovery in life sciences. However, challenges around data isolation and privacy threaten the trustworthiness of FL systems. Adversarial attacks against data privacy, learning algorithm stability, and system confidentiality are particularly concerning in the context of distributed training in federated learning. Therefore, it is crucial to develop FL in a trustworthy manner, with a focus on robustness and privacy. In this survey, we propose a comprehensive roadmap for developing trustworthy FL systems and summarize existing efforts from two key aspects: robustness and privacy. We outline the threats that pose vulnerabilities to trustworthy federated learning across different stages of development, including data processing, model training, and deployment. To guide the selection of the most appropriate defense methods, we discuss specific technical solutions for realizing each aspect of Trustworthy FL (TFL). Our approach differs from previous work that primarily discusses TFL from a legal perspective or presents FL from a high-level, non-technical viewpoint.",
    "citationCount": 58,
    "referenceCount": 275
}