{
    "paperId": "a804a2c2445d615690afcaf174fe478ca5422bac",
    "title": "LangSQL: Simplifying Database Interaction for Non-Technical Users",
    "year": 2024,
    "venue": "2024 7th International Conference on Mechatronics and Computer Technology Engineering (MCTE)",
    "authors": [
        "Hua Wei",
        "Xu Guo"
    ],
    "doi": "10.1109/MCTE62870.2024.11117587",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a804a2c2445d615690afcaf174fe478ca5422bac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the era of big data, data has always been the most important asset in various industries. The importance of databases as the core tool for managing data is self-evident. Although databases are becoming increasingly popular, mastering their use still requires high learning costs for users with non-technical backgrounds. In order to solve the problems faced by non-technical users when using databases and improve their efficiency, this paper proposes a method called LangSQL. Based on the Large Language Models and LangChain framework, LangSQL aims to convert natural language queries into SQL statements by utilizing the natural language processing capabilities of the Large Language Models, and present query results in natural language form, providing non-technical users with a simple and efficient way to interact with databases. Compared with traditional database operation methods, LangSQL significantly reduces the learning cost for non-technical users. In the testing of the Chinook database, LangSQL's F1 score was 90.3%, execution accuracy was 89.1%, and exact match rate was 87.6%. This method provides a simple and efficient way for non-technical users to interact with databases, which helps promote the application and development of natural language processing technology in the field of databases, and provides new ideas and methods for innovation in database technology.",
    "citationCount": 0,
    "referenceCount": 13
}