{
    "paperId": "a815e1c4d6524fb39ff5efa96628ad7819a1b2a5",
    "title": "Recommendation Systems: An Insight Into Current Development and Future Research Challenges",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Matteo Marcuzzo",
        "Alessandro Zangari",
        "A. Albarelli",
        "A. Gasparetto"
    ],
    "doi": "10.1109/ACCESS.2022.3194536",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a815e1c4d6524fb39ff5efa96628ad7819a1b2a5",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09843966.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Research on recommendation systems is swiftly producing an abundance of novel methods, constantly challenging the current state-of-the-art. Inspired by advancements in many related fields, like Natural Language Processing and Computer Vision, many hybrid approaches based on deep learning are being proposed, making solid improvements over traditional methods. On the downside, this flurry of research activity, often focused on improving over a small number of baselines, makes it hard to identify reference methods and standardized evaluation protocols. Furthermore, the traditional categorization of recommendation systems into content-based, collaborative filtering and hybrid systems lacks the informativeness it once had. With this work, we provide a gentle introduction to recommendation systems, describing the task they are designed to solve and the challenges faced in research. Building on previous work, an extension to the standard taxonomy is presented, to better reflect the latest research trends, including the diverse use of content and temporal information. To ease the approach toward the technical methodologies recently proposed in this field, we review several representative methods selected primarily from top conferences and systematically describe their goals and novelty. We formalize the main evaluation metrics adopted by researchers and identify the most commonly used benchmarks. Lastly, we discuss issues in current research practices by analyzing experimental results reported on three popular datasets.",
    "citationCount": 32,
    "referenceCount": 329
}