{
    "paperId": "a82e2696ff6265f07332a3344234c93ef4fb765e",
    "title": "Large Language Model Based Document Query Solution Using Vector Databases",
    "year": 2024,
    "venue": "2024 International Conference on Advances in Data Engineering and Intelligent Computing Systems (ADICS)",
    "authors": [
        "Rochan A",
        "P. Sowmya",
        "D. A. J. Daniel"
    ],
    "doi": "10.1109/ADICS58448.2024.10533636",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a82e2696ff6265f07332a3344234c93ef4fb765e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The world is moving towards a digital landscape where industries are starting to face great challenges in managing and extracting meaningful insights from vast volumes of unstructured data contained in documents such as PDFs, EPUBs and many more. Leveraging the advancements in Large Language Models, this paper presents a helpful approach to address the challenge using a document query solution using LLMs and the efficiency of vector databases. The proposed system presents a way for users to interact with documents and converse with it, allowing users to draw insights and information from the document in a new light and in a new way, facilitating intuitive interaction and information extraction for employees of companies across various industries. The system makes use of LLMs capabilities to interpret and generate responses similar to humans, while vector databases provide efficient data storage and retrieval. This integration enables users to extract insights and information from documents in novel ways, transforming data-driven decision-making processes. By delivering a more intuitive and appealing approach to interact with documents, the proposed approach has the potential to significantly enhance the productivity and effectiveness of data-driven decision-making processes, ultimately boosting innovation and growth across industries.",
    "citationCount": 1,
    "referenceCount": 21
}