{
    "paperId": "a83eadfb1388fdb1d9bb9907a8144e231fc3e29f",
    "title": "Priority-Driven Differentiated Performance for NoSQL Database-as-a-Service",
    "year": 2023,
    "venue": "IEEE Transactions on Cloud Computing",
    "authors": [
        "Remo Andreoli",
        "T. Cucinotta",
        "Daniel Bristot de Oliveira"
    ],
    "doi": "10.1109/TCC.2023.3292031",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a83eadfb1388fdb1d9bb9907a8144e231fc3e29f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tcc.2023.3292031",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Designing data stores for native Cloud Computing services brings a number of challenges, especially if the Cloud Provider wants to offer database services capable of controlling the response time for specific customers. These requests may come from heterogeneous data-driven applications with conflicting responsiveness requirements. For instance, a batch processing workload does not require the same level of responsiveness as a time-sensitive one. Their coexistence may interfere with the responsiveness of the time-sensitive workload, such as online video gaming, virtual reality, and cloud-based machine learning. This article presents a modification to the popular MongoDB NoSQL database to enable differentiated per-user/request performance on a priority basis by leveraging CPU scheduling and synchronization mechanisms available within the Operating System. This is achieved with minimally invasive changes to the source code and without affecting the performance and behavior of the database when the new feature is not in use. The proposed extension has been integrated with the access-control model of MongoDB for secure and controlled access to the new capability. Extensive experimentation with realistic workloads demonstrates how the proposed solution is able to reduce the response times for high-priority users/requests, with respect to lower-priority ones, in scenarios with mixed-priority clients accessing the data store.",
    "citationCount": 7,
    "referenceCount": 42
}