{
    "paperId": "a8416e930a5c48c4b14a5327462fe297767517e5",
    "title": "Chromosome genome assembly and annotation of Adzuki Bean (Vigna angularis)",
    "year": 2024,
    "venue": "Scientific Data",
    "authors": [
        "Wan Li",
        "Fanglei He",
        "Xueyang Wang",
        "Qi Liu",
        "Xiaoqing Zhang",
        "Zhiquan Yang",
        "Chao Fang",
        "Hongtao Xiang"
    ],
    "doi": "10.1038/s41597-024-03911-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a8416e930a5c48c4b14a5327462fe297767517e5",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41597-024-03911-y",
    "publicationTypes": [
        "Dataset",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Adzuki bean (Vigna angularis) is a significant dietary legume crop that is prevalent in East Asia. It also holds traditional medicinal importance in China. In this study, we report a high-quality, chromosome-level genome assembly of adzuki bean obtained by employing Illumina short-read sequencing, PacBio long-read sequencing, and Hi-C technology. The assembly spans 447.8 Mb, encompassing 96.32% of the estimated genome, with contig and scaffold N50 values of 16.5 and 41.0 Mb, respectively. More than 98.2% of the 1,614 BUSCO genes were fully identified, and 25,939 genes were annotated, with 98.23% of them being functionally identifiable. Vigna angularis was estimated to diverge successively from Vigna unguiculata and Vigna radiata about 15.3 and 8.7 million years ago (Ma), respectively. This chromosome-level reference genome of Vigna angularis provides a robust foundation for exploring the functional genomics and genome evolution of adzuki bean, thereby facilitating advancements in molecular breeding of adzuki bean.",
    "citationCount": 2,
    "referenceCount": 42
}