{
    "paperId": "a89c15828618c5a844f551de60dc4e950146d714",
    "title": "Benchmarking in online maritime education: tracing the evolution of assessment in electronic educational environments",
    "year": 2024,
    "venue": "Educational Dimension",
    "authors": [
        "O. Diahyleva",
        "A. Yurzhenko",
        "O. Kononova"
    ],
    "doi": "10.55056/ed.804",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a89c15828618c5a844f551de60dc4e950146d714",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The paper is devoted to the analysis of the evolution process of assessment practices in online maritime education within electronic educational environments (EEEs). It is highlighted that with the increasing popularity of EEEs worldwide, especially amid the COVID-19 pandemic, online education has become a crucial tool for ensuring continued access to learning. It is mentioned that despite the growing importance of e-learning platforms, there remains a gap in understanding best practices, trends, and innovations in assessment methods within this context. A comparison analysis of the most popular e-learning platforms is conducted in the study. The benefits of Moodle while online maritime education are mentioned in the article. The results of the study showed that Moodle has many tools and instruments for future ship engineers who want to study maritime English. The study also found that Moodle offers flexibility, interactivity, and efficiency in evaluating students' learning progress and outcomes with the help of these tools and instruments. This work highlights that while Moodle's assessment tools are effective, teachers can enhance the teaching and learning experience for both themselves and their cadets.",
    "citationCount": 2,
    "referenceCount": 28
}