{
    "paperId": "a8b57843affbd87dab44b1d86d15640c8f5e9376",
    "title": "Physics-Informed Inference Time Scaling via Simulation-Calibrated Scientific Machine Learning",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zexi Fan",
        "Yan Sun",
        "Shihao Yang",
        "Yiping Lu"
    ],
    "doi": "10.48550/arXiv.2504.16172",
    "arxivId": "2504.16172",
    "url": "https://www.semanticscholar.org/paper/a8b57843affbd87dab44b1d86d15640c8f5e9376",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High-dimensional partial differential equations (PDEs) pose significant computational challenges across fields ranging from quantum chemistry to economics and finance. Although scientific machine learning (SciML) techniques offer approximate solutions, they often suffer from bias and neglect crucial physical insights. Inspired by inference-time scaling strategies in language models, we propose Simulation-Calibrated Scientific Machine Learning (SCaSML), a physics-informed framework that dynamically refines and debiases the SCiML predictions during inference by enforcing the physical laws. SCaSML leverages derived new physical laws that quantifies systematic errors and employs Monte Carlo solvers based on the Feynman-Kac and Elworthy-Bismut-Li formulas to dynamically correct the prediction. Both numerical and theoretical analysis confirms enhanced convergence rates via compute-optimal inference methods. Our numerical experiments demonstrate that SCaSML reduces errors by 20-50% compared to the base surrogate model, establishing it as the first algorithm to refine approximated solutions to high-dimensional PDE during inference. Code of SCaSML is available at https://github.com/Francis-Fan-create/SCaSML.",
    "citationCount": 1,
    "referenceCount": 60
}