{
    "paperId": "a8ce8b6689c6e7ea61991c93da7c757e79eb31a9",
    "title": "CORE-SG: Efficient Computation of Multiple MSTs for Density-Based Methods",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "A. C. A. Neto",
        "M. Naldi",
        "R. Campello",
        "Jörg Sander"
    ],
    "doi": "10.1109/icde53745.2022.00076",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a8ce8b6689c6e7ea61991c93da7c757e79eb31a9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Several popular density-based methods for unsuper-vised and semi-supervised learning tasks, including clustering and classification, can be formulated as instances of a framework that is based on the processing of a minimum spanning tree of the data, where the edge weights correspond to a form of (unnormalized) density estimate w.r.t. a smoothing parameter $m_{pts}$. While density-based methods are considered to be robust w.r.t. $m_{pts}$ in the sense that small changes in its value usually lead to slight or no changes in the resulting structure, wider ranges of $m_{pts}$ values may lead to different results that a user would like to analyze before choosing the most suitable value for a given data set or application. However, to explore multiple results for a range of $m_{pts}$ values, until recently, one had to re-run the density-based method for each value in the range independently, which is computationally inefficient. This paper proposes a new computationally efficient approach to compute multiple density-based minimum spanning trees w.r.t. a set of $m_{pts}$ values by leveraging a graph obtained from a single run of the density-based algorithm, without the need for re-runs of the original algorithm. We present theoretical and experimental results that show that our approach overcomes the drawbacks of the previous state-of-the-art, and it is considerably superior in runtime and graph size while being easier to implement. Our experimental evaluation using synthetic and real data shows that our strategy can lead to speed-up factors of hundreds to thousands of times on the computation of density-based minimum spanning trees.",
    "citationCount": 2,
    "referenceCount": 27
}