{
    "paperId": "a917c41442db5c8b7ebe23f4c9ed8589c1981df1",
    "title": "Pistis: A Decentralized Knowledge Graph Platform Enabling Ownership-Preserving SPARQL Querying",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Enyuan Zhou",
        "Song Guo",
        "Zicong Hong",
        "Christian S. Jensen",
        "Yang Xiao",
        "Jinwen Liang",
        "Dalin Zhang"
    ],
    "doi": "10.14778/3749646.3749716",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a917c41442db5c8b7ebe23f4c9ed8589c1981df1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Decentralized Knowledge Graph (DKG) platforms allow the sharing of knowledge with multiple owners. While data owners can share their data with others by encrypting their data before sharing it, this naïve approach prevents data encrypted by different owners from being queried together, as it compromises query verifiability, an essential DKG platform feature. We propose Pistis, the first DKG platform capable of preserving ownership while also enabling verifiable SPARQL queries. Two novel techniques facilitate this:\n owner-managed end-to-end encryption\n and\n collaborative query verification.\n In Pistis, data owners thus encrypt their data individually and collaborate to construct an authenticated data structure (ADS) with a global key by means of secret sharing and secure multi-party computation. Then, by indexing KG data as ciphertext over the ADS, Pistis offers a cryptographic scheme called VO-SPARQL that facilitates verifiable queries on encrypted KG data with multiple owners. Pistis provides succinct proofs for two-stage SPARQL queries, including subgraph queries based on the ADS and aggregation on encrypted intermediate results based on a key-aggregate cryptographic primitive. A theoretical analysis and an empirical study provide detailed insight into the performance of Pistis while offering provable security.\n",
    "citationCount": 0,
    "referenceCount": 87
}