{
    "paperId": "a92b7305ecc47568da996785ce61ab5c54f13eec",
    "title": "Multi-Agent Collaborative Bayesian Optimization via Constrained Gaussian Processes",
    "year": 2024,
    "venue": "Technometrics",
    "authors": [
        "Qiyuan Chen",
        "Liangkui Jiang",
        "H. Qin",
        "R. Kontar"
    ],
    "doi": "10.1080/00401706.2024.2365732",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a92b7305ecc47568da996785ce61ab5c54f13eec",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract The increase in the computational power of edge devices has opened a new paradigm for collaborative analytics whereby agents borrow strength from each other to improve their learning capabilities. This work focuses on collaborative Bayesian optimization (BO), in which agents work together to efficiently optimize black-box functions without the need for sensitive data exchange. Our idea revolves around introducing a class of constrained Gaussian process surrogates, enabling agents to borrow informative designs from high-performing collaborators to enhance and expedite their optimization process. Our approach presents the first general-purpose collaborative BO framework that is compatible with any Gaussian process kernel and most of the known acquisition functions. Despite the simplicity of our approach, we demonstrate that it offers elegant theoretical guarantees and significantly outperforms state-of-the-art methods, especially when agents have heterogeneous black-box functions. Through various simulations and a real-life experiment in additive manufacturing, we showcase the advantageous properties of our approach and the benefits derived from collaboration.",
    "citationCount": 4,
    "referenceCount": 34
}