{
    "paperId": "a942f6320b85f4bb58fa56266028c4121074965f",
    "title": "Helios: An extremely low power event-based gesture recognition for always-on smart eyewear",
    "year": 2024,
    "venue": "ECCV Workshops",
    "authors": [
        "Prarthana Bhattacharyya",
        "Joshua Mitton",
        "Ryan Page",
        "Owen Morgan",
        "Ben Menzies",
        "Gabriel Homewood",
        "Kemi Jacobs",
        "Paolo Baesso",
        "Dave Trickett",
        "Chris Mair",
        "Taru Muhonen",
        "Rory R Clark",
        "Louis Berridge",
        "R. Vigars",
        "Iain Wallace"
    ],
    "doi": "10.48550/arXiv.2407.05206",
    "arxivId": "2407.05206",
    "url": "https://www.semanticscholar.org/paper/a942f6320b85f4bb58fa56266028c4121074965f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper introduces Helios, the first extremely low-power, real-time, event-based hand gesture recognition system designed for all-day on smart eyewear. As augmented reality (AR) evolves, current smart glasses like the Meta Ray-Bans prioritize visual and wearable comfort at the expense of functionality. Existing human-machine interfaces (HMIs) in these devices, such as capacitive touch and voice controls, present limitations in ergonomics, privacy and power consumption. Helios addresses these challenges by leveraging natural hand interactions for a more intuitive and comfortable user experience. Our system utilizes a extremely low-power and compact 3mmx4mm/20mW event camera to perform natural hand-based gesture recognition for always-on smart eyewear. The camera's output is processed by a convolutional neural network (CNN) running on a NXP Nano UltraLite compute platform, consuming less than 350mW. Helios can recognize seven classes of gestures, including subtle microgestures like swipes and pinches, with 91% accuracy. We also demonstrate real-time performance across 20 users at a remarkably low latency of 60ms. Our user testing results align with the positive feedback we received during our recent successful demo at AWE-USA-2024.",
    "citationCount": 5,
    "referenceCount": 29
}