{
    "paperId": "a965e614e6270b701188d990589b331057a404dd",
    "title": "Advancing the Threat Intelligence with AI: An Overview, Taxonomy and Roadmap",
    "year": 2025,
    "venue": "Journal of universal computer science (Online)",
    "authors": [
        "I. Tomičić",
        "P. Grd",
        "A. Bernik"
    ],
    "doi": "10.3897/jucs.137544",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a965e614e6270b701188d990589b331057a404dd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a comprehensive analysis of the integration of artificial intelligence (AI) into threat intelligence (TI) systems, focusing on its potential to enhance cybersecurity operations. The paper presents an extensive literature review, covering the current state of AI applications in TI, including machine learning, deep learning, and natural language processing for automating threat detection, classification, and analysis. It outlines the core functions of AI in TI, such as threat detection, correlation, prediction, and automated response, and introduces a detailed taxonomy categorizing AI techniques based on their roles in enhancing TI processes. Additionally, the paper proposes a conceptual workflow for AI-powered TI, illustrating how AI can streamline data collection, threat analysis, and incident response. A roadmap for future research is further provided, highlighting key areas for development, including explainable AI, federated learning, and edge computing. This work contributes to the field by offering a structured framework for integrating AI into TI and identifying critical challenges and future directions in AI-driven cybersecurity.",
    "citationCount": 0,
    "referenceCount": 38
}