{
    "paperId": "a976412e56a5342679610ceba9878f3ff3ddecf4",
    "title": "A Robust Automatic Epilepsy Seizure Detection Algorithm Based on Interpretable Features and Machine Learning",
    "year": 2024,
    "venue": "Electronics",
    "authors": [
        "Shiqi Liu",
        "Yuting Zhou",
        "Xuemei Yang",
        "Xiaoying Wang",
        "Junping Yin"
    ],
    "doi": "10.3390/electronics13142727",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a976412e56a5342679610ceba9878f3ff3ddecf4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/13/14/2727/pdf?version=1720872963",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Epilepsy, as a serious neurological disorder, can be detected by analyzing the brain signals produced by neurons. Electroencephalogram (EEG) signals are the most important data source for monitoring these brain signals. However, these complex, noisy, nonlinear and nonstationary signals make detecting seizures become a challenging task. Feature-based seizure detection algorithms have become a dominant approach for automatic seizure detection. This study presents an algorithm for automatic seizure detection based on novel features with clinical and statistical significance. Our algorithms achieved the best results on two benchmark datasets, outperforming traditional feature-based methods and state-of-the-art deep learning algorithms. Accuracy exceeded 99.99% on both benchmark public datasets, with the 100% correct detection of all seizures on the second one. Due to the interpretability and robustness of our algorithm, combined with its minimal computational resource requirements and time consumption, it exhibited substantial potential value in the realm of clinical application. The coefficients of variation of datasets proposed by us makes the algorithm data-specific and can give theoretical guidance on the selection of appropriate random spectral features for different datasets. This will broaden the applicability scenario of our feature-based approach.",
    "citationCount": 10,
    "referenceCount": 39
}