{
    "paperId": "a9878b7bc32a33e5691200728ecc9ac88302db94",
    "title": "Artificial Intelligence (AI)-Centric Management of Resources in Modern Distributed Computing Systems",
    "year": 2020,
    "venue": "2020 IEEE Cloud Summit",
    "authors": [
        "Shashikant Ilager",
        "R. Muralidhar",
        "R. Buyya"
    ],
    "doi": "10.1109/IEEECloudSummit48914.2020.00007",
    "arxivId": "2006.05075",
    "url": "https://www.semanticscholar.org/paper/a9878b7bc32a33e5691200728ecc9ac88302db94",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2006.05075",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Contemporary Distributed Computing Systems (DCS) such as Cloud Data Centers are large scale, complex, heterogeneous, and distributed across multiple networks and geographical boundaries. On the other hand, the Internet of Things (IoT)-driven applications are producing a huge amount of data that requires real-time processing and fast response. Managing these resources efficiently to provide reliable services to end-users or applications is a challenging task. The existing Resource Management Systems (RMS) rely on either static or heuristic solutions inadequate for such composite and dynamic systems. The advent of Artificial Intelligence (AI) due to data availability and processing capabilities manifested into possibilities of exploring data-driven solutions in RMS tasks that are adaptive, accurate, and efficient. In this regard, this paper aims to draw the motivations and necessities for data-driven solutions in resource management. It identifies the challenges associated with it and outlines the potential future research directions detailing where and how to apply the data-driven techniques in the different RMS tasks. Finally, it provides a conceptual data-driven RMS model for DCS and presents the two real-time use cases (GPU frequency scaling and data centre resource management from Google Cloud and Microsoft Azure) demonstrating AI-centric approaches' feasibility.",
    "citationCount": 23,
    "referenceCount": 41
}