{
    "paperId": "a98c8e545376db6e941aa2aa339d568bcce7e3e9",
    "title": "PHI-SMFE: spatial multi-scale feature extract neural network based on physical heterogeneous interaction for solving passive scalar advection in a 2-D unsteady flow",
    "year": 2023,
    "venue": "Frontiers in Marine Science",
    "authors": [
        "Yuchen Yuan",
        "Ning Song",
        "Jie Nie",
        "Xiaomeng Shi",
        "Jingjian Chen",
        "Qi Wen",
        "Zhiqiang Wei"
    ],
    "doi": "10.3389/fmars.2023.1276869",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a98c8e545376db6e941aa2aa339d568bcce7e3e9",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fmars.2023.1276869/pdf?isPublishedV2=False",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fluid dynamic calculations play a crucial role in understanding marine biochemical dynamic processes, impacting the behavior, interactions, and distribution of biochemical components in aquatic environments. The numerical simulation of fluid dynamics is a challenging task, particularly in real-world scenarios where fluid motion is highly complex. Traditional numerical simulation methods enhance accuracy by increasing the resolution of the computational grid. However, this approach comes with a higher computational demand. Recent advancements have introduced an alternative by leveraging deep learning techniques for fluid dynamic simulations. These methods utilize discretized learned coefficients to achieve high-precision solutions on low-resolution grids, effectively reducing the computational burden while maintaining accuracy. Yet, existing fluid numerical simulation methods based on deep learning are limited by their single-scale analysis of spatially correlated physical fields, which fails to capture the diverse scale characteristics inherent in flow fields governed by complex laws in different physical space. Additionally, these models lack an effective approach to enhance correlation interactions among dynamic fields within the same system. To tackle these challenges, we propose the Spatial Multi-Scale Feature Extract Neural Network based on Physical Heterogeneous Interaction (PHI-SMFE). The PHI module is designed to extract heterogeneity and interaction information from diverse dynamic fields, while the SMFE module focuses on capturing multi-scale features in fluid dynamic fields. We utilize channel-biased convolution to implement a separation strategy, reducing the processing of redundant feature information. Furthermore, the traditional solution module based on the finite volume method is integrated into the network to facilitate the numerical solution of the discretized dynamic field in subsequent time steps. Comparative analysis with the current state-of-the-art model reveals that our proposed method offers a 41% increase in simulation accuracy and a 12.7% decrease in inference time during the iterative evolution of unsteady flow. These results underscore the superior performance of our model in terms of both simulation accuracy and computational speedup, establishing it as a state-of-the-art solution.",
    "citationCount": 0,
    "referenceCount": 57
}