{
    "paperId": "a9cf7570bc7e06f0403e0400e9313c845847d0d5",
    "title": "Artificial Intelligence and Cyber-Physical Systems: A Review and Perspectives for the Future in the Chemical Industry",
    "year": 2021,
    "venue": "Applied Informatics",
    "authors": [
        "L. M. C. Oliveira",
        "Rafael L. Dias",
        "C. Rebello",
        "M. Martins",
        "A. Rodrigues",
        "A. M. Ribeiro",
        "I. Nogueira"
    ],
    "doi": "10.3390/ai2030027",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/a9cf7570bc7e06f0403e0400e9313c845847d0d5",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2673-2688/2/3/27/pdf?version=1631596730",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern society is living in an age of paradigm changes. In part, these changes have been driven by new technologies, which provide high performance computing capabilities that enable the creation of complex Artificial Intelligence systems. Those developments are allowing the emergence of new Cyber Systems where the continuously generated data is utilized to build Artificial Intelligence models used to perform specialized tasks within the system. While, on one hand, the isolated application of the cyber systems is becoming widespread, on the other hand, their synchronical integration with other cyber systems to build a concise and cognitive structure that can interact deeply and autonomously with a physical system is still a completely open question, only addressed in some works from a philosophical point of view. From this standpoint, the AI can play an enabling role to allow the existence of these cognitive CPSs. This review provides a look at some of the aspects that will be crucial in the development of cyber-physical systems, focusing on the application of artificial intelligence to confer cognition to the system. Topics such as control and optimization architectures and digital twins are presented as components of the CPS. It also provides a conceptual overview of the impacts that the application of these technologies might have in the chemical industry, more specifically in the purification of methane.",
    "citationCount": 26,
    "referenceCount": 77
}