{
    "paperId": "aa050731df64d823a7b1f90dfd2b07553fc20121",
    "title": "Quantifying the impacts of the COVID-19 pandemic lockdown and the armed conflict with Russia on Sentinel 5P TROPOMI NO2 changes in Ukraine",
    "year": 2023,
    "venue": "Big Earth Data",
    "authors": [
        "Anh Phan",
        "Hiromichi Fukui"
    ],
    "doi": "10.1080/20964471.2023.2265105",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aa050731df64d823a7b1f90dfd2b07553fc20121",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/20964471.2023.2265105?needAccess=true",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT This study investigated variations in nitrogen dioxide (NO2) levels in Ukraine during two significant periods: the COVID-19 pandemic lockdown in 2020 and the armed conflict with Russia in 2022. Original and reprocessed Sentinel 5P data products were utilized for the analysis. A machine learning model was employed to generate a business-as-usual NO2 time series that accounted for meteorological variability. For the nine most populous cities in Ukraine, during the lockdown in 2020 we observed a moderation of increases in NO2 levels during the lockdown compared to the pre-lockdown levels. Looking at the same months during the conflict period in 2022, we identified much more significant reductions in NO2 level in these cities, averaging 12.1% for original and 18.1% for reprocessed datasets. Besides our examination of major urban areas, we observed reductions in NO2 levels in areas surrounding coal power plants damaged or destroyed by the conflict. For the major urban areas in Ukraine, we conclude that changes in daily anthropogenic activities due to the conflict-related events had more substantial impacts on NO2 levels than did COVID-19 lockdown.",
    "citationCount": 1,
    "referenceCount": 35
}