{
    "paperId": "aa0809c9c708819688d5aa1d0d25be62b1eb5019",
    "title": "TICKHUNTER: A Targeted Hybridization-Capture Sequencing Approach for the Detection and Characterization of Tick-borne Pathogens and Blood Meals",
    "year": 2025,
    "venue": "bioRxiv",
    "authors": [
        "Xiyu Wang",
        "Joel J. Brown",
        "Marie V. Lilly",
        "Laura D Plimpton",
        "Chloe M. Murrell",
        "Sebastián G. Llanos-Soto",
        "Jordan D. Zehr",
        "Yining Sun",
        "Guillaume Reboul",
        "Kelly Sams",
        "Aiman Sabaawy",
        "Lauren Singh",
        "Rebecca L. Tallmadge",
        "Patrick K. Mitchell",
        "Renee R. Anderson",
        "Stephen G. Ladd-Wilson",
        "Ellie Bourgikos",
        "Chantal B.F. Vogels",
        "Ximena A. Olarte‐Castillo",
        "Maria A Diuk-Wasser",
        "Laura B. Goodman"
    ],
    "doi": "10.1101/2025.06.06.658355",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aa0809c9c708819688d5aa1d0d25be62b1eb5019",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ticks are vectors of many debilitating pathogens that are transmitted during blood meal acquisition. As both vector and pathogen species continue to emerge, there is a critical need for improved pathogen diagnostic and host remnant identification methods to develop interventions. Current pathogen detection methods are limited in their ability to subtype and detect emerging variants and non-vector borne “look-alike” diseases. Determination of tick blood meal sources is also an elusive step for understanding tick interactions with the biotic community in a given environment, with consequences for environmental management and disease prevention strategies. We have created an accessible hybridization capture next-generation sequencing panel called “TICKHUNTER” to improve molecular detection and subtyping of bacterial and parasitic pathogens in both clinical and tick samples. For disease ecology studies, the panel also detects host blood meal sources of interest. An alternative method for unbiased blood meal remnant analysis is also presented. We find that TICKHUNTER is a promising tool for effective and accurate detection of a variety of tick-borne pathogens, based on comparable linearity, limit of detection, sensitivity, and specificity to real-time PCR. Additionally, it can detect and characterize unexpected pathogens due to the large capacity for multiplexing and flexibility in variant detection.",
    "citationCount": 0,
    "referenceCount": 102
}