{
    "paperId": "aa252283ce5d7f9297371bb18f6ac0067d0ca184",
    "title": "Movement Analytics: Current Status, Application to Manufacturing, and Future Prospects from an AI Perspective",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Peter Baumgartner",
        "Daniel Smith",
        "Mashud Rana",
        "Reena Kapoor",
        "Elena Tartaglia",
        "A. Schutt",
        "Ashfaqur Rahman",
        "John Taylor",
        "S. Dunstall"
    ],
    "doi": "10.48550/arXiv.2210.01344",
    "arxivId": "2210.01344",
    "url": "https://www.semanticscholar.org/paper/aa252283ce5d7f9297371bb18f6ac0067d0ca184",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2210.01344",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data-driven decision making is becoming an integral part of manufacturing companies. Data is collected and commonly used to improve efficiency and produce high quality items for the customers. IoT-based and other forms of object tracking are an emerging tool for collecting movement data of objects/entities (e.g. human workers, moving vehicles, trolleys etc.) over space and time. Movement data can provide valuable insights like process bottlenecks, resource utilization, effective working time etc. that can be used for decision making and improving efficiency. Turning movement data into valuable information for industrial management and decision making requires analysis methods. We refer to this process as movement analytics. The purpose of this document is to review the current state of work for movement analytics both in manufacturing and more broadly. We survey relevant work from both a theoretical perspective and an application perspective. From the theoretical perspective, we put an emphasis on useful methods from two research areas: machine learning, and logic-based knowledge representation. We also review their combinations in view of movement analytics, and we discuss promising areas for future development and application. Furthermore, we touch on constraint optimization. From an application perspective, we review applications of these methods to movement analytics in a general sense and across various industries. We also describe currently available commercial off-the-shelf products for tracking in manufacturing, and we overview main concepts of digital twins and their applications.",
    "citationCount": 4,
    "referenceCount": 280
}