{
    "paperId": "aa46aebc35ca12ea9b28d4d81b91e3ad36fcd1a8",
    "title": "ViTMatte: Boosting Image Matting with Pretrained Plain Vision Transformers",
    "year": 2023,
    "venue": "Information Fusion",
    "authors": [
        "J. Yao",
        "Xinggang Wang",
        "Shusheng Yang",
        "Baoyuan Wang"
    ],
    "doi": "10.48550/arXiv.2305.15272",
    "arxivId": "2305.15272",
    "url": "https://www.semanticscholar.org/paper/aa46aebc35ca12ea9b28d4d81b91e3ad36fcd1a8",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.15272",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, plain vision Transformers (ViTs) have shown impressive performance on various computer vision tasks, thanks to their strong modeling capacity and large-scale pretraining. However, they have not yet conquered the problem of image matting. We hypothesize that image matting could also be boosted by ViTs and present a new efficient and robust ViT-based matting system, named ViTMatte. Our method utilizes (i) a hybrid attention mechanism combined with a convolution neck to help ViTs achieve an excellent performance-computation trade-off in matting tasks. (ii) Additionally, we introduce the detail capture module, which just consists of simple lightweight convolutions to complement the detailed information required by matting. To the best of our knowledge, ViTMatte is the first work to unleash the potential of ViT on image matting with concise adaptation. It inherits many superior properties from ViT to matting, including various pretraining strategies, concise architecture design, and flexible inference strategies. We evaluate ViTMatte on Composition-1k and Distinctions-646, the most commonly used benchmark for image matting, our method achieves state-of-the-art performance and outperforms prior matting works by a large margin.",
    "citationCount": 77,
    "referenceCount": 70
}