{
    "paperId": "aa5276e165f05e80731514e32c2c587b1d5a45ac",
    "title": "A 17.1 kb duplication downstream GATA6 is strongly associated with egg weight in chicken",
    "year": 2025,
    "venue": "BMC Genomics",
    "authors": [
        "Lei Wang",
        "Shaobo Han",
        "Weijian Fan",
        "Yangming Pan",
        "Bo Yuan",
        "Guanyu Hou",
        "Shijun Li"
    ],
    "doi": "10.1186/s12864-025-11888-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aa5276e165f05e80731514e32c2c587b1d5a45ac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Egg weight (EW) is one of the most economically important traits in chickens. Recent statistics show that the EWs of most yellow-feathered chickens in China fall within the 40 ~ 50 g range, while, Danzhou (DZH) chickens exhibit significantly lower EW compared to this range. Here, we aim to identify candidate genes and regulatory variants involved in EW control by conducting a genome-wide association study (GWAS) with high-density SNPs obtained from whole-genome sequencing (WGS). We performed a GWAS using WGS data from 76 DZH chickens and 120 Wenchang (WCH) chickens to identify loci associated with the unique EW phenotype in DZH chickens. Using a mixed linear model, we identified an association signal at 102,727,028 bp ~ 102,822,629 bp on chromosome 2. This signal is adjacent to the GATA6, which plays a key role in liver development. Given the liver’s essential role in synthesizing yolk precursors, we hypothesized this signal region might influence EW through liver function. Although SNPs and indels within this signal region were ruled out as causal variants for EW, SV-gwas between DZH and WCH revealed a 17.1 kb duplication (dup, chr2:102,721,722–102,738,778 bp) approximately 66.6 kb downstream of GATA6. In the F2 population of 118 individuals derived from DZH and WCH chickens, PCR and qPCR of the dup revealed significant differences in EW. Both heterozygous (dup/+) and homozygous (dup/dup) individuals showed significantly higher minimum and average EW compared to wild-type (+/+) controls. Moreover, the maximum EW observed in homozygotes was also significantly elevated relative to the wild-type. Dual-luciferase assays confirmed the presence of an open chromatin region within the dup, validated by ATAC-seq, which exhibited enhanced regulatory activity. Additionally, GATA6 expression levels measured by qPCR were significantly higher in high EW individuals with heterozygous or homozygous genotypes compared to wild-type individuals with low EW. In conclusion, our findings establish, for the first time, that a 245 bp enhancer-containing dup in GATA6’s regulatory region critically regulates EW variation in yellow-feathered chickens, providing a potential molecular marker for breeding programs targeting egg size optimization. Supplementary Information The online version contains supplementary material available at 10.1186/s12864-025-11888-0.",
    "citationCount": 0,
    "referenceCount": 59
}