{
    "paperId": "aa576de3c0716496138e9fcab22d7250e3c44ada",
    "title": "Machine Learning for Graph Data Management and Query Processing",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Hanchen Wang",
        "Ying Zhang",
        "Wenjie Zhang"
    ],
    "doi": "10.14778/3750601.3750702",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aa576de3c0716496138e9fcab22d7250e3c44ada",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning techniques have been proposed to optimize the performance of graph databases in recent years. Due to the NP-hardness of graph database tasks and the complexity of graph data, traditional exact solutions usually encounter efficiency issues, while the performance of approximation solutions can be affected by issues like sampling failure and local optimality. Empowered by the inherent advantages of machine learning, the learning-based techniques show the generalization ability and better performance in many scenarios, including graph data management and graph query processing. Despite the efficiency and accuracy brought by machine learning techniques, machine learning for graph database models still face several critical challenges, including scalability and adaptability. In this tutorial, we first provide an in-depth survey of learning-based graph data management and query processing techniques published in recent database and data mining conferences to sketch the frontier of the research of Machine Learning for Graph Database. We also discuss the open challenges and provide future directions.",
    "citationCount": 0,
    "referenceCount": 44
}