{
    "paperId": "aaa8a8c55dd5f66bba109e72735ee0171cafac4b",
    "title": "Tetrahymena predation drives adaptive evolution of Salmonella by disrupting O-antigen biosynthesis and upregulating transcriptional regulator csgD",
    "year": 2025,
    "venue": "The ISME Journal",
    "authors": [
        "Hao Huang",
        "Jinzhu Geng",
        "Yuhao Dong",
        "Chen Yuan",
        "Gang Li",
        "Meng Nie",
        "Jingjing Guo",
        "Yongjie Liu"
    ],
    "doi": "10.1093/ismejo/wraf070",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aaa8a8c55dd5f66bba109e72735ee0171cafac4b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Protozoan predation is increasingly understood to be one of the main environmental factors driving bacterial virulence evolution and adaptation strategies. In this study, we reveal the adaptive evolution of Salmonella Enteritidis in phenotypic and genomic traits after passage through Tetrahymena thermophila. We identified a beneficial and fixed mutation that occurs at the coding region of rfbP, encoding the undecaprenyl-phosphate galactose phosphotransferase, and demonstrated that almost all observed phenotypic changes caused by selection pressure, including enhanced biofilm formation and reduced bacterial motility, are related to the early termination of RfbP protein translation. This mutation blocks the lipopolysaccharide O-antigen synthesis and leads to upregulation of the transcriptional factor csgD, which plays a central role in regulating Salmonella adaptation to the adverse environment. Our findings underscore the selective pressure from Tetrahymena as a pivotal driver of adaptive evolution in Salmonella, elucidating the nexus between adaptation to protozoan predation and augmented environmental persistence. This investigation advances our understanding of the ecological role of protozoan predation in the natural selection of bacterial communities.",
    "citationCount": 0,
    "referenceCount": 66
}