{
    "paperId": "aaaf18029e4a6ea16f19e5f839603fd419ab7cf2",
    "title": "MAPSO-based mode transition process optimisation of ship parallel hybrid power system",
    "year": 2025,
    "venue": "Journal of Marine Engineering &amp; Technology",
    "authors": [
        "Ailong Fan",
        "Zhiqi Tian",
        "Yongping Li",
        "Hanyou Liu",
        "Hao Qiu",
        "Yuliang Liufu",
        "Nikola Vladimir"
    ],
    "doi": "10.1080/20464177.2025.2457182",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aaaf18029e4a6ea16f19e5f839603fd419ab7cf2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hybrid power ships are the focus of attention in the shipping industry due to their low carbon and high efficiency benefits. However, fluctuations in stern shaft speed and equipment wear generated by its power system during mode transition has been an inadequately addressed problem. To this end, this paper first takes a 7500-ton bulk carrier as the research object and builds a hybrid power system model in the AMESim simulation platform for simulation and verification work. Then, the stern shaft speed overshoot rate, stern shaft rotational speed jerk, and clutch slip friction work are used as indicators, which are normalised and weighted as a multi-objective evaluation function for mode transition. With the objective of minimising the value of this function, the modified adaptive particle swarm algorithm (MAPSO) is used to solve the control problem of shaft motor torque and clutch oil pressure during mode transition and the optimisation results are obtained. The results show that the simulation accuracy of the established model can reach 1.1%., and the MAPSO-based mode transition coordinated control strategy reduces the stern shaft speed overshoot rate, stern shaft rotational speed jerk, and clutch slip friction work by 86.32%, 52.01% and 24.91% during EP mode to PTI mode respectively and 86.73%, 58.80% and 35.05% during EP mode to PTO mode respectively, compared with prototype control strategy.",
    "citationCount": 1,
    "referenceCount": 38
}