{
    "paperId": "aabd04575aa69094c4da5eac252e5eb71efe445f",
    "title": "Internet of Things with Deep Learning Techniques for Pandemic Detection: A Comprehensive Review of Current Trends and Open Issues",
    "year": 2024,
    "venue": "Electronics",
    "authors": [
        "S. Ajagbe",
        "P. Mudali",
        "M. Adigun"
    ],
    "doi": "10.3390/electronics13132630",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aabd04575aa69094c4da5eac252e5eb71efe445f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/electronics13132630",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Technological advancements for diverse aspects of life have been made possible by the swift development and application of Internet of Things (IoT) based technologies. IoT technologies are primarily intended to streamline various processes, guarantee system (technology or process) efficiency, and ultimately enhance the quality of life. An effective method for pandemic detection is the combination of deep learning (DL) techniques with the IoT. IoT proved beneficial in many healthcare domains, especially during the last worldwide health crisis: the COVID-19 pandemic. Using studies published between 2019 and 2024, this review seeks to examine the various ways that IoT-DL models contribute to pandemic detection. We obtained the titles, keywords, and abstracts of the chosen papers by using the Scopus and Web of Science (WoS) databases. This study offers a comprehensive review of the literature and unresolved problems in applying IoT and DL to pandemic detection in 19 papers that were eligible to be read from start to finish out of 2878 papers that were initially accessed. To provide practitioners, policymakers, and researchers with useful information, we examine a range of previous study goals, approaches used, and the contributions made in those studies. Furthermore, by considering the numerous contributions of IoT technologies and DL as they help in pandemic preparedness and control, we provide a structured overview of the current scientific trends and open issues in this field. This review provides a thorough overview of the state-of-the-art routing approaches currently in use, as well as their limits and potential future developments, making it an invaluable resource for DL researchers and practitioners and it is a useful tool for multidisciplinary research.",
    "citationCount": 15,
    "referenceCount": 72
}