{
    "paperId": "aaf62664b8a5172b02c4b75dde29818c0fd094ca",
    "title": "Evaluation Algorithm of TV Program Host Performance Based on Emotion Recognition",
    "year": 2024,
    "venue": "Journal of Electrical Systems",
    "authors": [
        "Lu Bai Lu Bai"
    ],
    "doi": "10.52783/jes.629",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aaf62664b8a5172b02c4b75dde29818c0fd094ca",
    "isOpenAccess": true,
    "openAccessPdf": "https://journal.esrgroups.org/jes/article/download/629/652",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development of information technology and system norms and the incongruity of personnel training speed, the development of news media reports has caused a large number of negative effects. From the current situation of the development of news media reports, due to the lack of perfect management, the difference in media literacy between users and enterprises, entertainment to death, rampant consumer culture, and many other factors, the network media reports are chaotic. In the proposed model Fuzzy Fredholm Integral Market Efficiency (FFI-ME) for the media coverage. With the FFI-ME model, the information technology computes the news media data for the estimation of the coverage to achieve market efficiency. The FFI-ME model uses the Fredholm Integral model to compute the market efficiency for the media data in China. The FFI-ME model computes the news data in China and clusters the data for the classification and detection of the instances in the equation. Through the Integral Fredholm model, the features of the news are estimated to compute the media coverage and efficiency of the news media data. The model uses the Deep learning model for the classification of the data instance in the media data. The simulation analysis expressed that the proposed FFI-ME model achieves a higher classification data accuracy of the 98%. ",
    "citationCount": 0,
    "referenceCount": 30
}