{
    "paperId": "aaf91d32f2c5892d971d5d3837dc6970a6768d7b",
    "title": "Memory Prefetching Evaluation of Scientific Applications on a Modern HPC Arm-Based Processor",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Nam Ho",
        "Carlos Falquez",
        "Antoni Portero",
        "Estela Suarez",
        "Dirk Pleiter"
    ],
    "doi": "10.1109/ACCESS.2025.3569533",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aaf91d32f2c5892d971d5d3837dc6970a6768d7b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2025.3569533",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Memory prefetching is a well-known technique for mitigating the negative impact of memory access latencies on memory bandwidth. This problem has become more pressing as improvements in memory bandwidth have not kept pace with increases in computational power. While much existing work has been devoted to finding appropriate prefetching techniques for specific workloads, few provide insight into the behavior of scientific applications to better understand the impact of prefetchers. This paper investigates the impact of hardware prefetchers on the latest Arm-based high-end processor architectures. In this work, we investigate memory access patterns by analyzing locality properties and visualizing delta and repetitive address patterns. A deeper understanding of memory access patterns allows the use of the appropriate prefetcher and reaching a better correlation between access pattern properties and prefetcher performance. This can guide future co-design efforts. We evaluated traditional and innovative prefetchers using a gem5-based model of Arm Neoverse V1 cores. The model features a 16-core architecture, using Amazon’s Graviton 3 processor as a hardware reference, but substituting DDR5 by high bandwidth memory (HBM2). We performed a detailed prefetching evaluation focusing on stencil, sparse matrix-vector multiplication, and Breadth-First Search kernels. These kernels represent a broad range of the applications running on today’s High-Performance Computing (HPC) systems, which are sensitive to memory performance.",
    "citationCount": 0,
    "referenceCount": 66
}