{
    "paperId": "ab05d0a76e1d71fa6f6061479cac9dd233cf508c",
    "title": "Trust Measurement in Human-Autonomy Teams: Development of a Conceptual Toolkit",
    "year": 2022,
    "venue": "ACM Trans. Hum. Robot Interact.",
    "authors": [
        "Andrea S. Krausman",
        "Catherine Neubauer",
        "Daniella J. Forster",
        "Shan G. Lakhmani",
        "Anthony L. Baker",
        "Sean M. Fitzhugh",
        "Gregory M. Gremillion",
        "Julia L. Wright",
        "J. Metcalfe",
        "Kristin E. Schaefer"
    ],
    "doi": "10.1145/3530874",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ab05d0a76e1d71fa6f6061479cac9dd233cf508c",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3530874",
    "publicationTypes": [
        "JournalArticle",
        "CaseReport"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rise in artificial intelligence capabilities in autonomy-enabled systems and robotics has pushed research to address the unique nature of human-autonomy team collaboration. The goal of these advanced technologies is to enable rapid decision-making, enhance situation awareness, promote shared understanding, and improve team dynamics. Simultaneously, use of these technologies is expected to reduce risk to those who collaborate with these systems. Yet, for appropriate human-autonomy teaming to take place, especially as we move beyond dyadic partnerships, proper calibration of team trust is needed to effectively coordinate interactions during high-risk operations. But to meet this end, critical measures of team trust for this new dynamic of human-autonomy teams are needed. This article seeks to expand on trust measurement principles and the foundation of human-autonomy teaming to propose a “toolkit” of novel methods that support the development, maintenance, and calibration of trust in human-autonomy teams operating within uncertain, risky, and dynamic environments.",
    "citationCount": 32,
    "referenceCount": 283
}