{
    "paperId": "ab359819d72891fe109b6dcb20be0f5ce0e849e0",
    "title": "LISA: A Case For Learned Index based Acceleration of Biological Sequence Analysis",
    "year": 2020,
    "venue": "bioRxiv",
    "authors": [
        "Darryl Ho",
        "S. Kalikar",
        "Sanchit Misra",
        "Jialin Ding",
        "Vasimuddin Md",
        "N. Tatbul",
        "Heng Li",
        "Tim Kraska"
    ],
    "doi": "10.1101/2020.12.22.423964",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ab359819d72891fe109b6dcb20be0f5ce0e849e0",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.biorxiv.org/content/biorxiv/early/2021/07/13/2020.12.22.423964.full.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Next Generation Sequencing (NGS) is transforming fields like genomics, transcriptomics, and epigenetics with rapidly increasing throughput at reduced cost. This also demands overcoming performance bottlenecks in the downstream analysis of the sequencing data. A key performance bottleneck is searching for exact matches of entire or substrings of short DNA/RNA sequence queries in a long reference sequence database. This task is typically performed by using an index of the reference - such as FM-index, suffix arrays, suffix trees, hash tables, or lookup tables. In this paper, we propose accelerating this sequence search by substituting or enhancing the indexes with machine learning based indexes - called learned indexes - and present LISA (Learned Indexes for Sequence Analysis). We evaluate LISA through a number of case studies – that cover widely used software tools; short and long reads; human, animal, and plant genome datasets; DNA and RNA sequences; various traditional indexing techniques (FM-indexes, hash tables and suffix arrays) – and demonstrate significant performance benefits in a majority of them. For example, our experiments on real datasets show that LISA achieves speedups of up to 2.2 fold and 4.7 fold over the state-of-the-art FM-index based implementations for exact sequence search modules in popular tools bowtie2 and BWA-MEM2, respectively. Code availability LISA-based FM-index: https://github.com/IntelLabs/Trans-Omics-Acceleration-Library/tree/master/src/LISA-FMI LISA-based hash-table: https://github.com/IntelLabs/Trans-Omics-Acceleration-Library/tree/master/src/LISA-hash LISA applied to BWA-MEM2: https://github.com/bwa-mem2/bwa-mem2/tree/bwa-mem2-lisa.",
    "citationCount": 3,
    "referenceCount": 58
}