{
    "paperId": "ab4485a3dff69dc3e5747a3e912f6de452b449b6",
    "title": "User Identification across Social Networking Sites using User Profiles and Posting Patterns",
    "year": 2021,
    "venue": "IEEE International Joint Conference on Neural Network",
    "authors": [
        "Prashant Solanki",
        "Kwan Hui Lim",
        "A. Harwood"
    ],
    "doi": "10.1109/IJCNN52387.2021.9534413",
    "arxivId": "2106.11815",
    "url": "https://www.semanticscholar.org/paper/ab4485a3dff69dc3e5747a3e912f6de452b449b6",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2106.11815",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the prevalence of online social networking sites (OSNs) and mobile devices, people are increasingly reliant on a variety of OSNs for keeping in touch with family and friends, and using it as a source of information. For example, a user might utilise multiple OSNs for different purposes, such as using Flickr to share holiday pictures with family and friends, and Twitter to post short messages about their thoughts. Identifying the same user across multiple OSNs is an important task as this allows us to understand the usage patterns of users among different OSNs, make recommendations when a user registers for a new OSN, and various other useful applications. To address this problem, we proposed an algorithm based on the multilayer perceptron using various types of features, namely: (i) user profile, such as name, location, description; (ii) temporal distribution of user generated content; and (iii) embedding based on user name, real name and description. Using a Twitter and Flickr dataset of users and their posting activities, we perform an empirical study on how these features affect the performance of user identification across the two OSN s and discuss our main findings based on the different features.",
    "citationCount": 5,
    "referenceCount": 39
}