{
    "paperId": "ab6d33a8948a4ffbaec98d7a498c9be89d5bb4bc",
    "title": "Recording the ethical provenance of data and automating data stewardship",
    "year": 2023,
    "venue": "Big Data & Society",
    "authors": [
        "A. Bernier",
        "Maili Raven-Adams",
        "D. Zaccagnini",
        "B. Knoppers"
    ],
    "doi": "10.1177/20539517231163174",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ab6d33a8948a4ffbaec98d7a498c9be89d5bb4bc",
    "isOpenAccess": true,
    "openAccessPdf": "https://journals.sagepub.com/doi/pdf/10.1177/20539517231163174",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Health organisations use numerous different mechanisms to collect biomedical data, to determine the applicable ethical, legal and institutional conditions of use, and to reutilise the data in accordance with the relevant rules. These methods and mechanisms differ from one organisation to another, and involve considerable specialised human labour, including record-keeping functions and decision-making committees. In reutilising data at scale, however, organisations struggle to meet demands for data interoperability and for rapid inter-organisational data exchange due to reliance on legacy paper-based records and on the human-initiated administration of accompanying permissions in data. The adoption of permissions-recording, and permissions-administration tools that can be implemented at scale across numerous organisations is imperative. Further, these must be implemented in a manner that does not compromise the nuanced and contextual adjudicative processes of research ethics committees, data access committees, and biomedical research organisations. The tools required to implement a streamlined system of biomedical data exchange have in great part been developed. Indeed, there remains but a small core of functions that must further be standardised and automated to enable the recording and administration of permissions in biomedical research data with minimal human effort. Recording ethical provenance in this manner would enable biomedical data exchange to be performed at scale, in full respect of the ethical, legal, and institutional rules applicable to different datasets. This despite foundational differences between the distinct legal and normative frameworks is applicable to distinct communities and organisations that share data between one another.",
    "citationCount": 5,
    "referenceCount": 32
}