{
    "paperId": "ab7f87ed8ddc290c2938e67a2f7540a50240baac",
    "title": "Efficient and Reusable Lazy Sampling",
    "year": 2024,
    "venue": "SIGMOD record",
    "authors": [
        "Viktor Sanca",
        "Periklis Chrysogelos",
        "Anastasia Ailamaki"
    ],
    "doi": "10.1145/3665252.3665261",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ab7f87ed8ddc290c2938e67a2f7540a50240baac",
    "isOpenAccess": true,
    "openAccessPdf": "https://sigmodrecord.org/?smd_process_download=1&download_id=13697",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern analytical engines rely on Approximate Query Processing (AQP) to provide faster response times than the hardware allows for exact query answering. However, existing AQP methods impose steep performance penalties as workload unpredictability increases. While offline AQP relies on predictable workloads to a priori create samples that match the queries, as soon as workload predictability diminishes, returning to existing online AQP methods that create query-specific samples with little reuse across queries results in significantly smaller gains in response times. As a result, existing approaches cannot fully exploit the benefits of sampling under increased unpredictability. We propose LAQy, a framework for building, expanding, and merging samples to adapt to the changes in workload predicates. We propose lazy sampling to overcome the unpredictability issues that cause fast-but-specialized samples to be query-specific and design it for a scale-up analytical engine to show the adaptivity and practicality of our framework in a modern system. LAQy speeds up online sampling processing as a function of data access and computation reuse, making sampler placement after expensive operators more practical.",
    "citationCount": 0,
    "referenceCount": 36
}