{
    "paperId": "abb5aa3ff57e043bbaf59239ab27150a2545aee5",
    "title": "Associative Memories via Predictive Coding",
    "year": 2021,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Tommaso Salvatori",
        "Yuhang Song",
        "Yujian Hong",
        "Simon Frieder",
        "Lei Sha",
        "Zhenghua Xu",
        "R. Bogacz",
        "Thomas Lukasiewicz"
    ],
    "doi": null,
    "arxivId": "2109.08063",
    "url": "https://www.semanticscholar.org/paper/abb5aa3ff57e043bbaf59239ab27150a2545aee5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Associative memories in the brain receive and store patterns of activity registered by the sensory neurons, and are able to retrieve them when necessary. Due to their importance in human intelligence, computational models of associative memories have been developed for several decades now. In this paper, we present a novel neural model for realizing associative memories, which is based on a hierarchical generative network that receives external stimuli via sensory neurons. It is trained using predictive coding, an error-based learning algorithm inspired by information processing in the cortex. To test the model's capabilities, we perform multiple retrieval experiments from both corrupted and incomplete data points. In an extensive comparison, we show that this new model outperforms in retrieval accuracy and robustness popular associative memory models, such as autoencoders trained via backpropagation, and modern Hopfield networks. In particular, in completing partial data points, our model achieves remarkable results on natural image datasets, such as ImageNet, with a surprisingly high accuracy, even when only a tiny fraction of pixels of the original images is presented. Our model provides a plausible framework to study learning and retrieval of memories in the brain, as it closely mimics the behavior of the hippocampus as a memory index and generative model.",
    "citationCount": 71,
    "referenceCount": 47
}