{
    "paperId": "abc960c9d72a3b14f52cb9f8ef40fcc733d44560",
    "title": "Evaluating of Large Language Models in Relationship Extraction from Unstructured Data: Empirical Study from Holocaust Testimonies",
    "year": 2023,
    "venue": "Recent Advances in Natural Language Processing",
    "authors": [
        "Isuri Anuradha Nanomi Arachchige",
        "L. Ha",
        "R. Mitkov",
        "Vinita Nahar"
    ],
    "doi": "10.26615/978-954-452-092-2_013",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/abc960c9d72a3b14f52cb9f8ef40fcc733d44560",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.26615/978-954-452-092-2_013",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        },
        {
            "category": "History",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Relationship extraction from unstructured data remains one of the most challenging tasks in the field of Natural Language Processing (NLP). The complexity of relationship extraction arises from the need to comprehend the underlying semantics, syntactic structures, and contextual dependencies within the text. Unstructured data poses challenges with diverse linguistic patterns, implicit relationships, contextual nuances, complicating accurate relationship identification and extraction. The emergence of Large Language Models (LLMs), such as GPT (Generative Pre-trained Transformer), has indeed marked a significant advancement in the field of NLP. In this work, we assess and evaluate the effectiveness of LLMs in relationship extraction in the Holocaust testimonies within the context of the Historical realm. By delving into this domain-specific context, we aim to gain deeper insights into the performance and capabilities of LLMs in accurately capturing and extracting relationships within the Holocaust domain by developing a novel knowledge graph to visualise the relationships of the Holocaust. To the best of our knowledge, there is no existing study which discusses relationship extraction in Holocaust testimonies. The majority of current approaches for Information Extraction (IE) in historic documents are either manual or OCR based. Moreover, in this study, we found that the Subject-Object-Verb extraction using GPT3-based relations produced more meaningful results compared to the Semantic Role labeling-based triple extraction.",
    "citationCount": 0,
    "referenceCount": 17
}