{
    "paperId": "abfe05089ac289174a6afd78fc7cba002d519c32",
    "title": "Quantum-Inspired Spatio-Temporal Inference Network for Sustainable Car-Sharing Demand Prediction",
    "year": 2025,
    "venue": "Sustainability",
    "authors": [
        "Nihad Brahimi",
        "Huaping Zhang",
        "Zahid Razzaq"
    ],
    "doi": "10.3390/su17114987",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/abfe05089ac289174a6afd78fc7cba002d519c32",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate car-sharing demand prediction is a key factor in enhancing the operational efficiency of shared mobility systems. However, mobility data often exhibit temporal, spatial, and spatio-temporal interdependencies that pose significant challenges for conventional models. These models typically struggle to capture nonlinear and high-dimensional patterns. Existing methods struggle to model entangled relationships across these modalities and lack scalability in dynamic urban environments. This paper presents the Quantum-Inspired Spatio-Temporal Inference Network (QSTIN), an enhanced approach that builds upon our previously proposed Explainable Spatio-Temporal Inference Network (eX-STIN). QSTIN integrates a Quantum-Inspired Neural Network (QINN) into the fusion module, generating complex-valued feature representations. This enables the model to capture intricate, nonlinear dependencies across heterogeneous mobility features. Additionally, Quantum Particle Swarm Optimization (QPSO) is applied at the final prediction stage to optimize output parameters and improve convergence stability. Experimental results indicate that QSTIN consistently outperforms both conventional baseline models and the earlier eX-STIN in predictive accuracy. By enhancing demand prediction, QSTIN supports efficient vehicle allocation and planning, reducing energy use and emissions and promoting sustainable urban mobility from both environmental and economic perspectives.",
    "citationCount": 0,
    "referenceCount": 40
}