{
    "paperId": "ac13b2ac116cbd3e9f7302a5bcf163c089195d87",
    "title": "GDC-3D: A Geospatial Data Cube for Efficient Management and Analysis of 3D Spatial Data",
    "year": 2025,
    "venue": "International Conference on Agro-Geoinformatics",
    "authors": [
        "Binwen Wu",
        "Peng Yue",
        "Ruixiang Liu",
        "Kaixuan Wang",
        "Lianlian He"
    ],
    "doi": "10.1109/Agro-Geoinformatics66479.2025.11136350",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ac13b2ac116cbd3e9f7302a5bcf163c089195d87",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the widespread application of three-dimensional (3D) spatial data in smart cities, digital twins, and environmental monitoring, it has become a critical challenge to efficiently manage and analyze vast and complex datasets. In recent years, the concept of data cubes has gained significant attention. It allows multidimensional partitioning of data through slicing and dicing to facilitate data warehousing, management, and analytical services. Currently, existing research on Geospatial Data Cubes (GDCs) primarily focuses on Two-dimensional (2D) spatial data. To address the gap, the paper presents GDC-3D, a geospatial data cube model designed for the organization and management of multi-source 3D spatial data across clouds. GDC-3D also provides approaches to enhance the efficiency of 3D spatial data analysis. Experimental results demonstrate that GDC-3D shows feasibility, scalability and excellent efficiency when dealing with large-scale 3D spatial data management and analysis applications.",
    "citationCount": 0,
    "referenceCount": 20
}