{
    "paperId": "ac1cc53009cd95bc2444de98fd601ba25644db63",
    "title": "RFID Batch Authentication—A Usable Scheme Providing Anonymity",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Przemysław Błaśkiewicz",
        "B. Drzazga",
        "Łukasz Krzywiecki",
        "Damian Stygar",
        "P. Syga"
    ],
    "doi": "10.1109/ACCESS.2022.3197795",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ac1cc53009cd95bc2444de98fd601ba25644db63",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/09853538.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Businesses are slowly replacing Universal Product Code (barcodes used for tracking items) with radio-frequency identification (RFID). Unlike a barcode, RFID tag does not need to be within the line of sight of the reader, and can be interrogated from up to hundreds of meters from the reader in the case of active tag. Some readers are designed to read multiple RFID tags concurrently, which is useful in, e.g., warehouses. We address the problem of efficient methods for simultaneous authentication of multiple RFID tags – batch tag authentication. We provide a general design to build a provable secure batch tag authentication protocol from a single-tag authentication scheme using some aggregation function. Our main goal is to build a computationally-efficient batch tag authentication method that provides a reasonable level of anonymity in a model with an untrusted RFID reader. We provide an efficiency analysis of a protocol where the Bloom filter is used as the aggregation function together with a brief comparison with alternative data structures.",
    "citationCount": 1,
    "referenceCount": 40
}