{
    "paperId": "ac6303d847dea1ac546c9d8ce4fc335db532fb3b",
    "title": "Plant Disease Clustering System using Dynamic Auto-Encoder",
    "year": 2025,
    "venue": "International Conference on Wireless Communications and Mobile Computing",
    "authors": [
        "Dorra Zaibi",
        "Alya Alkameli",
        "Riadh Ksantini"
    ],
    "doi": "10.1109/IWCMC65282.2025.11059664",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ac6303d847dea1ac546c9d8ce4fc335db532fb3b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Diseases significantly impact plant growth, and one reliable way of detecting illnesses is to observe changes in the leaves. Plant diseases are caused by a number of pests that eat on the leaves, stems, bases, and entire plant. Therefore, it’s critical to detect and eradicate the illness before it harms plants. Identifying and treating plant diseases manually is becoming more and more challenging. Advancements in deep learning, particularly deep clustering algorithms, have significantly contributed to the discovery and diagnosis of plant diseases. For this purpose, we explore the effectiveness of a deep clustering model based on Dynamic Autoencoder to improve plant disease detection. This approach aims to tackle challenges such as feature drift and randomness, while also adapting to the evolving nature of the data and enhancing disease detection accuracy. Results from an experimental study using PlantVillage datasets were compared with current methods, demonstrating the model’s superiority and performance.",
    "citationCount": 0,
    "referenceCount": 19
}