{
    "paperId": "ac76285b99f5e176555c7f744600ab04df0d93e6",
    "title": "Improving Vehicular Network Authentication with Teegraph: A Hashgraph-Based Efficiency Approach",
    "year": 2025,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Rubén Juárez Cádiz",
        "Ruben Nicolas-Sans",
        "José Fernández Tamámes"
    ],
    "doi": "10.3390/s25154856",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ac76285b99f5e176555c7f744600ab04df0d93e6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Vehicular ad hoc networks (VANETs) are a critical aspect of intelligent transportation systems, improving safety and comfort for drivers. These networks enhance the driving experience by offering timely information vital for safety and comfort. Yet, VANETs come with their own set of challenges concerning security, privacy, and design reliability. Traditionally, vehicle authentication occurs every time a vehicle enters the domain of the roadside unit (RSU). In our study, we suggest that authentication should take place only when a vehicle has not covered a set distance, increasing system efficiency. The rise of the Internet of Things (IoT) has seen an upsurge in the use of IoT devices across various fields, including smart cities, healthcare, and vehicular IoT. These devices, while gathering environmental data and networking, often face reliability issues without a trusted intermediary. Our study delves deep into implementing Teegraph in VANETs to enhance authentication. Given the integral role of VANETs in Intelligent Transportation Systems and their inherent challenges, we turn to Hashgraph—an alternative to blockchain. Hashgraph offers a decentralized, secure, and trustworthy database. We introduce an efficient authentication system, which triggers only when a vehicle has not traversed a set distance, optimizing system efficiency. Moreover, we shed light on the indispensable role Hashgraph can occupy in the rapidly expanding IoT landscape. Lastly, we present Teegraph, a novel Hashgraph-based technology, as a superior alternative to blockchain, ensuring a streamlined, scalable authentication solution. Our approach leverages the logical key hierarchy (LKH) and packet update keys to ensure data privacy and integrity in vehicular networks.",
    "citationCount": 0,
    "referenceCount": 38
}