{
    "paperId": "ac78af781fb93c600b1ed1062cf937a1c6036baf",
    "title": "Estimation of aerodynamic parameters using neural artificial bee colony fusion algorithm for moderate angle of attack using real flight data",
    "year": 2023,
    "venue": "Proceedings of the Institution of Mechanical Engineers, Part G: Journal of Aerospace Engineering",
    "authors": [
        "Prashant Kumar",
        "S. Sonkar",
        "R. George",
        "A. K. Ghosh",
        "Deepu Philip"
    ],
    "doi": "10.1177/09544100231201215",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ac78af781fb93c600b1ed1062cf937a1c6036baf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aircraft system identification aims to estimate the aerodynamic force and moment coefficients utilizing intelligent modeling and parametric identification methodologies. Classical methods like output, filter, and equation error methods apply extensively as parametric approaches. In contrast, machine learning approaches like Artificial Neural Networks (ANN), Adaptive Neuro-Fuzzy Inference Systems (ANFIS), etc., are alternatives to model-based methods. This work presents a novel aerodynamic parameters estimation technique that fuses two biologically inspired optimization techniques, (i) the Artificial Bee Colony (ABC) optimization and (ii) ANN for an actual aircraft while incorporating system and measurement uncertainty. The fusion of ABC and ANN imparts the ability to address sensor noise challenges associated with system identification and parameter estimation. Comparison of the proposed method’s results with the benchmark techniques like Least Square, Filter Error, and Neural Gauss Methods using recorded flight data of the ATTAS (DLR German Aerospace Centre) and HANSA-3 (IIT Kanpur) aircrafts established its adequacy and efficacy. Furthermore, the capability of the proposed hybrid method to extract stability and control variables from the stable aircraft kinematics is shown even with insufficient information in its data history.",
    "citationCount": 2,
    "referenceCount": 51
}