{
    "paperId": "ac9e5dc5ca86a1e9c55f970b6c63b2a154f2cc20",
    "title": "Tree-based indexing technique for efficient and real-time label retrieval in the object tracking system",
    "year": 2022,
    "venue": "Journal of Supercomputing",
    "authors": [
        "Ala-Eddine Benrazek",
        "Zineddine Kouahla",
        "Brahim Farou",
        "Hamid Seridi",
        "Imane Allele"
    ],
    "doi": "10.1007/s11227-023-05478-8",
    "arxivId": "2205.15477",
    "url": "https://www.semanticscholar.org/paper/ac9e5dc5ca86a1e9c55f970b6c63b2a154f2cc20",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In real-time object tracking systems, it is essential to assign a unique identifier or label to each tracked object to distinguish it from other objects to reduce the number of ID switching (ID-Sw) and improve tracking quality. To perform the object labeling process, massive metadata must be researched to determine the appropriate label. Despite the simplicity of this process, it becomes very complex in large-scale video surveillance networks, where the metadata becomes “big metadata,” which negatively affects the performance of the real-time surveillance system. In this regard, we propose a new automatic label retrieval solution for efficient real-time tracking using the ABCCF-tree index structure to avoid such problems. The main advantages of the ABCCF-tree are its ability to index massive metadata and its logarithmic search complexity, which implicitly reduces the search time. Additionally, the quality of its searches, which ensures a consistent labeling of the tracked objects. The experimental evaluation was conducted on a publicly available dataset generated by a multi-camera containing different crowd activities. The experimental results showed excellent and promising performance.",
    "citationCount": 7,
    "referenceCount": 52
}