{
    "paperId": "acb1d590043d9f840f87d171311af2ae335491f4",
    "title": "High-quality implementation for a continuous-in-time financial API in C#",
    "year": 2024,
    "venue": "Frontiers Comput. Sci.",
    "authors": [
        "Tarik Chakkour"
    ],
    "doi": "10.3389/fcomp.2024.1371052",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/acb1d590043d9f840f87d171311af2ae335491f4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/computer-science/articles/10.3389/fcomp.2024.1371052/pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, there has been a rising interest in potentially complex software and financial industries with applications in many engineering fields. With this rise comes a host of developing a usable and consistent Application Programming Interface (API). Prioritize designing and building the software ensures to enrich the platform and emphasize inventorying APIs. In this paper, we proposed a high-quality API to implement the continuous-in-time financial model. The existing discrete framework cannot be evaluated at any time period, involving drawbacks in operating the data structures. Then, the continuous framework is implemented based on the measure theory paradigm. Our proposal uses mathematical modeling, which consists of some objects as measures and fields. It is suitable to develop this API in C# to provide the requirement quality in programming language professionally. This also integrates demands, codes, and verification in the system development life cycle. The advantages are aimed at increasing the structuring and readability. The presented work provides an overview of the design, implementation, testing, and delivery aspects of the API, highlighting the importance of architecture, testing, and numerical choices. The article gives an overview of the API by describing the implementation concerning the data structures and algorithms. These algorithms are based on using the Task Parallel Library (TPL) that makes the API easier and more fruitful for data parallel to benefit from the advantages provided by the .NET Framework.",
    "citationCount": 2,
    "referenceCount": 65
}