{
    "paperId": "acdd38398d5d09ebbf413b336dc61fedf7d41193",
    "title": "RL-CoPref: a reinforcement learning-based coordinated prefetching controller for multiple prefetchers",
    "year": 2024,
    "venue": "Journal of Supercomputing",
    "authors": [
        "Huijing Yang",
        "Juan Fang",
        "Xing Su",
        "Zhi Cai",
        "Yuening Wang"
    ],
    "doi": "10.1007/s11227-024-05938-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/acdd38398d5d09ebbf413b336dc61fedf7d41193",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s11227-024-05938-9.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern processors employ data prefetchers to alleviate the impact of long memory access latency. However, current prefetchers are designed for specific memory access patterns, which perform poorly on mixed applications with multiple memory access patterns. To address these issues, RL-CoPref, a reinforcement learning (RL)-based coordinated prefetching controller for multiple prefetchers, is proposed in this paper. RL-CoPref takes diverse program context information as the input, learns to maximize cumulative rewards, and evaluates prefetch quality based on prefetch hits/misses and memory bandwidth utilization. It can dynamically adjust the prefetch activation and prefetch degree, enabling multiple prefetchers to complement each other on mixed applications. Our extensive evaluation, utilizing the ChampSim simulator, demonstrates that RL-CoPref can effectively adapt to various workloads and system configurations, optimizing prefetch control. On average, RL-CoPref achieves 76.15% prefetch coverage, having 35.50% IPC improvement, outperforming state-of-the-art individual prefetchers by 5.91–16.54% and outperforming SBP, a state-of-the-art (non-RL) prefetch controller, by 4.64%.",
    "citationCount": 8,
    "referenceCount": 32
}