{
    "paperId": "acfd683d261f83a1c82bfac8b75719e8ab516726",
    "title": "A Self-Aware Digital Memory Framework Powered by Artificial Intelligence",
    "year": 2024,
    "venue": "IEEE Transactions on Artificial Intelligence",
    "authors": [
        "Prabuddha Chakraborty",
        "S. Bhunia"
    ],
    "doi": "10.1109/TAI.2024.3375834",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/acfd683d261f83a1c82bfac8b75719e8ab516726",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Edge computing devices in Internet-of-Things (IoT) systems are being widely used in diverse application domains including industrial automation, surveillance, and smart housing. These applications typically employ a large array of sensors, store a high volume of data, and search within the stored data for specific patterns using machine intelligence. Due to this heavy reliance on data in these applications, optimizing the memory performance in edge devices has become an important research focus. In this work, we note (based on some preliminary quantitative studies) that the memory requirements of such application-specific systems tend to differ drastically from traditional general-purpose computing systems. Inspired by these findings and also through drawing inspiration from the human brain (which excels at being highly adaptive), we design a digital memory framework that can continually adapt to the specific needs of different edge devices. This adaption is made possible through a continual reinforcement-based learning methodology, and it aims at creating a digital memory framework that is always self-aware of the data it hold and queries being made. Through a methodical implementation of the framework, we demonstrate its effectiveness for different use-cases, settings, and hyperparameters in comparison with traditional content-addressable memory.",
    "citationCount": 1,
    "referenceCount": 57
}