{
    "paperId": "ae03cd6d73cc312dfb66dede5706b4ae0189efb8",
    "title": "SEMI-SUPERVISED PREDICTION OF MULTIMODAL VEHICLE TRAJECTORY BASED ON TRANSFORMERS",
    "year": 2025,
    "venue": "Kibernetyka ta Systemnyi Analiz",
    "authors": [
        "V. Sineglazov",
        "K. Lesohorskyi"
    ],
    "doi": "10.34229/kca2522-9664.25.5.3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae03cd6d73cc312dfb66dede5706b4ae0189efb8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The prediction of vehicle motion trajectories using artificial neural networks is investigated. Existing approaches and methods for predicting vehicle motion trajectories, along with their limitations, are considered. The traffic prediction problem is presented in a scene-centric setting, using a simplified bird’s eye view (BEV) input representation and an occupancy map output representation. A semi-supervised physical maneuver model is proposed to reprocess the unimodal dataset and generate a multimodal dataset, thereby solving the problem of limited dataset for training. A modified version of the Transformer artificial neural network architecture is used for trajectory prediction. The Transformer architecture is also further modified to handle large spatio-temporal relationships. The efficiency of the proposed method is compared with the two best agent-centric and scene-centric algorithms. The proposed method improves the efficiency of known methods by up to 40% in certain metrics and achieves results comparable to the best agent-centric approaches.\n\nKeywords: motion prediction, trajectory prediction, semi-supervised learning, transformers, deep learning.",
    "citationCount": 0,
    "referenceCount": 2
}