{
    "paperId": "ae05d2c1b12dcc090428f3e9aeadf849ebfd5efe",
    "title": "Hybrid Big Data-Driven Architecture for University Student Management Based on Artificial Intelligence Algorithm",
    "year": 2025,
    "venue": "2025 3rd International Conference on Data Science and Network Security (ICDSNS)",
    "authors": [
        "Huimin Liu"
    ],
    "doi": "10.1109/ICDSNS65743.2025.11168550",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae05d2c1b12dcc090428f3e9aeadf849ebfd5efe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern university student management systems require frameworks that has to scale and consider intelligent means for examining a range of diversity and dimensions of data. Many existing systems do not consider the integration of adapting to dynamic behaviors or the relational dependencies of students' courses and instructors. This work introduces a big data proposed approach which encompasses the collection of a multi-source dataset of academics. The data are preprocessed, including the mean imputation of missing values and min-max normalization, to obtain a profile of the same scale for numerical data features. In the feature extraction phase of this approach, the temporal and behavioral features of the data were extracted, including the average session length and categorical variables, represented in either one-hot encoding. Graph Neural Networks (GNNs) are then used to learn contextual embeddings from graphs that include structural or behavioral dependencies. The embeddings learned and the hand-constructed features were then sent to a Gradient-Boosted Decision Tree (GBDT) classifier to accurately predict academic risk. The proposed GNN-GBDT method achieved high results in terms of accuracy with 97.87%, precision with 94.84%, and recall with 95.81% respectively.",
    "citationCount": 0,
    "referenceCount": 15
}