{
    "paperId": "ae09b2e085a20063f18d3987f94f44b7a5384963",
    "title": "An experimental analysis and deep learning model to assess the cooling performance of green walls in humid climates",
    "year": 2024,
    "venue": "Frontiers in Energy Research",
    "authors": [
        "A. B. Daemei",
        "T. Bradecki",
        "Alina Pancewicz",
        "Amirali Razzaghipour",
        "Asma Jamali",
        "Seyedeh Maryam Abbaszadegan",
        "Reza Askarizad",
        "Mostafa Kazemi",
        "Ayyoob Sharifi"
    ],
    "doi": "10.3389/fenrg.2024.1447655",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae09b2e085a20063f18d3987f94f44b7a5384963",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/journals/energy-research/articles/10.3389/fenrg.2024.1447655/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction: Amidst escalating global temperatures, increasing climate change, and rapid urbanization, addressing urban heat islands and improving outdoor thermal comfort is paramount for sustainable urban development. Green walls offer a promising strategy by effectively lowering ambient air temperatures in urban environments. While previous studies have explored their impact in various climates, their effectiveness in humid climates remains underexplored.Methods: This research investigates the cooling effect of a green wall during summer in a humid climate, employing two approaches: Field Measurement-Based Analysis (SC 1: FMA) and Deep Learning Model (SC 2: DLM). In SC 1: FMA, experiments utilized data loggers at varying distances from the green wall to capture real-time conditions. SC 2: DLM utilized a deep learning model to predict the green wall’s performance over time.Results: Results indicate a significant reduction in air temperature, with a 1.5°C (6%) decrease compared to real-time conditions. Long-term analysis identified specific distances (A, B, C, and D) contributing to temperature reductions ranging from 1.5°C to 2.5°C, highlighting optimal distances for green wall efficacy.Discussion: This study contributes novel insights by determining effective distances for green wall systems to mitigate ambient temperatures, addressing a critical gap in current literature. The integration of a deep learning model enhances analytical precision and forecasts future outcomes. Despite limitations related to a single case study and limited timeframe, this research offers practical benefits in urban heat island mitigation, enhancing outdoor comfort, and fostering sustainable and climate-resilient urban environments.",
    "citationCount": 0,
    "referenceCount": 54
}