{
    "paperId": "ae0ac9057ca37051d4dc0da005db2afac40e85d8",
    "title": "Towards a Semiautomatic Tool to Support the Integration of Feature Models",
    "year": 2019,
    "venue": "Brazilian Symposium on Information Systems",
    "authors": [
        "Vinícius Bischoff",
        "Kleinner Farias",
        "L. Gonçales",
        "J. Barbosa"
    ],
    "doi": "10.1145/3330204.3330249",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae0ac9057ca37051d4dc0da005db2afac40e85d8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The integration of feature models plays a key role in many software engineering tasks, e.g., adding new features to software product lines (SPL) of information systems. Previous empirical studies have revealed that integrating design models is still considered a time-consuming and error-prone task. Unfortunately, integration approaches with tool support are still severely lacking. Even worse, little is known about the effort invested by developers to integrate models manually, and how correct the integrated models are. This paper proposes FMIT, which is a semiautomatic tool to support the integration of feature models. It comes up with a strategy-based approach to reduce the effort that developers invest to combine feature models and increase the amount of correctly integrated models. A controlled experiment was run with 10 volunteers through six realistic integration scenarios. Our results, supported by statistical tests, show that our semiautomatic approach not only reduced the integration effort by 73.01%, but also increased the number of correctly integrated feature models by 43.01%, compared with the manual approach. Our main contributions are a semiautomatic, strategy-based approach with tool support, and empirical evidence on its benefits. Our encouraging results open the way for the development of new heuristics and tools to support developers during the evolution of feature models.",
    "citationCount": 1,
    "referenceCount": 21
}