{
    "paperId": "ae1d3219964317e3857bb3fab169237b43a67efe",
    "title": "Predicate Caching: Query-Driven Secondary Indexing for Cloud Data Warehouses",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Tobias Schmidt",
        "Andreas Kipf",
        "Dominik Horn",
        "Gaurav Saxena",
        "Tim Kraska"
    ],
    "doi": "10.1145/3626246.3653395",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae1d3219964317e3857bb3fab169237b43a67efe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud data warehouses are today's standard for analytical query processing. Multiple cloud vendors offer state-of-the-art systems, such as Amazon Redshift. We have observed that customer workloads experience highly repetitive query patterns, i.e., users and systems frequently send the same queries. In order to improve query performance on these queries, most systems rely on techniques like result caches or materialized views. However, these caches are often stale due to inserts, deletes, or updates that occur between query repetitions. We propose a novel secondary index, predicate caching, to improve query latency for repeating scans and joins. Predicate caching stores ranges of qualifying tuples of base table scans. Such an index can be built on the fly, is lightweight, and can be kept online without recomputation. We implemented a prototype of this idea in the cloud data warehouse Amazon Redshift. Our evaluation shows that predicate caching improves query runtimes by up to 10x on selected queries with negligible build overhead.",
    "citationCount": 16,
    "referenceCount": 29
}