{
    "paperId": "ae23792dc55c3089db45ae934b12c3437cc4fb8a",
    "title": "A Survey on Advanced Persistent Threat Detection: A Unified Framework, Challenges, and Countermeasures",
    "year": 2024,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Bo Zhang",
        "Yansong Gao",
        "Boyu Kuang",
        "Changlong Yu",
        "Anmin Fu",
        "Willy Susilo"
    ],
    "doi": "10.1145/3700749",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae23792dc55c3089db45ae934b12c3437cc4fb8a",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3700749",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, frequent Advanced Persistent Threat (APT) attacks have caused disastrous damage to critical facilities, leading to severe information leakages, economic losses, and even social disruptions. Via sophisticated, long-term, and stealthy network intrusions, APT attacks are often beyond the capabilities of traditional intrusion detection methods. Existing methods employ various techniques to enhance APT detection at different stages, but this makes it difficult to fairly and objectively evaluate the capability, value, and orthogonality of available techniques. Overly focusing on hardening specific APT detection stages cannot address some essential challenges from a global perspective, which would result in severe consequences. To holistically tackle this problem and explore effective solutions, we abstract a unified framework that covers the complete process of APT attack detection, with standardized summaries of state-of-the-art solutions and analysis of feasible techniques. Further, we provide an in-depth discussion of the challenges and countermeasures faced by each component of the detection framework. In addition, we comparatively analyze public datasets and outline the capability criteria to provide a reference for standardized evaluations. Finally, we discuss insights into potential areas for future research.",
    "citationCount": 2,
    "referenceCount": 118
}