{
    "paperId": "ae47d6d45e7569d25355cf01cd3a128614ba4d2f",
    "title": "Drillboards: Adaptive Visualization Dashboards for Dynamic Personalization of Visualization Experiences",
    "year": 2024,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Sungbok Shin",
        "Inyoup Na",
        "Niklas Elmqvist"
    ],
    "doi": "10.1109/TVCG.2025.3542606",
    "arxivId": "2410.12744",
    "url": "https://www.semanticscholar.org/paper/ae47d6d45e7569d25355cf01cd3a128614ba4d2f",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2410.12744",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present drillboards, a technique for adaptive visualization dashboards consisting of a hierarchy of coordinated charts that the user can drill down to reach a desired level of detail depending on their expertise, interest, and desired effort. This functionality allows different users to personalize the same dashboard to their specific needs and expertise. The technique is based on a formal vocabulary of chart representations and rules for merging multiple charts of different types and data into single composite representations. The drillboard hierarchy is created by iteratively applying these rules starting from a baseline dashboard, with each consecutive operation yielding a new dashboard with fewer charts and progressively more abstract and simplified views. We also present an authoring tool for building drillboards and show how it can be applied to an agricultural dataset with hundreds of expert users. Our evaluation asked three domain experts to author drillboards for their own datasets, which we then showed to casual end-users with favorable outcomes.",
    "citationCount": 3,
    "referenceCount": 81
}