{
    "paperId": "ae8090d50da7481038b82e7538b13f96d46eacba",
    "title": "A Survey on fMRI-based Brain Decoding for Reconstructing Multimodal Stimuli",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Pengyu Liu",
        "Guohua Dong",
        "Dan Guo",
        "Kun Li",
        "Fengling Li",
        "Xun Yang",
        "Meng Wang",
        "Xiaomin Ying"
    ],
    "doi": "10.48550/arXiv.2503.15978",
    "arxivId": "2503.15978",
    "url": "https://www.semanticscholar.org/paper/ae8090d50da7481038b82e7538b13f96d46eacba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In daily life, we encounter diverse external stimuli, such as images, sounds, and videos. As research in multimodal stimuli and neuroscience advances, fMRI-based brain decoding has become a key tool for understanding brain perception and its complex cognitive processes. Decoding brain signals to reconstruct stimuli not only reveals intricate neural mechanisms but also drives progress in AI, disease treatment, and brain-computer interfaces. Recent advancements in neuroimaging and image generation models have significantly improved fMRI-based decoding. While fMRI offers high spatial resolution for precise brain activity mapping, its low temporal resolution and signal noise pose challenges. Meanwhile, techniques like GANs, VAEs, and Diffusion Models have enhanced reconstructed image quality, and multimodal pre-trained models have boosted cross-modal decoding tasks. This survey systematically reviews recent progress in fMRI-based brain decoding, focusing on stimulus reconstruction from passive brain signals. It summarizes datasets, relevant brain regions, and categorizes existing methods by model structure. Additionally, it evaluates model performance and discusses their effectiveness. Finally, it identifies key challenges and proposes future research directions, offering valuable insights for the field. For more information and resources related to this survey, visit https://github.com/LpyNow/BrainDecodingImage.",
    "citationCount": 3,
    "referenceCount": 260
}