{
    "paperId": "ae859496df8860871e7d996eadd67f7a1c51b6b3",
    "title": "Flat ball topology basics multi‐transceivers 100 km/2.5 Tbps gigabit‐ethernet PON architecture for energy efficiency in data centers",
    "year": 2023,
    "venue": "Transactions on Emerging Telecommunications Technologies",
    "authors": [
        "Meet Kumari",
        "Vivek Arya"
    ],
    "doi": "10.1002/ett.4875",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ae859496df8860871e7d996eadd67f7a1c51b6b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing electronic data sources desire high‐power requisites, in order to obtain a large bandwidth, minimum power dissipation and low latency in networks. In this instance, a gigabit ethernet passive optical network (GEPON) architecture based on a dynamic Flat Ball topology incorporating multi‐transceivers to minimize network energy consumption via passive devices along with bandwidth reconfiguration potential and low latency is reported in this paper. The proposed architecture connected with 200 nodes exhibits 26 as well as 40 dB total loss in uplink as well as downlink considerably, compared to Sirius and Sandwich tree. Also, Flat ball GEPON architecture permits 9 and 10 dBm energy saving in downlink as well as uplink, respectively, than conventional GEPON architecture at 1 ms delay. The proposed architecture with 50 Erlang load allows energy ratio of 39% in downlink and 37% in uplink, at 25 × 100 Gbps traffic rate for 55 nodes. Besides this, the faithful fiber range of 100 km considering fiber no‐linearities and impairments can be obtained successfully. The architecture can be bordered with 1:64 splitting ratio with 35 ms in downlink as well as 31 ms in uplink transmission delay at bit error rate of 10−3. Additionally, on comparing the proposed topology with existing architectures depict its superiority with minimal implementation cost, low‐power dissipation, less traffic delay as well as high scalability and high flexibility.",
    "citationCount": 0,
    "referenceCount": 26
}