{
    "paperId": "aead833395fd376e577280bcdc89ed1858fc089e",
    "title": "AI-Reinforced Wearable Sensors and Intelligent Point-of-Care Tests",
    "year": 2024,
    "venue": "Journal of Personalized Medicine",
    "authors": [
        "Ghita Yammouri",
        "Abdellatif Ait Lahcen"
    ],
    "doi": "10.3390/jpm14111088",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aead833395fd376e577280bcdc89ed1858fc089e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/jpm14111088",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence (AI) techniques offer great potential to advance point-of-care testing (POCT) and wearable sensors for personalized medicine applications. This review explores the recent advances and the transformative potential of the use of AI in improving wearables and POCT. The integration of AI significantly contributes to empowering these tools and enables continuous monitoring, real-time analysis, and rapid diagnostics, thus enhancing patient outcomes and healthcare efficiency. Wearable sensors powered by AI models offer tremendous opportunities for precise and non-invasive tracking of physiological conditions that are essential for early disease detection and personalized treatments. AI-empowered POCT facilitates rapid, accurate diagnostics, making these medical testing kits accessible and available even in resource-limited settings. This review discusses the key advances in AI applications for data processing, sensor fusion, and multivariate analytics, highlighting case examples that exhibit their impact in different medical scenarios. In addition, the challenges associated with data privacy, regulatory approvals, and technology integrations into the existing healthcare system have been overviewed. The outlook emphasizes the urgent need for continued innovation in AI-driven health technologies to overcome these challenges and to fully achieve the potential of these techniques to revolutionize personalized medicine.",
    "citationCount": 26,
    "referenceCount": 124
}