{
    "paperId": "aece592644c4738893a288eee181822852ec4766",
    "title": "DLFT: Data and Layout Aware Fault Tolerance Framework for Big Data Transfer Systems",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "Preethika Kasu",
        "Prince Hamandawana",
        "Tae-Sun Chung"
    ],
    "doi": "10.1109/ACCESS.2021.3055731",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aece592644c4738893a288eee181822852ec4766",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9312710/09343287.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Various scientific research organizations generate several petabytes of data per year through computational science simulations. These data are often shared by geographically distributed data centers for data analysis. One of the major challenges in distributed environments is failure; hardware, network, and software might fail at any instant. Thus, high-speed and fault tolerant data transfer frameworks are vital for transferring such large data efficiently between the data centers. In this study, we proposed a bloom filter-based data aware probabilistic fault tolerance (DAFT) mechanism that can handle such failures. We also proposed a data and layout aware mechanism for fault tolerance (DLFT) to effectively handle the false positive matches of DAFT. We evaluated the data transfer and recovery time overheads of the proposed fault tolerance mechanisms on the overall data transfer performance. The experimental results demonstrated that the DAFT and DLFT mechanisms exhibit a maximum of 10% and a minimum of 2% recovery time overhead at 80% and 20% fault points respectively. However, we observed minimum to negligible overhead with respect to the overall data transfer rate.",
    "citationCount": 3,
    "referenceCount": 22
}