{
    "paperId": "aed4489ce24147a0f90440ce43abb2e57e0db4c5",
    "title": "3-D land use index: Vertical land use analysis based on multi-dimensional geospatial data cube",
    "year": 2024,
    "venue": "BigData Congress [Services Society]",
    "authors": [
        "Jiyoung Kim",
        "Hyojoong Kim"
    ],
    "doi": "10.1109/BigData62323.2024.10825536",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aed4489ce24147a0f90440ce43abb2e57e0db4c5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In response to the concentration of population in cities and the increasing land value, cities are being developed in a more vertical and complex manner. To quantify vertical land use in three dimensions, a three-dimensional land use index (3D LUI) was proposed. For this purpose, heterogeneous time-series spatial data were used to create a multidimensional geospatial data cube (GDC) consisting of the four dimensions. The cell size of the GDC was determined by using the 3D Moran's I index, which minimizes the effect of modifiable areal unit problem (MAUP) when mapping point data to cells, and thus the smallest cell value was chosen as the initial cell size. The 3D LUI was calculated by linearly summing the spatial accessibility (kernal density factor) and diversity of uses (enrichment factor) between cells, weighted by the values derived from the entropy weighting method (EWM). After applying this method to the Seocho-gu, Seoul, Republic of Korea in June 2024, visual evaluation using KakaoMap’s Street View revealed that in mixed-use buildings or buildings with commercial functions on the ground floor, the commercial and residential functions were separated vertically.",
    "citationCount": 1,
    "referenceCount": 10
}