{
    "paperId": "aefcf7d4f3d966c58030c956449a13c308ce266f",
    "title": "Human Information Interaction and the Cognitive Predicting Theory of Trust",
    "year": 2020,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Lauren Fell",
        "A. Gibson",
        "P. Bruza",
        "P. Hoyte"
    ],
    "doi": "10.1145/3343413.3377981",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aefcf7d4f3d966c58030c956449a13c308ce266f",
    "isOpenAccess": true,
    "openAccessPdf": "https://sigir.org/chiir2020/",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This perspectives paper proposes a conceptualization of trust that does not require a predefined feature space, but rather is dynamically formed at the point of information interaction through a cognitive predicting mechanism. Trust is a significant issue in the current information context due to fake news, echo chambers, filter bubbles, and confirmation biases which can result in a disconnect between human trust expectations and information trustworthiness, making it difficult to establish a feature space within which trust might be modeled. In response to this, we present our Cognitive Predicting Theory of Trust (CPTT) which allows trust to be modeled without the requirement of a predefined feature space. Drawn from the cognitive theory of Predictive Processing, CPTT describes how people form trust judgments based on cognitive predictions within a system of information interactions. We outline how this CPTT view of trust might be modeled using complex systems and provide examples showing how curation of the information interaction environment can affect the trust associated with the system. We conclude by proposing that our perspective opens up two avenues for exploration in Computer Human Information Interaction and Retrieval: (1) the need for alternative models, and (2) the value of curating the information environment.",
    "citationCount": 14,
    "referenceCount": 41
}