{
    "paperId": "af40933490b53be0776db693c16bb6f197f645b0",
    "title": "EarLock: Personal Authentication System for Hearables Using Sound Leakage Signals",
    "year": 2025,
    "venue": "IEEE Transactions on Mobile Computing",
    "authors": [
        "Takashi Amesaka",
        "Hiroki Watanabe",
        "Yuta Sugiura",
        "Masanori Sugimoto",
        "B. Shizuki"
    ],
    "doi": "10.1109/TMC.2025.3540584",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/af40933490b53be0776db693c16bb6f197f645b0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Earphone-type wearable devices, also known as “hearables,” will have many functions in the future. Some of those functions will require authentication of the wearer for access to the user's privacy information or settlement of payments. In this study, we propose a new personal authentication system for hearables called EarLock. EarLock authenticates the wearer by acquiring and analyzing ear canal and auricle shape information using sound leakage from the device. The system can be implemented using a speaker and external microphone that are highly compatible with hearables. We implemented three prototype devices and investigated EarLock's authentication performance under various practical scenarios, including walking conditions, noisy environments, and situations with object interference. Experimental results showed that the in-ear, open-ear, and bone-conduction devices achieved balanced accuracy (BAC) scores of 87.2–93.7%, 83.4–94.7%, and 85.9–90.0%.",
    "citationCount": 1,
    "referenceCount": 57
}