{
    "paperId": "af450c5d53c5a265426ee0da8d532ad3c84544fe",
    "title": "Efficient neural network accelerators with optical computing and communication",
    "year": 2023,
    "venue": "Computer Science and Information Systems",
    "authors": [
        "Chengpeng Xia",
        "Yawen Chen",
        "Haibo Zhang",
        "Hao Zhang",
        "Fei Dai",
        "Jigang Wu"
    ],
    "doi": "10.2298/csis220131066x",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/af450c5d53c5a265426ee0da8d532ad3c84544fe",
    "isOpenAccess": true,
    "openAccessPdf": "http://www.doiserbia.nb.rs/ft.aspx?id=1820-02142200066X",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Conventional electronic Artificial Neural Networks (ANNs) accelerators focus\n on architecture design and numerical computation optimization to improve the\n training efficiency. However, these approaches have recently encountered\n bottlenecks in terms of energy efficiency and computing performance, which\n leads to an increase interest in photonic accelerator. Photonic\n architectures with low energy consumption, high transmission speed and high\n bandwidth have been considered as an important role for generation of\n computing architectures. In this paper, to provide a better understanding of\n optical technology used in ANN acceleration, we present a comprehensive\n review for the efficient photonic computing and communication in ANN\n accelerators. The related photonic devices are investigated in terms of the\n application in ANNs acceleration, and a classification of existing solutions\n is proposed that are categorized into optical computing acceleration and\n optical communication acceleration according to photonic effects and\n photonic architectures. Moreover, we discuss the challenges for these\n photonic neural network acceleration approaches to highlight the most\n promising future research opportunities in this field.",
    "citationCount": 2,
    "referenceCount": 84
}