{
    "paperId": "af61712793efe21a718d805ff9108b64498654d9",
    "title": "VEND: Vertex Encoding for Edge Nonexistence Determination",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Youhuan Li",
        "Hangyu Zheng",
        "Lei Zou",
        "Xiaosen Li",
        "Ziming Li",
        "Pin Xiao",
        "Yangyu Tao",
        "Zheng Qin"
    ],
    "doi": "10.1109/ICDE55515.2023.00032",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/af61712793efe21a718d805ff9108b64498654d9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose to design vertex encoding for determinations of no-result edge queries that should not be executed. Edge query is one of the core operations in mainstream graph databases, which is to retrieve the corresponding edges connecting two given vertices. Real-world graphs may be too large to be stored in memory and frequently accessing edge data on disk usually incurs much overhead. Average degree of real-world graph tends to be much less than the vertex number, and edges may not exist in most pairs of vertices. Efficiently avoiding no-result edge query executions will certainly improve performance of graph database. In this paper, we propose a new and important problem for determining no-result edge queries: vertex encoding for edge nonexistence determination (VEND, for short). We build a low dimensional vertex encoding for all vertices, and we can efficiently determine most vertex pairs that are connected by no edges just with their corresponding codes. With VEND, we can utilize in-memory efficient operations to filter no-result disk accesses for edge query. We also design maintenance algorithms for the proposed solution when data updates happen. Extensive experiments on many real-world datasets confirm the ability of our solution on determining a quite high proportion of non-edge vertex pairs, as well as the acceleration for edge queries.",
    "citationCount": 2,
    "referenceCount": 45
}