{
    "paperId": "af67be246b72cd1b18237be426b5cc890fafbd52",
    "title": "Towards Building Economic Models of Conversational Search",
    "year": 2022,
    "venue": "European Conference on Information Retrieval",
    "authors": [
        "L. Azzopardi",
        "Mohammad Aliannejadi",
        "E. Kanoulas"
    ],
    "doi": "10.1007/978-3-030-99739-7_4",
    "arxivId": "2201.08742",
    "url": "https://www.semanticscholar.org/paper/af67be246b72cd1b18237be426b5cc890fafbd52",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Various conceptual and descriptive models of conversational search have been proposed in the literature -- while useful, they do not provide insights into how interaction between the agent and user would change in response to the costs and benefits of the different interactions. In this paper, we develop two economic models of conversational search based on patterns previously observed during conversational search sessions, which we refer to as: Feedback First where the agent asks clarifying questions then presents results, and Feedback After where the agent presents results, and then asks follow up questions. Our models show that the amount of feedback given/requested depends on its efficiency at improving the initial or subsequent query and the relative cost of providing said feedback. This theoretical framework for conversational search provides a number of insights that can be used to guide and inform the development of conversational search agents. However, empirical work is needed to estimate the parameters in order to make predictions specific to a given conversational search setting.",
    "citationCount": 9,
    "referenceCount": 19
}