{
    "paperId": "af88f113206cdf40f9204d2e5040963f4e265094",
    "title": "Learning from the Past: Adaptive Parallelism Tuning for Stream Processing Systems",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Yuxing Han",
        "Lixiang Chen",
        "Haoyu Wang",
        "Zhanghao Chen",
        "Yifan Zhang",
        "Chengcheng Yang",
        "Kongzhang Hao",
        "Zhengyi Yang"
    ],
    "doi": "10.1109/ICDE65448.2025.00264",
    "arxivId": "2504.12074",
    "url": "https://www.semanticscholar.org/paper/af88f113206cdf40f9204d2e5040963f4e265094",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Distributed stream processing systems rely on the dataflow model to define and execute streaming jobs, organizing computations as Directed Acyclic Graphs (DAGs) of operators. Adjusting the parallelism of these operators is crucial to handling fluctuating workloads efficiently while balancing resource usage and processing performance. However, existing methods often fail to effectively utilize execution histories or fully exploit DAG structures, limiting their ability to identify bottlenecks and determine the optimal parallelism. In this paper, we propose StreamTune, a novel approach for adaptive parallelism tuning in stream processing systems. StreamTune incorporates a pre-training and fine-tuning framework that leverages global knowledge from historical execution data for job-specific parallelism tuning. In the pre-training phase, StreamTune clusters the historical data with Graph Edit Distance and pre-trains a Graph Neural Network-based encoder per cluster to capture the correlation between the operator parallelism, DAG structures, and the identified operator-level bottlenecks. In the online tuning phase, Stream-Tu ne iteratively refines operator parallelism recommendations using an operator-level bottleneck prediction model enforced with a monotonic constraint, which aligns with the observed system performance behavior. Evaluation results demonstrate that StreamTune reduces reconfigurations by up to 29.6% and parallelism degrees by up to 30.8% in Apache Flink under a synthetic workload. In Timely Dataflow, StreamTune achieves up to an 83.3% reduction in parallelism degrees while maintaining comparable processing performance under the Nexmark benchmark, when compared to the state-of-the-art methods.",
    "citationCount": 1,
    "referenceCount": 57
}