{
    "paperId": "aff0e197f46f07dacd3a397f4986a3dde8129829",
    "title": "Enhancing Wireless Communication Security With Variable Bloom Filter-Based Physical-Layer Secure Transmission",
    "year": 2025,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Anqi Huo",
        "Guyue Li",
        "Lilin Yang",
        "Zilong Liu",
        "Aiqun Hu"
    ],
    "doi": "10.1109/JIOT.2025.3567288",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aff0e197f46f07dacd3a397f4986a3dde8129829",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article studies one-time pad (OTP) secure communication by leveraging the unpredictable physical layer channel characteristics. Existing OTP schemes based on physical-layer key generation (PKG) require additional transmission overhead of information reconciliation and may face security threats of information leakage under slow-varying channels. To tackle these challenges, we investigate a fault-tolerant privacy amplification method through variable bloom filters (BF) to address the underlying security problems. Specifically, the quantized bit sequence of the channel state information goes through a BF to improve the randomness within the sequence while the parameters of BF vary to avoid the correlations between adjacent sequences. We then optimize the parameters of the error-correcting code used during communication based on the position of the eavesdropper and the length of the quantized bits, thereby further enhancing the system security. Through comprehensive simulations, it is shown that our proposed approach can achieve a near-perfect pass rate in NIST randomness tests, and with a bit replacement rate around 0.45, while capable of resisting attacks under slow-varying channels. These results indicate that the proposed scheme significantly outperforms previous OTP secure transmission schemes.",
    "citationCount": 0,
    "referenceCount": 44
}