{
    "paperId": "aff24ff9f44b22b16929d8d4661b683ecf79c105",
    "title": "Neural Network Architectures for UAV Path Planning: A Comparative Study with A* Algorithm as Benchmark",
    "year": 2025,
    "venue": "International Journal of Robotics and Control Systems",
    "authors": [
        "Gregorius Airlangga",
        "Julius Bata",
        "Oskar Ika Adi Nugroho",
        "Lai Ferry Sugianto"
    ],
    "doi": "10.31763/ijrcs.v5i1.1757",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aff24ff9f44b22b16929d8d4661b683ecf79c105",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Autonomous path planning for Unmanned Aerial Vehicles (UAVs) plays a critical role in applications ranging from disaster response to urban logistics. Traditional algorithms, such as A*, are widely recognized for their reliability in generating collision-free and efficient trajectories but often struggle with scalability in complex and dynamic environments. This study evaluates the performance of several neural network architectures, including MLP-LSTM, CNN-GRU, CNN-LSTM, CNN BILSTM, and others, as potential alternatives to classical methods. A dataset of trajectories generated by the A* algorithm was used to train and benchmark the models, enabling direct performance comparison across key metrics such as path length, smoothness, clearance, collisions, and waypoint density. The results demonstrate that the MLP-LSTM model outperforms other neural architectures, producing paths that closely resemble A* trajectories with high smoothness and waypoint granularity. While some models, such as CNN-GRU and CNN-BILSTM, show promise in generating feasible paths, their performance is inconsistent across different UAV scenarios. Models like Residual CNN and Hybrid CNN-MHA failed to generate meaningful trajectories, highlighting the critical importance of architectural choices. This study underscores the potential of neural network models for UAV path planning.",
    "citationCount": 0,
    "referenceCount": 73
}