{
    "paperId": "aff47e69f1d23fbbc5c665a3f96f5a46a9233b6b",
    "title": "Enhancing Regular Expression Processing through Field-Programmable Gate Array-Based Multi-Character Non-Deterministic Finite Automata",
    "year": 2024,
    "venue": "Electronics",
    "authors": [
        "Chuang Zhang",
        "Xuebin Tang",
        "Yuanxi Peng"
    ],
    "doi": "10.3390/electronics13091635",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/aff47e69f1d23fbbc5c665a3f96f5a46a9233b6b",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/electronics13091635",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This work investigates the advantages of FPGA-based Multi-Character Non-Deterministic Finite Automata (MC-NFA) for enhancing regular expression processing over traditional software-based methods. By integrating Field-Programmable Gate Arrays (FPGAs) within a data processing framework, our study showcases significant improvements in processing efficiency, accuracy, and resource utilization for complex pattern matching tasks. We present a novel approach that not only accelerates database and network security applications, but also contributes to the evolving landscape of computational efficiency and hardware acceleration. The findings illustrate that FPGA’s coherent access to main memory and the efficient use of resources lead to considerable gains in processing times and throughput for handling regular expressions, unaffected by expression complexity and driven primarily by dataset size and match location. Our research further introduces a phase shift compensation technique that elevates match accuracy to optimal levels, highlighting FPGA’s potential for real-time, accurate data processing. The study confirms that the benefits of using FPGA for these tasks do not linearly correlate with an increase in resource consumption, underscoring the technology’s efficiency. This paper not only solidifies the case for adopting FPGA technology in complex data processing tasks, but also lays the groundwork for future explorations into optimizing hardware accelerators for broader applications.",
    "citationCount": 0,
    "referenceCount": 28
}