{
    "paperId": "b04f35bc85c94d11e2f334d4549b5a7cd763b68f",
    "title": "Research on the application of deep neural networks in predicting English language proficiency",
    "year": 2025,
    "venue": "4th International Conference on Telecommunications, Optics and Computer Science (TOCS 2023)",
    "authors": [
        "Jing Zhang"
    ],
    "doi": "10.1117/12.3067924",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b04f35bc85c94d11e2f334d4549b5a7cd763b68f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study explores the integration of Deep Neural Networks (DNNs) and Improved Support Vector Machines (ISVMs) to predict students' English language proficiency within a cloud-based educational platform. Utilizing a hybrid ISVM-DNN model, the research leverages DNNs' capability for automatic feature extraction and handling complex nonlinear relationships, alongside SVMs' robust classification performance in high-dimensional spaces. Data were collected from an online English learning platform, undergoing thorough preprocessing to ensure quality and consistency. The hybrid model demonstrated superior prediction accuracy compared to traditional machine learning methods, effectively capturing intricate patterns in students' learning behaviors and linguistic data. Performance evaluations highlighted significant reductions in system latency through Dynamic Resource Scheduling (DRS), ensuring scalability and responsiveness under varying user loads. Additionally, a questionnaire-based survey revealed high levels of user satisfaction, indicating the model's practical applicability in personalized education. This study underscores the potential of hybrid machine learning models in advancing personalized and data-driven educational assessments.",
    "citationCount": 0,
    "referenceCount": 19
}