{
    "paperId": "b07968a64e37338d39a8c250847639b6d349e89e",
    "title": "Dynamic online matching with budget refills",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Maria Cherifa",
        "Clément Calauzènes",
        "Vianney Perchet"
    ],
    "doi": "10.48550/arXiv.2405.09920",
    "arxivId": "2405.09920",
    "url": "https://www.semanticscholar.org/paper/b07968a64e37338d39a8c250847639b6d349e89e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Inspired by sequential budgeted allocation problems, we study the online matching problem with budget refills. In this context, we consider an online bipartite graph $G=(U,V,E)$, where the nodes in $V$ are discovered sequentially and nodes in $U$ are known beforehand. Each $u\\in U$ is endowed with a budget $b_{u,t}\\in \\mathbb{N}$ that dynamically evolves over time. Unlike the canonical setting, in many applications, the budget can be refilled from time to time, which leads to a much richer dynamic that we consider here. Intuitively, adding extra budgets in $U$ seems to ease the matching task, and our results support this intuition. In fact, for the stochastic framework considered where we studied the matching size built by Greedy algorithm on an Erd\\H{o}s-R{\\'e}yni random graph, we showed that the matching size generated by Greedy converges with high probability to a solution of an explicit system of ODE. Moreover, under specific conditions, the competitive ratio (performance measure of the algorithm) can even tend to 1. For the adversarial part, where the graph considered is deterministic and the algorithm used is Balance, the $b$-matching bound holds when the refills are scarce. However, when refills are regular, our results suggest a potential improvement in algorithm performance. In both cases, Balance algorithm manages to reach the performance of the upper bound on the adversarial graphs considered.",
    "citationCount": 1,
    "referenceCount": 34
}