{
    "paperId": "b07b03b7e8187d5b843111b7713c12d1738656c3",
    "title": "Intra-request branch orchestration for efficient LLM reasoning",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Weifan Jiang",
        "Rana Shahout",
        "Yilun Du",
        "Michael Mitzenmacher",
        "Minlan Yu"
    ],
    "doi": "10.48550/arXiv.2509.24957",
    "arxivId": "2509.24957",
    "url": "https://www.semanticscholar.org/paper/b07b03b7e8187d5b843111b7713c12d1738656c3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large Language Models (LLMs) increasingly rely on inference-time reasoning algorithms such as chain-of-thought and multi-branch reasoning to improve accuracy on complex tasks. These methods, however, substantially increase token usage and per-request latency. Prior work has largely focused on reducing token usage, often at the expense of accuracy, while overlooking other latency factors. We present DUCHESS, an LLM serving system that reduces cost and latency without sacrificing accuracy through intra-request branch orchestration guided by predictions. DUCHESS employs a lightweight linear probing model over LLM layer activations to estimate branch correctness, and its orchestration policy decides whether to terminate, duplicate, or continue a branch. When handling multiple requests, DUCHESS further reduces latency by prioritizing easier reasoning tasks when complexity can be estimated from the prompt. Experiments on three reasoning benchmarks show that DUCHESS consistently improves the token-accuracy Pareto frontier, reducing token usage by 42-63% at matched accuracy compared to self-consistency. In serving with vLLM, DUCHESS reduces mean, median, and tail latencies by 57-81%, 58-85%, and 52-84% with First-Come-First-Served scheduling, and achieves additional gains under difficulty-aware scheduling at higher request rates.",
    "citationCount": 0,
    "referenceCount": 37
}