{
    "paperId": "b0a9a8cadbc4c21dd483761f8700196d6fea0670",
    "title": "SuperCone: Unified User Segmentation over Heterogeneous Experts via Concept Meta-learning",
    "year": 2022,
    "venue": "",
    "authors": [
        "Keqian Li",
        "Yifan Hu"
    ],
    "doi": null,
    "arxivId": "2203.07029",
    "url": "https://www.semanticscholar.org/paper/b0a9a8cadbc4c21dd483761f8700196d6fea0670",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study the problem of user segmentation: given a set of users and one or more predefined groups or segments, assign users to their corresponding segments. As an example, for a segment indicating particular interest in a certain area of sports or entertainment, the task will be to predict whether each single user will belong to the segment. However, there may exist numerous long tail prediction tasks that suffer from data availability and may be of heterogeneous nature, which make it hard to capture using single off the shelf model architectures. In this work, we present SuperCone, our unified predicative segments system that addresses the above challenges. It builds on top of a flat concept representation that summarizes each user's heterogeneous digital footprints, and uniformly models each of the prediction task using an approach called\"super learning\", that is, combining prediction models with diverse architectures or learning method that are not compatible with each other. Following this, we provide an end to end approach that learns to flexibly attend to best suited heterogeneous experts adaptively, while at the same time incorporating deep representations of the input concepts that augments the above experts. Experiments show that SuperCone significantly outperform state-of-the-art recommendation and ranking algorithms on a wide range of predicative segment tasks and public structured data learning benchmarks.",
    "citationCount": 0,
    "referenceCount": 43
}