{
    "paperId": "b10da08a293d9214bf48bfeee4df0a20d52985b7",
    "title": "Multimodal Semantic Retrieval for Product Search",
    "year": 2025,
    "venue": "The Web Conference",
    "authors": [
        "Dong Liu",
        "Esther Lopez Ramos"
    ],
    "doi": "10.1145/3701716.3717567",
    "arxivId": "2501.07365",
    "url": "https://www.semanticscholar.org/paper/b10da08a293d9214bf48bfeee4df0a20d52985b7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Semantic retrieval (also known as dense retrieval) based on textual data has been extensively studied for both web search and product search application fields, where the relevance of a query and a potential target document is computed by their dense vector representation comparison. Product image is crucial for e-commerce search interactions and is a key factor for customers at product explorations. However, its impact on semantic retrieval has not been well studied yet. In this research, we build a multimodal representation for product items in e-commerce search in contrast to pure-text representation of products, and investigate the impact of such representations. The models are developed and evaluated on e-commerce datasets. We demonstrate that a multimodal representation scheme for a product can show improvement either on purchase recall or relevance accuracy in semantic retrieval. Additionally, we provide numerical analysis for exclusive matches retrieved by a multimodal semantic retrieval model versus a text-only semantic retrieval model, to demonstrate the validation of multimodal solutions.",
    "citationCount": 1,
    "referenceCount": 22
}