{
    "paperId": "b10dabf9de5c5ffb48bd5d8c6e6fee2d35f271ab",
    "title": "Towards a Formal Characterization of User Simulation Objectives in Conversational Information Access",
    "year": 2024,
    "venue": "International Conference on the Theory of Information Retrieval",
    "authors": [
        "Nolwenn Bernard",
        "K. Balog"
    ],
    "doi": "10.1145/3664190.3672529",
    "arxivId": "2406.19007",
    "url": "https://www.semanticscholar.org/paper/b10dabf9de5c5ffb48bd5d8c6e6fee2d35f271ab",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3664190.3672529",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "User simulation is a promising approach for automatically training and evaluating conversational information access agents, enabling the generation of synthetic dialogues and facilitating reproducible experiments at scale. However, the objectives of user simulation for the different uses remain loosely defined, hindering the development of effective simulators. In this work, we formally characterize the distinct objectives for user simulators: training aims to maximize behavioral similarity to real users, while evaluation focuses on the accurate prediction of real-world conversational agent performance. Through an empirical study, we demonstrate that optimizing for one objective does not necessarily lead to improved performance on the other. This finding underscores the need for tailored design considerations depending on the intended use of the simulator. By establishing clear objectives and proposing concrete measures to evaluate user simulators against those objectives, we pave the way for the development of simulators that are specifically tailored to their intended use, ultimately leading to more effective conversational agents.",
    "citationCount": 7,
    "referenceCount": 39
}