{
    "paperId": "b1109066bdf0ae90e9995582591043aa6ae7e100",
    "title": "Embodied Self-Aware Computing Systems",
    "year": 2020,
    "venue": "Proceedings of the IEEE",
    "authors": [
        "H. Hoffmann",
        "A. Jantsch",
        "N. Dutt"
    ],
    "doi": "10.1109/JPROC.2020.2977054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b1109066bdf0ae90e9995582591043aa6ae7e100",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/jproc.2020.2977054",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Embodied self-aware computing systems are embedded in a physical environment with a rich set of sensors and actuators to interact both with their environment and with their own embodiment. Through this interaction, they learn about their situation, their own state, and their performance. Although they are application specific like traditional embedded systems (ESs), they are significantly more flexible, robust, and autonomous; they can adapt to a wide range of environmental variation and can cope with deterioration and shortcomings of their own performance. As such, embodied self-aware computing systems are an evolution of traditional embedded and cyber–physical systems into the direction of more autonomy, robustness, and flexibility. When traditional ESs operate in a changing world by demanding unchanging and fully characterized computing resources, embodied self-aware computing systems adapt to a changing world and changing computing resources. This article surveys the methods and methodologies used for embodied self-aware computing systems structured along with the faculties of: 1) sensory observation and abstraction; 2) self-aware assessment; and 3) hierarchical goals and control. The discussion is exemplified by application cases in the areas of systems-on-chip, control systems, health monitoring, and condition monitoring in industrial production systems.",
    "citationCount": 11,
    "referenceCount": 105
}