{
    "paperId": "b11c2b51ba189c2d1c0a64afaebd3469d47c7800",
    "title": "Distributed Data Deduplication for Big Data: A Survey",
    "year": 2025,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Yinjin Fu",
        "Jun Su",
        "Jiahao Ning",
        "Jian Wu",
        "Yutong Lu",
        "Nong Xiao"
    ],
    "doi": "10.1145/3735508",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b11c2b51ba189c2d1c0a64afaebd3469d47c7800",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To address the throughput and capacity limitations of single-node centralized deduplication, distributed data deduplication has become a popular technology in big data management to save more storage space, enhance I/O performance, and improve system scalability. It includes inter-node data assignment from clients to multiple deduplication nodes by a data routing scheme, and independent intra-node redundancy suppression in individual nodes. In this paper, we first describe the background of big data deduplication. Then we summarize and classify the state-of-the-art in the key techniques of distributed data deduplication, including data partitioning, chunk fingerprinting, data routing, index lookup, data restoring, garbage collection, the security and reliability of deduplicated data. These help identify and understand the system implementation of the existing distributed data deduplication methods. Moreover, we present some representative industrial products that have successfully applied distributed data deduplication technologies. Finally, we discuss the main challenges and industry trend of distributed data deduplication, and outline the open problems and its future research directions.",
    "citationCount": 2,
    "referenceCount": 171
}