{
    "paperId": "b1449c3526f43b72b51d362441e8f272ade1afe3",
    "title": "Deep-Learning-based Fault Detection and Location Method Applied on Isolated Dc-Dc Converter",
    "year": 2023,
    "venue": "Applied Power Electronics Conference",
    "authors": [
        "A. A. Gandomi",
        "M. Kargar",
        "Saeed Kargar",
        "L. Parsa",
        "K. Corzine"
    ],
    "doi": "10.1109/APEC43580.2023.10131570",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b1449c3526f43b72b51d362441e8f272ade1afe3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fast-switching power semiconductors have a higher chance of failure than passive components and there is a need to detect and locate these failures to have higher reliability in the shipboard applications. In this work, a deep-learning based fault detection and location method is proposed for open-circuit failure of the switches in a 5-level dual-active dc-dc converter. The data driven recursive discrete Fourier transform based feature vectors corresponding to repetitive primary voltage can be extracted and stored in the DSP during the training phase of the algorithm for normal operation or any type of failure. Once the statistical database is populated with those features, to increase the performance of the deep learning model, standardization, normalization, and dimensionality reduction methods are applied in the preprocessing stage. Due to the higher fundamental frequency of this converter, the model needs to have lower latency as well as higher accuracy. Therefore, it is desired to have a simplest model that meets the requirements. The detailed analysis is done on different harmonics orders of the primary voltage to have their importance in this analysis to improve the model. The method is demonstrated using experimental and simulation data.",
    "citationCount": 1,
    "referenceCount": 35
}