{
    "paperId": "b185dc4cfd1e26058132e5b16733cb75e01cc15e",
    "title": "MgNet: A unified framework of multigrid and convolutional neural network",
    "year": 2019,
    "venue": "Science China Mathematics",
    "authors": [
        "Juncai He",
        "Jinchao Xu"
    ],
    "doi": "10.1007/s11425-019-9547-2",
    "arxivId": "1901.10415",
    "url": "https://www.semanticscholar.org/paper/b185dc4cfd1e26058132e5b16733cb75e01cc15e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1901.10415",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We develop a unified model, known as MgNet, that simultaneously recovers some convolutional neural networks (CNN) for image classification and multigrid (MG) methods for solving discretized partial differential equations (PDEs). This model is based on close connections that we have observed and uncovered between the CNN and MG methodologies. For example, pooling operation and feature extraction in CNN correspond directly to restriction operation and iterative smoothers in MG, respectively. As the solution space is often the dual of the data space in PDEs, the analogous concept of feature space and data space (which are dual to each other) is introduced in CNN. With such connections and new concept in the unified model, the function of various convolution operations and pooling used in CNN can be better understood. As a result, modified CNN models (with fewer weights and hyperparameters) are developed that exhibit competitive and sometimes better performance in comparison with existing CNN models when applied to both CIFAR-10 and CIFAR-100 data sets.",
    "citationCount": 60,
    "referenceCount": 59
}