{
    "paperId": "b1942ce913f61ae1f37a0b23b35368a627963635",
    "title": "An Approach to Map Visibility in the Built Environment From Airborne LiDAR Point Clouds",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "Guanting Zhang",
        "E. Verbree",
        "Xiao‐Jun Wang"
    ],
    "doi": "10.1109/ACCESS.2021.3066649",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b1942ce913f61ae1f37a0b23b35368a627963635",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9312710/09380239.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sustainable development can only be achieved with an innovative improvement from the way we currently analyze, design, build and manage our urban spaces. Current digital analysis and design methods for cities, such as visibility analysis, deeply rely on mapping and modeling techniques. However, most methods fall short of depicting the real visual landscape in the urban realm and this could bring a significant error in visibility calculations which may lead to an improper decision for urban spaces. The technical development of light detection and ranging(LiDAR) technology introduces new approaches for urban study. LiDAR utilizes point clouds including thousands or even millions of georeferenced points, and thus can support 3-D digital representation of urban landscape with detailed information and high resolution. Besides the superiority in representing urban landscape, LiDAR point clouds also has a clear advantage in quantitative analysis and provides better visibility than traditional models. In this paper, we first introduced a novel approach to map visibility in the urban built environment involving vegetation data directly using airborne LiDAR point clouds. This approach calculates neighborhood statistics for occlusion detection. Then we presented 2 case with different scenarios showing how our approach can be used to obtain a precise visibility in an urban area in the Netherlands. At last, we discussed how point clouds based visibility models can be further explored and can better assist urban design.",
    "citationCount": 6,
    "referenceCount": 34
}