{
    "paperId": "b1a53f1353d0aabad7b8b2e2d78b9948e60a3270",
    "title": "DARTH: Declarative Recall Through Early Termination for Approximate Nearest Neighbor Search",
    "year": 2025,
    "venue": "Proceedings of the ACM on Management of Data",
    "authors": [
        "Manos Chatzakis",
        "Y. Papakonstantinou",
        "Themis Palpanas"
    ],
    "doi": "10.1145/3749160",
    "arxivId": "2505.19001",
    "url": "https://www.semanticscholar.org/paper/b1a53f1353d0aabad7b8b2e2d78b9948e60a3270",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Approximate Nearest Neighbor Search (ANNS) presents an inherent tradeoff between performance and recall (i.e., result quality). Each ANNS algorithm provides its own algorithm-dependent parameters to allow applications to influence the recall/performance tradeoff of their searches. This situation is doubly problematic. First, the application developers have to experiment with these algorithm-dependent parameters to fine-tune the parameters that produce the desired recall for each use case. This process usually takes a lot of effort. Even worse, the chosen parameters may produce good recall for some queries, but bad recall for hard queries. To solve these problems, we present DARTH, a method that uses target declarative recall. DARTH uses a novel method for providing target declarative recall on top of an ANNS index by employing an adaptive early termination strategy integrated into the search algorithm. Through a wide range of experiments, we demonstrate that DARTH effectively meets user-defined recall targets while achieving significant speedups, up to 14.6x (average: 6.8x; median: 5.7x) faster than the search without early termination for HNSW and up to 41.8x (average: 13.6x; median: 8.1x) for IVF.",
    "citationCount": 0,
    "referenceCount": 98
}