{
    "paperId": "b1f0b0dcc69f61b89c53b473a2585d2566c16d21",
    "title": "Accelerating Entity Lookups in Knowledge Graphs Through Embeddings",
    "year": 2022,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Ghadeer Abuoda",
        "Saravanan Thirumuruganathan",
        "Ashraf Aboulnaga"
    ],
    "doi": "10.1109/icde53745.2022.00088",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b1f0b0dcc69f61b89c53b473a2585d2566c16d21",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tabular data is widespread on the web and in enterprise data lakes. Recently, there has been increasing interest in developing algorithms for matching tabular data with knowledge graphs. This involves learning correspondences between tabular entities such as cells, rows, and columns and entities in the knowledge graph. Such semantic annotation of tabular entities has numerous applications such as entity disambiguation, knowledge graph expansion, error detection and repair in tabular data, and more. A key first step for all these applications is the lookup function that matches a query string to a candidate set of knowledge graph entities. Despite the importance of entity lookup, current implementations are not optimized, not robust to misspellings, and ignore semantic relationships. To address these problems, we represent each entity as an embedding - a compact vector representation that is cognizant of syntactic and semantic similarities and supports fast lookup. We propose, EMBLOOKUP, a novel and efficient approach for learning such an embedding. EMBLOOKUP is based on deep metric learning with triplet loss and supports accurate and efficient lookup of knowledge graph entities. We conduct extensive experiments that demonstrate that EMBLOOKUP achieves 1–2 orders of magnitude speedup while being tolerant to many types of errors in the query and data. We demonstrate the generality of EMBLOOKUP over diverse application scenarios in semantic table annotation, entity disambiguation, and data repair.",
    "citationCount": 3,
    "referenceCount": 29
}