{
    "paperId": "b1f081a4746c7a70eba796300528d69967eac2db",
    "title": "BlockMEDC: Blockchain Smart Contracts System for Securing Moroccan Higher Education Digital Certificates",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Mohamed Fartitchou",
        "Ismail Lamaakal",
        "K. Makkaoui",
        "Z. E. Allali",
        "Yassine Maleh"
    ],
    "doi": "10.1109/ACCESS.2025.3546177",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b1f081a4746c7a70eba796300528d69967eac2db",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2025.3546177",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Morocco’s Vision 2030, known as Maroc Digital 2030, aims to position the kingdom as a regional leader in digital technology by boosting digital infrastructure, fostering innovation, and advancing digital skills. Complementing this initiative, the Pacte ESRI 2030 strategy, launched in 2023, seeks to transform the higher education, research, and innovation sectors by integrating state-of-the-art digital technologies. In alignment with these national strategies, this paper introduces BlockMEDC, a blockchain-based system for securing and managing Moroccan educational digital certificates. Leveraging Ethereum Layer 2 (zk-Rollups) smart contracts and the InterPlanetary File System, BlockMEDC automates the issuance, management, and verification of academic credentials across Moroccan universities. The proposed system addresses key issues such as document authenticity, manual verification, and lack of interoperability, delivering a secure, transparent, and significantly low-cost solution that aligns with Morocco’s digital transformation goals for the education sector.",
    "citationCount": 4,
    "referenceCount": 69
}