{
    "paperId": "b1f32ef0aa321728d1f6e506943a27ddae5829c2",
    "title": "Semantic IDs for Joint Generative Search and Recommendation",
    "year": 2025,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Gustavo Penha",
        "Edoardo D'Amico",
        "Marco De Nadai",
        "Enrico Palumbo",
        "Alexandre Tamborrino",
        "Ali Vardasbi",
        "Max Lefarov",
        "Shawn Lin",
        "T. Heath",
        "Francesco Fabbri",
        "Hugues Bouchard"
    ],
    "doi": "10.1145/3705328.3759300",
    "arxivId": "2508.10478",
    "url": "https://www.semanticscholar.org/paper/b1f32ef0aa321728d1f6e506943a27ddae5829c2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative models powered by Large Language Models (LLMs) are emerging as a unified solution for powering both recommendation and search tasks. A key design choice in these models is how to represent items, traditionally through unique identifiers (IDs) and more recently with Semantic IDs composed of discrete codes, obtained from embeddings. While task-specific embedding models can improve performance for individual tasks, they may not generalize well in a joint setting. In this paper, we explore how to construct Semantic IDs that perform well both in search and recommendation when using a unified model. We compare a range of strategies to construct Semantic IDs, looking into task-specific and cross-tasks approaches, and also whether each task should have its own semantic ID tokens in a joint search and recommendation generative model. Our results show that using a bi-encoder model fine-tuned on both search and recommendation tasks to obtain item embeddings, followed by the construction of a unified Semantic ID space provides an effective trade-off, enabling strong performance in both tasks. We hope these findings spark follow-up work on generalisable, semantically grounded ID schemes and inform the next wave of unified generative recommender architectures.",
    "citationCount": 0,
    "referenceCount": 26
}