{
    "paperId": "b2519ac967ce0ee0393f43a43e39d125e8473434",
    "title": "Modern Minimal Perfect Hashing: A Survey",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Hans-Peter Lehmann",
        "Thomas Mueller",
        "R. Pagh",
        "Giulio Ermanno Pibiri",
        "Peter Sanders",
        "S. Vigna",
        "Stefan Walzer"
    ],
    "doi": "10.48550/arXiv.2506.06536",
    "arxivId": "2506.06536",
    "url": "https://www.semanticscholar.org/paper/b2519ac967ce0ee0393f43a43e39d125e8473434",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Given a set $S$ of $n$ keys, a perfect hash function for $S$ maps the keys in $S$ to the first $m \\geq n$ integers without collisions. It may return an arbitrary result for any key not in $S$ and is called minimal if $m = n$. The most important parameters are its space consumption, construction time, and query time. Years of research now enable modern perfect hash functions to be extremely fast to query, very space-efficient, and scale to billions of keys. Different approaches give different trade-offs between these aspects. For example, the smallest constructions get within 0.1% of the space lower bound of $\\log_2(e)$ bits per key. Others are particularly fast to query, requiring only one memory access. Perfect hashing has many applications, for example to avoid collision resolution in static hash tables, and is used in databases, bioinformatics, and stringology. Since the last comprehensive survey in 1997, significant progress has been made. This survey covers the latest developments and provides a starting point for getting familiar with the topic. Additionally, our extensive experimental evaluation can serve as a guide to select a perfect hash function for use in applications.",
    "citationCount": 5,
    "referenceCount": 164
}