{
    "paperId": "b2a8b21062718f930dbb1662a93ae1f13298fa1f",
    "title": "Serenity: Library Based Python Code Analysis for Code Completion and Automated Machine Learning",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Wenting Zhao",
        "I. Abdelaziz",
        "Julian Dolby",
        "Kavitha Srinivas",
        "M. Helali",
        "Essam Mansour"
    ],
    "doi": "10.48550/arXiv.2301.05108",
    "arxivId": "2301.05108",
    "url": "https://www.semanticscholar.org/paper/b2a8b21062718f930dbb1662a93ae1f13298fa1f",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2301.05108",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dynamically typed languages such as Python have become very popular 1 . Among other strengths, Python’s dynamic nature and its straightforward linking to native code have made it the de-facto language for many research areas such as Artificial Intelligence. This flexibility, however, makes static analysis very hard. While creating a sound, or a soundy, analysis for Python remains an open problem, we present in this work Serenity, a framework for static analysis of Python that turns out to be sufficient for some tasks. The Serenity framework exploits two basic mechanisms: (a) reliance on dynamic dispatch at the core of language translation, and (b) extreme abstraction of libraries, to generate an abstraction of the code. We demonstrate the efficiency and usefulness of Serenity’s analysis in two applications: code completion and automated machine learning. In these two applications, we demonstrate that such analysis has a strong signal, and can be leveraged to establish state-of-the-art performance, comparable to neural models and dynamic analysis respectively.",
    "citationCount": 0,
    "referenceCount": 42
}