{
    "paperId": "b2f3ea5565e2697ac9496d30e1a7e28df5ff538f",
    "title": "Using Range-Revocable Pseudonyms to Provide Backward Unlinkability in the Edge",
    "year": 2023,
    "venue": "Conference on Computer and Communications Security",
    "authors": [
        "Cláudio Correia",
        "M. Correia",
        "Luís Rodrigues"
    ],
    "doi": "10.1145/3576915.3623111",
    "arxivId": "2308.03402",
    "url": "https://www.semanticscholar.org/paper/b2f3ea5565e2697ac9496d30e1a7e28df5ff538f",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3576915.3623111",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper we propose a novel abstraction that we have named Range-Revocable Pseudonyms (RRPs). RRPs are a new class of pseudonyms whose validity can be revoked for any time-range within its original validity period. The key feature of RRPs is that the information provided to revoke a pseudonym for a given time-range cannot be linked with the information provided when using the pseudonym outside the revoked range. We provide an algorithm to implement RRPs using efficient cryptographic primitives where the space complexity of the pseudonym is constant, regardless of the granularity of the revocation range, and the space complexity of the revocation information only grows logarithmically with the granularity; this makes the use of RRPs far more efficient than the use of many short-lived pseudonyms. We have used RRPs to design EDGAR, an access control system for VANET scenarios that offers backward unlinkability. The experimental evaluation of EDGAR shows that, when using RRPs, the revocation can be performed efficiently (even when using time slots as small as 1 second) and that users can authenticate with low latency (0.5-3.5ms ).",
    "citationCount": 3,
    "referenceCount": 117
}