{
    "paperId": "b2f729eb246dd01013cc05f75d168c44d3601bde",
    "title": "Anonymized Network Sensing Graph Challenge",
    "year": 2024,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Hayden Jananthan",
        "Michael Jones",
        "W. Arcand",
        "David Bestor",
        "William Bergeron",
        "Daniel J. Burrill",
        "A. Buluç",
        "C. Byun",
        "Tim Davis",
        "V. Gadepally",
        "Daniel Grant",
        "Michael Houle",
        "M. Hubbell",
        "Piotr Luszczek",
        "P. Michaleas",
        "Lauren Milechin",
        "Chasen Milner",
        "Guillermo Morales",
        "Andrew Morris",
        "J. Mullen",
        "Ritesh Patel",
        "A. Pentland",
        "Sandeep Pisharody",
        "Andrew Prout",
        "A. Reuther",
        "Antonio Rosa",
        "Gabriel Wachman",
        "Charles Yee",
        "J. Kepner"
    ],
    "doi": "10.1109/HPEC62836.2024.10938508",
    "arxivId": "2409.08115",
    "url": "https://www.semanticscholar.org/paper/b2f729eb246dd01013cc05f75d168c44d3601bde",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The MIT/IEEE/Amazon GraphChallenge encourages community approaches to developing new solutions for analyzing graphs and sparse data derived from social media, sensor feeds, and scientific data to discover relationships between events as they unfold in the field. The anonymized network sensing Graph Challenge seeks to enable large, open, community-based approaches to protecting networks. Many large-scale networking problems can only be solved with community access to very broad data sets with the highest regard for privacy and strong community buy-in. Such approaches often require community-based data sharing. In the broader networking community (commercial, federal, and academia) anonymized source-to-destination traffic matrices with standard data sharing agreements have emerged as a data product that can meet many of these requirements. This challenge provides an opportunity to highlight novel approaches for optimizing the construction and analysis of anonymized traffic matrices using over 100 billion network packets derived from the largest Internet telescope in the world (CAIDA). This challenge specifies the anonymization, construction, and analysis of these traffic matrices. A GraphBLAS reference implementation is provided, but the use of GraphBLAS is not required in this Graph Challenge. As with prior Graph Challenges the goal is to provide a well-defined context for demonstrating innovation. Graph Challenge participants are free to select (with accompanying explanation) the Graph Challenge elements that are appropriate for highlighting their innovations.",
    "citationCount": 10,
    "referenceCount": 90
}