{
    "paperId": "b341d8c655098b8c623ee46f5637973b99685370",
    "title": "The Hopsworks Feature Store for Machine Learning",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Javier de la Rúa Martínez",
        "Fabio Buso",
        "Antonios Kouzoupis",
        "Alexandru A. Ormenisan",
        "Salman Niazi",
        "D. Bzhalava",
        "Kenneth Mak",
        "Victor Jouffrey",
        "Mikael Ronström",
        "Raymond Cunningham",
        "Ralfs Zangis",
        "Dhananjay Mukhedkar",
        "Ayushman Khazanchi",
        "Vladimir Vlassov",
        "Jim Dowling"
    ],
    "doi": "10.1145/3626246.3653389",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b341d8c655098b8c623ee46f5637973b99685370",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data management is the most challenging aspect of building Machine Learning (ML) systems. ML systems can read large volumes of historical data when training models, but inference workloads are more varied, depending on whether it is a batch or online ML system. The feature store for ML has recently emerged as a single data platform for managing ML data throughout the ML lifecycle, from feature engineering to model training to inference. In this paper, we present the Hopsworks feature store for machine learning as a highly available platform for managing feature data with API support for columnar, row-oriented, and similarity search query workloads. We introduce and address challenges solved by the feature stores related to feature reuse, how to organize data transformations, and how to ensure correct and consistent data between feature engineering, model training, and model inference. We present the engineering challenges in building high-performance query services for a feature store and show how Hopsworks outperforms existing cloud feature stores for training and online inference query workloads.",
    "citationCount": 2,
    "referenceCount": 40
}