{
    "paperId": "b3427585b57969420ac54602be3b281ee1c61e23",
    "title": "Metahuman systems = humans + machines that learn",
    "year": 2020,
    "venue": "Journal of Information and Technology",
    "authors": [
        "K. Lyytinen",
        "J. Nickerson",
        "J. King"
    ],
    "doi": "10.1177/0268396220915917",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b3427585b57969420ac54602be3b281ee1c61e23",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Metahuman systems are new, emergent, sociotechnical systems where machines that learn join human learning and create original systemic capabilities. Metahuman systems will change many facets of the way we think about organizations and work. They will push information systems research in new directions that may involve a revision of the field’s research goals, methods and theorizing. Information systems researchers can look beyond the capabilities and constraints of human learning toward hybrid human/machine learning systems that exhibit major differences in scale, scope and speed. We review how these changes influence organization design and goals. We identify four organizational level generic functions critical to organize metahuman systems properly: delegating, monitoring, cultivating, and reflecting. We show how each function raises new research questions for the field. We conclude by noting that improved understanding of metahuman systems will primarily come from learning-by-doing as information systems scholars try out new forms of hybrid learning in multiple settings to generate novel, generalizable, impactful designs. Such trials will result in improved understanding of metahuman systems. This need for large-scale experimentation will push many scholars out from their comfort zone, because it calls for the revitalization of action research programs that informed the first wave of socio-technical research at the dawn of automating work systems.",
    "citationCount": 101,
    "referenceCount": 200
}