{
    "paperId": "b343d8afd6b77a9ceb2a71ca5c8c7a93bbbc070e",
    "title": "Improving Write Performance for LSM-tree-based Key-Value Stores with NV-Cache",
    "year": 2022,
    "venue": "2022 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)",
    "authors": [
        "Xuzhen Jiang",
        "Miao Cai",
        "Baoliu Ye"
    ],
    "doi": "10.1109/ISPA-BDCloud-SocialCom-SustainCom57177.2022.00057",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b343d8afd6b77a9ceb2a71ca5c8c7a93bbbc070e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Log Structured Merge tree (LSM-tree) is widely used in modern key-value stores due to its superior write performance. However, current LSM-tree-based key-value stores suffer from two performance issues: (1) write stall caused by speed gap between fast DRAM and slow storage devices; (2) write amplification incurred by existing LSM-tree compaction. This paper proposes NV-Cache, a write-optimized non-volatile cache for LSM-tree-based key-value stores. We design a split LSM-tree over a hybrid storage hierarchy consisting of fast Non-Volatile Memory (NVM) and slow solid state drive (SSD). It promotes frequently-accessed, high LSM-tree levels onto fast NVM and offloads cold, large LSM-tree levels into the slow storage device. Further, we propose a range of techniques, including unsorted LSM-tree node layout, lightweight MemTable flush, write-optimal list compaction, and LRU-based NV-Cache eviction, to extensively optimize the write path. NV-Cache closes the performance gap between fast DRAM and slow storage devices to prevent the write stall and reduce write amplification. We implement NV-Cache based on Google LevelDB and conduct a series of experiments using db_bench and YCSB workloads. Experiment results suggest that NV-Cache effectively prevents write stall, achieves 2.3× write reduction, and performs 54% better than LeveIDB., NoveLSM., and MatrixKV.",
    "citationCount": 2,
    "referenceCount": 31
}