{
    "paperId": "b3dc93162273b48262759e4cfad7974a9968067e",
    "title": "Optical comb enabled flexible-bandwidth single-carrier frequency-division-multiplexed-based intra-data centre interconnect",
    "year": 2018,
    "venue": "IET Communications",
    "authors": [
        "Qian Kong",
        "Y. Zhan",
        "Chaowei Duan"
    ],
    "doi": "10.1049/iet-com.2018.5061",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b3dc93162273b48262759e4cfad7974a9968067e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1049/iet-com.2018.5061",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this study, the authors propose a novel intra-data centre network (DCN) architecture based on cascaded micro-electro-mechanical system switches for dynamic DCN connectivity provisioning. Through combining the single-carrier frequency-division-multiplexed with the proposed architecture, this structure can achieve unprecedented flexibility in dealing with both mice and elephant flow in the DCN. Multiple-input multiple-output switching is experimentally demonstrated through intra- and inter-data centre switching scenarios. A numerical investigation is also performed to evaluate the performance of the fixed-grid transceivers, flex-grid transceivers and mixed-fixed/flex grid transceivers in the same switching scenario. The results show that the flex-grid transceivers significantly reduced the service latency and blocking probability compared to the fixed-grid transceivers. The proposed architecture would be better applied in the field of all-optical DCNs.",
    "citationCount": 1,
    "referenceCount": 22
}