{
    "paperId": "b409e82203a04b859786ee7c358ee636bc14ec35",
    "title": "Multiple Lignocellulosic Inhibitor-Tolerant Saccharomyces cerevisiae Strains Developed by Evolutionary Engineering and CRISPR/Cas9 Gene Editing Technology.",
    "year": 2025,
    "venue": "Journal of Agricultural and Food Chemistry",
    "authors": [
        "Guangyu Chen",
        "Yule Shan",
        "Jiao Wang",
        "Qingyan Zhang",
        "Lan Yao",
        "Xiong Chen"
    ],
    "doi": "10.1021/acs.jafc.5c04039",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b409e82203a04b859786ee7c358ee636bc14ec35",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Through evolutionary engineering strategies, scientists have successfully cultivated multiple strains of Saccharomyces cerevisiae with enhanced tolerance, demonstrating significant potential in improving S. cerevisiae resistance. In this study, S. cerevisiae CEN.PK113-7D was continuously cultured for 80 days in a medium containing lignocellulosic inhibitors (furfural, acetic acid, and vanillin). The evolved strain, S. cerevisiae CEN.PK113-AL80-4, exhibited 12 h reduction in lag phase under multiple stress conditions and 17% increase in the ethanol conversion rate. The double mutant strain RG was constructed by mutating genes such as Rad18 and Gcn1 using CRISPR/Cas9 gene editing technology. Under the stress of 2 g/L furfural, 3 g/L acetic acid, and 1.5 g/L vanillin, ethanol yield reached 5.88 ± 0.28 g/L (the conversion rate was 0.29 ± 0.01 g/g). However, the original strain cannot grow. Mechanism studies have shown that Rad18 and Gcn1 significantly enhance stress tolerance by increasing the activities of catalase (CAT) (75%) and superoxide dismutase (SOD) (27.6%), increasing intracellular glycerol content, and strengthening carbon metabolism and oxidative stress responses. This study lays a solid theoretical foundation for developing more robust strains and advancing efficient utilization of lignocellulosic biomass.",
    "citationCount": 0,
    "referenceCount": 60
}