{
    "paperId": "b44c27055ac9f69dc693effa1edf6924460fa5d2",
    "title": "Parallelism or Fairness? How to Be Friendly for SSDs in Cloud Environments",
    "year": 2024,
    "venue": "IEEE International Conference on Cluster Computing",
    "authors": [
        "Yangqing Zhou",
        "Fang Wang",
        "Zhan Shi",
        "Dan Feng"
    ],
    "doi": "10.1109/CLUSTER59578.2024.00023",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b44c27055ac9f69dc693effa1edf6924460fa5d2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern SSDs achieve low latency and high throughput by utilizing multiple levels of SSD parallelism. Fairness is also a critical design consideration in cloud environments and has inspired great interest in recent years to study it. However, we find that excessive striving for SSD parallelism can inadvertently harm the SSD fairness due to the striped data layout. We observe from our experimental analysis that some common access patterns in cloud loads (e.g., high-intensity I/O) are not addressed by SSD parallelism, which can affect both SSD parallelism and fairness. In this paper, we analyze two address mapping policies with orthogonal characteristics from SSD parallelism and fairness perspectives. Based on extensive experiments and observations, we schedule a hybrid address mapping policy to achieve fairness of SSDs in cloud environments by distinguishing different I/O access modes and cold/hot data, while ensuring SSD performance. Experimental results on the latest block-level I/O traces show that our approach significantly improves performance and fairness by up to 77.3% and 62.8%, respectively, over the previous schemes with negligible cost. Meanwhile, it can also reduce the write amplification by 23.5% to 33.5%.",
    "citationCount": 0,
    "referenceCount": 24
}