{
    "paperId": "b4516bf2a2260c038b33b8526b97d33c602565c8",
    "title": "Neuro-Symbolic AI-Driven Data Warehouses: Self-Learning Architectures for Dynamic Schema Evolution and Adaptive Query Optimization",
    "year": 2025,
    "venue": "2025 International Conference on Metaverse and Current Trends in Computing (ICMCTC)",
    "authors": [
        "Dharmajee Rao Professor",
        "Md Afzal",
        "Ch Vidyadhari",
        "Shilpa Sargari",
        "Mrs. R. Barathy",
        "Dr. A.S.ANAKATH"
    ],
    "doi": "10.1109/ICMCTC62214.2025.11196455",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b4516bf2a2260c038b33b8526b97d33c602565c8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A developing solution that combines the vision of having an AI-empowered data warehouse that can learn to develop new schema and to self-optimize queries for a dynamic data ecosystem, is in the form of a neuro-symbolic AI, or, to put it more simply, learning about data schema, and learning, adjusting, and tuning query optimization. Rigid schema structures, slow query refinement, and effectuation in data warehousing of data from different sources are the tedious issues of traditional data warehouses. Based on the studied requirement, the paper proposes an intelligent system called Neuro-Semantic AI Data Warehouse (NSAI-DW), which is a hybrid AI system that automatically evolves schemas and optimizes query execution using deep learning, symbolic reasoning, and reinforcement learning. The fixed framework monitors data ingested patterns over time, while newly emerging business needs can execute rewrites to schemas, and uses reinforcement learning to obtain optimal query plans dynamically. The overall approach combines structured and unstructured data by integrating them into a semantic knowledge graph that improves data interoperability. Its further acceleration of query processing is done by reducing computational complexity through quantum-inspired tensor networks. Results of experiments show that NSAI-DW is orders of magnitude more efficient for queries, as well as schema adaptability and scalability, than conventional data warehouses. It is particularly suitable for real-time applications in finance, healthcare, and Smart IoT-enabled environments. The self-learning capability of the system reduces manual intervention. This research contributes to the field of AI and data warehousing as an advanced and autonomous solution for dealing with the ever-evolving data landscape in a robust, scalable, and available way. The work future will be looked into regarding improvements using federated learning and edge AI for distributed intelligence.",
    "citationCount": 0,
    "referenceCount": 17
}