{
    "paperId": "b45146cb2b2908656a46576431d6ed94fa3cd0ac",
    "title": "Unlocking Access to Healthcare: Evaluating the Efficacy of AI-Driven Diagnosis in a Mobile Application",
    "year": 2024,
    "venue": "Advanced Natural Language Processing",
    "authors": [
        "Mylyn Zheng",
        "Adam Grant"
    ],
    "doi": "10.5121/csit.2024.141025",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b45146cb2b2908656a46576431d6ed94fa3cd0ac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In today's fast-paced world, accessing quality healthcare can often feel like an uphill battle. Whether hindered by geographical barriers, long waiting times, or financial constraints, many individuals struggle to receive timely diagnoses for their health concerns. Recognizing this pressing need, we've developed an innovative solution in the form of our cutting-edge app[7].Harnessing the power of artificial intelligence, our app offers users a seamless pathway to diagnosis based on their reported symptoms. Our journey began with meticulous research to identify the most reliable AI technology, leading us to integrate ChatGPT, a state-of-the-art Large Language Model renowned for its ability to mimic professional medical responses accurately [8]. To ensure seamless functionality, we complemented this AI prowess with a robust Firebase database, facilitating efficient data storage and retrieval [9].Following rigorous development and testing phases, we're thrilled to announce that our app delivers unparalleled accuracy in diagnosis. Our trials revealed an impressive average accuracy rating of 1.8 out of 2 for common illnesses, underscoring the reliability and efficacy of our diagnostic algorithms. While initial evaluations highlighted room for improvement in symptom diversity across a spectrum of 21 illnesses, our focus on refining the app's capabilities for prevalent conditions has yielded remarkable results.Ultimately, our app stands as a beacon of accessibility in the realm of basic healthcare. By bridging the gap between individuals and vital medical expertise, we're empowering users to take proactive control of their well-being, irrespective of their circumstances. With our unwavering commitment to innovation and excellence, we're proud to revolutionize healthcare delivery and make a meaningful difference in people's lives.",
    "citationCount": 0,
    "referenceCount": 14
}