{
    "paperId": "b4cf16a2d72a7aa000e6262b68a7dbdcd36e3b1c",
    "title": "Transitional Care from Hospital to Cardiac Rehabilitation During COVID-19: The Perspectives of Older Adults and Their Healthcare Providers",
    "year": 2023,
    "venue": "Journal of Patient Experience",
    "authors": [
        "Cecilia Flores-Sandoval",
        "J. Orange",
        "Bridget L Ryan",
        "Tracey L Adams",
        "N. Suskin",
        "Robert McKelvie",
        "Jacobi Elliott",
        "Shannon L. Sibbald"
    ],
    "doi": "10.1177/23743735231213757",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b4cf16a2d72a7aa000e6262b68a7dbdcd36e3b1c",
    "isOpenAccess": true,
    "openAccessPdf": "https://journals.sagepub.com/doi/pdf/10.1177/23743735231213757",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Transitional care to cardiac rehabilitation during the pandemic was a complex process for older adults, with additional challenges for decision-making and participation. This study aimed to explore the perspectives of older adults and health providers on transitional care from the hospital to cardiac rehabilitation, focusing on patient participation in decision-making. A qualitative exploratory design was used. Semi-structured interviews were conducted with 15 older adults and 6 healthcare providers. Document analysis and reflexive journaling were used to support triangulation of findings. Six themes emerged from the data, related to insufficient follow-up from providers, the importance of patients’ emotional and psychological health and the support provided by family members, the need for information tailored to patients’ needs and spaces for participation in decision-making, as well as challenges during COVID-19, including delayed medical procedures, rushed discharge and isolating hospital stays. The findings of this study indicated a number of potential gaps in the provision of transitional care services as reported by older adults who had a cardiovascular event, often during the first few weeks post hospital discharge.",
    "citationCount": 0,
    "referenceCount": 37
}