{
    "paperId": "b4cf663bfda8a9f439c45678433549cfa1fff3b8",
    "title": "Impact of Segmentation and Popularity-based Cache Replacement Policies on Named Data Networking",
    "year": 2024,
    "venue": "Jurnal Rekayasa Elektrika",
    "authors": [
        "R. Negara",
        "Novan Purba Wasesa",
        "Zaid Muhammad",
        "Ratna Mayasari",
        "Sri Astuti"
    ],
    "doi": "10.17529/jre.v20i1.34309",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b4cf663bfda8a9f439c45678433549cfa1fff3b8",
    "isOpenAccess": true,
    "openAccessPdf": "https://jurnal.usk.ac.id/JRE/article/download/34309/20_1_5_35_42",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The data distribution mechanism of internet protocol (IP) technology is inefficient because it necessitates the user to await a response from the server.  Named data networking (NDN) is a cutting-edge technology being assessed for enhancing IP networks, primarily because it incorporates a data packet caching technique on every router. However, the effectiveness of this approach is highly dependent on the router's content capacity, thus requiring the use data replacement mechanism when the router capacity is full.  The least recently used (LRU) method is employed for cache replacement policy; yet, it is considered ineffective as it neglects the content's popularity. The LRU algorithm replaces the infrequently requested data, leading to inefficient caching of popular data when multiple users constantly request it.  To address this problem, we propose a segmented LRU (SLRU) replacement strategy that considers content popularity. The SLRU will evaluate both popular content and content that has previously been popular in two segment categories, namely the probationary and protected segments.  Icarus simulator was used to evaluate multiple comprehensive scenarios.  Our experimental results show that the SLRU obtains a better cache hit ratio (CHR) and able to minimize latency and link load compared to existing cache replacement policies such as First In, First Out (FIFO), LRU, and Climb.",
    "citationCount": 1,
    "referenceCount": 18
}