{
    "paperId": "b5051a78ce8aa54013b260b73a7db753cab2106a",
    "title": "LSM-OPD: Boosting Scan in LSM-Trees by Enabling Direct Computing on Compressed Data",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jianfeng Huang",
        "Ziyao Wang",
        "Lin Yuan",
        "Jiajie Wen",
        "Yihao Cao",
        "Dongjing Miao",
        "Yong Wang",
        "Jiahao Zhang"
    ],
    "doi": "10.48550/arXiv.2508.11862",
    "arxivId": "2508.11862",
    "url": "https://www.semanticscholar.org/paper/b5051a78ce8aa54013b260b73a7db753cab2106a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Scan-based operations, such as backstage compaction and value filtering, have emerged as the main bottleneck for LSM-Trees in supporting contemporary data-intensive applications. For slower external storage devices, such as HDD and SATA SSD, the scan performance is primarily limited by the I/O bandwidth (i.e., I/O bound) due to the substantial read/write amplifications in LSM-Trees. Recent adoption of high-performance storage devices, such as NVMe SSD, has transformed the main limitation to be compute-bound, emerging the impact of computational resource consumption caused by inefficient compactions and filtering. However, when the value size increases, the bottleneck for scan performance in fast devices gradually shifts towards the I/O bandwidth as well, and the overall throughput across all types of devices undergo a dramatic reduction. This paper addresses the core issues by proposing LSM-OPD, a Log-S tructured M erge-O rder- Preserving Dictionary encoding scheme that enables direct computing on compressed data within LSM-Trees. It first enables key-value-separated data flushing to disk in a densely encoded columnar layout, ideally with few bytes for a large string value (e.g., 1024 bytes), thereby significantly alleviating the frequent I/O requests caused by intensive scans. Then, it is capable of offloading the costly scan-based operations on large values, including compaction and value filtering, to lightweight dictionaries due to the order-preserving property. And SIMD-based vectorization can now be employed to maximize the evaluating performance on modern multi-core processors, further breaking the compute-bound limitations in LSM-trees. Extensive experiments demonstrate the superior efficiency of LSM-OPD in processing various workloads that involve intensive scan-based operations on diverse modern storage devices.",
    "citationCount": 0,
    "referenceCount": 29
}