{
    "paperId": "b50939e90a822ceb0772b4de24ab3064000f0b32",
    "title": "GSID: Generative Semantic Indexing for E-Commerce Product Understanding",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Haiyang Yang",
        "Qinye Xie",
        "Qingheng Zhang",
        "Liyu Chen",
        "Huike Zou",
        "Chengbao Lian",
        "Shuguang Han",
        "Fei Huang",
        "Jufeng Chen",
        "Bo Zheng"
    ],
    "doi": "10.48550/arXiv.2509.23860",
    "arxivId": "2509.23860",
    "url": "https://www.semanticscholar.org/paper/b50939e90a822ceb0772b4de24ab3064000f0b32",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Structured representation of product information is a major bottleneck for the efficiency of e-commerce platforms, especially in second-hand ecommerce platforms. Currently, most product information are organized based on manually curated product categories and attributes, which often fail to adequately cover long-tail products and do not align well with buyer preference. To address these problems, we propose \\textbf{G}enerative \\textbf{S}emantic \\textbf{I}n\\textbf{D}exings (GSID), a data-driven approach to generate product structured representations. GSID consists of two key components: (1) Pre-training on unstructured product metadata to learn in-domain semantic embeddings, and (2) Generating more effective semantic codes tailored for downstream product-centric applications. Extensive experiments are conducted to validate the effectiveness of GSID, and it has been successfully deployed on the real-world e-commerce platform, achieving promising results on product understanding and other downstream tasks.",
    "citationCount": 1,
    "referenceCount": 30
}