{
    "paperId": "b50b3584f4da94accd5571a973a909746608b9e9",
    "title": "Extending the Applicability of Bloom Filters by Relaxing their Parameter Constraints",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Paul Walther",
        "Wejdene Mansour",
        "Martin Werner"
    ],
    "doi": "10.48550/arXiv.2502.02193",
    "arxivId": "2502.02193",
    "url": "https://www.semanticscholar.org/paper/b50b3584f4da94accd5571a973a909746608b9e9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "These days, Key-Value Stores are widely used for scalable data storage. In this environment, Bloom filters serve as an efficient probabilistic data structure for the representation of sets of keys as they allow for set membership queries with controllable false positive rates and no false negatives. For optimal error rates, the right choice of the main parameters, namely the length of the Bloom filter array, the number of hash functions used to map an element to the array's indices, and the number of elements to be inserted in one filter, is crucial. However, these parameters are constrained: The number of hash functions is bounded to integer values, and the length of a Bloom filter is usually chosen to be a power-of-two to allow for efficient modulo operations using binary arithmetics. These modulo calculations are necessary to map from the output universe of the applied universal hash functions, like Murmur, to the set of indices of the Bloom filter. In this paper, we relax these constraints by proposing the Rational Bloom filter, which allows for non-integer numbers of hash functions. This results in optimized fraction-of-zero values for a known number of elements to be inserted. Based on this, we construct the Variably-Sized Block Bloom filters to allow for a flexible filter length, especially for large filters, while keeping computation efficient.",
    "citationCount": 0,
    "referenceCount": 29
}