{
    "paperId": "b538d93c3088ecac9e23efa04b4d1fe3f778b413",
    "title": "Packet Filtering and Sampling for Efficient Slow Denial of Service Detection in Resource Scarce IoT Networks",
    "year": 2023,
    "venue": "International Symposium on Networks, Computers and Communications",
    "authors": [
        "Andy Reed",
        "Laurence Dooley",
        "S. Mostéfaoui"
    ],
    "doi": "10.1109/ISNCC58260.2023.10323987",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b538d93c3088ecac9e23efa04b4d1fe3f778b413",
    "isOpenAccess": true,
    "openAccessPdf": "https://oro.open.ac.uk/92358/1/ISNCC2024_final.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There has recently been considerable interest in automatic detection strategies for recognising application layer security threats such as Hypertext Transfer Protocol (HTTP) Slow Denial of-Service (Slow DoS) attacks in Internet of Things (IoT) networks. Most existing approaches however, fail to take cognisance of the substantial resource constraints imposed upon IoT environments, which limits the applicability and deployment of many Slow DoS detection mechanisms. This paper addresses this significant security threat for resource scarce IoT nodes and networks in proposing an accurate and computationally efficient approach to packet-based intrusion detection of HTTP Slow DoS activity. The paper both critically analyses and measures the impact of applying network attribute filtering and packet sampling to reduce the computational overheads on the resource constrained IoT Slow DoS detection node. The unique solution proposed uses a dataset synthesised from a live IoT environment comprising both legitimate and malicious network events in the form of legitimate HTTP traffic and Slow DoS attacks. Experimental results corroborate that combining filtering at the Border Router of only in-bound packets containing no TCP payload with a systematic packet sampling scheme at a sampling ratio of up to 1:64, the processing overheads on the detection node are significantly reduced. The novel contribution presented is a resource efficient solution, garnered by employing systematic sampling to seamlessly and accurately support selective attribute-based intrusion detection of HTTP Slow DoS attacks in IoT networks.",
    "citationCount": 2,
    "referenceCount": 22
}