{
    "paperId": "b54e35b3d40cff019da35d91bf02426b9c03414d",
    "title": "Improvement of Message-Oriented Middleware (MOM) for the Surveillance Platform",
    "year": 2023,
    "venue": "International Joint Conference on Computer Science and Software Engineering",
    "authors": [
        "Seoulcha Ratmumad",
        "W. Suntiamorntut"
    ],
    "doi": "10.1109/JCSSE58229.2023.10202030",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b54e35b3d40cff019da35d91bf02426b9c03414d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud computing technology has become increasingly popular and has expanded the capabilities of closed-circuit television (CCTV) systems, especially with the emergence of applications that allow easy access to CCTV. Cloud computing and CCTV capabilities has led to the development of cloud-based video processing applications, including video processing for surveillance and security, which utilize artificial intelligence (AI) technology to detect events in surveillance cameras and convert them into user-friendly results. In order to improve the processing speed in surveillance platform and support future surveillance camera functionalities, this paper proposes an optimized cloud video processing pipeline that leverages Apache Kafka and Distributed File System (DFS) technologies. We conducted experiments by applying configuration parameters to the message-oriented middleware (MOM) task and compared our approach to existing research on our test machines. We used the Node.js framework to run data producers and consumers. The results demonstrate that our proposed concept can reduce latency and increase system throughput, with a throughput increase of 88.55% for SD resolution image and 190.75% for HD resolution image compared to existing research.",
    "citationCount": 0,
    "referenceCount": 16
}