{
    "paperId": "b569bb1dd8d9755dc9cc5e11967c595abbd84641",
    "title": "Stingy Sketch: A Sketch Framework for Accurate and Fast Frequency Estimation",
    "year": 2022,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Haoyu Li",
        "Qizhi Chen",
        "Yixin Zhang",
        "Tong Yang",
        "Bin Cui"
    ],
    "doi": "10.14778/3523210.3523220",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b569bb1dd8d9755dc9cc5e11967c595abbd84641",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Recording the frequency of items in highly skewed data streams is a fundamental and hot problem in recent years. The literature demonstrates that\n sketch\n is the most promising solution. The typical metrics to measure a sketch are accuracy and speed, but existing sketches make only trade-offs between the two dimensions. Our proposed solution is a new sketch framework called Stingy sketch with two key techniques: Bit-pinching Counter Tree (\n BCTree\n ) and Prophet Queue (\n PQueue\n ) which optimizes both the accuracy and speed. The key idea of\n BCTree\n is to split a large fixed-size counter into many small nodes of a tree structure, and to use a precise encoding to perform carry-in operations with low processing overhead. The key idea of\n PQueue\n is to use pipelined prefetch technique to make most memory accesses happen in L2 cache without losing precision. Importantly, the two techniques are cooperative so that Stingy sketch can improve accuracy and speed simultaneously. Extensive experimental results show that Stingy sketch is up to 50% more accurate than the SOTA of accuracy-oriented sketches and is up to 33% faster than the SOTA of speed-oriented sketches.\n",
    "citationCount": 44,
    "referenceCount": 52
}