{
    "paperId": "b57f4dd781c6512a8937074ef98646d55618533b",
    "title": "Mapping the AI Landscape in Food Science and Engineering: A Bibliometric Analysis Enhanced with Interactive Digital Tools and Company Case Studies",
    "year": 2025,
    "venue": "Food Engineering Reviews",
    "authors": [
        "Jordan Pennells",
        "Peter Watkins",
        "A. Bowler",
        "Nicholas J. Watson",
        "Kai Knoerzer"
    ],
    "doi": "10.1007/s12393-025-09413-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b57f4dd781c6512a8937074ef98646d55618533b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The proliferation of research on Artificial Intelligence (AI) in food science and engineering has made it increasingly difficult to synthesise relevant insights effectively. Although AI adoption in the food industry has grown, it lags behind sectors like finance and healthcare due to the complexity of food systems, including high process variability, risk aversion towards novel technologies, and constrained investment appetite. Historically, computational techniques and AI-adjacent technologies like expert systems and empirical modelling have supported food research and development for decades. More recently, AI applications have broadened to include process control, food safety, ingredient and product quality, sensory evaluation, traceability, and supply chain management. In response to the rapid increase in AI-related food science publications – particularly since 2019 – this review introduces tools for dynamically synthesising and exploring this evolving knowledge base. We present an interactive dashboard that integrates a curated dataset of food AI review articles with advanced bibliometric analyses, enabling user-driven exploration of research trends and thematic relationships. Additionally, we demonstrate the use of customised large language model (LLM) tools for targeted literature interrogation, enhancing accessibility for researchers and industry stakeholders. Complementing this academic synthesis, we profile selected industry case studies where AI plays a central role in ingredient discovery, product development, intelligent sorting, and sensory analytics. By combining interactive research tools with real-world case studies, this review offers a comprehensive snapshot of Food AI and begins to bridge the gap between academic research and industry implementation, providing a valuable resource for those seeking both domain-specific knowledge and actionable insights. Supplementary Information The online version contains supplementary material available at 10.1007/s12393-025-09413-w.",
    "citationCount": 0,
    "referenceCount": 78
}