{
    "paperId": "b5b9ed1e6d3cd2e51d155831cdfae39f2e0f4578",
    "title": "Synergy between Machine/Deep Learning and Software Engineering: How Far Are We?",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "Simin Wang",
        "LiGuo Huang",
        "Jidong Ge",
        "Tengfei Zhang",
        "Haitao Feng",
        "Ming Li",
        "He Zhang",
        "Vincent Ng"
    ],
    "doi": null,
    "arxivId": "2008.05515",
    "url": "https://www.semanticscholar.org/paper/b5b9ed1e6d3cd2e51d155831cdfae39f2e0f4578",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Since 2009, the deep learning revolution, which was triggered by the introduction of ImageNet, has stimulated the synergy between Machine Learning (ML)/Deep Learning (DL) and Software Engineering (SE). Meanwhile, critical reviews have emerged that suggest that ML/DL should be used cautiously. To improve the quality (especially the applicability and generalizability) of ML/DL-related SE studies, and to stimulate and enhance future collaborations between SE/AI researchers and industry practitioners, we conducted a 10-year Systematic Literature Review (SLR) on 906 ML/DL-related SE papers published between 2009 and 2018. Our trend analysis demonstrated the mutual impacts that ML/DL and SE have had on each other. At the same time, however, we also observed a paucity of replicable and reproducible ML/DL-related SE studies and identified five factors that influence their replicability and reproducibility. To improve the applicability and generalizability of research results, we analyzed what ingredients in a study would facilitate an understanding of why a ML/DL technique was selected for a specific SE problem. In addition, we identified the unique trends of impacts of DL models on SE tasks, as well as five unique challenges that needed to be met in order to better leverage DL to improve the productivity of SE tasks. Finally, we outlined a road-map that we believe can facilitate the transfer of ML/DL-based SE research results into real-world industry practices.",
    "citationCount": 7,
    "referenceCount": 154
}