{
    "paperId": "b5bcd9612d21e023bffb3261d72ae354c7e27a53",
    "title": "A high-throughput ResNet CNN approach for automated grapevine leaf hair quantification",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Nagarjun Malagol",
        "Tanuj Rao",
        "Anna Werner",
        "R. Töpfer",
        "L. Hausmann"
    ],
    "doi": "10.1038/s41598-025-85336-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b5bcd9612d21e023bffb3261d72ae354c7e27a53",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-025-85336-0",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The hairiness of the leaves is an essential morphological feature within the genus Vitis that can serve as a physical barrier. A high leaf hair density present on the abaxial surface of the grapevine leaves influences their wettability by repelling forces, thus preventing pathogen attack such as downy mildew and anthracnose. Moreover, leaf hairs as a favorable habitat may considerably affect the abundance of biological control agents. The unavailability of accurate and efficient objective tools for quantifying leaf hair density makes the study intricate and challenging. Therefore, a validated high-throughput phenotyping tool was developed and established in order to detect and quantify leaf hair using images of single grapevine leaf discs and convolution neural networks (CNN). We trained modified ResNet CNNs with a minimalistic number of images to efficiently classify the area covered by leaf hairs. This approach achieved an overall model prediction accuracy of 95.41%. As final validation, 10,120 input images from a segregating F1 biparental population were used to evaluate the algorithm performance. ResNet CNN-based phenotypic results compared to ground truth data received by two experts revealed a strong correlation with R values of 0.98 and 0.92 and root-mean-square error values of 8.20% and 14.18%, indicating that the model performance is consistent with expert evaluations and outperforms the traditional manual rating. Additional validation between expert vs. non-expert on six varieties showed that non-experts contributed to over- and underestimation of the trait, with an absolute error of 0% to 30% and -5% to -60%, respectively. Furthermore, a panel of 16 novice evaluators produced significant bias on set of varieties. Our results provide clear evidence of the need for an objective and accurate tool to quantify leaf hairiness. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-85336-0.",
    "citationCount": 2,
    "referenceCount": 41
}