{
    "paperId": "b5ec82b01a51a1075adea8b0105426c1ea002ed3",
    "title": "Optimizing Merkle Proof Size for Blockchain Transactions",
    "year": 2021,
    "venue": "International Conference on Communication Systems and Networks",
    "authors": [
        "Avi Mizrahi",
        "Noam Koren",
        "Ori Rottenstreich"
    ],
    "doi": "10.1109/COMSNETS51098.2021.9352820",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b5ec82b01a51a1075adea8b0105426c1ea002ed3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Merkle trees play a crucial role in blockchain networks in organizing network state. They allow proving a particular value of an entry in the state to a node that maintains only the root of the Merkle trees, a hash-based signature computed over the data in a hierarchical manner. Verification of particular state entries is crucial in reaching a consensus on the execution of a block where state information is required in the processing of its transactions. For instance, a payment transaction should be based on the balance of the involved accounts. The proof length affects the network communication and is typically logarithmic in the state size. In this paper, we take advantage of typical transaction characteristics for better organizing Merkle trees to improve blockchain network performance. We focus on the common transaction processing where Merkle proofs are jointly provided for multiple accounts. We provide lower bounds for the communication cost and describe algorithms based on traffic patterns can significantly reduce them. We rely on real blockchain data to show the savings allowed by our approach.",
    "citationCount": 9,
    "referenceCount": 18
}