{
    "paperId": "b62db67f4b293920371a672ccbe909156658c4f6",
    "title": "Optimistic No-regret Algorithms for Discrete Caching",
    "year": 2022,
    "venue": "Proceedings of the ACM on Measurement and Analysis of Computing Systems",
    "authors": [
        "Naram Mhaisen",
        "Abhishek Sinha",
        "G. Paschos",
        "Georgios Iosifidis"
    ],
    "doi": "10.1145/3570608",
    "arxivId": "2208.06414",
    "url": "https://www.semanticscholar.org/paper/b62db67f4b293920371a672ccbe909156658c4f6",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2208.06414",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We take a systematic look at the problem of storing whole files in a cache with limited capacity in the context of optimistic learning, where the caching policy has access to a prediction oracle (provided by, e.g., a Neural Network). The successive file requests are assumed to be generated by an adversary, and no assumption is made on the accuracy of the oracle. In this setting, we provide a universal lower bound for prediction-assisted online caching and proceed to design a suite of policies with a range of performance-complexity trade-offs. All proposed policies offer sublinear regret bounds commensurate with the accuracy of the oracle. Our results substantially improve upon all recently-proposed online caching policies, which, being unable to exploit the oracle predictions, offer only O(√T) regret. In this pursuit, we design, to the best of our knowledge, the first comprehensive optimistic Follow-the-Perturbed leader policy, which generalizes beyond the caching problem. We also study the problem of caching files with different sizes and the bipartite network caching problem. Finally, we evaluate the efficacy of the proposed policies through extensive numerical experiments using real-world traces.",
    "citationCount": 15,
    "referenceCount": 72
}