{
    "paperId": "b6708bee32b113fd80f1b3e9afb739e24c5d39d7",
    "title": "Fundamental of theories on human resource quality improvement in the universities and lesson learned",
    "year": 2024,
    "venue": "Interdisciplinary Social Studies",
    "authors": [
        "Mardy Serey",
        "Putheasath Sin",
        "Dina Pen",
        "Suntrakwadh Hem"
    ],
    "doi": "10.55324/iss.v3i2.549",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b6708bee32b113fd80f1b3e9afb739e24c5d39d7",
    "isOpenAccess": true,
    "openAccessPdf": "https://iss.internationaljournallabs.com/index.php/iss/article/download/549/519",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The development of human resources in education and training is becoming more important, and the roles of human resources have become necessary to contribute to all sectors of national development. This study aims to codify the fundamental theories on human resources quality improvement in universities and draw lessons learned for Svay Rieng University. As a methodology, the research results are mainly collected from the published information, and descriptive statistics are the principal analytical method used in this article. The study presents the basic concepts of human resources, human resources quality, human resources management structure in universities, and the rational structure of human resources in universities. As lessons learned, in order to develop the quality of lecturers as well as human resources at Svay Rieng University, first of all, it must have proper, reasonable, and objective assessments so that it can clearly find out the strengths, weaknesses, and constraints of human resources quality improvement. After accurately assessing these issues, it is necessary to have regulations, policies, and strategies for human resources development; therefore, human resources can constantly improve their quality and quantity to meet the vision and mission of the university in the next period.",
    "citationCount": 0,
    "referenceCount": 23
}