{
    "paperId": "b681784263c1a99d1144554493b2a4fc6205a69d",
    "title": "Learning Context-Aware Outfit Recommendation",
    "year": 2020,
    "venue": "Symmetry",
    "authors": [
        "A. Abugabah",
        "Xiaochun Cheng",
        "Jianfeng Wang"
    ],
    "doi": "10.3390/sym12060873",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b681784263c1a99d1144554493b2a4fc6205a69d",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2073-8994/12/6/873/pdf?version=1592980871",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development and increasing popularity of online shopping for fashion products, fashion recommendation plays an important role in daily online shopping scenes. Fashion is not only a commodity that is bought and sold but is also a visual language of sign, a nonverbal communication medium that exists between the wearers and viewers in a community. The key to fashion recommendation is to capture the semantics behind customers’ fit feedback as well as fashion visual style. Existing methods have been developed with the item similarity demonstrated by user interactions like ratings and purchases. By identifying user interests, it is efficient to deliver marketing messages to the right customers. Since the style of clothing contains rich visual information such as color and shape, and the shape has symmetrical structure and asymmetrical structure, and users with different backgrounds have different feelings on clothes, therefore affecting their way of dress. In this paper, we propose a new method to model user preference jointly with user review information and image region-level features to make more accurate recommendations. Specifically, the proposed method is based on scene images to learn the compatibility from fashion or interior design images. Extensive experiments have been conducted on several large-scale real-world datasets consisting of millions of users/items and hundreds of millions of interactions. Extensive experiments indicate that the proposed method effectively improves the performance of items prediction as well as of outfits matching.",
    "citationCount": 3,
    "referenceCount": 37
}