{
    "paperId": "b699ec3e0a87de34870ef4b56352784fea97df1b",
    "title": "Neural Network Verification with Proof Production",
    "year": 2022,
    "venue": "Formal Methods in Computer-Aided Design",
    "authors": [
        "Omri Isac",
        "Clark W. Barrett",
        "M. Zhang",
        "Guy Katz"
    ],
    "doi": "10.34727/2022/isbn.978-3-85448-053-2_9",
    "arxivId": "2206.00512",
    "url": "https://www.semanticscholar.org/paper/b699ec3e0a87de34870ef4b56352784fea97df1b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep neural networks (DNNs) are increasingly being employed in safety-critical systems, and there is an urgent need to guarantee their correctness. Consequently, the verification community has devised multiple techniques and tools for verifying DNNs. When DNN verifiers discover an input that triggers an error, that is easy to confirm; but when they report that no error exists, there is no way to ensure that the verification tool itself is not flawed. As multiple errors have already been observed in DNN verification tools, this calls the applicability of DNN verification into question. In this work, we present a novel mechanism for enhancing Simplex-based DNN verifiers with proof production capabilities: the generation of an easy-to-check witness of unsatisfiability, which attests to the absence of errors. Our proof production is based on an efficient adaptation of the well-known Farkas' lemma, combined with mechanisms for handling piecewise-linear functions and numerical precision errors. As a proof of concept, we implemented our technique on top of the Marabou DNN verifier. Our evaluation on a safety-critical system for airborne collision avoidance shows that proof production succeeds in almost all cases and requires only minimal overhead.",
    "citationCount": 24,
    "referenceCount": 78
}