{
    "paperId": "b6a421c35c5ce5ecc113636a654330c1a2dff0f8",
    "title": "MojoFrame: Dataframe Library in Mojo Language",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Shengya Huang",
        "Zhaoheng Li",
        "Derek Werner",
        "Yongjoo Park"
    ],
    "doi": "10.48550/arXiv.2505.04080",
    "arxivId": "2505.04080",
    "url": "https://www.semanticscholar.org/paper/b6a421c35c5ce5ecc113636a654330c1a2dff0f8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mojo is an emerging programming language built on MLIR (Multi-Level Intermediate Representation) and JIT compilation. It enables transparent optimizations with respect to the underlying hardware (e.g., CPUs, GPUs), while allowing users to express their logic using Python-like user-friendly syntax. Mojo has been shown to offer great performance in tensor operations; however, its performance has not been tested for relational operations (e.g., filtering, join, and group-by), which are common in data science workflows. To date, no dataframe implementation exists in the Mojo ecosystem. In this paper, we introduce the first Mojo-native dataframe library, called MojoFrame, that supports core relational operations and user-defined functions (UDFs). MojoFrame is built on top of Mojo's tensor to achieve fast operations on numeric columns, while utilizing a cardinality-aware approach to effectively integrate non-numeric columns for flexible data representation. To achieve high efficiency, MojoFrame takes significantly different approaches than existing libraries. MojoFrame supports all operations for TPC-H queries, and achieves up to 2.97x speedup versus existing dataframe libraries in other programming languages. Nevertheless, there remain optimization opportunities for MojoFrame (and the Mojo language), particularly in data loading and dictionary operations.",
    "citationCount": 1,
    "referenceCount": 72
}