{
    "paperId": "b6dae438b04522d2dc51df08be67fc707fa8c6c5",
    "title": "An Accelerated Mixed Weighted-Unweighted MMSE Approach for MU-MIMO Beamforming",
    "year": 2025,
    "venue": "",
    "authors": [
        "Xi Gao",
        "Akang Wang",
        "Junkai Zhang",
        "Qihong Duan",
        "Jiang Xue"
    ],
    "doi": null,
    "arxivId": "2510.20507",
    "url": "https://www.semanticscholar.org/paper/b6dae438b04522d2dc51df08be67fc707fa8c6c5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Precoding design based on weighted sum-rate (WSR) maximization is a fundamental problem in downlink multi-user multiple-input multiple-output (MU-MIMO) systems. While the weighted minimum mean-square error (WMMSE) algorithm is a standard solution, its high computational complexity--cubic in the number of base station antennas due to matrix inversions--hinders its application in latency-sensitive scenarios. To address this limitation, we propose a highly parallel algorithm based on a block coordinate descent framework. Our key innovation lies in updating the precoding matrix via block coordinate gradient descent, which avoids matrix inversions and relies solely on matrix multiplications, making it exceptionally amenable to GPU acceleration. We prove that the proposed algorithm converges to a stationary point of the WSR maximization problem. Furthermore, we introduce a two-stage warm-start strategy grounded in the sum mean-square error (MSE) minimization problem to accelerate convergence. We refer to our method as the Accelerated Mixed weighted-unweighted sum-MSE minimization (A-MMMSE) algorithm. Simulation results demonstrate that A-MMMSE matches the WSR performance of both conventional WMMSE and its enhanced variant, reduced-WMMSE, while achieving a substantial reduction in computational time across diverse system configurations.",
    "citationCount": 0,
    "referenceCount": 38
}