{
    "paperId": "b6e1619cdf5c2cd2fab65c73ee7c4ce926f90446",
    "title": "Driving forces of digital transformation in chinese enterprises based on machine learning",
    "year": 2024,
    "venue": "Scientific Reports",
    "authors": [
        "Qi-an Chen",
        "Xu Zhao",
        "Xinyi Zhang",
        "Zizhe Jiang",
        "Yuxuan Wang"
    ],
    "doi": "10.1038/s41598-024-56448-w",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b6e1619cdf5c2cd2fab65c73ee7c4ce926f90446",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41598-024-56448-w.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With advanced science and digital technology, digital transformation has become an important way to promote the sustainable development of enterprises. However, the existing research only focuses on the linear relationship between a single characteristic and digital transformation. In this study, we select the data of Chinese A-share listed companies from 2010 to 2020, innovatively use the machine learning method and explore the differences in the predictive effects of multi-dimensional features on the digital transformation of enterprises based on the Technology-Organization-Environment (TOE) theory, thus identifying the main drivers affecting digital transformation and the fitting models with stronger predictive effect. The study found that: first, by comparing machine learning and traditional linear regression models, it is found that the prediction ability of ensemble earning method is generally higher than that of tradition measurement method. For the sample data selected in this research, XGBoost and LightGBM have strong explanatory ability and high prediction accuracy. Second, compared with the technical driving force and environmental driving force, the organizational driving force has a greater impact. Third, among these characteristics, equity concentration and executives’ knowledge level in organizational dimension have the greatest impact on digital transformation. Therefore, enterprise managers should always pay attention to the decision-making role of equity concentration and executives’ knowledge level. This study further enriches the literature on digital transformation in enterprises, expands the application of machine learning in economics, and provides a theoretical basis for enterprises to enhance digital transformation.",
    "citationCount": 14,
    "referenceCount": 64
}