{
    "paperId": "b6eaba8989d51ecc8ad59a98210603b66bd26e3c",
    "title": "Best practices for germline variant and DNA methylation analysis of second- and third-generation sequencing data",
    "year": 2024,
    "venue": "Human Genomics",
    "authors": [
        "Ferdinando Bonfiglio",
        "A. Legati",
        "V. A. Lasorsa",
        "Flavia Palombo",
        "Giulia De Riso",
        "Federica Isidori",
        "Silvia Russo",
        "Simone Furini",
        "G. Merla",
        "Fabio Coppedè",
        "M. Tartaglia",
        "A. Bruselles",
        "T. Pippucci",
        "A. Ciolfi",
        "M. Pinelli",
        "Mario Capasso"
    ],
    "doi": "10.1186/s40246-024-00684-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b6eaba8989d51ecc8ad59a98210603b66bd26e3c",
    "isOpenAccess": true,
    "openAccessPdf": "https://humgenomics.biomedcentral.com/counter/pdf/10.1186/s40246-024-00684-8",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This comprehensive review provides insights and suggested strategies for the analysis of germline variants using second- and third-generation sequencing technologies (SGS and TGS). It addresses the critical stages of data processing, starting from alignment and preprocessing to quality control, variant calling, and the removal of artifacts. The document emphasized the importance of meticulous data handling, highlighting advanced methodologies for annotating variants and identifying structural variations and methylated DNA sites. Special attention is given to the inspection of problematic variants, a step that is crucial for ensuring the accuracy of the analysis, particularly in clinical settings where genetic diagnostics can inform patient care. Additionally, the document covers the use of various bioinformatics tools and software that enhance the precision and reliability of these analyses. It outlines best practices for the annotation of variants, including considerations for problematic genetic alterations such as those in the human leukocyte antigen region, runs of homozygosity, and mitochondrial DNA alterations. The document also explores the complexities associated with identifying structural variants and copy number variations, underscoring the challenges posed by these large-scale genomic alterations. The objective is to offer a comprehensive framework for researchers and clinicians, ensuring that genetic analyses conducted with SGS and TGS are both accurate and reproducible. By following these best practices, the document aims to increase the diagnostic accuracy for hereditary diseases, facilitating early diagnosis, prevention, and personalized treatment strategies. This review serves as a valuable resource for both novices and experts in the field, providing insights into the latest advancements and methodologies in genetic analysis. It also aims to encourage the adoption of these practices in diverse research and clinical contexts, promoting consistency and reliability across studies.",
    "citationCount": 5,
    "referenceCount": 165
}