{
    "paperId": "b70a17a5991a1d8deecda7fbfed0f7f8ebab105f",
    "title": "Beyond Bandwidth Doubling: Embrace Bit-Flips and Unlock Processing-in-NAND",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Maximilian Berens",
        "Yun-Chih Chen",
        "Jian-Jia Chen",
        "Jens Teubner"
    ],
    "doi": "10.1109/ICDE65448.2025.00373",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b70a17a5991a1d8deecda7fbfed0f7f8ebab105f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "NVMe SSDs offer unprecedented capacity and bandwidth and upcoming PCIe standards promise even more. However, the underlying technology, NAND memory, already struggles with significant heat and power consumption challenges. Just like microprocessors before, NAND also experiences Dark Silicon, preventing performance from improving at the same pace as capacity. Much of the power (and thus heat) within a NAND chip results from transferring data at a high rate, another symptom of a compute-centric style of processing. Therefore, we argue for data-centric Processing-in-NAND (PiN). However, PiN comes with significant challenges, such as limited capabilities and the need to cope with bit-flip errors. Even beyond Processing-in-Memory (PiM), databases may soon have to accept that memory is not error-free, an assumption that comes at a significant cost in power, capacity and performance. Our discussion indicates that no PiN design will serve as a singular, universally applicable solution to the limit of bandwidth scaling. Instead, successful integration into database architecture requires carefully identifying PiN-compatible functionality and abstractions, and cooperation with other innovations, such as Computational Storage and CXL. Lastly, we analyze the fundamental error tolerance of Bloom filters and binary sketches as PiM-compatible data structures, which we believe may be of independent interest.",
    "citationCount": 0,
    "referenceCount": 48
}