{
    "paperId": "b74f5a90f2845e625d781f6ea74d150ed3632262",
    "title": "CAM: Asynchronous GPU-Initiated, CPU-Managed SSD Management for Batching Storage Access",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Ziyu Song",
        "Jie Zhang",
        "Jie Sun",
        "Mo Sun",
        "Zihan Yang",
        "Zheng Zhang",
        "Xuzheng Chen",
        "Fei Wu",
        "Huajin Tang",
        "Zeke Wang"
    ],
    "doi": "10.1109/ICDE65448.2025.00175",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b74f5a90f2845e625d781f6ea74d150ed3632262",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the wide adoption of GPU and the explosion in data volumes, existing accelerator-centric systems require massive storage access. They adopt high-performance storage devices like NVMe SSDs to scale up single-node systems cost-effectively and leverage the CPU to manage these SSDs. However, they suffer from performance bottlenecks because of the high CPU OS kernel overhead and the CPU memory intermediated data transfer. To address this issue, GPU-initiated and GPU-managed SSD management is proposed to allow the GPU to fully manipulate SSDs: 1) direct data transfer from SSD to GPU memory (data plane) and 2) GPU-managed SSD control (control plane). This can potentially enable these GPU systems to fully leverage the SSD bandwidth. However, we still identify two severe issues. First, the GPU-management SSD control leads to low GPU Streaming Multiprocessor utilization. Second, it leads to the serial execution of SSD accesses with GPU computation, which slows down the overall computing task. To this end, we propose CAM, the first asynchronous GPU-initialized, CPU-managed SSD management for batching storage access. It 1) offloads the SSD control plane from GPU to CPU, thus maximizing GPU streaming multiprocessor utilization, and 2) adopts asynchronous user-friendly APIs that allow programmers to easily overlap GPU computation and SSD I/O operations while keeping a synchronous programming experience. As such, CAM enables us to achieve the best of two worlds: high performance and high programmability. The experimental results show that CAM can perform GNN model training, mergesort, and GEMM up to $\\mathbf{1.84}\\times, \\mathbf{1.5}\\times$, and $\\mathbf{1.84}\\times \\mathbf{faster}$ compared to the existing state-of-the-art GPU systems, while keeping high programmability.",
    "citationCount": 0,
    "referenceCount": 62
}