{
    "paperId": "b751404218d0aecfeb1cefe8a26297006f7b9ae7",
    "title": "Phát triển Framework ứng dụng AI hỗ trợ tự động khai thác lỗ hổng bảo mật",
    "year": 2022,
    "venue": "Journal of Science and Technology on Information security",
    "authors": [
        "Nguyễn Mạnh Thiên",
        "Phạm Đăng Khoa",
        "Nguyễn Đức Vượng",
        "Nguyễn Lê Việt Hùng"
    ],
    "doi": "10.54654/isj.v1i13.234",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b751404218d0aecfeb1cefe8a26297006f7b9ae7",
    "isOpenAccess": true,
    "openAccessPdf": "https://hoithaobotulenh86.isj.vn/index.php/journal_STIS/article/download/234/116",
    "publicationTypes": null,
    "s2FieldsOfStudy": [],
    "abstract": "Tóm tắt—Hiện nay, nhiệm vụ đánh giá an toàn thông tin cho các hệ thống thông tin có ý nghĩa quan trọng trong đảm bảo an toàn thông tin. Đánh giá/khai thác lỗ hổng bảo mật cần được thực hiện thường xuyên và ở nhiều cấp độ khác nhau đối với các hệ thống thông tin. Tuy nhiên, nhiệm vụ này đang gặp nhiều khó khăn trong triển khai diện rộng do thiếu hụt đội ngũ chuyên gia kiểm thử chất lượng ở các cấp độ khác nhau. Trong khuôn khổ bài báo này, chúng tôi trình bày nghiên cứu phát triển Framework có khả năng tự động trinh sát thông tin và tự động lựa chọn các mã để tiến hành khai thác mục tiêu dựa trên công nghệ học tăng cường (Reinforcement Learning). Bên cạnh đó Framework còn có khả năng cập nhật nhanh các phương pháp khai thác lỗ hổng bảo mật mới, hỗ trợ tốt cho các cán bộ phụ trách hệ thống thông tin nhưng không phải là chuyên gia bảo mật có thể tự động đánh giá hệ thống của mình, nhằm giảm thiểu nguy cơ từ các cuộc tấn công mạng. \nAbstract—Currently, security assessment is one of the most important proplem in information security. Vulnerability assessment/exploitation should be performed regularly with different levels of complexity for each information system. However, this task is facing many difficulties in large-scale deployment due to the lack of experienced testing experts. In this paper, we proposed a Framework that can automatically gather information and automatically select suitable module to exploit the target based on reinforcement learning technology. Furthermore, our framework has intergrated many scanning tools, exploited tools that help pentesters doing their work. It also can be easily updated new vulnerabilities exploit techniques.",
    "citationCount": 0,
    "referenceCount": 16
}