{
    "paperId": "b78e18ec906482eaf3e14c413d79da3f4a7c3c11",
    "title": "Efficient and Accurate Range Counting on Privacy-preserving Spatial Data Federation [Technical Report]",
    "year": 2023,
    "venue": "International Conference on Database Systems for Advanced Applications",
    "authors": [
        "Maocheng Li",
        "Yuxiang Zeng",
        "Lei Chen"
    ],
    "doi": "10.48550/arXiv.2303.02842",
    "arxivId": "2303.02842",
    "url": "https://www.semanticscholar.org/paper/b78e18ec906482eaf3e14c413d79da3f4a7c3c11",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2303.02842",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A spatial data federation is a collection of data owners (e.g., a consortium of taxi companies), and collectively it could provide better location-based services (LBS). For example, car-hailing services over a spatial data federation allow end users to easily pick the best offers. We focus on the range counting queries, which are primitive operations in spatial databases but received little attention in related research, especially considering the privacy requirements from data owners, who are reluctant to disclose their proprietary data. We propose a grouping-based technical framework named FedGroup, which groups data owners without compromising privacy, and achieves superior query accuracy (up to 50% improvement) as compared to directly applying existing privacy mechanisms achieving Differential Privacy (DP). Our experimental results also demonstrate that FedGroup runs orders-of-magnitude faster than traditional Secure Multiparty Computation (MPC) based method, and FedGroup even scales to millions of data owners, which is a common setting in the era of ubiquitous mobile devices.",
    "citationCount": 0,
    "referenceCount": 29
}