{
    "paperId": "b7c480fd05678df306c51217b43199010d2ef43c",
    "title": "Enhancing Healthcare Insurance Cost Prediction with a Metaheuristic Optimization Approach: Comparative Analysis of Machine Learning Models",
    "year": 2025,
    "venue": "International Conference Intelligent Data Communication Technologies and Internet Things",
    "authors": [
        "M. R.",
        "Manjula Arunraj"
    ],
    "doi": "10.1109/ICICI65870.2025.11069726",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b7c480fd05678df306c51217b43199010d2ef43c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The prediction of healthcare insurance costs is significant to the insurers and insured persons for risk assessment, premium calculation and budget planning. In this study, we propose an optimized predictive model by using the machine learning approaches and a new metaheuristic optimization algorithm. The publicly available dataset from Kaggle, which contains information on healthcare insurance, features attributes including age, BMI, number of children, smoking status, and region. Data preprocessing involves dealing with missing values, feature scaling, and the encoding of categorical variables. Very simple EGMO data preparation: FGMO data preparation is more complicated than EGMO data preparation, but can be integrated into AMI systems. We propose a metaheuristic optimization algorithm for hyperparameter tuning and feature selection as the proposed methodology. The performance of benchmark metaheuristic methods including Genetic Algorithm (GA), Particle Swarm Optimization (PSO), and Bayesian Optimization are compared. The models were evaluated using Mean Absolute Error (MAE), Mean Squared Error (MSE), Root Mean Squared Error (RMSE), and R-squared (R2) score. Then performance of the devised optimization algorithm is evaluated and compared with other current metaheuristic methods. The proposed optimization algorithm applied to Random Forest and Gradient Boosting, presented the best performance, reaching an R2 score of 92.5% and the lower RMSE, achieving 2510.23, improving its accuracy by 4.3%. It can be observed that enesmble based models are outperforming techniques like regression based models in predicting costs for insurance. We improve predictive performance by optimizing feature selection and hyperparameters using a proposed optimization algorithm. Smoking status and BMI are two main predictors. Metaheuristic improves accuracy for health care insurance cost prediction. The method compares favourably to standard machine learning methods. Further works should combine deep learning with metaheuristic optimization for higher accuracy.",
    "citationCount": 0,
    "referenceCount": 16
}