{
    "paperId": "b7ccbe5aafc0ed695f8ba3e0b1c4c30e7f8633e8",
    "title": "Polylidar3D-Fast Polygon Extraction from 3D Data",
    "year": 2020,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "J. Castagno",
        "E. Atkins"
    ],
    "doi": "10.3390/s20174819",
    "arxivId": "2007.12065",
    "url": "https://www.semanticscholar.org/paper/b7ccbe5aafc0ed695f8ba3e0b1c4c30e7f8633e8",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/20/17/4819/pdf?version=1598523138",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Flat surfaces captured by 3D point clouds are often used for localization, mapping, and modeling. Dense point cloud processing has high computation and memory costs making low-dimensional representations of flat surfaces such as polygons desirable. We present Polylidar3D, a non-convex polygon extraction algorithm which takes as input unorganized 3D point clouds (e.g., LiDAR data), organized point clouds (e.g., range images), or user-provided meshes. Non-convex polygons represent flat surfaces in an environment with interior cutouts representing obstacles or holes. The Polylidar3D front-end transforms input data into a half-edge triangular mesh. This representation provides a common level of abstraction for subsequent back-end processing. The Polylidar3D back-end is composed of four core algorithms: mesh smoothing, dominant plane normal estimation, planar segment extraction, and finally polygon extraction. Polylidar3D is shown to be quite fast, making use of CPU multi-threading and GPU acceleration when available. We demonstrate Polylidar3D’s versatility and speed with real-world datasets including aerial LiDAR point clouds for rooftop mapping, autonomous driving LiDAR point clouds for road surface detection, and RGBD cameras for indoor floor/wall detection. We also evaluate Polylidar3D on a challenging planar segmentation benchmark dataset. Results consistently show excellent speed and accuracy.",
    "citationCount": 10,
    "referenceCount": 75
}