{
    "paperId": "b7df1e5c57ed232a9e1d5129f2bb8c4b04dd620b",
    "title": "Yardstick: A Benchmark for Minecraft-like Services",
    "year": 2019,
    "venue": "International Conference on Performance Engineering",
    "authors": [
        "Jerom van der Sar",
        "Jesse Donkervliet",
        "A. Iosup"
    ],
    "doi": "10.1145/3297663.3310307",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b7df1e5c57ed232a9e1d5129f2bb8c4b04dd620b",
    "isOpenAccess": true,
    "openAccessPdf": "https://research.vu.nl/files/87101005/Yardstick.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online gaming applications entertain hundreds of millions of daily active players and often feature vastly complex architecture. Among online games, Minecraft-like games simulate unique (e.g., modifiable) environments, are virally popular, and are increasingly provided as a service. However, the performance of Minecraft-like services, and in particular their scalability, is not well understood. Moreover, currently no benchmark exists for Minecraft-like games. Addressing this knowledge gap, in this work we design and use the Yardstick benchmark to analyze the performance of Minecraft-like services. Yardstick is based on an operational model that captures salient characteristics of Minecraft-like services. As input workload, Yardstick captures important features, such as the most-popular maps used within the Minecraft community. Yardstick captures system- and application-level metrics, and derives from them service-level metrics such as frequency of game-updates under scalable workload. We implement Yardstick, and, through real-world experiments in our clusters, we explore the performance and scalability of popular Minecraft-like servers, including the official vanilla server, and the community-developed servers Spigot and Glowstone. Our findings indicate the scalability limits of these servers, that Minecraft-like services are poorly parallelized, and that Glowstone is the least viable option among those tested.",
    "citationCount": 7,
    "referenceCount": 35
}