{
    "paperId": "b7f50347e6418246f5b52ad6abc3af93dd8c7dd7",
    "title": "Demand Forecasting: Integrating Textual and Market Data to Navigate Irregular Market Disruption",
    "year": 2024,
    "venue": "Proceedings of the 2024 3rd International Conference on Algorithms, Data Mining, and Information Technology",
    "authors": [
        "Nway Nway Aung",
        "Yuejingxian Mao",
        "Chandra Suwandi Wijaya",
        "Aryel Beck",
        "Miura Koji",
        "Tajika Yosuke"
    ],
    "doi": "10.1145/3701100.3701158",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b7f50347e6418246f5b52ad6abc3af93dd8c7dd7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Demand forecasting in the B2B sector is challenging due to complex supply chains and variable influences such as economic conditions and market trends. Traditional forecasting techniques rely on stable but often delayed data sources like government and industry reports, which struggle to provide timely and accurate predictions during volatile market conditions. This study introduces an enhanced forecasting methodology integrating high-frequency indicators from social media platforms and the stock market. Our novel approach consists of two components: the High-Frequency Textual Event Disruption Analyzer (HFT-EDA), which leverages advanced natural language processing techniques to analyze online trends and news data for immediate market insights, and the market health analyzer (MHA), which statistically combines hard, soft, and high-frequency economic indicators for a comprehensive market assessment. In this study, our methodology significantly improved monthly forecasts, surpassing existing models by up to 8.5% for specific products, including electronic devices used in home and industrial appliances. This capability is particularly crucial during crises such as the COVID-19 lockdown, where rapid market shifts significantly impact demand dynamics. Our dual approach provides precise and actionable demand forecasts, enabling businesses to adapt quickly to market changes and stay attuned to immediate market fluctuations in the dynamic B2B landscape.",
    "citationCount": 0,
    "referenceCount": 23
}