{
    "paperId": "b801cd3aa19700fbaa08f7d0122372b59105bd28",
    "title": "Scalable Tabular Dataset Labeling with Language Models",
    "year": 2025,
    "venue": "International Conference on Statistical and Scientific Database Management",
    "authors": [
        "Yaojie Hu",
        "Ilias Fountalis",
        "Jin Tian",
        "N. Vasiloglou"
    ],
    "doi": "10.1145/3733723.3733739",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b801cd3aa19700fbaa08f7d0122372b59105bd28",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Acquiring tabular datasets for machine learning research can be surprisingly challenging. For example, executable SQL code paired with tabular data is still limited by manual annotations by human experts, which limits its scale. Furthermore, tabular machine learning (ML) problems often impose domain-specific constraints, making customized datasets even harder to obtain. To tackle the tabular dataset labeling problem, we propose a scalable and customizable methodology that synthesizes tabular ML datasets using language model annotations. Our approach leverages the abundance of existing tabular data and the instruction-following capabilities of language models to generate datasets tailored to specific research needs. We apply this method to create a three-part dataset for three tabular ML studies, progressively exploring how language models can augment tabular data. Notably, our method has produced the largest executable SQL dataset to date. In these studies, we demonstrate the scientific utility of our augmented datasets and assess the correctness of LLM-synthesized labels, highlighting the models’ ability to understand tabular data and support ML research.",
    "citationCount": 0,
    "referenceCount": 11
}