{
    "paperId": "b85c6b1ed5efe1c28361b823fd976cee1ded6cba",
    "title": "MozzaVID: Mozzarella Volumetric Image Dataset",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "P. Pieta",
        "P. Rasmussen",
        "A. Dahl",
        "J. Frisvad",
        "S. Bigdeli",
        "Carsten Gundlach",
        "A. Christensen"
    ],
    "doi": "10.48550/arXiv.2412.04880",
    "arxivId": "2412.04880",
    "url": "https://www.semanticscholar.org/paper/b85c6b1ed5efe1c28361b823fd976cee1ded6cba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Influenced by the complexity of volumetric imaging, there is a shortage of established datasets useful for benchmarking volumetric deep-learning models. As a consequence, new and existing models are not easily comparable, limiting the development of architectures optimized specifically for volumetric data. To counteract this trend, we introduce MozzaVID - a large, clean, and versatile volumetric classification dataset. Our dataset contains X-ray computed tomography (CT) images of mozzarella microstructure and enables the classification of 25 cheese types and 149 cheese samples. We provide data in three different resolutions, resulting in three dataset instances containing from 591 to 37,824 images. While being general-purpose, the dataset also facilitates investigating mozzarella structure properties. The structure of food directly affects its functional properties and thus its consumption experience. Understanding food structure helps tune the production and mimicking it enables sustainable alternatives to animal-derived food products. The complex and disordered nature of food structures brings a unique challenge, where a choice of appropriate imaging method, scale, and sample size is not trivial. With this dataset we aim to address these complexities, contributing to more robust structural analysis models. The dataset can be downloaded from: https://archive.compute.dtu.dk/files/public/projects/MozzaVID/.",
    "citationCount": 0,
    "referenceCount": 92
}