{
    "paperId": "b8a5363384941daf6015acf36a0edc813bd3e575",
    "title": "A Survey of Source Code Search: A 3-Dimensional Perspective",
    "year": 2023,
    "venue": "ACM Transactions on Software Engineering and Methodology",
    "authors": [
        "Weisong Sun",
        "Chunrong Fang",
        "Yifei Ge",
        "Yuling Hu",
        "Yuchen Chen",
        "Quanjun Zhang",
        "Xiuting Ge",
        "Yang Liu",
        "Zhenyu Chen"
    ],
    "doi": "10.48550/arXiv.2311.07107",
    "arxivId": "2311.07107",
    "url": "https://www.semanticscholar.org/paper/b8a5363384941daf6015acf36a0edc813bd3e575",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "(Source) code search is widely concerned by software engineering researchers because it can improve the productivity and quality of software development. Given a functionality requirement usually described in a natural language sentence, a code search system can retrieve code snippets that satisfy the requirement from a large-scale code corpus, e.g., GitHub. To realize effective and efficient code search, many techniques have been proposed successively. These techniques improve code search performance mainly by optimizing three core components, including query understanding component, code understanding component, and query-code matching component. In this article, we provide a 3-dimensional perspective survey for code search. Specifically, we categorize existing code search studies into query-end optimization techniques, code-end optimization techniques, and match-end optimization techniques according to the specific components they optimize. These optimization techniques are proposed to enhance the performance of specific components, and thus the overall performance of code search. Considering that each end can be optimized independently and contributes to the code search performance, we treat each end as a dimension. Therefore, this survey is 3-dimensional in nature, and it provides a comprehensive summary of each dimension in detail. To understand the research trends of the three dimensions in existing code search studies, we systematically review 68 relevant literatures. Different from existing code search surveys that only focus on the query end or code end or introduce various aspects shallowly (including codebase, evaluation metrics, modeling technique, etc.), our survey provides a more nuanced analysis and review of the evolution and development of the underlying techniques used in the three ends. Based on a systematic review and summary of existing work, we outline several open challenges and opportunities at the three ends that remain to be addressed in future work.",
    "citationCount": 14,
    "referenceCount": 119
}