{
    "paperId": "b8e837349f3903e2c2e0d7a2e2c0b2e185ed6942",
    "title": "Pone-GNN: Integrating Positive and Negative Feedback in Graph Neural Networks for Recommender Systems",
    "year": 2025,
    "venue": "Trans. Recomm. Syst.",
    "authors": [
        "Ziyang Liu",
        "Chaokun Wang",
        "Shuwen Zheng",
        "Cheng Wu",
        "Kai Zheng",
        "Yang Song",
        "Na Mou"
    ],
    "doi": "10.1145/3711666",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b8e837349f3903e2c2e0d7a2e2c0b2e185ed6942",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender systems mitigate information overload by offering personalized suggestions to users. As the interactions between users and items can inherently be depicted as a bipartite graph, recent years have seen a surge in the interest in harnessing graph neural networks (GNNs) for enhancing recommender systems. However, a notable limitation of current GNN-based recommendation models is their exclusive emphasis on positive feedback, while disregarding the potentially insightful negative feedback. In this article, we introduce Pone-GNN, a novel recommendation model that synergistically integrates both Positive and negative feedback in Graph Neural Networks. Pone-GNN utilizes dual embeddings–interest embeddings for capturing a user’s likes and disinterest embeddings for a user’s dislikes. Also, Pone-GNN performs message passing for both positive and negative feedback, and integrates two sets of embeddings through contrastive learning, which is crucial for extracting robust and discriminative embeddings. Our comprehensive experimental analysis demonstrates that Pone-GNN outperforms state-of-the-art models on diverse real-world recommendation datasets. For example, Pone-GNN achieves a 6.15% increase in relative nDCG@10 compared to the runner-up on the KuaiRec dataset.",
    "citationCount": 5,
    "referenceCount": 65
}