{
    "paperId": "b8f33cd54ea03e06fb44d618f57b6e85f0a15565",
    "title": "TPP: Transparent Page Placement for CXL-Enabled Tiered-Memory",
    "year": 2022,
    "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems",
    "authors": [
        "H. Maruf",
        "Hao Wang",
        "A. Dhanotia",
        "Johannes Weiner",
        "Niket Agarwal",
        "Pallab Bhattacharya",
        "Chris Petersen",
        "Mosharaf Chowdhury",
        "Shobhit O. Kanaujia",
        "Prakash Chauhan"
    ],
    "doi": "10.1145/3582016.3582063",
    "arxivId": "2206.02878",
    "url": "https://www.semanticscholar.org/paper/b8f33cd54ea03e06fb44d618f57b6e85f0a15565",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.02878",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing demand for memory in hyperscale applications has led to memory becoming a large portion of the overall datacenter spend. The emergence of coherent interfaces like CXL enables main memory expansion and offers an efficient solution to this problem. In such systems, the main memory can constitute different memory technologies with varied characteristics. In this paper, we characterize memory usage patterns of a wide range of datacenter applications across the server fleet of Meta. We, therefore, demonstrate the opportunities to offload colder pages to slower memory tiers for these applications. Without efficient memory management, however, such systems can significantly degrade performance. We propose a novel OS-level application-transparent page placement mechanism (TPP) for CXL-enabled memory. TPP employs a lightweight mechanism to identify and place hot/cold pages to appropriate memory tiers. It enables a proactive page demotion from local memory to CXL-Memory. This technique ensures a memory headroom for new page allocations that are often related to request processing and tend to be short-lived and hot. At the same time, TPP can promptly promote performance-critical hot pages trapped in the slow CXL-Memory to the fast local memory, while minimizing both sampling overhead and unnecessary migrations. TPP works transparently without any application-specific knowledge and can be deployed globally as a kernel release. We evaluate TPP with diverse memory-sensitive workloads in the production server fleet with early samples of new x86 CPUs with CXL 1.1 support. TPP makes a tiered memory system performant as an ideal baseline (<1% gap) that has all the memory in the local tier. It is 18% better than today’s Linux, and 5–17% better than existing solutions including NUMA Balancing and AutoTiering. Most of the TPP patches have been merged in the Linux v5.18 release while the remaining ones are just pending for more discussion.",
    "citationCount": 245,
    "referenceCount": 72
}