{
    "paperId": "b9b4387d61d181a10f5513fef4d1c619f1efbd78",
    "title": "Interferometric Synthetic Aperture Radar Multitemporal Deformation Monitoring: A review of machine learning techniques",
    "year": 2025,
    "venue": "IEEE Geoscience and Remote Sensing Magazine",
    "authors": [
        "Y. Wassie",
        "P. Milillo"
    ],
    "doi": "10.1109/MGRS.2025.3538667",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b9b4387d61d181a10f5513fef4d1c619f1efbd78",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, the synergy between multitemporal (MT) interferometric synthetic aperture radar (InSAR) and machine learning (ML) techniques has transformed the landscape of Earth observation and geospatial data analysis. This review aims to provide an overview of the state-of-the-art ML methods for MT-InSAR data processing and applications in analyzing natural and anthropogenic activities. In particular, the contribution of deep learning (DL) methods in handling complex and big MT-InSAR processing tasks from a diverse range of applications, including infrastructure monitoring, early warning detection, and geohazard prediction, is explored. Drawing from peer-reviewed papers, this article identifies the small baseline subset (SBAS) as a widely adopted InSAR data processing method, with Sentinel-1 as a frequently employed radar data source, and long short-term memory (LSTM) and convolutional neural networks (CNNs) as popular choices among ML/DL architectures. Datasets derived from Constellation of Small Satellites for Mediterranean Basin Observation (COSMO-SkyMed) satellite images are also used to demonstrate underlying ML parameters and metrics used in MT-InSAR time-series classification. Moreover, by highlighting advances in methods, opportunities, limitations, and emerging trends at the intersection of ML/DL and MT-InSAR methods, this review is expected to serve as a valuable resource for researchers and practitioners navigating future ML-driven MT-InSAR geospatial data analysis. See Table 1 for abbreviations used throughout the article.",
    "citationCount": 0,
    "referenceCount": 191
}