{
    "paperId": "b9e1bcf575d7f42cce1a60e8a826d700d8bb42de",
    "title": "SALSA-Net: Explainable Deep Unrolling Networks for Compressed Sensing",
    "year": 2023,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Heping Song",
        "Qifeng Ding",
        "Jingyao Gong",
        "Hongying Meng",
        "Yuping Lai"
    ],
    "doi": "10.3390/s23115142",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/b9e1bcf575d7f42cce1a60e8a826d700d8bb42de",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/11/5142/pdf?version=1685351810",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep unrolling networks (DUNs) have emerged as a promising approach for solving compressed sensing (CS) problems due to their superior explainability, speed, and performance compared to classical deep network models. However, the CS performance in terms of efficiency and accuracy remains a principal challenge for approaching further improvements. In this paper, we propose a novel deep unrolling model, SALSA-Net, to solve the image CS problem. The network architecture of SALSA-Net is inspired by unrolling and truncating the split augmented Lagrangian shrinkage algorithm (SALSA) which is used to solve sparsity-induced CS reconstruction problems. SALSA-Net inherits the interpretability of the SALSA algorithm while incorporating the learning ability and fast reconstruction speed of deep neural networks. By converting the SALSA algorithm into a deep network structure, SALSA-Net consists of a gradient update module, a threshold denoising module, and an auxiliary update module. All parameters, including the shrinkage thresholds and gradient steps, are optimized through end-to-end learning and are subject to forward constraints to ensure faster convergence. Furthermore, we introduce learned sampling to replace traditional sampling methods so that the sampling matrix can better preserve the feature information of the original signal and improve sampling efficiency. Experimental results demonstrate that SALSA-Net achieves significant reconstruction performance compared to state-of-the-art methods while inheriting the advantages of explainable recovery and high speed from the DUNs paradigm.",
    "citationCount": 1,
    "referenceCount": 54
}