{
    "paperId": "ba091f44ccdc95a9ac8300b7eedbacf4d79c335a",
    "title": "Deep Unfolded Superposition Coding Optimization for Two-Hop NOMA MANETs",
    "year": 2023,
    "venue": "IEEE Military Communications Conference",
    "authors": [
        "Tomer Alter",
        "Nir Shlezinger"
    ],
    "doi": "10.1109/MILCOM58377.2023.10356307",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ba091f44ccdc95a9ac8300b7eedbacf4d79c335a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mobile ad hoc network (MANET) is an attractive technology for tactical communications. When combined with non-orthogonal multiple access (NOMA), it can support a large number of devices over flexible topologies in a spectral efficient manner. However, to harness the benefits of NOMA MANETs, one should determine the transmission protocol, particularly the superposition code, which involves a lengthy optimization procedure that has to be repeated when the topology changes. In this work, we tackle this challenge by proposing an optimizer for rapidly tuning superposition codes for two-hop NOMA MANETs. This is achieved using the emerging deep unfolding methodology, leveraging data to boost reliable settings with a fixed and limited latency. We unfold optimization based on a small number of projected gradient steps applied to the minimal rate objective, combine it with an ensemble to cope with non-convexity and use machine learning tools to tune the hyperparameters of the optimizers in an unsupervised manner. Our numerical results demonstrate that the proposed method enables the rapid setting of high-rate superposition codes for various channels.",
    "citationCount": 2,
    "referenceCount": 20
}