{
    "paperId": "ba1ba2cb74832c0d490c3513e0a67de0aa6cbdda",
    "title": "An Access Pattern-Aware Hybrid Learning-Based and Conventional Mapping for Solid-State Drives",
    "year": 2024,
    "venue": "International Conference on Computer Aided Design",
    "authors": [
        "Qian Wei",
        "Xiaosu Guo",
        "Jie Wang",
        "Zhaoyan Shen",
        "Dongxiao Yu",
        "Zhiping Jia",
        "Bingzhe Li"
    ],
    "doi": "10.1145/3676536.3676765",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ba1ba2cb74832c0d490c3513e0a67de0aa6cbdda",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Learning-based address mapping strategy has been proposed as an alternative to the conventional one-to-one mapping strategy for logical to physical address translation in flash-based Solid-State Drives (SSDs). This strategy employs a machine learning (ML)-based index to replace the memory-intensive mappings, thereby saving memory space. However, current learning-based mapping strategies mainly focus on the sequential characteristics of I/O workloads, making them less effective in scenarios with frequent updates. In this work, we introduce an access pattern-aware hybrid learning-based and conventional mapping scheme for SSDs, called APH-FTL. This approach features a machine learning-driven data classifier that employs distinct address mapping strategies for data requests with varying access patterns. Additionally, we develop a benefit-guided space regulation strategy to manage in-device memory space effectively and provide a solution to the challenge of mapping policies transformation. We evaluate APH-FTL through simulations using various real-world workloads. Experimental results demonstrate that APH-FTL significantly improves performance, reducing response time by up to 76.59% and write amplification (WA) by up to 82.97% compared with state-of-the-art schemes.",
    "citationCount": 0,
    "referenceCount": 26
}