{
    "paperId": "ba26cd80e2d6ac03157687a7bfcdcb1db3c235f3",
    "title": "FlexSketch: Estimation of Probability Density for Stationary and Non-Stationary Data Streams",
    "year": 2021,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Namuk Park",
        "Songkuk Kim"
    ],
    "doi": "10.3390/s21041080",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ba26cd80e2d6ac03157687a7bfcdcb1db3c235f3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/21/4/1080/pdf?version=1612680193",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient and accurate estimation of the probability distribution of a data stream is an important problem in many sensor systems. It is especially challenging when the data stream is non-stationary, i.e., its probability distribution changes over time. Statistical models for non-stationary data streams demand agile adaptation for concept drift while tolerating temporal fluctuations. To this end, a statistical model needs to forget old data samples and to detect concept drift swiftly. In this paper, we propose FlexSketch, an online probability density estimation algorithm for data streams. Our algorithm uses an ensemble of histograms, each of which represents a different length of data history. FlexSketch updates each histogram for a new data sample and generates probability distribution by combining the ensemble of histograms while monitoring discrepancy between recent data and existing models periodically. When it detects concept drift, a new histogram is added to the ensemble and the oldest histogram is removed. This allows us to estimate the probability density function with high update speed and high accuracy using only limited memory. Experimental results demonstrate that our algorithm shows improved speed and accuracy compared to existing methods for both stationary and non-stationary data streams.",
    "citationCount": 2,
    "referenceCount": 62
}