{
    "paperId": "ba37e782b71f8b4b3590569eca573d07fe773cc0",
    "title": "Scalable Algorithm for Finding Balanced Subgraphs with Tolerance in Signed Networks",
    "year": 2024,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Jingbang Chen",
        "Qiuyang Mang",
        "Hangrui Zhou",
        "Richard Peng",
        "Yu Gao",
        "Chenhao Ma"
    ],
    "doi": "10.1145/3637528.3671674",
    "arxivId": "2402.05006",
    "url": "https://www.semanticscholar.org/paper/ba37e782b71f8b4b3590569eca573d07fe773cc0",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2402.05006",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Signed networks, characterized by edges labeled as either positive or negative, offer nuanced insights into interaction dynamics beyond the capabilities of unsigned graphs. Central to this is the task of identifying the maximum balanced subgraph, crucial for applications like polarized community detection in social networks and portfolio analysis in finance. Traditional models, however, are limited by an assumption of perfect partitioning, which fails to mirror the complexities of real-world data. Addressing this gap, we introduce an innovative generalized balanced subgraph model that incorporates tolerance for imbalance. Our proposed region-based heuristic algorithm, tailored for this NP -hard problem, strikes a balance between low time complexity and high-quality outcomes. Comparative experiments validate its superior performance against leading solutions, delivering enhanced effectiveness (notably larger subgraph sizes) and efficiency (achieving up to 100× speedup) in both traditional and generalized contexts.",
    "citationCount": 0,
    "referenceCount": 38
}