{
    "paperId": "ba612200366e6050cced2d119abcda7a21a039a5",
    "title": "The Concurrent Learned Indexes for Multicore Data Storage",
    "year": 2022,
    "venue": "ACM Transactions on Storage",
    "authors": [
        "Zhaoguo Wang",
        "Haibo Chen",
        "Youyun Wang",
        "Chuzhe Tang",
        "Huan Wang"
    ],
    "doi": "10.1145/3478289",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ba612200366e6050cced2d119abcda7a21a039a5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present XIndex, which is a concurrent index library and designed for fast queries. It includes a concurrent ordered index (XIndex-R) and a concurrent hash index (XIndex-H). Similar to a recent proposal of the learned index, the indexes in XIndex use learned models to optimize index efficiency. Compared with the learned index, for the ordered index, XIndex-R is able to handle concurrent writes effectively and adapts its structure according to runtime workload characteristics. For the hash index, XIndex-H is able to avoid the resize operation blocking concurrent writes. Furthermore, the indexes in XIndex can index string keys much more efficiently than the learned index. We demonstrate the advantages of XIndex with YCSB, TPC-C (KV), which is a TPC-C-inspired benchmark for key-value stores, and micro-benchmarks. Compared with ordered indexes of Masstree and Wormhole, XIndex-R achieves up to 3.2× and 4.4× performance improvement on a 24-core machine. Compared with hash indexes of Intel TBB HashMap, XIndex-H achieves up to 3.1× speedup. The performance further improves by 91% after adding the optimizations on indexing string keys. The library is open-sourced.1",
    "citationCount": 9,
    "referenceCount": 60
}