{
    "paperId": "ba7c5dd868b04d04e771dd8da9e163246d2443d0",
    "title": "Cost-based Selection of Provenance Sketches for Data Skipping",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Ziyu Liu",
        "Boris Glavic"
    ],
    "doi": "10.48550/arXiv.2504.19252",
    "arxivId": "2504.19252",
    "url": "https://www.semanticscholar.org/paper/ba7c5dd868b04d04e771dd8da9e163246d2443d0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Provenance sketches, light-weight indexes that record what data is needed (is relevant) for answering a query, can significantly improve performance of important classes of queries (e.g., HAVING and top-k queries). Given a horizontal partition of a table, a provenance sketch for a query Q records which fragments contain provenance. Once a provenance sketch has been captured for a query, it can be used to speed-up subsequent queries by skipping data that does not belong to a sketch. The size and, thus, also the effectiveness of a provenance sketch is often quite sensitive to the choice of attribute(s) we are partitioning on. In this work, we develop sample-based estimation techniques for the size of provenance sketches akin to a specialized form of approximate query processing. This technique enables the online selection of provenance sketches by estimating the size of sketches for a set of candidate attributes and then creating the sketch that is estimated to yield the largest benefit. We demonstrate experimentally that our estimation is accurate enough to select optimal or near optimal provenance sketches in most cases which in turn leads to a runtime improvement of up to %60 compared to other strategies for selecting provenance sketches.",
    "citationCount": 1,
    "referenceCount": 37
}