{
    "paperId": "bacf607d7734958f700077b65fbb3e9bdeeb66e8",
    "title": "Learning to Accelerate Decomposition for Multi-Directional 3D Printing",
    "year": 2020,
    "venue": "IEEE Robotics and Automation Letters",
    "authors": [
        "Chenming Wu",
        "Yong-Jin Liu",
        "Charlie C.L. Wang"
    ],
    "doi": "10.1109/LRA.2020.3011369",
    "arxivId": "2004.03450",
    "url": "https://www.semanticscholar.org/paper/bacf607d7734958f700077b65fbb3e9bdeeb66e8",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2004.03450.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multi-directional 3D printing has the capability of decreasing or eliminating the need for support structures. Recent work proposed a beam-guided search algorithm to find an optimized sequence of plane-clipping, which gives volume decomposition of a given 3D model. Different printing directions are employed in different regions to fabricate a model with tremendously less support (or even no support in many cases). To obtain optimized decomposition, a large beam width needs to be used in the search algorithm, leading to a very time-consuming computation. In this letter, we propose a learning framework that can accelerate the beam-guided search by using a smaller number of the original beam width to obtain results with similar quality. Specifically, we use the results of beam-guided search with large beam width to train a scoring function for candidate clipping planes based on six newly proposed feature metrics. With the help of these feature metrics, both the current and the sequence-dependent information are captured by the neural network to score candidates of clipping. As a result, we can achieve around $3 \\times$ computational speed. We test and demonstrate our accelerated decomposition on a large dataset of models for 3D printing.",
    "citationCount": 6,
    "referenceCount": 39
}