{
    "paperId": "bb04a08b8d3bb93e3514cdc76f6a4cc29d3aa1b1",
    "title": "HomeDOCtor App: Integrating Medical Knowledge into GPT for Personal Health Counseling",
    "year": 2024,
    "venue": "Proceedings of Chat Gpt in Medicine 2024",
    "authors": [
        "Matic Zadobovšek"
    ],
    "doi": "10.70314/is.2024.chtm.8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bb04a08b8d3bb93e3514cdc76f6a4cc29d3aa1b1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The escalating workload demands on healthcare professionals are leading to systemic overload, resulting in a decline in the efficiency of public health services. This situation necessitates the development of solutions that can alleviate the burden on physicians while ensuring comprehensive patient care. Recent advancements in generative artificial intelligence, particularly in the field of medicine, have demonstrated that large language models (LLMs) can outperform doctors in specific tasks, high-lighting their potential as valuable tools for reducing the strain on healthcare providers. This study focuses on the development of the HomeDOCtor application, which integrates additional validated medical knowledge into the GPT-4o LLM. The objective of this application and the enhanced LLM is to offer users reliable access to a medical chatbot capable of providing accurate and timely responses to health-related inquiries. The chatbot’s behavior has been meticulously tested and refined in collaboration with a team of physicians. The findings of this research offer insights into the development of such systems and explore their potential application within the Slovenian healthcare system.",
    "citationCount": 0,
    "referenceCount": 17
}