{
    "paperId": "bb2f050f033580c0feabf4425e7b6d0231d0a02e",
    "title": "ChIP-Based Nuclear DNA Isolation for Genome Sequencing in Pyropia to Remove Cytosol and Bacterial DNA Contamination",
    "year": 2023,
    "venue": "Plants",
    "authors": [
        "Zehao Zhang",
        "Junhao Wang",
        "Xiaoqian Zhang",
        "X. Guan",
        "Tian Gao",
        "Y. Mao",
        "A. Poetsch",
        "Dongmei Wang"
    ],
    "doi": "10.3390/plants12091883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bb2f050f033580c0feabf4425e7b6d0231d0a02e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2223-7747/12/9/1883/pdf?version=1683274691",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Contamination from cytosolic DNA (plastid and mitochondrion) and epiphytic bacteria is challenging the efficiency and accuracy of genome-wide analysis of nori-producing marine seaweed Pyropia yezoensis. Unlike bacteria and organellar DNA, Pyropia nuclear DNA is closely associated with histone proteins. In this study, we applied Chromatin Immunoprecipitation (ChIP) of histone H3 to isolate nuclear DNA, followed by high-throughput sequencing. More than 99.41% of ChIP-sequencing data were successfully aligned to the reference nuclear genome; this was remarkably higher than those from direct extraction and direct extraction data, in which 40.96% to 42.95% are from plastids. The proportion of data that were mapped to the bacterial database when using ChIP extraction was very low. Additionally, ChIP data can cover up to 89.00% of the nuclear genome, higher than direct extraction data at equal data size and comparable to the latter at equal sequencing depth. The uncovered regions from the three methods are mostly overlapping, suggesting that incomplete sequencing accounts for the missing data, rather than failed chromatin-antibody binding in the ChIP extraction method. This ChIP extraction method can successfully separate nuclear DNA from cytosolic DNA and bacterial DNA, thus overwhelmingly reducing the sequencing cost in a genome resequencing project and providing strictly purified reference data for genome assembly. The method’s applicability to other macroalgae makes it a valuable contribution to the algal research community.",
    "citationCount": 0,
    "referenceCount": 42
}