{
    "paperId": "bb3b5c25dee691c2f429f8396e1e7e327f43dd8e",
    "title": "HybridTSS: A Recursive Scheme Combining Coarse- and Fine- Grained Tuples for Packet Classification",
    "year": 2022,
    "venue": "Asia-Pacific Workshop on Networking",
    "authors": [
        "Yuxi Liu",
        "Yao Xin",
        "Wenjun Li",
        "Haoyu Song",
        "Ori Rottenstreich",
        "Weichao Li",
        "Yi Wang"
    ],
    "doi": "10.1145/3542637.3542644",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bb3b5c25dee691c2f429f8396e1e7e327f43dd8e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The popular OpenFlow virtual switch Open vSwitch (OVS) uses a variant of Tuple Space Search (TSS) for packet classification. Although it is easy for rule updates, the lookup performance is poor. By introducing partial trees into TSS, the recently proposed CutTSS improves the lookup performance of TSS. However, it is challenging to replace TSS in OVS for two reasons: (1) the hand-tuned partitioning heuristics are rule-set dependent; (2) the complex and irregular data structures make it difficult to be integrated and maintained in real systems. To address these issues, we propose HybridTSS, a recursive TSS scheme for fast packet classification in OVS, which exploits three novel ideas: (1) the recursive partitioning based on reinforcement learning balances global rule partitions with low training complexity; (2) a hybrid TSS scheme combining coarse-grained and fine-grained tuples suppresses tuple explosion in TSS; (3) a heterogeneous search algorithm consisting of TSS and linear search adapts to characteristics of rules at different scales for fast lookups. Using ClassBench, we show that, while immune from the main drawbacks of CutTSS, HybridTSS retains the update performance of TSS, and achieves almost an order of magnitude higher lookup performance than TSS, making it an ideal packet classification algorithm for OVS.",
    "citationCount": 8,
    "referenceCount": 49
}