{
    "paperId": "bb4199ac2be15e8977c7d57d9c91fe142a5962f5",
    "title": "Neuromorphic Photonic Computing with an Electro-Optic Analog Memory",
    "year": 2024,
    "venue": "",
    "authors": [
        "Sean Lam",
        "A. Khaled",
        "S. Bilodeau",
        "Bicky A. Marquez",
        "Paul R. Prucnal",
        "L. Chrostowski",
        "B. Shastri",
        "S. Shekhar"
    ],
    "doi": null,
    "arxivId": "2401.16515",
    "url": "https://www.semanticscholar.org/paper/bb4199ac2be15e8977c7d57d9c91fe142a5962f5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence (AI) has seen remarkable advancements across various domains, including natural language processing, computer vision, autonomous vehicles, and biology. However, the rapid expansion of AI technologies has escalated the demand for more powerful computing resources. As digital computing approaches fundamental limits, neuromorphic photonics emerges as a promising platform to complement existing digital systems. In neuromorphic photonic computing, photonic devices are controlled using analog signals. This necessitates the use of digital-to-analog converters (DAC) and analog-to-digital converters (ADC) for interfacing with these devices during inference and training. However, data movement between memory and these converters in conventional von Neumann computing architectures consumes energy. To address this, analog memory co-located with photonic computing devices is proposed. This approach aims to reduce the reliance on DACs and minimize data movement to enhance compute efficiency. This paper demonstrates a monolithically integrated neuromorphic photonic circuit with co-located capacitive analog memory and analyzes analog memory specifications for neuromorphic photonic computing using the MNIST dataset as a benchmark.",
    "citationCount": 1,
    "referenceCount": 83
}