{
    "paperId": "bbae1617b0d7b82f59b22c5ef6c77754c4bf2ccc",
    "title": "Generative AI for Healthcare: Fundamentals, Challenges, and Perspectives",
    "year": 2025,
    "venue": "",
    "authors": [
        "Gang Chen",
        "Changshuo Liu",
        "Gene Anne Ooi",
        "Marcus Tan",
        "Zhongle Xie",
        "Jianwei Yin",
        "J. Yip",
        "Wenqiao Zhang",
        "Jiaqi Zhu",
        "Bengchin Ooi"
    ],
    "doi": null,
    "arxivId": "2510.24551",
    "url": "https://www.semanticscholar.org/paper/bbae1617b0d7b82f59b22c5ef6c77754c4bf2ccc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative Artificial Intelligence (GenAI) is taking the world by storm. It promises transformative opportunities for advancing and disrupting existing practices, including healthcare. From large language models (LLMs) for clinical note synthesis and conversational assistance to multimodal systems that integrate medical imaging, electronic health records, and genomic data for decision support, GenAI is transforming the practice of medicine and the delivery of healthcare, such as diagnosis and personalized treatments, with great potential in reducing the cognitive burden on clinicians, thereby improving overall healthcare delivery. However, GenAI deployment in healthcare requires an in-depth understanding of healthcare tasks and what can and cannot be achieved. In this paper, we propose a data-centric paradigm in the design and deployment of GenAI systems for healthcare. Specifically, we reposition the data life cycle by making the medical data ecosystem as the foundational substrate for generative healthcare systems. This ecosystem is designed to sustainably support the integration, representation, and retrieval of diverse medical data and knowledge. With effective and efficient data processing pipelines, such as semantic vector search and contextual querying, it enables GenAI-powered operations for upstream model components and downstream clinical applications. Ultimately, it not only supplies foundation models with high-quality, multimodal data for large-scale pretraining and domain-specific fine-tuning, but also serves as a knowledge retrieval backend to support task-specific inference via the agentic layer. The ecosystem enables the deployment of GenAI for high-quality and effective healthcare delivery.",
    "citationCount": 0,
    "referenceCount": 110
}