{
    "paperId": "bc163cf1e2ea38be010c6280e86118e263375955",
    "title": "Spatial Information Retrieval in Digital Ecosystems: A Comprehensive Survey",
    "year": 2020,
    "venue": "International ACM Conference on Management of Emergent Digital EcoSystems",
    "authors": [
        "A. Carniel"
    ],
    "doi": "10.1145/3415958.3433038",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc163cf1e2ea38be010c6280e86118e263375955",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spatial information retrieval is a common task of digital ecosystems due to the popularity of collecting and storing spatial information and phenomena in the world of the Internet of Things (IoT). Spatial relationships play an important role in this context by specifying how two or more spatial objects are related or connected. Examples of spatial relationships include topological relationships (e.g., intersect, overlap, contains), metric relationships (e.g., nearest neighbors), and direction relationships (e.g., cardinal directions like north and south). Many works in the literature have proposed definitions and implementations of spatial queries based on specific types of spatial relationships. Hence, a holistic view of these works is important to understand their applicability and relations. This paper advances in the literature by providing a comprehensive survey of the implementations and types of spatial queries that can be used by digital ecosystems. We present a novel characterization based on spatial relationships to define topological-based, metric-based, and direction-based spatial queries. For each type of spatial query, we present its intuitive and formal definitions together with possible strategies of implementation. Further, we identify hybrid spatial queries as combinations of two or more spatial relationships, and spatial joins as generalization cases. In addition, we present some equivalences between some types of queries. As a result, we point out future research topics in spatial information retrieval.",
    "citationCount": 6,
    "referenceCount": 48
}