{
    "paperId": "bc2d2aa5563360c8f459b48e391db9bd9ed6fc47",
    "title": "Counting with Prediction: Rank and Select Queries with Adjusted Anchoring",
    "year": 2022,
    "venue": "Data Compression Conference",
    "authors": [
        "M. O. Külekci"
    ],
    "doi": "10.1109/DCC52660.2022.00049",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc2d2aa5563360c8f459b48e391db9bd9ed6fc47",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rank and select queries are the fundamental building blocks of the compressed data structures. On a given bit string of length $n$, counting the number of set bits up to a certain position is named as the rank, and finding the position of the $k$th set bit is the select query. We present a new data structure and the procedures on it to support rank/select operations. The proposed scheme introduces ($\\frac{\\log 2m}{d}+\\frac{\\log n}{s\\cdot d}$) overhead bits per each bit over the $n$-bits long input bit string, where $d$ is the inner-block size in bits, $s$ is the number of inner-blocks in a super-block, and $m$ is a properly chosen constant modulus value. When compared to the previous two-level hierarchical data structures that generate $(\\frac{\\log(s\\cdot d)}{d}+\\frac{\\log n}{s\\cdot d})$ overhead bits per bit, the new approach reduces the space consumption significantly with proper selection of the parameters. With the new data structure, the rank queries are usually (≈ 90% of the time) executed in $O(t_{d})$ time, where $O(t_{d})$ is the time required to compute a rank in an inner-block of length $d$-bits, which is assumed to be constant via the wide-register instructions in modern processors. Seldom, it may require to investigate more than one block, where on average this is observed to be around two blocks, empirically. We provide probabilistic analyses on how to choose the appropriate parameters and present several trade-offs to guarantee constant-time rank. We also investigate using the same data structure to support the select queries as well. Experimental evaluation of the introduced scheme revealed that the proposed data structure consumes nearly 30%-50% less space than its alternatives by introducing less than 5% overhead, while the speed is either better or very competitive when compared with the current state-of the art implementations both in terms of rank and select.",
    "citationCount": 1,
    "referenceCount": 18
}