{
    "paperId": "bc3b0bce3458f9cd289eebf0e07d269ba26fb1b5",
    "title": "Oxidative stress resistance prompts pyrroloquinoline quinone biosynthesis in Hyphomicrobium denitrificans H4-45",
    "year": 2024,
    "venue": "Applied Microbiology and Biotechnology",
    "authors": [
        "Jiale Liang",
        "Mingjie Tang",
        "Lang Chen",
        "Wenjie Wang",
        "Xinle Liang"
    ],
    "doi": "10.1007/s00253-024-13053-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc3b0bce3458f9cd289eebf0e07d269ba26fb1b5",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00253-024-13053-1.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Pyrroloquinoline quinone (PQQ) is a natural antioxidant with diverse applications in food and pharmaceutical industries. A lot of effort has been devoted toward the discovery of PQQ high-producing microbial species and characterization of biosynthesis, but it is still challenging to achieve a high PQQ yield. In this study, a combined strategy of random mutagenesis and adaptive laboratory evolution (ALE) with fermentation optimization was applied to improve PQQ production in Hyphomicrobium denitrificans H4-45. A mutant strain AE-9 was obtained after nearly 400 generations of UV-LiCl mutagenesis, followed by an ALE process, which was conducted with a consecutive increase of oxidative stress generated by kanamycin, sodium sulfide, and potassium tellurite. In the flask culture condition, the PQQ production in mutant strain AE-9 had an 80.4% increase, and the cell density increased by 14.9% when compared with that of the initial strain H4-45. Moreover, batch and fed-batch fermentation processes were optimized to further improve PQQ production by pH control strategy, methanol and H_2O_2 feed flow, and segmented fermentation process. Finally, the highest PQQ production and productivity of the mutant strain AE-9 reached 307 mg/L and 4.26 mg/L/h in a 3.7-L bioreactor, respectively. Whole genome sequencing analysis showed that genetic mutations in the ftfL gene and thiC gene might contribute to improving PQQ production by enhancing methanol consumption and cell growth in the AE-9 strain. Our study provided a systematic strategy to obtain a PQQ high-producing mutant strain and achieve high production of PQQ in fermentation. These practical methods could be applicable to improve the production of other antioxidant compounds with uncleared regulation mechanisms. Key points • Improvement of PQQ production by UV-LiCl mutagenesis combined with adaptive laboratory evolution (ALE) and fermentation optimization. • A consecutive increase of oxidative stress could be used as the antagonistic factor for ALE to enhance PQQ production. • Mutations in the ftfL gene and thiC gene indicated that PQQ production might be increased by enhancing methanol consumption and cell growth.",
    "citationCount": 2,
    "referenceCount": 53
}