{
    "paperId": "bc59310d14d04986b8ee0ae72937ee3290f68a10",
    "title": "Role of Imaging and AI in the Evaluation of COVID-19 Infection: A Comprehensive Survey.",
    "year": 2022,
    "venue": "Frontiers in Bioscience",
    "authors": [
        "Mayada Elgendy",
        "H. M. Balaha",
        "M. Shehata",
        "A. Alksas",
        "M. Ghoneim",
        "Fatma Sherif",
        "Ali H. Mahmoud",
        "Ahmed Elgarayhi",
        "F. Taher",
        "M. Sallah",
        "M. Ghazal",
        "A. El-Baz"
    ],
    "doi": "10.31083/j.fbl2709276",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc59310d14d04986b8ee0ae72937ee3290f68a10",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.imrpress.com/journal/FBL/27/9/10.31083/j.fbl2709276/pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Coronavirus disease 2019 (COVID-19) is a respiratory illness that started and rapidly became the pandemic of the century, as the number of people infected with it globally exceeded 253.4 million. Since the beginning of the pandemic of COVID-19, over two years have passed. During this hard period, several defies have been coped by the scientific society to know this novel disease, evaluate it, and treat affected patients. All these efforts are done to push back the spread of the virus. This article provides a comprehensive review to learn about the COVID-19 virus and its entry mechanism, its main repercussions on many organs and tissues of the body, identify its symptoms in the short and long terms, in addition to recognize the role of diagnosis imaging in COVID-19. Principally, the quick evolution of active vaccines act an exceptional accomplishment where leaded to decrease rate of death worldwide. However, some hurdels still have to be overcome. Many proof referrers that infection with CoV-19 causes neurological dis function in a substantial ratio of influenced patients, where these symptoms appear severely during the infection and still less is known about the potential long term consequences for the brain, where Loss of smell is a neurological sign and rudimentary symptom of COVID-19. Hence, we review the causes of olfactory bulb dysfunction and Anosmia associated with COVID-19, the latest appropriate therapeutic strategies for the COVID-19 treatment (e.g., the ACE2 strategy and the Ang II receptor), and the tests through the follow-up phases. Additionally, we discuss the long-term complications of the virus and thus the possibility of improving therapeutic strategies. Moreover, the main steps of artificial intelligence that have been used to foretell and early diagnose COVID-19 are presented, where Artificial intelligence, especially machine learning is emerging as an effective approach for diagnostic image analysis with performance in the discriminate diagnosis of injuries of COVID-19 on multiple organs, comparable to that of human practitioners. The followed methodology to prepare the current survey is to search the related work concerning the mentioned topic from different journals, such as Springer, Wiley, and Elsevier. Additionally, different studies have been compared, the results are collected and then reported as shown. The articles are selected based on the year (i.e., the last three years). Also, different keywords were checked (e.g., COVID-19, COVID-19 Treatment, COVID-19 Symptoms, and COVID-19 and Anosmia).",
    "citationCount": 10,
    "referenceCount": 148
}