{
    "paperId": "bc7f6664ca1ca1e8b28433056e4ab71f653313ea",
    "title": "Data Systems Education: Curriculum Recommendations, Course Syllabi, and Industry Needs",
    "year": 2025,
    "venue": "ITiCSE-WGR",
    "authors": [
        "Daphne Miedema",
        "Toni Taipalus",
        "V. Ajanovski",
        "Abdussalam Alawini",
        "Martin Goodfellow",
        "Michael Liut",
        "Svetlana Peltsverger",
        "Tiffany Young"
    ],
    "doi": "10.1145/3689187.3709609",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc7f6664ca1ca1e8b28433056e4ab71f653313ea",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data systems have been an important part of computing curricula for decades, and an integral part of data-focused industry roles such as software developers, data engineers, and data scientists. However, the field of data systems encompasses a large number of topics ranging from data manipulation and database distribution to creating data pipelines and data analytics solutions. Due to the slow nature of curriculum development, it remains unclear (i) which data systems topics are recommended across diverse higher education curriculum guidelines, (ii) which topics are taught in higher education data systems courses, and (iii) which data systems topics are actually valued in data-focused industry roles. In this study, we analyzed computing curriculum guidelines, course contents, and industry needs regarding data systems to uncover discrepancies between them. Our results show, for example, that topics such as data visualization, data warehousing, and semi-structured data models are valued in industry, yet seldom taught in courses. This work allows professionals to further align curriculum guidelines, higher education, and data systems industry to better prepare students for their working life by focusing on relevant skills in data systems education.",
    "citationCount": 1,
    "referenceCount": 131
}