{
    "paperId": "bc90ec70e56ce35b959f237f14daa49814638994",
    "title": "Online Facility Location with Weights and Congestion",
    "year": 2022,
    "venue": "Foundations of Software Technology and Theoretical Computer Science",
    "authors": [
        "Arghya Chakraborty",
        "R. Vaze"
    ],
    "doi": "10.4230/LIPIcs.FSTTCS.2023.6",
    "arxivId": "2211.11961",
    "url": "https://www.semanticscholar.org/paper/bc90ec70e56ce35b959f237f14daa49814638994",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The classic online facility location problem deals with finding the optimal set of facilities in an online fashion when demand requests arrive one at a time and facilities need to be opened to service these requests. In this work, we study two variants of the online facility location problem; (1) weighted requests and (2) congestion. Both of these variants are motivated by their applications to real life scenarios and the previously known results on online facility location cannot be directly adapted to analyse them. Weighted requests: In this variant, each demand request is a pair $(x,w)$ where $x$ is the standard location of the demand while $w$ is the corresponding weight of the request. The cost of servicing request $(x,w)$ at facility $F$ is $w\\cdot d(x,F)$. For this variant, given $n$ requests, we present an online algorithm attaining a competitive ratio of $\\mathcal{O}(\\log n)$ in the secretarial model for the weighted requests and show that it is optimal. Congestion: The congestion variant considers the case when there is an additional congestion cost that grows with the number of requests served by each facility. For this variant, when the congestion cost is a monomial, we show that there exists an algorithm attaining a constant competitive ratio. This constant is a function of the exponent of the monomial and the facility opening cost but independent of the number of requests.",
    "citationCount": 0,
    "referenceCount": 22
}