{
    "paperId": "bc94d32343acaa681c30c1016c6eca52757720af",
    "title": "Federated Learning: A Cutting-Edge Survey of the Latest Advancements and Applications",
    "year": 2023,
    "venue": "Computer Communications",
    "authors": [
        "Azim Akhtarshenas",
        "Mohammad Ali Vahedifar",
        "Navid Ayoobi",
        "B. Maham",
        "Tohid Alizadeh",
        "Sina Ebrahimi"
    ],
    "doi": "10.48550/arXiv.2310.05269",
    "arxivId": "2310.05269",
    "url": "https://www.semanticscholar.org/paper/bc94d32343acaa681c30c1016c6eca52757720af",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.05269",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Robust machine learning (ML) models can be developed by leveraging large volumes of data and distributing the computational tasks across numerous devices or servers. Federated learning (FL) is a technique in the realm of ML that facilitates this goal by utilizing cloud infrastructure to enable collaborative model training among a network of decentralized devices. Beyond distributing the computational load, FL targets the resolution of privacy issues and the reduction of communication costs simultaneously. To protect user privacy, FL requires users to send model updates rather than transmitting large quantities of raw and potentially confidential data. Specifically, individuals train ML models locally using their own data and then upload the results in the form of weights and gradients to the cloud for aggregation into the global model. This strategy is also advantageous in environments with limited bandwidth or high communication costs, as it prevents the transmission of large data volumes. With the increasing volume of data and rising privacy concerns, alongside the emergence of large-scale ML models like Large Language Models (LLMs), FL presents itself as a timely and relevant solution. It is therefore essential to review current FL algorithms to guide future research that meets the rapidly evolving ML demands. This survey provides a comprehensive analysis and comparison of the most recent FL algorithms, evaluating them on various fronts including mathematical frameworks, privacy protection, resource allocation, and applications. Beyond summarizing existing FL methods, this survey identifies potential gaps, open areas, and future challenges based on the performance reports and algorithms used in recent studies. This survey enables researchers to readily identify existing limitations in the FL field for further exploration.",
    "citationCount": 8,
    "referenceCount": 267
}