{
    "paperId": "bc9d720a70bfce9a2ed0a92a9a42ed03671cc348",
    "title": "IronMan-Pro: Multiobjective Design Space Exploration in HLS via Reinforcement Learning and Graph Neural Network-Based Modeling",
    "year": 2023,
    "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "authors": [
        "Nan Wu",
        "Yuan Xie",
        "Cong Hao"
    ],
    "doi": "10.1109/TCAD.2022.3185540",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bc9d720a70bfce9a2ed0a92a9a42ed03671cc348",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite the great success of high-level synthesis (HLS) tools, we observe several unresolved challenges: 1) the high-level abstraction of HLS programming styles sometimes conceals optimization opportunities; 2) the actual quality of resulting RTL designs is hard to predict; and 3) existing HLS tools do not provide flexible tradeoff (Pareto) solutions among different objectives and constraints. To this end, we propose an end-to-end framework, namely, IronMan-Pro. The primary goal is to enable a flexible and automated design space exploration (DSE), to provide either optimized solutions under user-specified constraints or Pareto tradeoffs among different objectives (such as resource types, area, and latency). IronMan-Pro consists of three components: 1) GPP, a highly accurate graph-neural-network-based performance and resource predictor; 2) RLMD, a reinforcement-learning-based multiobjective design exploration engine for optimal resource allocation strategies, aiming to provide Pareto solutions among different objectives; and 3) CT, a code transformer to assist RLMD and GPP, which extracts the data flow graphs from original HLS C/C++ and automatically generates synthesizable code with optimized HLS directives. Experimental results show that, 1) GPP achieves high prediction accuracy, reducing the prediction errors of HLS tools by <inline-formula> <tex-math notation=\"LaTeX\">$10.9\\times $ </tex-math></inline-formula> in resource utilization and <inline-formula> <tex-math notation=\"LaTeX\">$5.7\\times $ </tex-math></inline-formula> in critical path (CP) timing; 2) compared with meta-heuristic-based techniques, IronMan-Pro generates superior solutions improving resource utilization by <inline-formula> <tex-math notation=\"LaTeX\">$16.0\\% \\sim 29.5\\%$ </tex-math></inline-formula> and CP timing by 7.6%–16.5%; and 3) under user-specified constraints, IronMan-Pro can find satisfying solutions over 96% of the cases, more than twice as many as that of meta-heuristic-based techniques and with a speedup of up to <inline-formula> <tex-math notation=\"LaTeX\">$400\\times $ </tex-math></inline-formula>. This work demonstrates the great potential of applying machine learning algorithms in the electronic design automation domain, especially for the hard-to-solve problems, such as timing estimation and optimization. IronMan-Pro is available at <uri>https://github.com/lydiawunan/IronMan</uri>.",
    "citationCount": 53,
    "referenceCount": 59
}