{
    "paperId": "bcacc8e1ecc3db0cdc1c19ba2ba9e82e31608562",
    "title": "RAOP: Recurrent Neural Network Augmented Offset Prefetcher",
    "year": 2020,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "Pengmiao Zhang",
        "Ajitesh Srivastava",
        "Benjamin Brooks",
        "R. Kannan",
        "V. Prasanna"
    ],
    "doi": "10.1145/3422575.3422807",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bcacc8e1ecc3db0cdc1c19ba2ba9e82e31608562",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid development of Big Data coupled with slowing down of Moore’s law has made the memory performance a bottleneck in the von Neumann architecture. Machine learning has the potential to provide opportunities to address the memory performance issues, specifically through data access prediction. While recent works focusing on the prediction of memory accesses have used recurrent neural networks (RNN), there is a lack of a framework utilizing such prediction in a prefetcher. This paper introduces the RNN Augmented Offset Prefetcher (RAOP) framework, which consists of two parts: an RNN-based predictor and an offset prefetching module. By leveraging the RNN predicted access as a temporal reference, RAOP improves prefetching performance by executing offset prefetching for both the current address and the RNN predicted address. We implement the RNN in the predictor with a compressed long short-term memory (LSTM) model and demonstrate the effect of augmenting an RNN predictor to a simple next-line prefetcher in the prefetching module results in 3.22x, 4.2x, and 15.6% improvement in prefetch accuracy, coverage, and speedup. We further implement a best-offset prefetcher (BOP) in RAOP and compare it to several state-of-the-art prefetchers. Results show that RAOP achieves a mean 4.05% speedup by prefetching in last level cache, outperforming state-of-the-art prefetchers. By augmenting an RNN predictor to BOP, RAOP results in 6.5x, 9.2x, and 12.8% improvement in prefetch accuracy, coverage, and speedup.",
    "citationCount": 24,
    "referenceCount": 33
}