{
    "paperId": "bcd57a512111c8da7c1e926f68dc89e350ffdae7",
    "title": "The Effects of Logistics Websites’ Technical Factors on the Optimization of Digital Marketing Strategies and Corporate Brand Name",
    "year": 2022,
    "venue": "Processes",
    "authors": [
        "D. Sakas",
        "Dimitrios P. Reklitis",
        "P. Trivellas",
        "C. Vassilakis",
        "Marina C. Terzi"
    ],
    "doi": "10.3390/pr10050892",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bcd57a512111c8da7c1e926f68dc89e350ffdae7",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2227-9717/10/5/892/pdf?version=1652693393",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In a world overwhelmed with unstructured information, logistics companies increasingly depend on their websites to acquire new customers and maintain existing ones. Following this rationale, a series of technical elements may set the ground for differentiating one logistics website from another. Nevertheless, a suitable digital marketing strategy should be adopted in order to build competitive advantage. In this paper, the authors attempt to respond by implementing an innovative methodology building on web analytics and big data. The first phase of the research collects data for 180 days from 7 world-leading logistics companies. The second phase presents the statistical analysis of the gathered data, including regression, correlations, and descriptive statistics. Subsequently, Fuzzy Cognitive Mapping (FCM) was employed to illustrate the cause-and-effect links among the metrics in question. Finally, a predictive simulation model is developed to show the intercorrelation among the metrics studied as well as various optimization strategies. Research findings reveal a significant correlation between the logistics websites’ technical factors and the growth of the corporate brand name.",
    "citationCount": 7,
    "referenceCount": 103
}