{
    "paperId": "bceebd434d7502dcd87004ec7313c2eea2c512fc",
    "title": "A Survey for Efficient Open Domain Question Answering",
    "year": 2022,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Qin Zhang",
        "Shan Chen",
        "Dongkuan Xu",
        "Qingqing Cao",
        "Xiaojun Chen",
        "Trevor Cohn",
        "Meng Fang"
    ],
    "doi": "10.48550/arXiv.2211.07886",
    "arxivId": "2211.07886",
    "url": "https://www.semanticscholar.org/paper/bceebd434d7502dcd87004ec7313c2eea2c512fc",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2211.07886",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Open domain question answering (ODQA) is a longstanding task aimed at answering factual questions from a large knowledge corpus without any explicit evidence in natural language processing (NLP). Recent works have predominantly focused on improving the answering accuracy and have achieved promising progress. However, higher accuracy often requires more memory consumption and inference latency, which might not necessarily be efficient enough for direct deployment in the real world. Thus, a trade-off between accuracy, memory consumption and processing speed is pursued. In this paper, we will survey recent advancements in the efficiency of ODQA models and conclude core techniques for achieving efficiency. Additionally, we will provide a quantitative analysis of memory cost, query speed, accuracy, and overall performance comparison. Our goal is to keep scholars informed of the latest advancements and open challenges in ODQA efficiency research and contribute to the further development of ODQA efficiency.",
    "citationCount": 38,
    "referenceCount": 96
}