{
    "paperId": "bd09c0d10c5718cfc4403033e55433c5bbad41b8",
    "title": "Structural Health Prediction Method for Pipelines Subjected to Seismic Liquefaction-Induced Displacement via FEM and AutoML",
    "year": 2025,
    "venue": "Processes",
    "authors": [
        "Ning Shi",
        "Tianwei Kong",
        "Wancheng Ding",
        "Xianbin Zheng",
        "Hong Zhang",
        "Xiaoben Liu"
    ],
    "doi": "10.3390/pr13072163",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bd09c0d10c5718cfc4403033e55433c5bbad41b8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study investigates the mechanical behavior and safety performance of buried natural gas pipelines crossing seismically active fault zones and liquefaction-prone areas, with particular application to the China–Russia East-Route Natural Gas Pipeline. The research combines experimental testing, numerical simulation, and machine learning to develop an advanced framework for pipeline safety assessment under seismic loading conditions. A series of large-scale pipe–soil interaction experiments were conducted under seismic-frequency cyclic loading, leading to the development of a modified soil spring model that accurately captures the nonlinear soil-resistance characteristics during seismic events. Unlike prior studies focusing on static or specific seismic conditions, this work uniquely integrates real cyclic loading test data to develop a frequency-dependent soil spring model, significantly enhancing the physical basis for dynamic soil–pipeline interaction simulation. Finite element analyses were systematically performed to evaluate pipeline response under liquefaction-induced ground displacement, considering key influencing factors including liquefaction zone length, seismic wave frequency content, operational pressure, and pipe wall thickness. An innovative machine learning-based predictive model was developed by integrating LightGBM, XGBoost, and CatBoost algorithms, achieving remarkable prediction accuracy for pipeline strain (R2 > 0.999, MAPE < 1%). This high accuracy represents a significant improvement over conventional analytical methods and enables rapid safety assessment. The findings provide robust theoretical support for pipeline routing and seismic design in high-risk zones, enhancing the safety and reliability of energy infrastructure.",
    "citationCount": 0,
    "referenceCount": 18
}