{
    "paperId": "bd225ebda29f1415f8f346a92b3dca43ea7622ea",
    "title": "Control for multifunctionality: bioinspired control based on feeding in Aplysia californica",
    "year": 2020,
    "venue": "Biological cybernetics",
    "authors": [
        "V. Webster-Wood",
        "Jeffrey P. Gill",
        "P. Thomas",
        "H. Chiel"
    ],
    "doi": "10.1007/s00422-020-00851-9",
    "arxivId": "2008.04978",
    "url": "https://www.semanticscholar.org/paper/bd225ebda29f1415f8f346a92b3dca43ea7622ea",
    "isOpenAccess": true,
    "openAccessPdf": "https://europepmc.org/articles/pmc8543386?pdf=render",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Animals exhibit remarkable feats of behavioral flexibility and multifunctional control that remain challenging for robotic systems. The neural and morphological basis of multifunctionality in animals can provide a source of bioinspiration for robotic controllers. However, many existing approaches to modeling biological neural networks rely on computationally expensive models and tend to focus solely on the nervous system, often neglecting the biomechanics of the periphery. As a consequence, while these models are excellent tools for neuroscience, they fail to predict functional behavior in real time, which is a critical capability for robotic control. To meet the need for real-time multifunctional control, we have developed a hybrid Boolean model framework capable of modeling neural bursting activity and simple biomechanics at speeds faster than real time. Using this approach, we present a multifunctional model of Aplysia californica feeding that qualitatively reproduces three key feeding behaviors (biting, swallowing, and rejection), demonstrates behavioral switching in response to external sensory cues, and incorporates both known neural connectivity and a simple bioinspired mechanical model of the feeding apparatus. We demonstrate that the model can be used for formulating testable hypotheses and discuss the implications of this approach for robotic control and neuroscience.",
    "citationCount": 16,
    "referenceCount": 183
}