{
    "paperId": "bd29458e2f46280deed89b7d317cf225afb753c7",
    "title": "Meta-PDE: Learning to Solve PDEs Quickly Without a Mesh",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Tian Qin",
        "Alex Beatson",
        "Deniz Oktay",
        "Nick McGreivy",
        "Ryan P. Adams"
    ],
    "doi": "10.48550/arXiv.2211.01604",
    "arxivId": "2211.01604",
    "url": "https://www.semanticscholar.org/paper/bd29458e2f46280deed89b7d317cf225afb753c7",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.01604",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Partial differential equations (PDEs) are often computationally challenging to solve, and in many settings many related PDEs must be be solved either at every timestep or for a variety of candidate boundary conditions, parameters, or geometric domains. We present a meta-learning based method which learns to rapidly solve problems from a distribution of related PDEs. We use meta-learning (MAML and LEAP) to identify initializations for a neural network representation of the PDE solution such that a residual of the PDE can be quickly minimized on a novel task. We apply our meta-solving approach to a nonlinear Poisson's equation, 1D Burgers' equation, and hyperelasticity equations with varying parameters, geometries, and boundary conditions. The resulting Meta-PDE method finds qualitatively accurate solutions to most problems within a few gradient steps; for the nonlinear Poisson and hyper-elasticity equation this results in an intermediate accuracy approximation up to an order of magnitude faster than a baseline finite element analysis (FEA) solver with equivalent accuracy. In comparison to other learned solvers and surrogate models, this meta-learning approach can be trained without supervision from expensive ground-truth data, does not require a mesh, and can even be used when the geometry and topology varies between tasks.",
    "citationCount": 14,
    "referenceCount": 30
}