{
    "paperId": "bd54d6e2e342c7e256411e4c3e782ab7dfe7bfa6",
    "title": "NCI Cancer Research Data Commons: Lessons Learned and Future State",
    "year": 2024,
    "venue": "Cancer Research",
    "authors": [
        "Erika Kim",
        "Tanja M Davidsen",
        "Brandi Davis-Dusenbery",
        "Alexander Baumann",
        "Angela Maggio",
        "Zhaoyi Chen",
        "D. Meerzaman",
        "Esmeralda Casas-Silva",
        "David Pot",
        "Todd Pihl",
        "John Otridge",
        "E. Shalley",
        "The Crdc Program",
        "J. Barnholtz-Sloan",
        "A. Kerlavage"
    ],
    "doi": "10.1158/0008-5472.CAN-23-2730",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bd54d6e2e342c7e256411e4c3e782ab7dfe7bfa6",
    "isOpenAccess": true,
    "openAccessPdf": "https://aacrjournals.org/cancerres/article-pdf/doi/10.1158/0008-5472.CAN-23-2730/3423146/can-23-2730.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract More than ever, scientific progress in cancer research hinges on our ability to combine datasets and extract meaningful interpretations to better understand diseases and ultimately inform the development of better treatments and diagnostic tools. To enable the successful sharing and use of big data, the NCI developed the Cancer Research Data Commons (CRDC), providing access to a large, comprehensive, and expanding collection of cancer data. The CRDC is a cloud-based data science infrastructure that eliminates the need for researchers to download and store large-scale datasets by allowing them to perform analysis where data reside. Over the past 10 years, the CRDC has made significant progress in providing access to data and tools along with training and outreach to support the cancer research community. In this review, we provide an overview of the history and the impact of the CRDC to date, lessons learned, and future plans to further promote data sharing, accessibility, interoperability, and reuse. See related articles by Brady et al., p. 1384, Wang et al., p. 1388, and Pot et al., p. 1396",
    "citationCount": 6,
    "referenceCount": 20
}