{
    "paperId": "bd842f96b05ff10c9b6a0a880ca1e528c5c1b813",
    "title": "Navigating Tabular Data Synthesis Research Understanding User Needs and Tool Capabilities",
    "year": 2024,
    "venue": "SIGMOD record",
    "authors": [
        "M. Davila R.",
        "Sven Groen",
        "Fabian Panse",
        "Wolfram Wingerath"
    ],
    "doi": "10.1145/3712311.3712315",
    "arxivId": "2405.20959",
    "url": "https://www.semanticscholar.org/paper/bd842f96b05ff10c9b6a0a880ca1e528c5c1b813",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In an era of rapidly advancing data-driven applications, there is a growing demand for data in both research and practice. Synthetic data have emerged as an alternative when there are not enough real data available or when these data may not be shared (e.g., due to privacy regulations). Synthesizing tabular data presents unique and complex challenges, especially handling (i) missing values, (ii) dataset imbalance, (iii) diverse column types, and (iv) complex data distributions, as well as preserving (v) column correlations, (vi) temporal dependencies, and (vii) integrity constraints (e.g., functional dependencies) present in the original dataset. Although significant progress has been made recently in the development of generational models, there is no one-size-fitsall solution for tabular data today and choosing the right tool for a particular use case remains a difficult task. In this paper, we survey the state of the art in Tabular Data Synthesis (TDS) and examine user needs by defining a set of functional and non-functional requirements. We also evaluate the reported performance of 37 TDS research tools on these requirements, develop a tool selection guide to help users find a suitable TDS tool for their use case, and identify open challenges in TDS research, especially with respect to data management.",
    "citationCount": 6,
    "referenceCount": 137
}