{
    "paperId": "bd9c720dca6fcb80d423ea12df7fb377e3f72b2b",
    "title": "The Psychological Health Counseling Management System Based on the Apriori Algorithm",
    "year": 2024,
    "venue": "2024 International Conference on Machine Intelligence and Digital Applications",
    "authors": [
        "Mengli Cheng",
        "Yu Hua",
        "Jin Deng",
        "Ying He",
        "Banting Peng",
        "Tingting Cheng",
        "Qiang Zhou"
    ],
    "doi": "10.1145/3662739.3672189",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bd9c720dca6fcb80d423ea12df7fb377e3f72b2b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aiming at the problem that the conventional healthcare consulting management system is too heavy and bad, this article puts forward an Apriori Algorithm for Health Consulting Management System. The system analyzes user health consultation history data, uses Apriori algorithm to mine association rules of user health needs, and recommends personalized health consultation services to users based on these rules. The experimental results show that after extensive experimental verification, the data mining accuracy of the system designed in this paper generally exceeds 93.6%. After 500 experiments, its accuracy can reach 96.8%. The data mining accuracy of the other three systems is around 80%, which is still far behind our system. Therefore, we can partition the user psychological counseling database and then use the Apriori algorithm to mine the data, which can better ensure the data quality of the system. The mean computing time of this system is 5.1 s, and the calculation time of other systems is 3 ∼ 4 times as long as that of this thesis. Conclusion: This system is safe and reliable, with short running time and good overall performance. It can effectively improve user satisfaction and the quality of health consulting services and has good application prospects.",
    "citationCount": 0,
    "referenceCount": 24
}