{
    "paperId": "bdbef82dcbf78076d448d6433e94cd8d2c3fdfd9",
    "title": "Matting by Classification",
    "year": 2022,
    "venue": "IEEE International Conference on Systems, Man and Cybernetics",
    "authors": [
        "Zhixiong Zhou",
        "Jieke Jiang",
        "Jin Zhou",
        "Zhenhua Wang"
    ],
    "doi": "10.1109/SMC53654.2022.9945476",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bdbef82dcbf78076d448d6433e94cd8d2c3fdfd9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Natural image matting, since its born, has been regarded as a regression problem. Some previous works show the classification attributes in image matting are of great potential. Here we further explore the attributes to solve the matting problem in a pure classification way, which outperforms its regressive counterpart. We delved into the characteristics of $\\alpha$ on alpha mattes. Then we chop the continuous alpha value from 0 to 1 into 21 segments, each of which accounts for one class. The 21 classes are encoded by a simple number from 0 to 20 and each class represents a corresponding alpha value. Thus each pixel in image belongs to one class. Our model can be trained with both classification loss and regression loss. The latter loss is implemented with soft-argmax, which makes the selection of maximum index differentiable. Through softargmax, our model can be aware of the distance relationship among all classes. Moreover, we find this strategy enables the two kinds of losses to promote each other during training, which allows our model converge further.",
    "citationCount": 0,
    "referenceCount": 36
}