{
    "paperId": "bdbe2c1a430d8a15d20964bfd5d7e828ccae73d0",
    "title": "Querying Large Language Models with SQL",
    "year": 2023,
    "venue": "International Conference on Extending Database Technology",
    "authors": [
        "Mohammed Saeed",
        "Nicola De Cao",
        "Paolo Papotti"
    ],
    "doi": "10.48550/arXiv.2304.00472",
    "arxivId": "2304.00472",
    "url": "https://www.semanticscholar.org/paper/bdbe2c1a430d8a15d20964bfd5d7e828ccae73d0",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2304.00472",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In many use-cases, information is stored in text but not available in structured data. However, extracting data from natural language text to precisely fit a schema, and thus enable querying, is a challenging task. With the rise of pre-trained Large Language Models (LLMs), there is now an effective solution to store and use information extracted from massive corpora of text documents. Thus, we envision the use of SQL queries to cover a broad range of data that is not captured by traditional databases by tapping the information in LLMs. To ground this vision, we present Galois, a prototype based on a traditional database architecture, but with new physical operators for querying the underlying LLM. The main idea is to execute some operators of the the query plan with prompts that retrieve data from the LLM. For a large class of SQL queries, querying LLMs returns well structured relations, with encouraging qualitative results. Preliminary experimental results make pre-trained LLMs a promising addition to the field of database systems, introducing a new direction for hybrid query processing. However, we pinpoint several research challenges that must be addressed to build a DBMS that exploits LLMs. While some of these challenges necessitate integrating concepts from the NLP literature, others offer novel research avenues for the DB community.",
    "citationCount": 41,
    "referenceCount": 62
}