{
    "paperId": "bdd769eb1bfa6bfca6d58538f5f2f18927f29726",
    "title": "Advances of machine learning in materials science: Ideas and techniques",
    "year": 2023,
    "venue": "Frontiers of Physics",
    "authors": [
        "S. Chong",
        "Yi Sheng Ng",
        "Hui‐Qiong Wang",
        "Jin-Cheng Zheng"
    ],
    "doi": "10.1007/s11467-023-1325-z",
    "arxivId": "2307.14032",
    "url": "https://www.semanticscholar.org/paper/bdd769eb1bfa6bfca6d58538f5f2f18927f29726",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s11467-023-1325-z.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this big data era, the use of large dataset in conjunction with machine learning (ML) has been increasingly popular in both industry and academia. In recent times, the field of materials science is also undergoing a big data revolution, with large database and repositories appearing everywhere. Traditionally, materials science is a trial-and-error field, in both the computational and experimental departments. With the advent of machine learning-based techniques, there has been a paradigm shift: materials can now be screened quickly using ML models and even generated based on materials with similar properties; ML has also quietly infiltrated many sub-disciplinary under materials science. However, ML remains relatively new to the field and is expanding its wing quickly. There are a plethora of readily-available big data architectures and abundance of ML models and software; The call to integrate all these elements in a comprehensive research procedure is becoming an important direction of material science research. In this review, we attempt to provide an introduction and reference of ML to materials scientists, covering as much as possible the commonly used methods and applications, and discussing the future possibilities.",
    "citationCount": 50,
    "referenceCount": 384
}