{
    "paperId": "bdd9cdbfbb0e4f7a84f6e7e5949b8ce8c387898d",
    "title": "Multistage transfer learning for medical images",
    "year": 2024,
    "venue": "Artificial Intelligence Review",
    "authors": [
        "Gelan Ayana",
        "Kokeb Dese",
        "Ahmed Mohammed Abagaro",
        "K. C. Jeong",
        "Soon‐Do Yoon",
        "Se-woon Choe"
    ],
    "doi": "10.1007/s10462-024-10855-7",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bdd9cdbfbb0e4f7a84f6e7e5949b8ce8c387898d",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10462-024-10855-7.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning is revolutionizing various domains and significantly impacting medical image analysis. Despite notable progress, numerous challenges remain, necessitating the refinement of deep learning algorithms for optimal performance in medical image analysis. This paper explores the growing demand for precise and robust medical image analysis by focusing on an advanced deep learning technique, multistage transfer learning. Over the past decade, multistage transfer learning has emerged as a pivotal strategy, particularly in overcoming challenges associated with limited medical data and model generalization. However, the absence of well-compiled literature capturing this development remains a notable gap in the field. This exhaustive investigation endeavors to address this gap by providing a foundational understanding of how multistage transfer learning approaches confront the unique challenges posed by insufficient medical image datasets. The paper offers a detailed analysis of various multistage transfer learning types, architectures, methodologies, and strategies deployed in medical image analysis. Additionally, it delves into intrinsic challenges within this framework, providing a comprehensive overview of the current state while outlining potential directions for advancing methodologies in future research. This paper underscores the transformative potential of multistage transfer learning in medical image analysis, providing valuable guidance to researchers and healthcare professionals.",
    "citationCount": 21,
    "referenceCount": 85
}