{
    "paperId": "bdf5da0201e0b1b372540c31fbdbb61aab14dbe7",
    "title": "Carbyne: An Ultra-Lightweight DoS-Resilient Mempool for Bitcoin",
    "year": 2025,
    "venue": "Blockchain: Research and Applications",
    "authors": [
        "Hina Binte Haq",
        "Syed Taha Ali",
        "Asad Salman",
        "Patrick McCorry",
        "S. F. Shahandashti"
    ],
    "doi": "10.48550/arXiv.2504.16089",
    "arxivId": "2504.16089",
    "url": "https://www.semanticscholar.org/paper/bdf5da0201e0b1b372540c31fbdbb61aab14dbe7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increasing adoption of cryptocurrencies has significantly amplified the resource requirements for operating full nodes, creating substantial barriers to entry. Unlike miners, who are financially incentivized through block rewards and transaction fees, full nodes lack direct economic compensation for their critical role in maintaining the network. A key resource burden is the transaction pool, which is particularly memory-intensive as it temporarily stores unconfirmed transactions awaiting verification and propagation across the network. We present Neonpool, a novel optimization for transaction pool leveraging bloom filter variants to drastically reduce memory consumption by up to 200 (e.g., 400 MB to 2 MB) while maintaining over 99.99% transaction processing accuracy. Implemented in C++ and evaluated on unique Bitcoin and Ethereum datasets, Neonpool enables efficient operation on lightweight clients, such as smartphones, IoT devices, and systems-on-a-chip, without requiring a hard fork. By lowering the cost of node participation, Neonpool enhances decentralization and strengthens the overall security and robustness of cryptocurrency networks.",
    "citationCount": 2,
    "referenceCount": 114
}