{
    "paperId": "bdfa1985004b9bc357db35c7463afe8e3c3b273e",
    "title": "Advancing human-robot interaction in a manufacturing environment by incorporating hand movements for remote control",
    "year": 2023,
    "venue": "2023 IEEE International Conference on Networking, Sensing and Control (ICNSC)",
    "authors": [
        "Rim Slama",
        "Ilhem Slama",
        "Pierre R. L. Slangen",
        "O. Ben-Ammar"
    ],
    "doi": "10.1109/ICNSC58704.2023.10318994",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bdfa1985004b9bc357db35c7463afe8e3c3b273e",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.science/hal-04267721/file/ICNCS_2023_Marseille_SSPB.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, there has been a notable shift in manual assembly tasks being replaced by robots. These robots are controlled by operators using keyboards. To enhance this practice, we have introduced a remote human-robot collaboration system. This system allows operators to remotely control robots using hand gestures, utilizing an online hand gesture recognition system. A model-driven display system has been implemented to complement the remote robot control system.For data acquisition, we have carefully selected Leap Motion technology. The designed approach for remote hand gesture recognition has been implemented and tested for accuracy and response time using the well-known SHREC’21 Gesture Benchmark. The final analysis demonstrates the significant potential of the developed system in improving assembly processes and environments. It optimizes various key performance indicators, leading to enhanced efficiency and effectiveness.",
    "citationCount": 3,
    "referenceCount": 26
}