{
    "paperId": "be0bbf06977c4dadbf702287733187884a531b8a",
    "title": "Edge Artificial Intelligence for 6G: Vision, Enabling Technologies, and Applications",
    "year": 2021,
    "venue": "IEEE Journal on Selected Areas in Communications",
    "authors": [
        "K. Letaief",
        "Yuanming Shi",
        "Jianmin Lu",
        "Jianhua Lu"
    ],
    "doi": "10.1109/jsac.2021.3126076",
    "arxivId": "2111.12444",
    "url": "https://www.semanticscholar.org/paper/be0bbf06977c4dadbf702287733187884a531b8a",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/49/9653871/09606720.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The thriving of artificial intelligence (AI) applications is driving the further evolution of wireless networks. It has been envisioned that 6G will be transformative and will revolutionize the evolution of wireless from “connected things” to “connected intelligence”. However, state-of-the-art deep learning and big data analytics based AI systems require tremendous computation and communication resources, causing significant latency, energy consumption, network congestion, and privacy leakage in both of the training and inference processes. By embedding model training and inference capabilities into the network edge, edge AI stands out as a disruptive technology for 6G to seamlessly integrate sensing, communication, computation, and intelligence, thereby improving the efficiency, effectiveness, privacy, and security of 6G networks. In this paper, we shall provide our vision for scalable and trustworthy edge AI systems with integrated design of wireless communication strategies and decentralized machine learning models. New design principles of wireless networks, service-driven resource allocation optimization methods, as well as a holistic end-to-end system architecture to support edge AI will be described. Standardization, software and hardware platforms, and application scenarios are also discussed to facilitate the industrialization and commercialization of edge AI systems.",
    "citationCount": 484,
    "referenceCount": 325
}