{
    "paperId": "be2f194b692d51071fd6b26b351204da0d30c4b4",
    "title": "Hypersistent Sketch: Enhanced Persistence Estimation via Fast Item Separation",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Lu Cao",
        "Qilong Shi",
        "Weiqiang Xiao",
        "Nianfu Wang",
        "Wenjun Li",
        "Zhijun Li",
        "Weizhe Zhang",
        "Mingwei Xu"
    ],
    "doi": "10.1109/ICDE65448.2025.00227",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/be2f194b692d51071fd6b26b351204da0d30c4b4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient data stream processing, particularly for persistence estimation, is crucial in handling high-velocity data streams characterized by skewed distributions of item frequencies. Unlike more straightforward frequency metrics, persistence captures items' recurrence across multiple time windows, requiring nuanced processing approaches. In response, we introduce the Hypersistent Sketch, an algorithm that significantly enhances persistence estimation through innovative filtering techniques. Our design incorporates a Cold Filter to address the skewed nature of data streams where a few high-frequency (hot) items dominate. This filter allows for differential treatment by using smaller counters for most low-frequency (cold) items, thus conservatively allocating memory resources that would otherwise be sized uniformly based on hot items. However, the Cold Filter can reduce throughput due to its segregative processing. To mitigate this, we implement a Burst Filter, which optimizes the processing of hot items. The Burst Filter significantly improves throughput by preventing repeated insertions within a single window—where persistence increases by at most one—and deferring the insertion until the window's end. Comparative evaluations demonstrate that the Hypersistent Sketch outperforms existing solutions like the On-Off Sketch, offering up to 3 times improved throughput while maintaining competitive accuracy and substantially reducing memory usage in handling large-scale data streams.",
    "citationCount": 2,
    "referenceCount": 57
}