{
    "paperId": "be3ea886d15c1b9701c7f59e2d50e935a5c0a221",
    "title": "BIZA: Design of Self-Governing Block-Interface ZNS AFA for Endurance and Performance",
    "year": 2024,
    "venue": "Symposium on Operating Systems Principles",
    "authors": [
        "Shushu Yi",
        "Shaocong Sun",
        "Li Peng",
        "Yingbo Sun",
        "Ming-Chang Yang",
        "Zhichao Cao",
        "Qiao Li",
        "Myoungsoo Jung",
        "Ke Zhou",
        "Jie Zhang"
    ],
    "doi": "10.1145/3694715.3695953",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/be3ea886d15c1b9701c7f59e2d50e935a5c0a221",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3694715.3695953",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "All-flash array (AFA) has become one of the most popular storage forms in diverse computing domains. While traditional AFA implementations adopt the block interface to seamlessly integrate with most existing software, this interface hinders the host from managing SSD internal tasks explicitly, which results in both short endurance and poor performance. In comparison, ZNS AFA, such as RAIZN, adopts ZNS SSDs and exposes the ZNS interface to the users. This solution attempts to raise the level of responsibility for SSD management. Unfortunately, it faces severe compatibility issues as most upper-layer software only takes block I/O accesses for granted. In this work, we propose BIZA, a self-governing blockinterface ZNS AFA to proactively schedule I/O requests and SSD internal tasks via the ZNS interface while exposing the user-friendly block interface to upper-layer software. BIZA achieves both long endurance and high performance by exploiting the zone random write area (ZRWA) and internal parallelisms of ZNS SSDs. Specifically, to mitigate write amplification, BIZA proposes a ghost-cache-based algorithm to identify hot data and absorb their updates in the scarce ZRWA. BIZA also employs a novel guess-and-verify mechanism to detect the mappings between zones and I/O resources at a low cost. Thereafter, BIZA can serve write requests and internal tasks in parallel with our customized I/O scheduler for high throughput and low latency. The evaluation results show that BIZA can reduce write amplification by 42.7% while achieving 93.2% higher throughput and 62.8% lower tail latency, compared to the state-of-the-art AFA solutions.",
    "citationCount": 4,
    "referenceCount": 93
}