{
    "paperId": "be68177248858c2607fe42604d1a13d53079af87",
    "title": "Fine-Tuning Data Structures for Query Processing",
    "year": 2023,
    "venue": "IEEE/ACM International Symposium on Code Generation and Optimization",
    "authors": [
        "Amir Shaikhha",
        "Marios Kelepeshis",
        "Mahdi Ghorbani"
    ],
    "doi": "10.1145/3579990.3580016",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/be68177248858c2607fe42604d1a13d53079af87",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We introduce a framework for automatically choosing data structures for efficient query processing. Our contributions are twofold. First, we introduce a novel low-level intermediate language that can express the algorithms behind various query processing paradigms such as classical joins, groupjoin, and in-database machine learning engines. This language is designed around the notion of dictionaries and allows for a more fine-grained choice of its low-level implementation. Second, the cost model for alternative implementations is automatically inferred by combining machine learning and program reasoning. The dictionary cost model is learned using a regression model trained over the profiling data of dictionary operations on a given architecture. Program reasoning helps to infer the expected cost of the whole query by combining the learned dictionary cost estimates. Our experimental results show the effectiveness of the trained cost model on microbenchmarks. Furthermore, we show that the code generated by our framework outperforms or is competitive with state-of-the-art analytical query and in-database machine learning engines.",
    "citationCount": 4,
    "referenceCount": 75
}