{
    "paperId": "be84b27cec12e0bf01af5fade65a3fa1488170e7",
    "title": "APEX2: Adaptive and Extreme Summarization for Personalized Knowledge Graphs",
    "year": 2024,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Zihao Li",
        "Dongqi Fu",
        "Mengting Ai",
        "Jingrui He"
    ],
    "doi": "10.1145/3690624.3709213",
    "arxivId": "2412.17336",
    "url": "https://www.semanticscholar.org/paper/be84b27cec12e0bf01af5fade65a3fa1488170e7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Knowledge graphs (KGs), which store an extensive number of relational facts, serve various applications. Recently, personalized knowledge graphs (PKGs) have emerged as a solution to optimize storage costs by customizing their content to align with users' specific interests within particular domains. In the real world, on the one hand, user queries and their underlying interests are inherently evolving, requiring PKGs to adapt continuously; on the other hand, the summarization is constantly expected to be as small as possible in terms of storage cost. However, the existing PKG summarization methods implicitly assume that the user's interests are constant and do not shift. Furthermore, when the size constraint of PKG is extremely small, the existing methods cannot distinguish which facts are more of immediate interest and guarantee the utility of the summarized PKG. To address these limitations, we propose APEX2, a highly scalable PKG summarization framework designed with robust theoretical guarantees to excel in adaptive summarization tasks with extremely small size constraints. To be specific, after constructing an initial PKG, APEX2 continuously tracks the interest shift and adjusts the previous summary. The experiments show that APEX outperforms state-of-the-art baselines in terms of both query-answering accuracy and efficiency.",
    "citationCount": 13,
    "referenceCount": 80
}