{
    "paperId": "beabeba9caa18d4e3375317b4fabe751680bd3f7",
    "title": "Multiple Nitrogen Sources Application Inhibits Increasing Ammonia Volatilization Under Reducing Irrigation",
    "year": 2024,
    "venue": "Agronomy",
    "authors": [
        "Taotao Chen",
        "Erping Cui",
        "Ke Sun",
        "Chao Hu",
        "Siyi Li",
        "Ping Li",
        "Zhijuan Zhao",
        "Chuncheng Liu",
        "Bingjian Cui",
        "Xiangyang Fan"
    ],
    "doi": "10.3390/agronomy14122927",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/beabeba9caa18d4e3375317b4fabe751680bd3f7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Farmland ammonia (NH3) volatilization is an important source of NH3, and the application of chemical fertilizer nitrogen (N) is the main factor affecting NH3 volatilization. The optimal substitution of chemical fertilizer with organic manure and straw reportedly reduces NH3 volatilization, while reducing irrigation increases NH3 volatilization. However, the combined effect of nitrogen fertilizer substitution and reducing irrigation on NH3 volatilization and the role of microorganisms in this process remains unclear. In a soil column experiment, NH3 volatilization and microbial composition were measured under both multiple N sources and different irrigation levels by the vented-chamber method and metagenomic sequencing. The results revealed that multiple N sources application reduced cumulative NH3 volatilization by 16.5–75.4% compared to single chemical fertilizer application, and the decreasing trend of NH3 volatilization under reduced irrigation conditions was greater. Microorganisms had a more important effect on NH3 volatilization of reduced irrigation than conventional irrigation. The abundance of nirA, arcC, E3.5.1.49, and E3.5.5.1 (ammonia-producing) genes varied significantly at the two irrigation levels. Overall, multiple N sources could inhibit NH3 volatilization increasing under reducing irrigation compared to a single chemical fertilizer. Our findings contribute valuable insights into the combined effect of reduced irrigation and multiple N sources on NH3 volatilization.",
    "citationCount": 1,
    "referenceCount": 71
}