{
    "paperId": "beb947998263e8f50eb6beb33895fce712d55326",
    "title": "High-Efficiency Simulation of Dynamic Stability Derivatives Based on a Particle Swarm Optimization and Long Short-Term Memory Network (PSO-LSTM) Coupling Aerodynamic Model",
    "year": 2023,
    "venue": "Applied Sciences",
    "authors": [
        "Wenqi Cheng",
        "Baigang Mi"
    ],
    "doi": "10.3390/app132011511",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/beb947998263e8f50eb6beb33895fce712d55326",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/13/20/11511/pdf?version=1697796601",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A new high-efficiency method based on a particle swarm optimization and long short-term memory network is proposed in this study to predict the aerodynamic forces in an unsteady state. Based on the predicted aerodynamic forces, the dynamic derivative is further calculated. Using particle swarm optimization to optimize the hyper-parameters of a neural network, the long short-term memory network prediction model can be constructed according to the known simulating aerodynamic data to predict the aerodynamic performance of aircraft in unknown states. By coupling the least-squares method in an aerodynamic derivative model, the dynamic derivative can be quickly obtained. Unsteady motion of NACA 0012 airfoil was taken as the research example to verify this method, and its longitudinal combined dynamic derivatives were predicted and compared with CFD simulation results. The results show that the dynamic derivatives predicted by the PSO-LSTM method have high accuracy, with an error of no more than 1% compared to CFD, and a 70% improvement in efficiency. The method proposed in this study has good generalization ability and can realize fast and accurate prediction of dynamic derivatives with a small number of samples.",
    "citationCount": 5,
    "referenceCount": 15
}