{
    "paperId": "bec67a11b20a1ecf6146a431305fb9459c9af771",
    "title": "The potential role of AI agents in transforming nuclear medicine research and cancer management in India",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Rajat Vashistha",
        "Arif Gulzar",
        "Parveen Kundu",
        "Punit Sharma",
        "Mark Brunstein",
        "Viktor Vegh"
    ],
    "doi": "10.48550/arXiv.2503.07673",
    "arxivId": "2503.07673",
    "url": "https://www.semanticscholar.org/paper/bec67a11b20a1ecf6146a431305fb9459c9af771",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "India faces a significant cancer burden, with an incidence-to-mortality ratio indicating that nearly three out of five individuals diagnosed with cancer succumb to the disease. While the limitations of physical healthcare infrastructure are widely acknowledged as a primary challenge, concerted efforts by government and healthcare agencies are underway to mitigate these constraints. However, given the country's vast geography and high population density, it is imperative to explore alternative soft infrastructure solutions to complement existing frameworks. Artificial Intelligence agents are increasingly transforming problem-solving approaches across various domains, with their application in medicine proving particularly transformative. In this perspective, we examine the potential role of AI agents in advancing nuclear medicine for cancer research, diagnosis, and management in India. We begin with a brief overview of AI agents and their capabilities, followed by a proposed agent-based ecosystem that can address prevailing sustainability challenges in India nuclear medicine.",
    "citationCount": 1,
    "referenceCount": 33
}