{
    "paperId": "beef912f83044c6c05b7fbece39f396638c918b5",
    "title": "Sowing the Seeds of Precision: Innovations in Wireless Sensor Networks for Agricultural Environmental Monitoring",
    "year": 2024,
    "venue": "International Journal on AdHoc Networking Systems",
    "authors": [
        "Sreedeep Dey",
        "Sreejita Das"
    ],
    "doi": "10.5121/ijans.2024.14301",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/beef912f83044c6c05b7fbece39f396638c918b5",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5121/ijans.2024.14301",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Wireless Sensor Networks (WSNs) are used in precision agriculture to provide real-time environmental parameter monitoring that is essential to crop productivity. This study looks at the most current advancements in WSN technology and its application in monitoring vital factors including temperature, humidity, soil moisture, and light intensity in agricultural contexts, with an emphasis on the agricultural region of Bardhaman District, West Bengal, India. For sustainable and long-term sensor network functioning in this area, the study looks into several sensor placement procedures, creative data aggregation strategies, and energy-efficient protocols. To improve data accuracy and decision-making abilities, contemporary analytics techniques like machine learning and data fusion are also used. The results highlight how well WSNs work in Bardhaman District to maximise agricultural sustainability and productivity. The study discusses issues with WSN deployment, like network connectivity and power management, and suggests solutions specific to the region's agricultural environment. The goal of future study is to improve the precision agricultural utility of WSNs even more, with an emphasis on boosting resilience and productivity in farming operations in Bardhaman District.",
    "citationCount": 1,
    "referenceCount": 30
}