{
    "paperId": "bf248f101838ce20b7ae24158d5503f8a6b79621",
    "title": "Dynamic read & write optimization with TurtleKV",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Tony Astolfi",
        "Vidya Silai",
        "Darby Huye",
        "Lan Liu",
        "Raja R. Sambasivan",
        "Johes Bater"
    ],
    "doi": "10.48550/arXiv.2509.10714",
    "arxivId": "2509.10714",
    "url": "https://www.semanticscholar.org/paper/bf248f101838ce20b7ae24158d5503f8a6b79621",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "High read and write performance is important for generic key/value stores, which are fundamental to modern applications and databases. Yet, achieving high performance for both reads and writes is challenging due to traditionally limited memory and the pick-any-two-out-of-three tradeoff between memory use, read performance, and write performance. Existing state-of-the-art approaches limit memory usage and chose a primary dimension (reads or writes) for which to optimize their on-disk structures. They recover performance in the remaining dimension by other mechanisms. This approach limits databases'maximum performance in the remaining dimension and their dynamic (online) tunability to respond to changing workloads. We explore a different approach that dynamically trades memory for read or write performance as needed. We present TurtleKV, which includes a novel unbiased data structure for on-disk storage. It includes a knob that dynamically increases memory reserved for increasing read or write performance. When evaluated on YCSB, TurtleKV achieves up to 8x the write throughput of industry-leader RocksDB and up to 5x the read throughput while incurring similar space amplification. Compared to the state-of-the-art system SplinterDB, TurtleKV runs up to 40% better on point queries, up to 6x better on range scans and achieves similar write performance, while incurring 50% less space amplification.",
    "citationCount": 0,
    "referenceCount": 38
}