{
    "paperId": "bf481e120bb2bba8f57dc284797015bb893727b4",
    "title": "Aggregate Query Prediction under Dynamic Workloads",
    "year": 2019,
    "venue": "2019 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Fotis Savva",
        "C. Anagnostopoulos",
        "P. Triantafillou"
    ],
    "doi": "10.1109/BigData47090.2019.9006267",
    "arxivId": "1908.04772",
    "url": "https://www.semanticscholar.org/paper/bf481e120bb2bba8f57dc284797015bb893727b4",
    "isOpenAccess": true,
    "openAccessPdf": "http://wrap.warwick.ac.uk/138382/1/WRAP-aggregate-query-prediction-under-dynamic-workloads-Triantafillou-2020.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large organizations have seamlessly incorporated data-driven decision making in their operations. However, as data volumes increase, expensive big data infrastructures are called to rescue. In this setting, analytics tasks become very costly in terms of query response time, resource consumption, and money in cloud deployments, especially when base data are stored across geographically distributed data centers. Therefore, we introduce an adaptive Machine Learning mechanism which is light-weight, stored client-side, can estimate the answers of a variety of aggregate queries and can avoid the big data backend. The estimations are performed in milliseconds and are inexepensive as the mechanism learns from past analytical-query patterns. However, as analytic queries are ad-hoc and analysts’ interests change over time we develop solutions that can swiftly and accurately detect such changes and adapt to new query patterns. The capabilities of our approach are demonstrated using extensive evaluation with real and synthetic datasets.",
    "citationCount": 7,
    "referenceCount": 32
}