{
    "paperId": "bf712c1a71bdc31147bf1062b354158f6e441c33",
    "title": "Data Analytics Environment: Combining Visual Programming and MLOps for AI workflow creation",
    "year": 2024,
    "venue": "International Conference on Engineering, Technology and Innovation",
    "authors": [
        "André Grilo",
        "Paulo Figueiras",
        "Bruno Rêga",
        "Luís Lourenço",
        "Amin Khodamoradi",
        "R. Costa",
        "Ricardo Jardim-Gonçalves"
    ],
    "doi": "10.1109/ICE/ITMC61926.2024.10794244",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bf712c1a71bdc31147bf1062b354158f6e441c33",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the Industry 4.0 scene, Artificial Intelligence (AI) is sought after as a new way of getting a competitive advantage from other market competitors. This technology can support not only in-line production status assessment processes, which enable a better control over the quality of the final product, but also to identify potential bottlenecks and other inefficiencies that can exist or occur in production processes. However, this technology has some obstacles that make its access difficult for businesses that do not have the necessary resources for implementing AI solutions, whether due to the intrinsic difficulty to handle such technologies, which require specialists (engineers, data scientists) that are not normally part of industrial human resources, or due to the integration and management of these technologies with already established processes and environments. To approach these technological accessibility challenges, some concepts are being applied, such as in the case of no code/low code solutions, i.e., the reduction or complete removal of programming requirements while using these technologies, and Machine Learning Operations (MLOps), where the integration and life cycle management of these solutions use the same approach as DevOps but applied and adapted to AI technologies. This paper presents an innovative, open-source and scalable approach towards AI pipeline creation, integration, and life cycle management in Industry 4.0 scenarios, in which these no code/low code and MLOps concepts are used, as well as a real-life application in the manufacturing industry.",
    "citationCount": 1,
    "referenceCount": 35
}