{
    "paperId": "bf959f4ff5aac64beb85f97a1d88c9a771dea12b",
    "title": "Operationalizing AI/ML in Future Networks: A Bird's Eye View from the System Perspective",
    "year": 2023,
    "venue": "IEEE Communications Magazine",
    "authors": [
        "Tianzhu Zhang",
        "Masoud Hemmatpour",
        "Shashwat Mishra",
        "Leonardo Linguaglossa",
        "Dong Zhang",
        "Chung Shue Chen",
        "M. Mellia",
        "A. Aghasaryan"
    ],
    "doi": "10.1109/MCOM.001.2400033",
    "arxivId": "2303.04073",
    "url": "https://www.semanticscholar.org/paper/bf959f4ff5aac64beb85f97a1d88c9a771dea12b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern artificial intelligence (AI) technologies, led by machine learning (ML), have gained unprecedented momentum over the past decade. Following this wave of “AI summer,” the network research community has also embraced AI/ML algorithms to address many problems related to network operations and management. However, compared to their counterparts in other domains, most ML-based solutions have yet to receive large-scale deployment due to insufficient maturity for production settings. This article concentrates on the practical issues of developing and operating ML-based solutions in real networks. Specifically, we enumerate the key factors hindering the integration of AI/ML in real networks, and review existing solutions to uncover the missing components. Further, we highlight a promising direction, that is, machine learning operations (MLOps), that can close the gap. We believe this article spotlights the system-related considerations on implementing and maintaining ML-based solutions, and invigorates their full adoption in future networks.",
    "citationCount": 7,
    "referenceCount": 38
}