{
    "paperId": "bf987a09c830f13d5bd48043969c0c8e3cac3b12",
    "title": "Advancing Explainable AI Toward Human-Like Intelligence: Forging the Path to Artificial Brain",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Yongchen Zhou",
        "Richard Jiang"
    ],
    "doi": "10.48550/arXiv.2402.06673",
    "arxivId": "2402.06673",
    "url": "https://www.semanticscholar.org/paper/bf987a09c830f13d5bd48043969c0c8e3cac3b12",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The intersection of Artificial Intelligence (AI) and neuroscience in Explainable AI (XAI) is pivotal for enhancing transparency and interpretability in complex decision-making processes. This paper explores the evolution of XAI methodologies, ranging from feature-based to human-centric approaches, and delves into their applications in diverse domains, including healthcare and finance. The challenges in achieving explainability in generative models, ensuring responsible AI practices, and addressing ethical implications are discussed. The paper further investigates the potential convergence of XAI with cognitive sciences, the development of emotionally intelligent AI, and the quest for Human-Like Intelligence (HLI) in AI systems. As AI progresses towards Artificial General Intelligence (AGI), considerations of consciousness, ethics, and societal impact become paramount. The ongoing pursuit of deciphering the mysteries of the brain with AI and the quest for HLI represent transformative endeavors, bridging technical advancements with multidisciplinary explorations of human cognition.",
    "citationCount": 4,
    "referenceCount": 122
}