{
    "paperId": "bfdd83ebdcdd8113191f7b14cab66f2466d5ad95",
    "title": "Amplifying Domain Expertise in Clinical Data Pipelines",
    "year": 2020,
    "venue": "JMIR Medical Informatics",
    "authors": [
        "Protiva Rahman",
        "Arnab Nandi",
        "C. Hebert"
    ],
    "doi": "10.2196/19612",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bfdd83ebdcdd8113191f7b14cab66f2466d5ad95",
    "isOpenAccess": true,
    "openAccessPdf": "https://medinform.jmir.org/2020/11/e19612/PDF",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Digitization of health records has allowed the health care domain to adopt data-driven algorithms for decision support. There are multiple people involved in this process: a data engineer who processes and restructures the data, a data scientist who develops statistical models, and a domain expert who informs the design of the data pipeline and consumes its results for decision support. Although there are multiple data interaction tools for data scientists, few exist to allow domain experts to interact with data meaningfully. Designing systems for domain experts requires careful thought because they have different needs and characteristics from other end users. There should be an increased emphasis on the system to optimize the experts’ interaction by directing them to high-impact data tasks and reducing the total task completion time. We refer to this optimization as amplifying domain expertise. Although there is active research in making machine learning models more explainable and usable, it focuses on the final outputs of the model. However, in the clinical domain, expert involvement is needed at every pipeline step: curation, cleaning, and analysis. To this end, we review literature from the database, human-computer information, and visualization communities to demonstrate the challenges and solutions at each of the data pipeline stages. Next, we present a taxonomy of expertise amplification, which can be applied when building systems for domain experts. This includes summarization, guidance, interaction, and acceleration. Finally, we demonstrate the use of our taxonomy with a case study.",
    "citationCount": 12,
    "referenceCount": 227
}