{
    "paperId": "bfebac52f83ce2ec3b5dfc75b17e1f98e8aaddd4",
    "title": "Integrating Machine Learning with HPC-driven Simulations for Enhanced Student Learning",
    "year": 2020,
    "venue": "Workshop on Education for High Performance Computing",
    "authors": [
        "V. Jadhao",
        "J. Kadupitiya"
    ],
    "doi": "10.1109/EduHPC51895.2020.00009",
    "arxivId": "2008.13518",
    "url": "https://www.semanticscholar.org/paper/bfebac52f83ce2ec3b5dfc75b17e1f98e8aaddd4",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2008.13518",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We explore the idea of integrating machine learning (ML) with high performance computing (HPC)-driven simulations to address challenges in using simulations to teach computational science and engineering courses. We demonstrate that a ML surrogate, designed using artificial neural networks, yields predictions in excellent agreement with explicit simulation, but at far less time and computing costs. We develop a web application on nanoHUB that supports both HPC-driven simulation and the ML surrogate methods to produce simulation outputs. This tool is used for both in-classroom instruction and for solving homework problems associated with two courses covering topics in the broad areas of computational materials science, modeling and simulation, and engineering applications of HPC-enabled simulations. The evaluation of the tool via in-classroom student feedback and surveys shows that the ML-enhanced tool provides a dynamic and responsive simulation environment that enhances student learning. The improvement in the interactivity with the simulation framework in terms of real-time engagement and anytime access enables students to develop intuition for the physical system behavior through rapid visualization of variations in output quantities with changes in inputs.",
    "citationCount": 4,
    "referenceCount": 50
}