{
    "paperId": "c00f768f5a93da02d597249e9b62979dcbf7561a",
    "title": "oSWNN: Optimized Small World Neural Network for Predictive Analysis",
    "year": 2025,
    "venue": "National Conference on Communications",
    "authors": [
        "Shubham Dwivedi",
        "O. Pandey",
        "Rajesh M. Hegde"
    ],
    "doi": "10.1109/NCC63735.2025.10983005",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c00f768f5a93da02d597249e9b62979dcbf7561a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the domain of predictive modeling, achieving high accuracy with reduced computational complexity is imperative, particularly for applications requiring real-time processing or operating under stringent resource constraints. Conventional neural networks, despite their efficacy, often encounter limitations due to high structural complexity and inefficiencies in information propagation. This paper introduces an optimized small world neural network architecture (oSWNN), which systematically enhances predictive accuracy by optimizing the number and strategic placement of new links between neurons. By incorporating the small world property, characterized by short path lengths and efficient connectivity, our model facilitates seamless information flow, boosting performance in regression tasks. Tested on multiple regression datasets, including UCI Compressive Concrete Strength, UCI Energy Efficiency, and Oxford Parkinson's Disease dataset, the proposed oSWNN demonstrates significant gains in both accuracy and computational efficiency, underscoring the potential of small world neural network for robust predictive analysis.",
    "citationCount": 0,
    "referenceCount": 30
}