{
    "paperId": "c012eef7f2bd536b839fc13f8a9a91ac1febbd0d",
    "title": "QueryArtisan: Generating Data Manipulation Codes for Ad-hoc Analysis in Data Lakes",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Xiu Tang",
        "Wenhao Liu",
        "Sai Wu",
        "Chang Yao",
        "Gongsheng Yuan",
        "Shanshan Ying",
        "Gang Chen"
    ],
    "doi": "10.14778/3705829.3705832",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c012eef7f2bd536b839fc13f8a9a91ac1febbd0d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Query processing over data lakes is a challenging task, often requiring extensive data pre-processing activities such as data cleaning, transformation, and loading. However, the advent of Large Language Models (LLMs) has illuminated a new pathway to address these complexities by offering a unified approach to understanding the diverse datasets submerged in data lakes. In this paper, we introduce QueryArtisan, a novel LLM-powered analytic tool specifically designed for data lakes. QueryArtisan transcends traditional ETL (Extract, Transform, Load) processes by generating just-intime code for dataset-specific queries. It eliminates the need for an intermediary schema, enabling users to query the data lake directly using natural language. To achieve this, we have developed a suite of heterogeneous operators capable of processing data across various modalities. Additionally, QueryArtisan incorporates a cost model-based query optimization technique, significantly enhancing its code generation capabilities for efficient query resolution. Our extensive experimental evaluations, conducted with real-life datasets, demonstrate that QueryArtisan markedly outperforms existing solutions in terms of effectiveness, efficiency and usability.",
    "citationCount": 4,
    "referenceCount": 52
}