{
    "paperId": "c01ffa412730b87c64c497f26c7a3e7a94d2302d",
    "title": "Scalable Shared-Memory Hypergraph Partitioning",
    "year": 2020,
    "venue": "Workshop on Algorithm Engineering and Experimentation",
    "authors": [
        "Lars Gottesbüren",
        "Tobias Heuer",
        "P. Sanders",
        "Sebastian Schlag"
    ],
    "doi": "10.1137/1.9781611976472.2",
    "arxivId": "2010.10272",
    "url": "https://www.semanticscholar.org/paper/c01ffa412730b87c64c497f26c7a3e7a94d2302d",
    "isOpenAccess": true,
    "openAccessPdf": "https://epubs.siam.org/doi/pdf/10.1137/1.9781611976472.2",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hypergraph partitioning is an important preprocessing step for optimizing data placement and minimizing communication volumes in high-performance computing applications. To cope with ever growing problem sizes, it has become increasingly important to develop fast parallel partitioning algorithms whose solution quality is competitive with existing sequential algorithms. \nTo this end, we present Mt-KaHyPar, the first shared-memory multilevel hypergraph partitioner with parallel implementations of many techniques used by the sequential, high-quality partitioning systems: a parallel coarsening algorithm that uses parallel community detection as guidance, initial partitioning via parallel recursive bipartitioning with work-stealing, a scalable label propagation refinement algorithm, and the first fully-parallel direct $k$-way formulation of the classical FM algorithm. \nExperiments performed on a large benchmark set of instances from various application domains demonstrate the scalability and effectiveness of our approach. With 64 cores, we observe self-relative speedups of up to 51 and a harmonic mean speedup of 23.5. In terms of solution quality, we outperform the distributed hypergraph partitioner Zoltan on 95% of the instances while also being a factor of 2.1 faster. With just four cores,Mt-KaHyPar is also slightly faster than the fastest sequential multilevel partitioner PaToH while producing better solutions on 83% of all instances. The sequential high-quality partitioner KaHyPar still finds better solutions than our parallel approach, especially when using max-flow-based refinement. This, however, comes at the cost of considerably longer running times.",
    "citationCount": 37,
    "referenceCount": 60
}