{
    "paperId": "c02f0fb9f43df81a08ae0852c50f9da6369fa431",
    "title": "Research on Design of Electric Vehicle Sound Synthesis Based on Frequency Shift Algorithm",
    "year": 2024,
    "venue": "SAE technical paper series",
    "authors": [
        "Shangbo Yu",
        "Liping Xie",
        "Chihua Lu",
        "Yushu Qian",
        "Zhien Liu",
        "Songze Du"
    ],
    "doi": "10.4271/2024-01-2335",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c02f0fb9f43df81a08ae0852c50f9da6369fa431",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The active sound generation systems (ASGS) for electric vehicles (EVs) play an important role in improving sound perception and transmission in the car, and can meet the needs of different user groups for driving and riding experiences. The active sound synthesis algorithm is the core part of ASGS. This paper uses an efficient variable-range fast linear interpolation method to design a frequency-shifted and pitch-modified sound synthesis algorithm. By obtaining the operating parameters of EVs, such as vehicle speed, motor speed, pedal opening, etc., the original sound signal is interpolated to varying degrees to change the frequency of the sound signal, and then the amplitude of the sound signal is determined according to different driving states. This simulates an effect similar to the sound of a traditional car engine. Then, a dynamic superposition strategy is proposed based on the Hann window function. Through windowing and superposition processing of each sound signal segment generated by the algorithm, the coherence and real-time performance of the synthesized engine sound are improved, so that the ASGS can quickly and accurately reflect the driving status of EVs. Finally, through the analysis and verification of the sound quality of the synthesized sound through different parameter adjustments, an engine synthesized sound that satisfies the subjective evaluation of sound quality can be obtained. This paper proposes an effective active sound synthesis algorithm for EVs, which ensures that EVs produce more textured engine sound while emphasizing the timeliness of synthesized sound. It plays an important role in improving pedestrian safety perception and driving experience, and promotes the research and development of ASGS for EVs.",
    "citationCount": 5,
    "referenceCount": 12
}