{
    "paperId": "c07802ed8a25998e9bd44ee1ddbcc63b7eb34060",
    "title": "Data Management for Machine Learning: A Survey",
    "year": 2023,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Chengliang Chai",
        "Jiayi Wang",
        "Yuyu Luo",
        "Zeping Niu",
        "Guoliang Li"
    ],
    "doi": "10.1109/TKDE.2022.3148237",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c07802ed8a25998e9bd44ee1ddbcc63b7eb34060",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tkde.2022.3148237",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) has widespread applications and has revolutionized many industries, but suffers from several challenges. First, sufficient high-quality training data is inevitable for producing a well-performed model, but the data is always human expensive to acquire. Second, a large amount of training data and complicated model structures lead to the inefficiency of training and inference. Third, given an ML task, one always needs to train lots of models, which are hard to manage in real applications. Fortunately, database techniques can benefit ML by addressing the above three challenges. In this paper, we review existing studies from the following three aspects along with the pipeline highly related to ML. (1) Data preparation (Pre-ML): it focuses on preparing high-quality training data that can improve the performance of the ML model, where we review data discovery, data cleaning and data labeling. (2) Model training & inference (In-ML): researchers in ML community focus on improving the model performance during training, while in this survey we mainly study how to accelerate the entire training process, also including feature selection and model selection. (3) Model management (Post-ML): in this part, we survey how to store, query, deploy and debug the models after training. Finally, we provide research challenges and future directions.",
    "citationCount": 52,
    "referenceCount": 188
}