{
    "paperId": "c0803c464a2b30bcbcd0babf7d404b0c9778397c",
    "title": "Dual-GRU-GNN for Dynamic Blockchain Network Sharding",
    "year": 2024,
    "venue": "Journées Bases de Données Avancées",
    "authors": [
        "Xianghe Ye",
        "Qingxu Di",
        "Xinyuan Du",
        "Ayong Bao",
        "Shusong Xing"
    ],
    "doi": "10.1109/ICBDA61153.2024.10607332",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c0803c464a2b30bcbcd0babf7d404b0c9778397c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we present an innovative solution to overcome the limitations of blockchain systems, particularly in terms of communication costs and storage resources. Our ap-proach leverages blockchain sharding, a technique that partitions a blockchain into multiple parallel shards. We underscore the im-portance of selecting a sharding algorithm that accounts for the temporal dimension, often overlooked in prior studies. This algorithm is designed to minimize inter-shard communication and en-sure a well-balanced distribution of nodes. Additionally, we intro-duce a novel methodology that integrates the gated recurrent unit (GRU) and graph neural network (GNN) for the sharding algorithm, incorporating time-related information. This involves a graph extractor for extracting temporal graph data from block-chain data and a Dual-GRU-GNN model for learning from these temporal graphs to enhance prediction results. Our proposed so-lution is specifically crafted to handle dynamic Ethereum-like blockchain networks that evolve over time, aiming to yield supe-rior results in the realm of blockchain sharding. Compared to clas-sical neural network models such as Graph Neural Network (GCN), Graph Sage, and Graph Attention Network (GAT), our proposed model exhibits superior overall performance. It achieves a more evenly distributed number of nodes within each shard and establishes stronger correlations among nodes within the same shard, minimizing the need for cross-shard communication.",
    "citationCount": 0,
    "referenceCount": 26
}