{
    "paperId": "c08f7c8af7fb6fba7d451408bac99ef11a7ce0e3",
    "title": "DeepOnet Based Preconditioning Strategies For Solving Parametric Linear Systems of Equations",
    "year": 2024,
    "venue": "SIAM Journal on Scientific Computing",
    "authors": [
        "Alena Kopanicáková",
        "G. Karniadakis"
    ],
    "doi": "10.48550/arXiv.2401.02016",
    "arxivId": "2401.02016",
    "url": "https://www.semanticscholar.org/paper/c08f7c8af7fb6fba7d451408bac99ef11a7ce0e3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We introduce a new class of hybrid preconditioners for solving parametric linear systems of equations. The proposed preconditioners are constructed by hybridizing the deep operator network, namely DeepONet, with standard iterative methods. Exploiting the spectral bias, DeepONet-based components are harnessed to address low-frequency error components, while conventional iterative methods are employed to mitigate high-frequency error components. Our preconditioning framework comprises two distinct hybridization approaches: direct preconditioning (DP) and trunk basis (TB) approaches. In the DP approach, DeepONet is used to approximate an action of an inverse operator to a vector during each preconditioning step. In contrast, the TB approach extracts basis functions from the trained DeepONet to construct a map to a smaller subspace, in which the low-frequency component of the error can be effectively eliminated. Our numerical results demonstrate that utilizing the TB approach enhances the convergence of Krylov methods by a large margin compared to standard non-hybrid preconditioning strategies. Moreover, the proposed hybrid preconditioners exhibit robustness across a wide range of model parameters and problem resolutions.",
    "citationCount": 29,
    "referenceCount": 92
}