{
    "paperId": "c098e3666821c6a8184f9e7e254807524d134894",
    "title": "Garbage Image Classification Using Improved Inception-V3 Neural Network",
    "year": 2024,
    "venue": "2024 International Conference on Intelligent Robotics and Automatic Control (IRAC)",
    "authors": [
        "Xiaohui Wang",
        "Yaying Shi",
        "Siyong Fu"
    ],
    "doi": "10.1109/IRAC63143.2024.10871539",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c098e3666821c6a8184f9e7e254807524d134894",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents an improved Inception-V3 model for garbage image classification aimed at facilitating intelligent garbage sorting through computer vision or mobile terminal applications. Initially, the iPhone-GARBAGE dataset of garbage images is constructed. Subsequently, the convolution blocks in the original Inception-V3 are replaced with new Inverted Bottleneck modules for richer feature expressions. Additionally, a Contextual Transformer module is added, enabling the model to discern more detailed object and scene semantics. The substitution of multi-scale pooling layers for the conventional maximum pooling layers further enhances the model's capability to recognize and retain features. Lastly, the integration of data augmentation and transfer learning strategies into the deep convolutional network empowers the recognition and classification of garbage images. Comparative experiments with different models under identical conditions are conducted. Results indicate that the improved Inception-V3 model achieves a classification accuracy of 96.20% and a test accuracy of 96.10%, surpassing other models. The proposed model demonstrates faster improvement rates and better convergence.",
    "citationCount": 0,
    "referenceCount": 14
}