{
    "paperId": "c0a113240525a7cdaa09fb41753a98da7a1e0a51",
    "title": "From Bottom of Sea to Space: Quo Vadis IoT? So What About Security?",
    "year": 2025,
    "venue": "Future Internet",
    "authors": [
        "B. Zolfaghari",
        "Jacob Krzciok",
        "Khodakhast Bibak"
    ],
    "doi": "10.3390/fi17020091",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c0a113240525a7cdaa09fb41753a98da7a1e0a51",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, we have witnessed the era of IoT. Extensions of the IoT are found almost everywhere in the modern world: under the ground, on the ground, under the sea, in the sky, and in space. Such a rapid proliferation has given rise to a variety of requirements and challenges. As suggested by the recent literature, security is the most critical challenge in this area. A comprehensive survey in this area can pave the way for further research by highlighting current trends and shedding light on less-studied aspects of the area. This paper provides a comprehensive review of the current state of research on IoT extensions, with a focus on security. We start with reviewing existing relevant surveys, noting their shortcomings. We highlight the lack of inclusiveness in existing surveys. Moreover, we show that these surveys do not look closely at security challenges and fail to develop a taxonomy or a solid future roadmap. Then, we provide an overview of the security challenges and mechanisms of IoT extensions. We proceed to develop a taxonomy of these extensions with a focus on security. Lastly, we discuss what the future may hold for IoT extensions, given the role of artificial intelligence in IoT and the advancements of artificial intelligence on the horizon.",
    "citationCount": 0,
    "referenceCount": 248
}