{
    "paperId": "c0efcbad169910782c3d17d08c689c43dd2bc631",
    "title": "StragglerHelper: Alleviating Straggling in Computing Clusters via Sharing Memory Access Patterns",
    "year": 2020,
    "venue": "IEEE International Parallel and Distributed Processing Symposium",
    "authors": [
        "Wenjie Liu",
        "Ping Huang",
        "Xubin He"
    ],
    "doi": "10.1109/IPDPS47924.2020.00068",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c0efcbad169910782c3d17d08c689c43dd2bc631",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Clusters have been a prevalent and successful computing framework for processing large amount of data due to their distributed and parallelized working paradigm. A task submitted to a cluster is typically divided into a number of subtasks which are designated to different work nodes running the same code but dealing with different equal portion of the dataset to be processed. Due to the existence of heterogeneity, it could easily result in stragglers unfairly slowing down the entire processing, because work nodes finish their subtasks at different rates. In this study, we aim to speed up straggling work nodes to quicken the overall processing by leveraging exhibited performance variation. More specifically, we propose StragglerHelper which conveys the memory access characteristics experienced by the forerunner to the stragglers such that stragglers can be sped up due to the accurately informed memory prefetching. A Progress Monitor is deployed to supervise the respective progresses of the work nodes and inform the memory access patterns of forerunner to straggling nodes. Our evaluation results with the SPEC MPI 2007 and BigDataBench on a cluster of 64 work nodes have shown that StragglerHelper is able to improve the execution time of stragglers by up to 99.5% with an average of 61.4%, contributing to an overall improvement of the entire cohort of the cluster by up to 46.7% with an average of 9.9% compared to the baseline cluster.",
    "citationCount": 1,
    "referenceCount": 38
}