{
    "paperId": "c150313cd5aa5a84faf0a44ec6ac80b369034791",
    "title": "DEAR: Improving Performance and Lifetime of SSDs Using Dynamic Error-Aware Refresh",
    "year": 2025,
    "venue": "Proceedings of the 2025 58th IEEE/ACM International Symposium on Microarchitecture",
    "authors": [
        "Jaeyong Lee",
        "Beomjun Kim",
        "Myoungjun Chun",
        "Myungsuk Kim",
        "Jihong Kim"
    ],
    "doi": "10.1145/3725843.3756134",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c150313cd5aa5a84faf0a44ec6ac80b369034791",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Although NAND flash memory has achieved significant capacity improvements through advanced 3D stacking and multi-level cell technologies, these advances have intensified the read-disturb problem. Modern SSDs require efficient solutions to minimize the overhead of managing read-disturb errors. In this paper, we propose DEAR (Dynamic Error-Aware Refresh), a novel approach that dynamically monitors flash memory error status at runtime. Unlike conventional methods that trigger read refresh (RR) procedures based on fixed read-count thresholds per block, DEAR selectively invokes RR at the WL granularity, based on actual error conditions. DEAR leverages an accurate and efficient runtime error estimator (SEE), significantly reducing unnecessary RR invocations. System-level evaluations with ten real-world workloads show that DEAR reduces RR invocations by 64.2% on average compared to existing methods, with negligible overhead. Furthermore, DEAR reduces the 99.9th percentile read latency by 44.9% and extends SSD lifetime by 36.7% compared to state-of-the-art techniques.",
    "citationCount": 0,
    "referenceCount": 63
}