{
    "paperId": "c16e5d41e8275cc33c119ce0b73ff6492b4a0513",
    "title": "Bridging Software-Hardware for CXL Memory Disaggregation in Billion-Scale Nearest Neighbor Search",
    "year": 2024,
    "venue": "ACM Transactions on Storage",
    "authors": [
        "Junhyeok Jang",
        "Hanjin Choi",
        "Hanyeoreum Bae",
        "Seungjun Lee",
        "Miryeong Kwon",
        "Myoungsoo Jung"
    ],
    "doi": "10.1145/3639471",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c16e5d41e8275cc33c119ce0b73ff6492b4a0513",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3639471",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose CXL-ANNS, a software-hardware collaborative approach to enable scalable approximate nearest neighbor search (ANNS) services. To this end, we first disaggregate DRAM from the host via compute express link (CXL) and place all essential datasets into its memory pool. While this CXL memory pool allows ANNS to handle billion-point graphs without an accuracy loss, we observe that the search performance significantly degrades because of CXL’s far-memory-like characteristics. To address this, CXL-ANNS considers the node-level relationship and caches the neighbors in local memory, which are expected to visit most frequently. For the uncached nodes, CXL-ANNS prefetches a set of nodes most likely to visit soon by understanding the graph traversing behaviors of ANNS. CXL-ANNS is also aware of the architectural structures of the CXL interconnect network and lets different hardware components collaborate with each other for the search. Furthermore, it relaxes the execution dependency of neighbor search tasks and allows ANNS to utilize all hardware in the CXL network in parallel. Our evaluation shows that CXL-ANNS exhibits 93.3% lower query latency than state-of-the-art ANNS platforms that we tested. CXL-ANNS also outperforms an oracle ANNS system that has unlimited local DRAM capacity by 68.0%, in terms of latency.",
    "citationCount": 4,
    "referenceCount": 71
}