{
    "paperId": "c186ae344856a591c2eb6095b66c14783baf7b3d",
    "title": "Labor Market Employment Rate Prediction and Optimization Based on Deep Neural Networks",
    "year": 2025,
    "venue": "Proceedings of the 10th International Conference on Cyber Security and Information Engineering",
    "authors": [
        "Yangqian Xu",
        "Fang Liu"
    ],
    "doi": "10.1145/3759179.3759194",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c186ae344856a591c2eb6095b66c14783baf7b3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper investigates the application of deep neural networks (DNN) for predicting labor market employment rates, aiming to enhance forecasting accuracy over traditional methods. Traditional time-series models, such as ARIMA and linear regression, struggle to analyze the complex, non-linear relationships within economic data. This research introduces a DNN model tailored to predict employment trends by utilizing multiple macroeconomic indicators as input variables. The model was trained using historical employment data and evaluated based on standard performance metrics. Results indicate that the DNN model significantly outperforms conventional models, achieving lower RMSE and higher predictive accuracy, thus demonstrating its potential for more robust and scalable labor market forecasts. Furthermore, the study outlines a systematic architecture for optimizing DNN performance, focusing on hyperparameter tuning and regularization techniques. Despite its success, the paper identifies challenges in model interpretability and real-time adaptability, suggesting avenues for future research to address these limitations. Future directions include enhancing model transparency, exploring hybrid forecasting approaches, and incorporating real-time economic data for improved prediction robustness.",
    "citationCount": 0,
    "referenceCount": 16
}