{
    "paperId": "c1a84477a52929123a03c3b1c22b582c6ad268f1",
    "title": "HARL: Hierarchical Adaptive Reinforcement Learning Based Auto Scheduler for Neural Networks",
    "year": 2022,
    "venue": "International Conference on Parallel Processing",
    "authors": [
        "Zining Zhang",
        "Bingsheng He",
        "Zhenjie Zhang"
    ],
    "doi": "10.1145/3545008.3545020",
    "arxivId": "2211.11172",
    "url": "https://www.semanticscholar.org/paper/c1a84477a52929123a03c3b1c22b582c6ad268f1",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3545008.3545020",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To efficiently perform inference with neural networks, the underlying tensor programs require sufficient tuning efforts before being deployed into production environments. Usually, enormous tensor program candidates need to be sufficiently explored to find the one with the best performance. This is necessary to make the neural network products meet the high demand of real-world applications such as natural language processing, auto-driving, etc. Auto-schedulers are being developed to avoid the need for human intervention. However, due to the gigantic search space and lack of intelligent search guidance, current auto-schedulers require hours to days of tuning time to find the best-performing tensor program for the entire neural network. In this paper, we propose HARL, a reinforcement learning (RL) based auto-scheduler specifically designed for efficient tensor program exploration. HARL uses a hierarchical RL architecture in which learning-based decisions are made at all different levels of search granularity. It also automatically adjusts exploration configurations in real-time for faster performance convergence. As a result, HARL improves the tensor operator performance by 22% and the search speed by 4.3x compared to the state-of-the-art auto-scheduler. Inference performance and search speed are also significantly improved on end-to-end neural networks.",
    "citationCount": 6,
    "referenceCount": 28
}