{
    "paperId": "c1a9c7130b6168c63f9052e088c255eb9eecd095",
    "title": "Partial Failure Resilient Memory Management System for (CXL-based) Distributed Shared Memory",
    "year": 2023,
    "venue": "Symposium on Operating Systems Principles",
    "authors": [
        "Mingxing Zhang",
        "Teng Ma",
        "Jinqi Hua",
        "Zheng Liu",
        "Kang Chen",
        "Ning Ding",
        "Fan Du",
        "Jinlei Jiang",
        "Tao Ma",
        "Yongwei Wu"
    ],
    "doi": "10.1145/3600006.3613135",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1a9c7130b6168c63f9052e088c255eb9eecd095",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3600006.3613135",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The efficiency of distributed shared memory (DSM) has been greatly improved by recent hardware technologies. But, the difficulty of distributed memory management can still be a major obstacle to the democratization of DSM, especially when a partial failure of the participating clients (e.g., due to crashed processes or machines) should be tolerated. In this paper, we present CXL-SHM, an automatic distributed memory management system based on reference counting. The reference count maintenance in CXL-SHM is implemented with a special era-based non-blocking algorithm. Thus, there are no blocking synchronization, memory leak, double free, and wild pointer problems, even if some participating clients unexpectedly fail without freeing their possessed memory references. We evaluated our system on real CXL hardware with both micro-benchmarks and end-to-end applications, which demonstrate the efficiency of CXL-SHM and the simplicity/flexibility of using CXL-SHM to build efficient distributed applications.",
    "citationCount": 39,
    "referenceCount": 89
}