{
    "paperId": "c1b76dcf7dd4fe711b9f48a93bfdd090a6cbdd0d",
    "title": "Near-Optimal Streaming Codes with Linear Field Size",
    "year": 2023,
    "venue": "International Symposium on Information Theory",
    "authors": [
        "Vinayak Ramkumar",
        "Shobhit Bhatnagar",
        "P. V. Kumar"
    ],
    "doi": "10.1109/ISIT54713.2023.10206862",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1b76dcf7dd4fe711b9f48a93bfdd090a6cbdd0d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Streaming codes are codes designed to ensure erased packet recovery with a decoding-delay deadline. In streaming code literature, an (a, b, w) sliding-window (SW) channel model is considered, in which within any window of w time slots, either a burst of ≤ b packets, or else ≤ a random packets can be erased. An (a, b, w, τ) streaming code is a packet-level code capable of recovering messages under a decoding delay of τ time slots, from any erasure pattern produced by an (a, b, w)-SW channel. For any given (a, b, w)-SW channel, the minimum delay with which the maximum rate possible over this channel can be achieved is τ = w−1. Rate-optimal constructions of streaming codes for any parameter tuple of the form (a, b, w, τ = w−1) are known in the literature. However, these constructions require a field size that is quadratic in w in general, and linear field size constructions are known only for a subset of {a, b, w} parameters. The current paper shows that it is possible to construct linear field size streaming codes for all {a, b, w} parameters, by sacrificing a little on either delay or rate. When the allowed delay is one more than the minimum, i. e., when τ = w, we construct linear field size rate-optimal streaming codes for all possible {a, b, w} parameters. This construction also leads to an O(w) field size (a, b, w, τ = w − 1) streaming code whose rate is close to the optimal rate. Additionally, we show that our construction can be modified to get binary streaming codes without too much loss in rate.",
    "citationCount": 4,
    "referenceCount": 25
}