{
    "paperId": "c1cf6d13996a02a00796131064f951c724252be1",
    "title": "Automation and Artificial Intelligence in Software Engineering: Experiences, Challenges, and Opportunities",
    "year": 2021,
    "venue": "Hawaii International Conference on System Sciences",
    "authors": [
        "M. Latinovic",
        "Viktoria Pammer-Schindler"
    ],
    "doi": "10.24251/HICSS.2021.017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1cf6d13996a02a00796131064f951c724252be1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automation and Artificial Intelligence have a transformative influence on many sectors, and software engineers are the actors who engineer this transformation. On the other hand, there is little knowledge of how automation and Artificial Intelligence impact software engineering practice. To answer this question, we conducted semi-structured interviews with experienced software practitioners across frontend and backend development, DevOps, R&D, integration, and leadership positions. Our findings reveal 1) automation to appear as micro-automation in the sense of automation of tiny and specific tasks, 2) automation as a side product of work, and bottom-up driven in software engineering, and 3) automation as a possible cause for cognitive overhead due to automatically generated notifications. Furthermore, we notice that our interview participants do not expect automation and artificial intelligence tools to change software engineering’s essence in the foreseeable future substantially.",
    "citationCount": 4,
    "referenceCount": 40
}