{
    "paperId": "c1d827cbec63c5e01deb1d8dcc96cc222d058a79",
    "title": "Viper: Interactive Exploration of Large Satellite Data✱✱",
    "year": 2023,
    "venue": "International Symposium on Spatial and Temporal Databases",
    "authors": [
        "Zhuocheng Shang",
        "Ahmed Eldawy"
    ],
    "doi": "10.1145/3609956.3609966",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1d827cbec63c5e01deb1d8dcc96cc222d058a79",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3609956.3609966",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Significant increase in high-resolution satellite data requires more productive analysis methods to benefit data scientists. Interactive exploration is essential to productivity since it keeps the user engaged by providing quick responses. This paper addresses the progressive zonal statistics problem that given big satellite data, an aggregate function, and a set of query polygons, zonal statistics computes the aggregate function for each query polygon over raster data. Efficiently querying complex polygons, reading high resolution pixels and process multiple polygons simultaneously are three main challenges. This work introduces Viper, an interactive exploration pipeline to overcome these challenges and achieve requirements. Viper uses a raster-vector index to bootstrap the answer with an accurate result in a short time. Then, it progressively refines the answer using a priority processing algorithm to produce the final answer. Experiments on large-scale real data show that Viper can reach 90% accuracy or higher up-to two orders of magnitude faster than baseline algorithms.",
    "citationCount": 1,
    "referenceCount": 45
}