{
    "paperId": "c1e87dff72eebd95c1c1ce27ce2c8aefb2fe6d72",
    "title": "CWODL: Cross-platform Data Analytics Workflow Optimization with Deep Learning",
    "year": 2025,
    "venue": "International Conference on Big Data and Smart Computing",
    "authors": [
        "Qinghua Du",
        "Kai Zhang",
        "Zhenying He",
        "Yinan Jing",
        "X. Wang",
        "Zhenqiang Chen",
        "Changchun Zhang"
    ],
    "doi": "10.1109/BigComp64353.2025.00041",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1e87dff72eebd95c1c1ce27ce2c8aefb2fe6d72",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the increasing data volume and application diversity, a big data system generally deploys complex workflows to perform data analysis. According to data types and job specifications, a data analysis workflow usually consists of tasks from different domains, including graph analysis, machine learning, and relational queries. Studies show that the performance of a task can be dramatically different when being deployed on different computing platforms. Therefore, building a cross-platform workflow with efficient platform selection can effectively enhance its performance. However, with other optimizations like operator reordering and relevant costs like data conversion and movements, the search space for platform selection becomes an order of magnitude larger, incurring huge overhead in optimization. In this paper, we propose CWODL, a cross-platform data analytics workflow optimization method with deep learning. With operator attributes for dependency analysis, we design an operator reordering scheme to generate promising workflows for platform selection. A model based on graph convolutional networks (GCNs) and long short-term memory networks (LSTMs) is proposed to estimate the cost of the generated workflows for platform selection. With a pruning algorithm to dynamically reduce the search space, CWODL efficiently improves the performance of workflows with a low optimization overhead. Experimental results show that CWODL can effectively enhance the performance of cross-platform workflows while reducing the optimization overhead by up to $\\mathbf{7 0 \\%}$.",
    "citationCount": 0,
    "referenceCount": 36
}