{
    "paperId": "c1ea3e062154a3eb00b446c4dec2b0b1aa7b0037",
    "title": "New Trends in Data Forgetting for Sustainable Data Management",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Ramón Rico",
        "Arno Siebes",
        "Yannis Velegrakis"
    ],
    "doi": "10.14778/3750601.3750697",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c1ea3e062154a3eb00b446c4dec2b0b1aa7b0037",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Our ability to collect data is rapidly surpassing our ability to store it. As a result, organizations are faced with difficult decisions about what data to retain, and in what form, in order to meet their business goals while complying with storage restrictions. This is typically known as data reduction. This tutorial aims at introducing researchers and practitioners to the topic, and provides a holistic overview of the recent advancement in the field. It covers fundamental principles of data summarization, with a particular emphasis on submodular algorithms, alongside a detailed discussion on the limited existing data forgetting routines. It further underscores the limitations of the data summarization paradigm by introducing the concept of \"data rotting\" and illustrates the necessity of adopting the new stack data reduction techniques: data forgetting routines. Last, but not least, it discusses the challenges and open research questions in this newly born field.",
    "citationCount": 0,
    "referenceCount": 32
}