{
    "paperId": "c224c465c12a67e4a680a5292483388d1e2f7cad",
    "title": "DBOS Network Sensing: A Web Services Approach to Collaborative Awareness",
    "year": 2025,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "Sophia Lockton",
        "J. Kepner",
        "Michael Stonebraker",
        "Hayden Jananthan",
        "LaToya Anderson",
        "W. Arcand",
        "David Bestor",
        "William Bergeron",
        "Alex Bonn",
        "Daniel J. Burrill",
        "C. Byun",
        "Tim Davis",
        "V. Gadepally",
        "Michael Houle",
        "M. Hubbell",
        "Michael Jones",
        "Piotr Luszczek",
        "P. Michaleas",
        "Lauren Milechin",
        "Chasen Milner",
        "Guillermo Morales",
        "J. Mullen",
        "Michel Pelletier",
        "Alex Poliakov",
        "Andrew Prout",
        "A. Reuther",
        "Antonio Rosa",
        "Charles Yee",
        "A. Pentland"
    ],
    "doi": "10.1109/HPEC67600.2025.11196670",
    "arxivId": "2509.09898",
    "url": "https://www.semanticscholar.org/paper/c224c465c12a67e4a680a5292483388d1e2f7cad",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "DBOS (DataBase Operating System) is a novel capability that integrates web services, operating system functions, and database features to significantly reduce web-deployment effort while increasing resilience. Integration of high performance network sensing enables DBOS web services to collaboratively create a shared awareness of their network environments to enhance their collective resilience and security. Network sensing is added to DBOS using GraphBLAS hypersparse traffic matrices via two approaches: (1) Python-GraphBLAS and (2) OneSparse PostgreSQL. These capabilities are demonstrated using the work-flow and analytics from the IEEE/MIT/Amazon Anonymized Network Sensing Graph Challenge. The system was parallelized using pPython and benchmarked using 64 compute nodes on the MIT SuperCloud. The web request rate sustained by a single DBOS instance was >105, well above the required maximum, indicating that network sensing can be added to DBOS with negligible overhead. For collaborative awareness, many DBOS instances were connected to a single DBOS aggregator. The Python-GraphBLAS and OneSparse PostgreSQL implementations scaled linearly up to 64 and 32 nodes respectively. These results suggest that DBOS collaborative network awareness can be achieved with a negligible increase in computing resources.",
    "citationCount": 0,
    "referenceCount": 38
}