{
    "paperId": "c22621ebbdd9c5d73b2eeb2b57dbc9f3547b780e",
    "title": "Neural Ranking with Weak Supervision for Open-Domain Question Answering : A Survey",
    "year": 2023,
    "venue": "Findings",
    "authors": [
        "Xiaoyu Shen",
        "Svitlana Vakulenko",
        "Marco Del Tredici",
        "Gianni Barlacchi",
        "B. Byrne",
        "A. de Gispert"
    ],
    "doi": "10.18653/v1/2023.findings-eacl.129",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c22621ebbdd9c5d73b2eeb2b57dbc9f3547b780e",
    "isOpenAccess": true,
    "openAccessPdf": "https://aclanthology.org/2023.findings-eacl.129.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural ranking (NR) has become a key component for open-domain question-answering in order to access external knowledge. However, training a good NR model requires substantial amounts of relevance annotations, which is very costly to scale. To address this, a growing body of research works have been proposed to reduce the annotation cost by training the NR model with weak supervision (WS) instead. These works differ in what resources they require and employ a diverse set of WS signals to train the model. Understanding such differences is crucial for choosing the right WS technique. To facilitate this understanding, we provide a structured overview of standard WS signals used for training a NR model. Based on their required resources, we divide them into three main categories: (1) only documents are needed; (2) documents and questions are needed; and (3) documents and question-answer pairs are needed. For every WS signal, we review its general idea and choices. Promising directions are outlined for future research.",
    "citationCount": 4,
    "referenceCount": 137
}