{
    "paperId": "c247139641385ca267aeefa6a680eb71761cb5c1",
    "title": "AI-Powered Fibre Channel Congestion Detection and Resolution: Transforming SAN Network Resilience Through Intelligent Automation",
    "year": 2025,
    "venue": "European journal of computer science and information technology",
    "authors": [
        "Derek Asir Muthurajan Caleb"
    ],
    "doi": "10.37745/ejcsit.2013/vol13n22114125",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c247139641385ca267aeefa6a680eb71761cb5c1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fibre Channel Storage Area Networks (SANs) have long been plagued by congestion issues that degrade performance and disrupt critical business operations. This article explores the transformative role of artificial intelligence in revolutionizing congestion detection and resolution within FC networks. By leveraging advanced machine learning algorithms and neural network models, AI systems can now automatically correlate seemingly disparate network anomalies, accurately identify root causes of credit stalls, and implement autonomous remediation strategies without human intervention. The integration of AI-driven analytics enables a paradigm shift from reactive troubleshooting to proactive management, effectively eradicating persistent congestion through intelligent buffer credit management and dynamic path optimization. Organizations implementing these solutions experience significantly improved network resilience, enhanced application performance, and reduced operational overhead, positioning AI as an essential component in modern SAN infrastructure management.",
    "citationCount": 0,
    "referenceCount": 3
}