{
    "paperId": "c282ad350fafd7b2301355099c4bdcf3107995ce",
    "title": "SASNet: Stage-aware Sequential Matching for Online Travel Recommendation",
    "year": 2022,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Fanwei Zhu",
        "Zulong Chen",
        "Fan Zhang",
        "Jiazhen Lou",
        "Hong Wen",
        "Shui Liu",
        "Qi Rao",
        "Tengfei Yuan",
        "Shenghua Ni",
        "Jinxin Hu",
        "Fuzhen Sun",
        "Quan Lu"
    ],
    "doi": "10.1145/3511808.3557126",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c282ad350fafd7b2301355099c4bdcf3107995ce",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sequential matching, which aims to predict the item a user will next interact with in the sequential context of the user's historical behaviors, is widely adopted in recommender systems. Existing works mainly characterize the sequential context as the dependencies of user interactions, which is less effective for online travel recommendation where users' behaviors are highly correlated with theirstages in the travel life cycle. Specifically, users on an online travel platform (OTP) usually go through different stages (e.g., exploring a destination, planning an itinerary), and make several correlated interactions (e.g., booking a flight, reserving a hotel, renting a car) at each stage. In this paper, we propose to capture the deep sequential context by modeling the evolving of user stages, and develop a novel stage-aware deep sequential matching network (SASNet) that incorporates inter-stage and intra-stage dependencies over stage-augmented interaction sequence for more accurate and interpretable recommendation. Extensive experiments on real-world datasets validate the superiority of our model for both online travel recommendation and general next-item recommendation. Our model has been successfully deployed at Fliggy, one of the most popular OTPs in China, and shows good performance in serving online traffic.",
    "citationCount": 4,
    "referenceCount": 47
}