{
    "paperId": "c2c84e35fe52604c276770fc1281f7825ac0255e",
    "title": "UniKV: Toward High-Performance and Scalable KV Storage in Mixed Workloads via Unified Indexing",
    "year": 2020,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Qiang Zhang",
        "Yongkun Li",
        "P. Lee",
        "Yinlong Xu",
        "Qiu Cui",
        "L. Tang"
    ],
    "doi": "10.1109/ICDE48307.2020.00034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c2c84e35fe52604c276770fc1281f7825ac0255e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Persistent key-value (KV) stores are mainly designed based on the Log-Structured Merge-tree (LSM-tree), which suffer from large read and write amplifications, especially when KV stores grow in size. Existing design optimizations for LSM-tree-based KV stores often make certain trade-offs and fail to simultaneously improve both the read and write performance on large KV stores without sacrificing scan performance. We design UniKV, which unifies the key design ideas of hash indexing and the LSM-tree in a single system. Specifically, UniKV leverages data locality to differentiate the indexing management of KV pairs. It also develops multiple techniques to tackle the issues caused by unifying the indexing techniques, so as to simultaneously improve the performance in reads, writes, and scans. Experiments show that UniKV significantly outperforms several state-of-the-art KV stores (e.g., LevelDB, RocksDB, HyperLevelDB, and PebblesDB) in overall throughput under read-write mixed workloads.",
    "citationCount": 22,
    "referenceCount": 45
}