{
    "paperId": "c2ca50a636011abc0eea8f8b972f3ba997e80ac5",
    "title": "In-Network Machine Learning Using Programmable Network Devices: A Survey",
    "year": 2024,
    "venue": "IEEE Communications Surveys and Tutorials",
    "authors": [
        "Changgang Zheng",
        "Xinpeng Hong",
        "Damu Ding",
        "S. Vargaftik",
        "Y. Ben-Itzhak",
        "Noa Zilberman"
    ],
    "doi": "10.1109/COMST.2023.3344351",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c2ca50a636011abc0eea8f8b972f3ba997e80ac5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning is widely used to solve networking challenges, ranging from traffic classification and anomaly detection to network configuration. However, machine learning also requires significant processing and often increases the load on both networks and servers. The introduction of in-network computing, enabled by programmable network devices, has allowed to run applications within the network, providing higher throughput and lower latency. Soon after, in-network machine learning solutions started to emerge, enabling machine learning functionality within the network itself. This survey introduces the concept of in-network machine learning and provides a comprehensive taxonomy. The survey provides an introduction to the technology and explains the different types of machine learning solutions built upon programmable network devices. It explores the different types of machine learning models implemented within the network, and discusses related challenges and solutions. In-network machine learning can significantly benefit cloud computing and next-generation networks, and this survey concludes with a discussion of future trends.",
    "citationCount": 45,
    "referenceCount": 272
}