{
    "paperId": "c2fa234572e8968b6e809d8d5c338183c2893a75",
    "title": "Apache Nemo: A Framework for Optimizing Distributed Data Processing",
    "year": 2020,
    "venue": "ACM Transactions on Computer Systems",
    "authors": [
        "Won Wook Song",
        "Youngseok Yang",
        "Jeongyoon Eo",
        "J. Seo",
        "J. Kim",
        "Sanha Lee",
        "Gyewon Lee",
        "Taegeon Um",
        "Haeyoon Cho",
        "Byung-Gon Chun"
    ],
    "doi": "10.1145/3468144",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c2fa234572e8968b6e809d8d5c338183c2893a75",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1145/3468144",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimizing scheduling and communication of distributed data processing for resource and data characteristics is crucial for achieving high performance. Existing approaches to such optimizations largely fall into two categories. First, distributed runtimes provide low-level policy interfaces to apply the optimizations, but do not ensure the maintenance of correct application semantics and thus often require significant effort to use. Second, policy interfaces that extend a high-level application programming model ensure correctness, but do not provide sufficient fine control. We describe Apache Nemo, an optimization framework for distributed dataflow processing that provides fine control for high performance and also ensures correctness for ease of use. We combine several techniques to achieve this, including an intermediate representation of dataflow, compiler optimization passes, and runtime extensions. Our evaluation results show that Nemo enables composable and reusable optimizations that bring performance improvements on par with existing specialized runtimes tailored for a specific deployment scenario. Apache Nemo is open-sourced at https://nemo.apache.org as an Apache incubator project.",
    "citationCount": 4,
    "referenceCount": 53
}