{
    "paperId": "c3364b1fb446763cf56d5532f2ded29076e6d01f",
    "title": "Task-Oriented GNNs Training on Large Knowledge Graphs for Accurate and Efficient Modeling",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Hussein Abdallah",
        "Waleed Afandi",
        "Panos Kalnis",
        "Essam Mansour"
    ],
    "doi": "10.1109/ICDE60146.2024.00148",
    "arxivId": "2403.05752",
    "url": "https://www.semanticscholar.org/paper/c3364b1fb446763cf56d5532f2ded29076e6d01f",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2403.05752",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A Knowledge Graph (KG) is a heterogeneous graph encompassing a diverse range of node and edge types. Heterogeneous Graph Neural Networks (HGNNs) are popular for training machine learning tasks like node classification and link prediction on KGs. However, HGNN methods exhibit excessive complexity influenced by the KG's size, density, and the number of node and edge types. AI practitioners handcraft a subgraph of a KG $G$ relevant to a specific task. We refer to this subgraph as a task-oriented subgraph (TOSG), which contains a subset of task-related node and edge types in $G$. Training the task using TOSG instead of $G$ alleviates the excessive computation required for a large KG. Crafting the TOSG demands a deep understanding of the KG's structure and the task's objectives. Hence, it is challenging and time-consuming. This paper proposes KG-TOSA, an approach to automate the TOSG extraction for task-oriented HGNN training on a large KG. In KG-TOSA, we define a generic graph pattern that captures the KG's local and global structure relevant to a specific task. We explore different techniques to extract subgraphs matching our graph pattern: namely (i) two techniques sampling around targeted nodes using biased random walk or influence scores, and (ii) a SPARQL-based extraction method leveraging RDF engines' built-in indices. Hence, it achieves negligible preprocessing overhead compared to the sampling techniques. We develop a benchmark of real KGs of large sizes and various tasks for node classification and link prediction. Our experiments show that KG-TOSA helps state-of-the-art HGNN methods reduce training time and memory usage by up to 70% while improving the model performance, e.g., accuracy and inference time.",
    "citationCount": 3,
    "referenceCount": 52
}