{
    "paperId": "c33677cb2e7a6189164feb0fd3340ee567130d25",
    "title": "Construction and analysis of multi-relationship bipartite network model",
    "year": 2023,
    "venue": "Complex & Intelligent Systems",
    "authors": [
        "Hehe Lv",
        "Bofeng Zhang",
        "Tingting Li",
        "Shengxiang Hu"
    ],
    "doi": "10.1007/s40747-023-01038-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c33677cb2e7a6189164feb0fd3340ee567130d25",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s40747-023-01038-y.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bipartite networks that characterize complex relationships among data arise in various domains. The existing bipartite network models are mainly based on a type of relationship between objects, and cannot effectively describe multiple relationships in the real world. In this paper, we propose a multi-relationship bipartite network (MBN) model, which can describe multiple relationships between two types of objects, and realizes simple weighted bipartite network reconstruction. Our model contains three major modules, namely multi-relationship bipartite network modeling (MBNM), multi-relationship aggregation module (MAM) and network reconstruction module (NRM). In MBNM, a multi-relationship bipartite network is proposed to describe multiple relationships between two types of objects. In the MAM, considering that different relationships have different information for the model, we introduce a novel relationship-level attention mechanism, and the aggregation of multiple relationships is carried out through the importance of each relationship. Based on the learning framework, the NRM can learn the potential representations of nodes after multi-relationship aggregation, and design a nonlinear fusion mechanism to reconstruct weighted bipartite network. We conducted extensive experiments on three real-world datasets and the results show that multi-relationship aggregation can effectively improve the performance of the model. In addition, experiments also show that our model can outperform existing competitive baseline method.",
    "citationCount": 3,
    "referenceCount": 58
}