{
    "paperId": "c35adf54eef45dadd7be424d6407d10491693c4a",
    "title": "Applying Keras-Based Deep Learning for Intelligent Analysis in Network Security and Monitoring Systems",
    "year": 2025,
    "venue": "Babylonian Journal of Networking",
    "authors": [
        "Syfian Yousef"
    ],
    "doi": "10.58496/bjn/2025/009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c35adf54eef45dadd7be424d6407d10491693c4a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the advent of digital age, network access and protection of sensitive data from unauthorized access or use has been a great challenge. Face detection and recognition is becoming a prevalent method in network security system by utilising the biometric principles. In this survey, we use Convolutional Neural Networks (CNNs) and the Keras deep learning framework to improve network security by building efficient face detection systems. A high-level and user-friendly API implemented by Keras (over TensorFlow), which makes it very easy to use deep learning models for tasks such as face detection. Being multi-GPU ready and distributed training friendly alongside compatibility with OpenCV and TensorFlow enables it to be used in developing reliable, secure, real-time face authentication systems. In this paper, we review the statistics of CNN models for face detection, compare performance of the Keras models on multiple datasets, and show applications of securing a network such as login authentication and access control, as well as real-world uses for surveillance system. In addition, the survey details applications of face detection where the possibility of face spoofing is an issue and current research directions on the topic. Utilizing CNNs with Keras can enable the development of more flexible, performative, and accurate biometric authentication systems, and these systems play a critical role in the global cybersecurity ecosystem.\n \n \n \n \n \n \n ",
    "citationCount": 0,
    "referenceCount": 44
}