{
    "paperId": "c3680faa12caf9f2af76ec426c25a6045a1cd587",
    "title": "Analyzing and Assessing Pollution Attacks on Bloom Filters: Some Filters are More Vulnerable than Others",
    "year": 2021,
    "venue": "Conference on Network and Service Management",
    "authors": [
        "P. Reviriego",
        "Ori Rottenstreich",
        "Shanshan Liu",
        "Fabrizio Lombardi"
    ],
    "doi": "10.23919/CNSM52442.2021.9615566",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c3680faa12caf9f2af76ec426c25a6045a1cd587",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bloom filters are probabilistic data structures that are popular in networking for set representation; however, they show an inherent inaccuracy due to false positives. One of the potential attacks on Bloom filters is to pollute them with elements that cause the filter to have a larger false positive probability than under normal operation; Pollution is simple when an attacker knows the details of the filter implementation. Recent research has shown that also black-box adversaries can pollute a counting Bloom filter (a common variant of the filter that also supports removals) with no knowledge of its implementation. As over time, many variants and improvements of Bloom filters have been proposed, it is of interest to study whether they can also be polluted and if so also the increase in their false positive probability. This paper first proposes and then evaluates pollution attacks for some of the most common variants including the Block Bloom filters (BBFs), the Variable Increment and Fingerprint Counting Bloom filters (VI-CBFs and FP-CBFs). The results show that with or without knowledge of the implementation, these variants of the Bloom filter are significantly more vulnerable to pollution attacks than the traditional Bloom filter. In particular, BBFs are extremely vulnerable, so providing an insight on their impact and use in practical systems when the number of memory accesses per lookup must be reduced.",
    "citationCount": 3,
    "referenceCount": 33
}