{
    "paperId": "c37fc281ad01a0c4f401b6758cf10a705564078b",
    "title": "Software Engineering Education Must Adapt and Evolve for an LLM Environment",
    "year": 2024,
    "venue": "Technical Symposium on Computer Science Education",
    "authors": [
        "V. Kirova",
        "Cyril S. Ku",
        "Joseph R. Laracy",
        "Thomas J. Marlowe"
    ],
    "doi": "10.1145/3626252.3630927",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c37fc281ad01a0c4f401b6758cf10a705564078b",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3626252.3630927",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the era of artificial intelligence (AI), generative AI, and Large Language Models (LLMs) in particular, have become increasingly significant in various sectors. LLMs such as GPT expand their applications, from content creation to advanced code completion. They offer unmatched opportunities but pose unique challenges to the software engineering domain. This paper discusses the necessity and urgency for software engineering education to adapt and evolve to prepare software engineers for the emerging LLM environment. While existing literature and social media have investigated AI's integration into various educational spheres, there is a conspicuous gap in examining the specifics of LLMs' implications for software engineering education. We explore the goals of software engineering education, and changes to software engineering, software engineering education, course pedagogy, and ethics. We argue that a holistic approach is needed, combining technical skills, ethical awareness, and adaptable learning strategies. This paper seeks to contribute to the ongoing conversation about the future of software engineering education, emphasizing the importance of adapting and evolving to remain in sync with rapid advancements in AI and LLMs. It is hoped that this exploration will provide valuable insights for educators, curriculum developers, and policymakers in software engineering.",
    "citationCount": 42,
    "referenceCount": 40
}