{
    "paperId": "c39bb75827220645c0b9234e4d23184913fff229",
    "title": "Large language models open new way of AI-assisted molecule design for chemists",
    "year": 2025,
    "venue": "Journal of Cheminformatics",
    "authors": [
        "Shoichi Ishida",
        "Tomohiro Sato",
        "Teruki Honma",
        "Kei Terayama"
    ],
    "doi": "10.1186/s13321-025-00984-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c39bb75827220645c0b9234e4d23184913fff229",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advancements in artificial intelligence (AI)-based molecular design methodologies have offered synthetic chemists new ways to design functional molecules with their desired properties. While various AI-based molecule generators have significantly advanced toward practical applications, their effective use still requires specialized knowledge and skills concerning AI techniques. Here, we develop a large language model (LLM)-powered chatbot, ChatChemTS, that assists users in designing new molecules using an AI-based molecule generator through only chat interactions, including automated construction of reward functions for the specified properties. Our study showcases the utility of ChatChemTS through de novo design cases involving chromophores and anticancer drugs (epidermal growth factor receptor inhibitors), exemplifying single- and multiobjective molecule optimization scenarios, respectively. ChatChemTS is provided as an open-source package on GitHub at https://github.com/molecule-generator-collection/ChatChemTS. Scientific contribution ChatChemTS is an open-source application that assists users in utilizing an AI-based molecule generator, ChemTSv2, solely through chat interactions. This study demonstrates that LLMs possess the potential to utilize advanced software, such as AI-based molecular generators, which require specialized knowledge and technical skills. Supplementary Information The online version contains supplementary material available at 10.1186/s13321-025-00984-8.",
    "citationCount": 6,
    "referenceCount": 53
}