{
    "paperId": "c3a8ae4a38582ae0a7698d79359d96c363eda2f7",
    "title": "Extensions for compiler infrastructure for neural networks to support automated generation of high-performance tensor programs for DSPs",
    "year": 2024,
    "venue": "Symposium on Advances in Electrical, Electronics and Computer Engineering",
    "authors": [
        "Ruiquan Huang",
        "Zhe Li",
        "Yuxiong Ji",
        "Jing Yang",
        "Yaohua Wang"
    ],
    "doi": "10.1117/12.3034293",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c3a8ae4a38582ae0a7698d79359d96c363eda2f7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To widely apply deep learning technology, it is necessary to deploy neural network models on different hardware platforms. Multi-core Digital Signal Processors (DSPs), as one of these platforms, exhibit the potential to accelerate deep learning in specific applications and scenarios due to their energy efficiency advantages. CINN, as an AI compiler, is been proposed for deploying DNN models on diverse hardware devices. However, due to differences in hardware architectures, there is a risk of poor utilization of memory and computing resources, leading to increased execution time. In this work, we propose several extensions to achieve optimization specific to DSPs, and allow CINN to automatically generate high-performance tensor programs for our DSPs through a search approach. Experimental result shows that there is a significant improvement in execution performance for the automatically generated tensor operators containing reduction operation compared to manual schedule.",
    "citationCount": 0,
    "referenceCount": 14
}