{
    "paperId": "c3bc547fc48ab9557457be003feea036adec1b4b",
    "title": "D-Bot: Database Diagnosis System using Large Language Models",
    "year": 2023,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Xuanhe Zhou",
        "Guoliang Li",
        "Zhaoyan Sun",
        "Zhiyuan Liu",
        "Weize Chen",
        "Jianming Wu",
        "Jiesi Liu",
        "Ruohang Feng",
        "Guoyang Zeng"
    ],
    "doi": "10.48550/arXiv.2312.01454",
    "arxivId": "2312.01454",
    "url": "https://www.semanticscholar.org/paper/c3bc547fc48ab9557457be003feea036adec1b4b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Database administrators (DBAs) play an important role in managing database systems. However, it is hard and tedious for DBAs to manage vast database instances and give timely response (waiting for hours is intolerable in many online cases). In addition, existing empirical methods only support limited diagnosis scenarios, which are also labor-intensive to update the diagnosis rules for database version updates. Recently large language models (LLMs) have shown great potential in various fields. Thus, we propose\n D-Bot\n , an LLM-based database diagnosis system that can automatically acquire knowledge from diagnosis documents, and generate reasonable and well-founded diagnosis report (i.e., identifying the root causes and solutions) within acceptable time (e.g., under 10 minutes compared to hours by a DBA). The techniques in\n D-Bot\n include (\n i\n ) offline knowledge extraction from documents, (\n ii\n ) automatic prompt generation (e.g., knowledge matching, tool retrieval), (\n iii\n ) root cause analysis using tree search algorithm, and (\n iv\n ) collaborative mechanism for complex anomalies with multiple root causes. We verify\n D-Bot\n on real benchmarks (including 539 anomalies of six typical applications), and the results show\n D-Bot\n can effectively identify root causes of unseen anomalies and\n significantly outperforms traditional methods and vanilla models like GPT-4.\n",
    "citationCount": 31,
    "referenceCount": 69
}