{
    "paperId": "c425b5a1be8d5efa9d8fb3f54ab5ab8b85d6fdd6",
    "title": "Binary Neural Networks in FPGAs: Architectures, Tool Flows and Hardware Comparisons",
    "year": 2023,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Yuanxin Su",
        "K. Seng",
        "L. Ang",
        "Jeremy Smith"
    ],
    "doi": "10.3390/s23229254",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c425b5a1be8d5efa9d8fb3f54ab5ab8b85d6fdd6",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/23/22/9254/pdf?version=1700235552",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Binary neural networks (BNNs) are variations of artificial/deep neural network (ANN/DNN) architectures that constrain the real values of weights to the binary set of numbers {−1,1}. By using binary values, BNNs can convert matrix multiplications into bitwise operations, which accelerates both training and inference and reduces hardware complexity and model sizes for implementation. Compared to traditional deep learning architectures, BNNs are a good choice for implementation in resource-constrained devices like FPGAs and ASICs. However, BNNs have the disadvantage of reduced performance and accuracy because of the tradeoff due to binarization. Over the years, this has attracted the attention of the research community to overcome the performance gap of BNNs, and several architectures have been proposed. In this paper, we provide a comprehensive review of BNNs for implementation in FPGA hardware. The survey covers different aspects, such as BNN architectures and variants, design and tool flows for FPGAs, and various applications for BNNs. The final part of the paper gives some benchmark works and design tools for implementing BNNs in FPGAs based on established datasets used by the research community.",
    "citationCount": 6,
    "referenceCount": 88
}