{
    "paperId": "c49cc91173808a47a5dd899a0536a0ed736d5e82",
    "title": "SOFOS: Demonstrating the Challenges of Materialized View Selection on Knowledge Graphs",
    "year": 2021,
    "venue": "SIGMOD Conference",
    "authors": [
        "Georgia Troullinou",
        "H. Kondylakis",
        "Matteo Lissandrini",
        "D. Mottin"
    ],
    "doi": "10.1145/3448016.3452765",
    "arxivId": "2103.06531",
    "url": "https://www.semanticscholar.org/paper/c49cc91173808a47a5dd899a0536a0ed736d5e82",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2103.06531",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analytical queries over RDF data are becoming prominent as a result of the proliferation of knowledge graphs. Yet, RDF databases are not optimized to perform such queries efficiently, leading to long processing times. A well known technique to improve the performance of analytical queries is to exploit materialized views.Although popular in relational databases, view materialization for RDF and SPARQL has not yet transitioned into practice, due to the non-trivial application to the RDF graph model. Motivated by a lack of understanding of the impact of view materialization alternatives for RDF data, we demonstrate Sofos, a system that implements and compares several cost models for view materialization. Sofos is, to the best of our knowledge, the first attempt to adapt cost models, initially studied in relational data, to the generic RDF setting, and to propose new ones, analyzing their pitfalls and merits. Sofos takes an RDF dataset and an analytical query for some facet in the data, and compares and evaluates alternative cost models, displaying statistics and insights about time, memory consumption, and query characteristics.",
    "citationCount": 14,
    "referenceCount": 24
}