{
    "paperId": "c4a9a392ce6b34a66aba95aa3096c1ad9af4c098",
    "title": "RAG-Driven Memory Architectures in Conversational LLMs—A Literature Review With Insights Into Emerging Agriculture Data Sharing",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "Nur Arifin Akbar",
        "Rahool Dembani",
        "B. Lenzitti",
        "Domenico Tegolo"
    ],
    "doi": "10.1109/ACCESS.2025.3589241",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c4a9a392ce6b34a66aba95aa3096c1ad9af4c098",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite significant advances in natural language processing, conversational AI systems face persistent challenges in maintaining extensive and contextually coherent dialogues, particularly regarding long-term memory management. This literature review synthesizes current approaches to memory architectures in conversational AI, examining the transition from basic dialogue agents to more sophisticated, agentic frameworks. We analyze how vector databases and Retrieval-Augmented Generation (RAG) address fundamental challenges in storing and retrieving conversational context, maintaining system responsiveness, managing user-specific data ethically, and integrating domain-specific information. Through systematic review of papers, we identify critical limitations of vector embedding in capturing extended conversational context, particularly in agentic domains requiring semantic, episodic, procedural, and emotional memory. We evaluate how RAG frameworks can augment vector databases to handle memory-intensive tasks requiring real-time updates and domain-specific knowledge integration. Furthermore, we examine alternative architectures including knowledge graphs, finite state machines, and hybrid solutions, highlighting the data quality and ethical challenges that must be addressed for scalable, reliable AI memory management. Our analysis provides a structured framework for understanding memory evolution in conversational AI, identifies gaps in current RAG solutions, proposes hybrid memory designs, and outlines future research directions emphasizing cross-domain applications in agriculture.",
    "citationCount": 0,
    "referenceCount": 116
}