{
    "paperId": "c4affe78f824f8dc604201ad40cd00c381297d7c",
    "title": "Exploring the Upper Limits of Text-Based Collaborative Filtering Using Large Language Models: Discoveries and Insights",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Ruyu Li",
        "Wenhao Deng",
        "Yu Cheng",
        "Zheng Yuan",
        "Jiaqi Zhang",
        "Fajie Yuan"
    ],
    "doi": "10.48550/arXiv.2305.11700",
    "arxivId": "2305.11700",
    "url": "https://www.semanticscholar.org/paper/c4affe78f824f8dc604201ad40cd00c381297d7c",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.11700",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Text-based collaborative filtering (TCF) has become the mainstream approach for text and news recommendation, utilizing text encoders, also known as language models (LMs), to represent items. However, existing TCF models primarily focus on using small or medium-sized LMs. It remains uncertain what impact replacing the item encoder with one of the largest and most powerful LMs, such as the 175-billion parameter GPT-3 model, would have on recommendation performance. Can we expect unprecedented results? To this end, we conduct an extensive series of experiments aimed at exploring the performance limits of the TCF paradigm. Specifically, we increase the size of item encoders from one hundred million to one hundred billion to reveal the scaling limits of the TCF paradigm. We then examine whether these extremely large LMs could enable a universal item representation for the recommendation task. Furthermore, we compare the performance of the TCF paradigm utilizing the most powerful LMs to the currently dominant ID embedding-based paradigm and investigate the transferability of this TCF paradigm. Finally, we compare TCF with the recently popularized prompt-based recommendation using ChatGPT. Our research findings have not only yielded positive results but also uncovered some surprising and previously unknown negative outcomes, which can inspire deeper reflection and innovative thinking regarding text-based recommender systems. Codes and datasets will be released for further research.",
    "citationCount": 56,
    "referenceCount": 66
}