{
    "paperId": "c4beb19c14357fb3a0d07a146ad088b31987a86c",
    "title": "Microbiome composition shapes temperature tolerance in a Hawaiian picture-winged Drosophila",
    "year": 2025,
    "venue": "bioRxiv",
    "authors": [
        "Donald K. Price",
        "Kristian West",
        "Michelle Cevallos-Zea",
        "S. Cahan",
        "J. C. Nunez",
        "Emily K. Longman",
        "Joanne Y. Yew",
        "Matthew J. Mederios"
    ],
    "doi": "10.1101/2025.06.03.657679",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c4beb19c14357fb3a0d07a146ad088b31987a86c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hawaiian picture-winged Drosophila are undergoing rapid biodiversity loss, with twelve species listed as endangered and others in decline. Gut microbiota are increasingly recognized as contributors to host adaptation that are capable of influencing stress tolerance, reproduction, and other fitness-related traits. We investigated the role of microbial communities in local adaptation using two populations of Drosophila basisetae from Hawaiian rainforests at 900 m and 1200 m elevation. Microbiome profiling of wild flies by high throughput amplicon sequencing revealed distinct bacterial and fungal communities between sites. Whole-genome resequencing of the two Drosophila populations identified weak but significant population genetic structure, with evidence of admixture and gene flow. Despite this connectivity, 16 outlier SNPs across 18 genes showed patterns consistent with divergent selection, suggesting localized adaptation. To test microbiome effects on host physiology experimentally, we conducted a fully factorial research design with microbiome inoculations in laboratory-reared flies acclimated to 18 °C (control) or 24 °C (stressful). Flies treated with low-elevation microbiota had higher survival across temperatures, whereas those treated with high-elevation microbiota produced more eggs, indicating microbiome-mediated differences in reproductive investment. Activity levels at 18 °C were higher when flies received microbiota from their native population. Measures of critical thermal maximum (CTmax) and male accessory gland size showed complex interactions among microbiome source, temperature, and fly population. These results indicate that microbes may modulate host thermal tolerance and reproduction in environmentally-dependent and population-specific ways. Our findings suggest that microbiome-host-environment interactions may contribute to both phenotypic plasticity and evolutionary adaptation to enhance resilience to environmental stress, with important implications for conservation in rapidly changing Hawaiian ecosystems. Summary statement This study demonstrates that microbiome composition influences thermal tolerance through alterations in survival and reproduction in the Hawaiian picture wing, Drosophila basisetae, potentially contributing to adaptive phenotypic changes between populations.",
    "citationCount": 0,
    "referenceCount": 53
}