{
    "paperId": "c4da90aa98c558c5e897c81db2af3de7c20fd759",
    "title": "Distributed Admm with Limited Communications Via Deep Unfolding",
    "year": 2023,
    "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing",
    "authors": [
        "Yoav Noah",
        "Nir Shlezinger"
    ],
    "doi": "10.1109/ICASSP49357.2023.10096455",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c4da90aa98c558c5e897c81db2af3de7c20fd759",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/icassp49357.2023.10096455",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Distributed optimization arises in various applications. A widely-used distributed optimizer is the distributed alternating direction method of multipliers (D-ADMM) algorithm, which enables agents to jointly minimize a shared objective by iteratively combining local computations and message exchanges. However, D-ADMM often involves a large number of possibly costly communications to reach convergence, limiting its applicability in communications-constrained networks. In this work we propose unfolded D-ADMM, which facilitates the application of D-ADMM with limited communications using the emerging deep unfolding methodology. We utilize the conventional D-ADMM algorithm with a fixed number of communications rounds, while leveraging data to tune the hyperparameters of each iteration of the algorithm. By doing so, we learn to optimize with limited communications, while preserving the interpretability and flexibility of the original D-ADMM algorithm. Our numerical results demonstrate that the proposed approach dramatically reduces the number of communications utilized by D-ADMM, without compromising on its performance.",
    "citationCount": 3,
    "referenceCount": 17
}