{
    "paperId": "c4ec534bd46033b862f3b6746da4b185e2222d6f",
    "title": "Computational Benefits of Intermediate Rewards for Goal-Reaching Policy Learning",
    "year": 2021,
    "venue": "Journal of Artificial Intelligence Research",
    "authors": [
        "Yuexiang Zhai",
        "Christina Baek",
        "Zhengyuan Zhou",
        "Jiantao Jiao",
        "Yi Ma"
    ],
    "doi": "10.1613/jair.1.13326",
    "arxivId": "2107.03961",
    "url": "https://www.semanticscholar.org/paper/c4ec534bd46033b862f3b6746da4b185e2222d6f",
    "isOpenAccess": true,
    "openAccessPdf": "https://jair.org/index.php/jair/article/download/13326/26777",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n \n \nMany goal-reaching reinforcement learning (RL) tasks have empirically verified that rewarding the agent on subgoals improves convergence speed and practical performance. We attempt to provide a theoretical framework to quantify the computational benefits of rewarding the completion of subgoals, in terms of the number of synchronous value iterations. In particular, we consider subgoals as one-way intermediate states, which can only be visited once per episode and propose two settings that consider these one-way intermediate states: the one-way single-path (OWSP) and the one-way multi-path (OWMP) settings. In both OWSP and OWMP settings, we demonstrate that adding intermediate rewards to subgoals is more computationally efficient than only rewarding the agent once it completes the goal of reaching a terminal state. We also reveal a trade-off between computational complexity and the pursuit of the shortest path in the OWMP setting: adding intermediate rewards significantly reduces the computational complexity of reaching the goal but the agent may not find the shortest path, whereas with sparse terminal rewards, the agent finds the shortest path at a significantly higher computational cost. We also corroborate our theoretical results with extensive experiments on the MiniGrid environments using Q-learning and some popular deep RL algorithms. \n \n \n",
    "citationCount": 26,
    "referenceCount": 80
}