{
    "paperId": "c4f754ecfc918d51aa2950c8f72ad6c89cd63798",
    "title": "A Research for Travel Mode Identification Based on Cellular Signaling Data",
    "year": 2022,
    "venue": "2022 IEEE Smartworld, Ubiquitous Intelligence & Computing, Scalable Computing & Communications, Digital Twin, Privacy Computing, Metaverse, Autonomous & Trusted Vehicles (SmartWorld/UIC/ScalCom/DigitalTwin/PriComp/Meta)",
    "authors": [
        "Yang Zhang",
        "Dongchao Ma",
        "Fan Zhang",
        "Yan Li",
        "Yuzhu Jin",
        "Lihua Song",
        "Laizhong Cui"
    ],
    "doi": "10.1109/SmartWorld-UIC-ATC-ScalCom-DigitalTwin-PriComp-Metaverse56740.2022.00067",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c4f754ecfc918d51aa2950c8f72ad6c89cd63798",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Under COVID-19, due to the comprehensive coverage and accessible collection of cellular signal data (CSD), CSD-based travel mode identification (TMI) has become a viable solution for close contact investigation. However, the accuracy of existing research is insufficient, and more accurate identification methods are needed when faced with more infectious Omicron variants. This paper proposes a scheme based on machine learning, including data cleaning and TMI. This paper is the first application of machine learning to CSD data cleaning. First, data annotation must find the CSD consecutive subsequence closest to GPS (CSCG). This paper proposes a sequence segmentation algorithm (SSA) that reduces the search space to a linear level. Then, for complex drift and oscillation sequences, this paper proposes the full point view clean model (FPVM). Regarding TMI, this paper proposes a stacking-based identification model (SBIM) based on four models: ‘random forest’, ‘extreme random tree’, ‘XGboost’, and ‘Xgb_limitdepth’. It is intended to discriminate four travel modes: walk, bike, bus, and car. The experiments show that after FPVM processing, about 65% of travel trajectories are more similar to GPS. Compared with identical cleaning algorithms, the accuracy is improved by more than 35% on average. SBIM achieves 87% accuracy (4 types), with F1 values exceeding 0.9 for the walk and car categories.",
    "citationCount": 1,
    "referenceCount": 27
}