{
    "paperId": "c50333c614d84c331335cf1bea17369d49513d7c",
    "title": "Stars: Tera-Scale Graph Building for Clustering and Graph Learning",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Cj Carey",
        "Jonathan J. Halcrow",
        "Rajesh Jayaram",
        "V. Mirrokni",
        "W. Schudy",
        "Peilin Zhong"
    ],
    "doi": "10.48550/arXiv.2212.02635",
    "arxivId": "2212.02635",
    "url": "https://www.semanticscholar.org/paper/c50333c614d84c331335cf1bea17369d49513d7c",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.02635",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A fundamental procedure in the analysis of massive datasets is the construction of similarity graphs. Such graphs play a key role for many downstream tasks, including clustering, classification, graph learning, and nearest neighbor search. For these tasks, it is critical to build graphs which are sparse yet still representative of the underlying data. The benefits of sparsity are twofold: firstly, constructing dense graphs is infeasible in practice for large datasets, and secondly, the runtime of downstream tasks is directly influenced by the sparsity of the similarity graph. In this work, we present $\\textit{Stars}$: a highly scalable method for building extremely sparse graphs via two-hop spanners, which are graphs where similar points are connected by a path of length at most two. Stars can construct two-hop spanners with significantly fewer similarity comparisons, which are a major bottleneck for learning based models where comparisons are expensive to evaluate. Theoretically, we demonstrate that Stars builds a graph in nearly-linear time, where approximate nearest neighbors are contained within two-hop neighborhoods. In practice, we have deployed Stars for multiple data sets allowing for graph building at the $\\textit{Tera-Scale}$, i.e., for graphs with tens of trillions of edges. We evaluate the performance of Stars for clustering and graph learning, and demonstrate 10~1000-fold improvements in pairwise similarity comparisons compared to different baselines, and 2~10-fold improvement in running time without quality loss.",
    "citationCount": 3,
    "referenceCount": 46
}