{
    "paperId": "c52367488df8599ac2d1979ded35f98b6ad6d3e8",
    "title": "A Fingerprint-based Bloom Filter with Deletion Capabilities",
    "year": 2019,
    "venue": "European Conference on Networks and Communications",
    "authors": [
        "Minseok Kwon",
        "V. Shankar",
        "S. Pontarelli",
        "P. Reviriego"
    ],
    "doi": "10.1109/EuCNC.2019.8801958",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c52367488df8599ac2d1979ded35f98b6ad6d3e8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "One drawback of Bloom filters is the inability to delete items due to hash collisions. Counting Bloom filters address this drawback using counters at the expense of increased filter size. Other alternatives like the Deletable Bloom Filter (DlBF) or the Ternary Bloom Filter (TBF) have been proposed to maintain a small filter size while supporting deletions of elements with some probability. These structures offer different trade-offs between deletability, false positive rate and filter size. In this paper, we propose a new filter called the D-FP (Deletable Fingerprint) Bloom filter that stores two-bit fingerprints, instead of a single bit or a counter, that can indicate whether the item can be deleted. By using the fingerprints, the D-FP Bloom filter provides lower false positive rates than the TBF at low filter occupancies and better deletability than the DlBF thus providing more options to desginers that want to trade-off both parameters. In addition to presenting the D-FP Bloom filter, this paper also presents an analysis of the effects of deletions on the performance of the DlBF and TBF. Finally, as a result of the simulations, we observe that the original analytical estimate for the deletable probability of DlBF tends to overestimate the probability.",
    "citationCount": 5,
    "referenceCount": 9
}