{
    "paperId": "c569cf11cf86f3109ed7eb6a79cfd6568f21da5e",
    "title": "Understanding Differential Search Index for Text Retrieval",
    "year": 2023,
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "authors": [
        "Xiaoyang Chen",
        "Yanjiang Liu",
        "Ben He",
        "Le Sun",
        "Yingfei Sun"
    ],
    "doi": "10.48550/arXiv.2305.02073",
    "arxivId": "2305.02073",
    "url": "https://www.semanticscholar.org/paper/c569cf11cf86f3109ed7eb6a79cfd6568f21da5e",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2305.02073",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Differentiable Search Index (DSI) is a novel information retrieval (IR) framework that utilizes a differentiable function to generate a sorted list of document identifiers in response to a given query. However, due to the black-box nature of the end-to-end neural architecture, it remains to be understood to what extent DSI possesses the basic indexing and retrieval abilities. To mitigate this gap, in this study, we define and examine three important abilities that a functioning IR framework should possess, namely, exclusivity, completeness, and relevance ordering. Our analytical experimentation shows that while DSI demonstrates proficiency in memorizing the unidirectional mapping from pseudo queries to document identifiers, it falls short in distinguishing relevant documents from random ones, thereby negatively impacting its retrieval effectiveness. To address this issue, we propose a multi-task distillation approach to enhance the retrieval quality without altering the structure of the model and successfully endow it with improved indexing abilities. Through experiments conducted on various datasets, we demonstrate that our proposed method outperforms previous DSI baselines.",
    "citationCount": 21,
    "referenceCount": 40
}