{
    "paperId": "c57e779902796d9d801e7caca772a084f0987220",
    "title": "Algorithmic Complexity Attacks on All Learned Cardinality Estimators: A Data-centric Approach",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yingze Li",
        "Xian-Guo Liu",
        "Dong Wang",
        "Zixuan Wang",
        "Hongzhi Wang",
        "Kaixing Zhang",
        "Yiming Guan"
    ],
    "doi": "10.48550/arXiv.2507.07438",
    "arxivId": "2507.07438",
    "url": "https://www.semanticscholar.org/paper/c57e779902796d9d801e7caca772a084f0987220",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Learned cardinality estimators show promise in query cardinality prediction, yet they universally exhibit fragility to training data drifts, posing risks for real-world deployment. This work is the first to theoretical investigate how minimal data-level drifts can maximally degrade the accuracy of learned estimators. We propose data-centric algorithmic complexity attacks against learned estimators in a black-box setting, proving that finding the optimal attack strategy is NP-Hard. To address this, we design a polynomial-time approximation algorithm with a $(1-\\kappa)$ approximation ratio. Extensive experiments demonstrate our attack's effectiveness: on STATS-CEB and IMDB-JOB benchmarks, modifying just 0.8\\% of training tuples increases the 90th percentile Qerror by three orders of magnitude and raises end-to-end processing time by up to 20$\\times$. Our work not only reveals critical vulnerabilities in deployed learned estimators but also provides the first unified worst-case theoretical analysis of their fragility under data updates. Additionally, we identify two countermeasures to mitigate such black-box attacks, offering insights for developing robust learned database optimizers.",
    "citationCount": 0,
    "referenceCount": 57
}