{
    "paperId": "c58487f55480c48c0493508ab85a98278f629bef",
    "title": "AdaLead: A simple and robust adaptive greedy search algorithm for sequence design",
    "year": 2020,
    "venue": "arXiv.org",
    "authors": [
        "S. Sinai",
        "Richard Wang",
        "Alexander Whatley",
        "Stewart Slocum",
        "Elina Locane",
        "Eric D. Kelsic"
    ],
    "doi": null,
    "arxivId": "2010.02141",
    "url": "https://www.semanticscholar.org/paper/c58487f55480c48c0493508ab85a98278f629bef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient design of biological sequences will have a great impact across many industrial and healthcare domains. However, discovering improved sequences requires solving a difficult optimization problem. Traditionally, this challenge was approached by biologists through a model-free method known as \"directed evolution\", the iterative process of random mutation and selection. As the ability to build models that capture the sequence-to-function map improves, such models can be used as oracles to screen sequences before running experiments. In recent years, interest in better algorithms that effectively use such oracles to outperform model-free approaches has intensified. These span from approaches based on Bayesian Optimization, to regularized generative models and adaptations of reinforcement learning. In this work, we implement an open-source Fitness Landscape EXploration Sandbox (FLEXS: this http URL) environment to test and evaluate these algorithms based on their optimality, consistency, and robustness. Using FLEXS, we develop an easy-to-implement, scalable, and robust evolutionary greedy algorithm (AdaLead). Despite its simplicity, we show that AdaLead is a remarkably strong benchmark that out-competes more complex state of the art approaches in a variety of biologically motivated sequence design challenges.",
    "citationCount": 90,
    "referenceCount": 45
}