{
    "paperId": "c593fd3ab78800f03262a9299f39c1a0befdb07d",
    "title": "Genos: General In-Network Unsupervised Intrusion Detection by Rule Extraction",
    "year": 2024,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Ruoyu Li",
        "Qing Li",
        "Yu Zhang",
        "Dan Zhao",
        "Xi Xiao",
        "Yong Jiang"
    ],
    "doi": "10.1109/INFOCOM52122.2024.10621157",
    "arxivId": "2403.19248",
    "url": "https://www.semanticscholar.org/paper/c593fd3ab78800f03262a9299f39c1a0befdb07d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2403.19248",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Anomaly-based network intrusion detection systems (A-NIDS) use unsupervised models to detect unforeseen attacks. However, existing A-NIDS solutions suffer from low throughput, lack of interpretability, and high maintenance costs. Recent in-network intelligence (INI) exploits programmable switches to offer line-rate deployment of NIDS. Nevertheless, current in-network NIDS are either model-specific or only apply to supervised models. In this paper, we propose Genos, a general in-network framework for unsupervised A-NIDS by rule extraction, which consists of a Model Compiler, a Model Interpreter, and a Model Debugger. Specifically, observing benign data are multi-modal and usually located in multiple subspaces in the feature space, we utilize a divide-and-conquer approach for model-agnostic rule extraction. In the Model Compiler, we first propose a tree-based clustering algorithm to partition the feature space into subspaces, then design a decision boundary estimation mechanism to approximate the source model in each subspace. The Model Interpreter interprets predictions by important attributes to aid network operators in understanding the predictions. The Model Debugger conducts incremental updating to rectify errors by only fine-tuning rules on affected subspaces, thus reducing maintenance costs. We implement a prototype using physical hardware, and experiments demonstrate its superior performance of 100 Gbps throughput, great interpretability, and trivial updating overhead.",
    "citationCount": 5,
    "referenceCount": 51
}