{
    "paperId": "c5cef3b274d1b8d9f3a0f13a60075821a9ed08dc",
    "title": "The Roles and Modes of Human Interactions with Automated Machine Learning Systems: A Critical Review and Perspectives",
    "year": 2023,
    "venue": "Found. Trends Hum. Comput. Interact.",
    "authors": [
        "T. T. Khuat",
        "D. Kedziora",
        "Bogdan Gabrys"
    ],
    "doi": "10.1561/1100000091",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c5cef3b274d1b8d9f3a0f13a60075821a9ed08dc",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1561/1100000091",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As automated machine learning (AutoML) systems continue to progress in both sophistication and performance, it becomes important to understand the ‘how’ and ‘why’ of human-computer interaction (HCI) within these frameworks, both current and expected. Such a discussion is necessary for optimal system design, leveraging advanced data-processing capabilities to support decision-making involving humans, but it is also key to identifying the opportunities and risks presented by ever-increasing levels of machine autonomy. Within this context, we focus on the following questions: (i) What does HCI currently look like for state-of-the-art AutoML algorithms, especially during the stages of development, deployment, and maintenance? (ii) Do the expectations of HCI within AutoML frameworks vary for different types of users and stakeholders? (iii) How can HCI be managed so that AutoML solutions acquire human trust and Thanh Tung Khuat, David Jacob Kedziora and Bogdan Gabrys (2023), “The Roles and Modes of Human Interactions with Automated Machine Learning Systems: A Critical Review and Perspectives”, Foundations and Trends® in Human-Computer Interaction: Vol. 17, No. 3-4, pp 195–387. DOI: 10.1561/1100000091. ©2023 T. T. Khuat et al. Full text available at: http://dx.doi.org/10.1561/1100000091",
    "citationCount": 7,
    "referenceCount": 335
}