{
    "paperId": "c5e480764f8b6f3a3ad2362b524adcdffd612796",
    "title": "Analysis of the most influential factors affecting outcomes of lung transplant recipients: a multivariate prediction model based on UNOS Data",
    "year": 2025,
    "venue": "BMJ Open",
    "authors": [
        "M. Gholamzadeh",
        "Reza Safdari",
        "Mehrnaz Asadi Gharabaghi",
        "Hamidreza Abtahi"
    ],
    "doi": "10.1136/bmjopen-2024-089796",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c5e480764f8b6f3a3ad2362b524adcdffd612796",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Objectives In lung transplantation (LTx), a priority is assigned to each candidate on the waiting list. Our primary objective was to identify the key factors that influence the allocation of priorities in LTx using machine learning (ML) techniques to enhance the process of prioritising patients. Design Developing a prediction model. Setting and participants Our data were retrieved from the United Network for Organ Sharing (UNOS) open-source database of transplant patients between 2005 and 2023. Interventions After the preprocessing process, a feature engineering technique was employed to select the most relevant features. Then, six ML models with optimised hyperparameters including multiple linear regression, random forest regressor (RF), support vector machine regressor, XGBoost regressor, a multilayer perceptron model and a deep learning model were developed based on the UNOS dataset. Primary and secondary outcome measures The performance of each model was evaluated using R-squared (R2) and other error rate metrics. Next, the Shapley Additive Explanations (SHAP) technique was used to identify the most important features in the prediction. Results The raw dataset contains 196 270 records with 545 features in all organs. After preprocessing, 32 966 records with 15 features remain. Among various models, the RF model achieved a high R2 score. Additionally, the RF model exhibited the lowest error values, indicating its superior precision compared with other regression models. The SHAP technique in conjunction with the RF model revealed the 11 most important features for priority allocation. Subsequently, we developed a web-based decision support tool using Python and the Streamlit framework based on the best-fine-tuned model. Conclusion The deployment of the ML model has the potential to act as an automated tool to aid physicians in assessing the priority of lung transplants and identifying significant factors that play a role in patient survival.",
    "citationCount": 0,
    "referenceCount": 57
}