{
    "paperId": "c5f147c89003d3efd3fd48349d8e22cc35ddd6d0",
    "title": "Federated Condition Monitoring Signal Prediction With Improved Generalization",
    "year": 2024,
    "venue": "IEEE Transactions on Reliability",
    "authors": [
        "Seokhyun Chung",
        "Raed Al Kontar"
    ],
    "doi": "10.1109/TR.2023.3283348",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c5f147c89003d3efd3fd48349d8e22cc35ddd6d0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Revolutionary advances in Internet of Things technologies have paved the way for a significant increase in computational resources at edge devices that collect condition monitoring (CM) data. This poses a significant opportunity for federated analytics (FA), which exploits edge computing resources to distribute model learning, reduce communication traffic, and circumvent the need to share raw data. In this article, we study CM signal prediction where operating units that have data storage and computational capabilities jointly learn models without sharing their collected CM signals. The key challenge we aim to address is learning effective FA models in the presence of heterogeneity, which is often intrinsic to CM signals. To this end, we first introduce a federated framework for CM signal prediction that tries to improve generalization by encouraging flat solutions through distributed computations. Then, a personalization approach is proposed to adapt the learned model to new clients without losing old knowledge. We examine our proposed framework on CM signals from aircraft turbofan engines under three realistic federated CM scenarios. Experimental results highlight the capability of our model to decentralize model inference while improving generalization and robustness to heterogeneity across CM signals.",
    "citationCount": 7,
    "referenceCount": 81
}