{
    "paperId": "c5f96f151f23e75e5e99dd97d4a4ab4ca52a8f8e",
    "title": "Multi-Timeframe Algorithmic Trading Bots Using Thick Data Heuristics with Deep Reinforcement Learning",
    "year": 2022,
    "venue": "Artificial Intelligence Evolution",
    "authors": [
        "Gregory Roy",
        "J. Fiaidhi",
        "Sabah Mohammed"
    ],
    "doi": "10.37256/aie.3220221722",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c5f96f151f23e75e5e99dd97d4a4ab4ca52a8f8e",
    "isOpenAccess": true,
    "openAccessPdf": "https://ojs.wiserpub.com/index.php/AIE/article/download/1722/1129",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article presents an augmented Artificial Intelligence (AI) algorithmic trading approach that combines Thick Data Heuristic (TDH), with Deep Reinforcement Learning (DRL), to successfully learn trading execution timing policies. Combining the augmented AI human trader's intuition and heuristics with DRL techniques to provide more focused drivers for trading order execution timing is explored in this study. In this research, the goal is to solve the sequential decision-making problem of AI for profitable day and swing trading order timing executions. Enabling trading bots with cognitive intelligence and common-sense heuristics will offer traders including automatic traders an insight to understand the day-to-day swing trading timeframes indicators and arrive at mature trading decision-making. This article examines the performance of bots with Nasdaq and NYSE stocks that have a strong catalyst (info. which increases directional momentum) to find that they outperform benchmark algorithmic trading approaches. The research illustrates to the reader how to combine TDH and Deep Q-networks (DQN) into a TDH-DQN augmented AI trading bot. The bot learns through test data to predict the optimal timing of order executions autonomously on idealized trading time series data.",
    "citationCount": 2,
    "referenceCount": 82
}