{
    "paperId": "c62c1807d8d5b7b54cc8893336b1d5ff163c56f5",
    "title": "Application of Dynamic Fragmentation Methods in Multimedia Databases: A Review",
    "year": 2020,
    "venue": "Entropy",
    "authors": [
        "F. Castro-Medina",
        "L. Rodríguez-Mazahua",
        "Asdrúbal López-Chau",
        "Jair Cervantes",
        "G. Alor-Hernández",
        "Isaac Machorro-Cano"
    ],
    "doi": "10.3390/e22121352",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c62c1807d8d5b7b54cc8893336b1d5ff163c56f5",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1099-4300/22/12/1352/pdf?version=1606728977",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fragmentation is a design technique widely used in multimedia databases, because it produces substantial benefits in reducing response times, causing lower execution costs in each operation performed. Multimedia databases include data whose main characteristic is their large size, therefore, database administrators face a challenge of great importance, since they must contemplate the different qualities of non-trivial data. These databases over time undergo changes in their access patterns. Different fragmentation techniques presented in related studies show adequate workflows, however, some do not contemplate changes in access patterns. This paper aims to provide an in-depth review of the literature related to dynamic fragmentation of multimedia databases, to identify the main challenges, technologies employed, types of fragmentation used, and characteristics of the cost model. This review provides valuable information for database administrators by showing essential characteristics to perform proper fragmentation and to improve the performance of fragmentation schemes. The reduction of costs in fragmentation methods is one of the most desired main properties. To fulfill this objective, the works include cost models, covering different qualities. In this analysis, a set of characteristics used in the cost models of each work is presented to facilitate the creation of a new cost model including the most used qualities. In addition, different data sets or reference points used in the testing stage of each work analyzed are presented.",
    "citationCount": 9,
    "referenceCount": 98
}