{
    "paperId": "c62ea3180d825f6ea8e62e87aada164b7579cd42",
    "title": "Building Trusted Startup Teams From LinkedIn Attributes: A Higher Order Probabilistic Analysis",
    "year": 2020,
    "venue": "IEEE International Conference on Tools with Artificial Intelligence",
    "authors": [
        "G. Drakopoulos",
        "Eleanna Kafeza",
        "Phivos Mylonas",
        "Haseena Al Katheeri"
    ],
    "doi": "10.1109/ICTAI50040.2020.00136",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c62ea3180d825f6ea8e62e87aada164b7579cd42",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Startups arguably contribute to the current business landscape by developing innovative products and services. The discovery of business partners and employees with a specific background which can be verified stands out repeatedly as a prime obstacle. LinkedIn is a popular platform where professional milestones, endorsements, recommendations, and skills are posted. A graph search algorithm with a BFS and a DFS strategy for seeking trusted candidates in LinkedIn is proposed. Both strategies rely on a metric for assessing the trustworthiness of an account according to LinkedIn attributes. Also, a stochastic vertex selection mechanism reminiscent of preferential attachment guides search. Both strategies were verified against a large segment of the vivid startup ecosystem of Patras, Hellas. A higher order probabilistic analysis suggests that BFS is more suitable. Findings also imply that emphasis should be given to local networking events, peer interaction, and to tasks allowing verifiable credit for the respective work.",
    "citationCount": 18,
    "referenceCount": 41
}