{
    "paperId": "c66aaaa3432e497b03728b3d526f71357be942f3",
    "title": "A Just-In-Time Framework for Routing-Oriented Traffic Prediction",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Jing Zhao",
        "Lei Li",
        "Mengxuan Zhang",
        "Haolun Ma",
        "Xiaofang Zhou"
    ],
    "doi": "10.1109/ICDE65448.2025.00240",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c66aaaa3432e497b03728b3d526f71357be942f3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traffic prediction plays a crucial role in urban transportation systems, yet existing methods face challenges in achieving real-time performance when handling large-scale road networks. This paper introduces a novel Just-In-Time Traffic Prediction framework that integrates traffic condition with routing queries for efficient localized predictions in multi-query urban environments. Unlike traditional approaches that perform global predictions across entire networks, our framework partitions the road network into non-overlapping small regions and selectively updates traffic conditions based on query demands. Specifically, we propose three key components: (i) a Search Space Estimation (SSE) model that reformulates search space determination of routing queries as a binary classification task to accurately identify the searched regions; (ii) a Region-based Traffic Speed Prediction (RTSP) model that incorporates the temporal validity of speed profiles in adjacent regions and comprehensive spatio-temporal features for precise region-based traffic prediction; (iii) a Global Region Prediction Scheduling that efficiently coordinates the SSE and RTSP models to maintain up-to-date traffic data for running queries while minimizing computational overhead from both spatio and temporal dimensions. Experimental results on real-world road networks demonstrate significant improvements in both effectiveness and efficiency compared to state-of-the-arts.",
    "citationCount": 0,
    "referenceCount": 83
}