{
    "paperId": "c6775c0cea685889734f82098107e53123832229",
    "title": "An improved FOX optimization algorithm using adaptive exploration and exploitation for global optimization",
    "year": 2025,
    "venue": "PLoS ONE",
    "authors": [
        "Mahmood A. Jumaah",
        "Yossra H. Ali",
        "Tarik A. Rashid"
    ],
    "doi": "10.1371/journal.pone.0331965",
    "arxivId": "2504.09574",
    "url": "https://www.semanticscholar.org/paper/c6775c0cea685889734f82098107e53123832229",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimization algorithms are essential for solving many real-world problems. However, challenges such as getting trapped in local minima and effectively balancing exploration and exploitation often limit their performance. This paper introduces an improved variation of the FOX optimization algorithm (FOX), termed Improved FOX (IFOX), incorporating a new adaptive method using a dynamically scaled step-size parameter to balance exploration and exploitation based on the current solution’s fitness value. The proposed IFOX also reduces the number of hyperparameters by removing four parameters (C1, C2, a, Mint) and refines the primary equations of FOX. To evaluate its performance, IFOX was tested on 20 classical benchmark functions, 61 benchmark test functions from the congress on evolutionary computation (CEC), and ten real-world problems. The experimental results showed that IFOX achieved a 40% improvement in overall performance metrics over the original FOX. Additionally, it achieved 880 wins, 228 ties, and 348 losses against 16 optimization algorithms across all involved functions and problems. Furthermore, non-parametric statistical tests, including the Friedman and Wilcoxon signed-rank tests, confirmed its competitiveness against recent and state-of-the-art optimization algorithms, such as LSHADE and NRO, with an average rank of 5.92 among 17 algorithms. These findings highlight the significant potential of IFOX for solving diverse optimization problems, establishing it as a competitive and effective optimization algorithm.",
    "citationCount": 0,
    "referenceCount": 71
}