{
    "paperId": "c681912b69d0cffd5631fc6f35753d2ea58f5dea",
    "title": "Hybrid assembly and comparative genomics unveil insights into the evolution and biology of the red-legged partridge",
    "year": 2024,
    "venue": "Scientific Reports",
    "authors": [
        "Abderrahmane Eleiwa",
        "J. Nadal",
        "Ester Vilaprinyó",
        "Alberto Marin-Sanguino",
        "A. Sorribas",
        "Oriol Basallo",
        "Abel G. Lucido",
        "Cristóbal Richart",
        "Ramona N Pena",
        "R. Ros-Freixedes",
        "Anabel Usie",
        "Rui Alves"
    ],
    "doi": "10.1038/s41598-024-70018-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c681912b69d0cffd5631fc6f35753d2ea58f5dea",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-024-70018-0",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The red-legged partridge Alectoris rufa plays a crucial role in the ecosystem of southwestern Europe, and understanding its genetics is vital for conservation and management. Here we sequence, assemble, and annotate a highly contiguous and nearly complete version of its genome. This assembly encompasses 96.9% of the avian genes flagged as essential in the BUSCO aves_odb10 dataset. Moreover, we pinpointed RNA and protein-coding genes, 95% of which had functional annotations. Notably, we observed significant chromosome rearrangements in comparison to quail (Coturnix japonica) and chicken (Gallus gallus). In addition, a comparative phylogenetic analysis of these genomes suggests that A. rufa and C. japonica diverged roughly 20 million years ago and that their common ancestor diverged from G. gallus 35 million years ago. Our assembly represents a significant advancement towards a complete reference genome for A. rufa, facilitating comparative avian genomics, and providing a valuable resource for future research and conservation efforts for the red-legged partridge.",
    "citationCount": 4,
    "referenceCount": 103
}