{
    "paperId": "c6c7d835150cbb8f2454ec96d987d3c544aa5ed4",
    "title": "Limitations of Amplitude Encoding on Quantum Classification",
    "year": 2025,
    "venue": "",
    "authors": [
        "Xin Wang",
        "Yabo Wang",
        "Bo Qi",
        "Rebing Wu"
    ],
    "doi": null,
    "arxivId": "2503.01545",
    "url": "https://www.semanticscholar.org/paper/c6c7d835150cbb8f2454ec96d987d3c544aa5ed4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "It remains unclear whether quantum machine learning (QML) has real advantages when dealing with practical and meaningful tasks. Encoding classical data into quantum states is one of the key steps in QML. Amplitude encoding has been widely used owing to its remarkable efficiency in encoding a number of $2^{n}$ classical data into $n$ qubits simultaneously. However, the theoretical impact of amplitude encoding on QML has not been thoroughly investigated. In this work we prove that under some broad and typical data assumptions, the average of encoded quantum states via amplitude encoding tends to concentrate towards a specific state. This concentration phenomenon severely constrains the capability of quantum classifiers as it leads to a loss barrier phenomenon, namely, the loss function has a lower bound that cannot be improved by any optimization algorithm. In addition, via numerical simulations, we reveal a counterintuitive phenomenon of amplitude encoding: as the amount of training data increases, the training error may increase rather than decrease, leading to reduced decrease in prediction accuracy on new data. Our results highlight the limitations of amplitude encoding in QML and indicate that more efforts should be devoted to finding more efficient encoding strategies to unlock the full potential of QML.",
    "citationCount": 3,
    "referenceCount": 72
}