{
    "paperId": "c717788916b2cc85dbe7c01bc879c68254938d95",
    "title": "Chromatin dynamics and transcriptional regulation of heat stress in an ectothermic fish.",
    "year": 2025,
    "venue": "Proceedings. Biological sciences",
    "authors": [
        "Songqian Huang",
        "Chenyu Yan",
        "Yuan Xu",
        "Jingting Qi",
        "Qiao Huang",
        "Minghao Zhang",
        "Zhichao Wu",
        "Jiulin Chan",
        "Mingli Liu",
        "Liangbiao Chen",
        "Peng Hu"
    ],
    "doi": "10.1098/rspb.2025.0769",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c717788916b2cc85dbe7c01bc879c68254938d95",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Global warming and extreme heat events threaten ectothermic animals, yet the molecular mechanisms of heat stress (HS) on transcriptional regulation, particularly associated chromatin accessibility dynamics, remain unclear. Here, we investigated chromatin accessibility and transcriptional dynamics in the brain, gill and head kidney of largemouth bass (Micropterus salmoides) under gradient HS. We found significant HS-induced apoptosis in the head kidney. Transcriptome analysis identified key pathways associated with endoplasmic reticulum (ER) stress, ferroptosis and apoptosis. Integrating cis-regulatory element analysis and transcription factor (TF) binding predictions, we constructed a transcriptional regulatory network for ER stress and apoptosis, identifying 259 TFs, including both known and newly discovered transcriptional regulators. Among these, CCCTC-binding factor (CTCF) and activating transcription factor 4 (ATF4) emerged as central regulators, dynamically controlling stress-responsive genes (eif2ak1, hsp90b1, hspa5 and tfr1a) driving ER stress and apoptosis. Enhanced nuclear expression of CTCF under HS, qPCR assay and immunofluorescence experimentally validated, highlights its pivotal regulatory role. These findings uncover mechanisms of ER stress regulation in fish under HS, positioning CTCF and ATF4 as hub regulatory factors in chromatin remodelling and transcriptional regulation response to HS in ectotherms.",
    "citationCount": 3,
    "referenceCount": 51
}