{
    "paperId": "c7528ccd4704a148327a310d476673e976771cd6",
    "title": "Re-optimization for Multi-objective Cloud Database Query Processing using Machine Learning",
    "year": 2021,
    "venue": "International Journal of Database Management Systems",
    "authors": [
        "Chenxiao Wang",
        "Z. Arani",
        "L. Gruenwald",
        "Laurent d'Orazio",
        "Eleazar Leal"
    ],
    "doi": "10.5121/IJDMS.2021.13102",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c7528ccd4704a148327a310d476673e976771cd6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5121/ijdms.2021.13102",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In cloud environments, hardware configurations, data usage, and workload allocations are continuously changing. These changes make it difficult for the query optimizer of a cloud database management system (DBMS) to select an optimal query execution plan (QEP). In order to optimize a query with a more accurate cost estimation, performing query re-optimizations during the query execution has been proposed in the literature. However, some of there-optimizations may not provide any performance gain in terms of query response time or monetary costs, which are the two optimization objectives for cloud databases, and may also have negative impacts on the performance due to their overheads. This raises the question of how to determine when are-optimization is beneficial. In this paper, we present a technique called ReOptML that uses machine learning to enable effective re-optimizations. This technique executes a query in stages, employs a machine learning model to predict whether a query re-optimization is beneficial after a stage is executed, and invokes the query optimizer to perform the re-optimization automatically. The experiments comparing ReOptML with existing query re-optimization algorithms show that ReOptML improves query response time from 13% to 35% for skew data and from 13% to 21% for uniform data, and improves monetary cost paid to cloud service providers from 17% to 35% on skewdata.",
    "citationCount": 0,
    "referenceCount": 32
}