{
    "paperId": "c75b4198d11a753b05767ffee20d1692ac3632e6",
    "title": "From Observations to Insights: Constructing Effective Cyberattack Provenance with PROVCON",
    "year": 2025,
    "venue": "Proceedings 2025 Workshop on Security Operation Center Operations and Construction",
    "authors": [
        "Anis Yusof",
        "Shaofei Li",
        "Kawatra Arshdeep Singh",
        "Ding Li",
        "Ee-Chien Chang",
        "Zhenkai Liang"
    ],
    "doi": "10.14722/wosoc.2025.23008",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c75b4198d11a753b05767ffee20d1692ac3632e6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "—To improve the preparedness of Security Operation Center (SOC), analysts may leverage provenance graphs to deepen their understanding of existing cyberattacks. However, the unknown nature of a cyberattack may result in a provenance graph with incomplete details, thus limiting the comprehensive knowledge of the cyberattack due to partial indicators. Furthermore, using outdated provenance graphs imposes a limit on the understanding of cyberattack trends. This negatively impacts SOC operations that are responsible for detecting and responding to threats and incidents. This paper introduces P ROV C ON , a framework that constructs a provenance graph representative of a cyberattack. Based on documented cyberattacks, the framework reproduces the cyberattack and generates the corresponding data for attack analysis. The knowledge gained from existing cyberattacks through the constructed provenance graph is instrumental in enhancing the understanding and improving decision-making in SOC. With the use of P ROV C ON , SOC can improve its cybersecurity posture by aligning its operations based on insights derived from documented observations.",
    "citationCount": 0,
    "referenceCount": 56
}