{
    "paperId": "c7666e9a670f362c628b08219ea5df17adeec4df",
    "title": "MEB: an Efficient and Accurate Multicast using Bloom Filter with Customized Hash Function",
    "year": 2023,
    "venue": "Asia-Pacific Workshop on Networking",
    "authors": [
        "Zihao Chen",
        "Jiawei Huang",
        "Qile Wang",
        "Jingling Liu",
        "Zhaoyi Li",
        "Shengwen Zhou",
        "Zhidong He"
    ],
    "doi": "10.1145/3600061.3600062",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c7666e9a670f362c628b08219ea5df17adeec4df",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Multicast is widely used to support a huge range of applications with one-to-many or many-to-many communication patterns. However, multicast systems do not scale due to considerable state and communication overheads. Some stateful multicast approaches require maintaining the state of each multicast session at switches, thus incurring large memory overhead. Some stateless ones utilize Bloom filter (BF) to encode multicast tree into the packet header to minimize communication overhead, but potentially suffer from the substantial false positive due to the probabilistic nature of Bloom filter. In this paper, we propose a stateless multicast scheme MEB, which uses Bloom filter to achieve large-scale multicast communication with low error, small overhead and high scalability. Specifically, to control the rate of false positive, MEB elaborately selects the hash functions for Bloom filters when constructing the packet header at the sender side, and makes forwarding decision according to packet header at the switch with negligible overhead. We compare MEB against the state-of-the-art multicast system in large-scale simulations. The test results show that MEB reduces the traffic overhead by up to 70% with small error rate.",
    "citationCount": 2,
    "referenceCount": 14
}