{
    "paperId": "c78786a4a0ae920371abdd7bd70cfb2fea32caff",
    "title": "Enforcing Fairness in Blockchain Transaction Ordering",
    "year": 2019,
    "venue": "Peer-to-Peer Networking and Applications",
    "authors": [
        "A. Orda",
        "Ori Rottenstreich"
    ],
    "doi": "10.1007/s12083-021-01165-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c78786a4a0ae920371abdd7bd70cfb2fea32caff",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s12083-021-01165-8.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In Blockchain networks involving multiple applications, the quality of service of an application is affected by the transaction ordering. For instance, upon issuing payment transactions, users of an application would like to be notified quickly on the transactions approval. The application can be a financial institution (such as a bank), sharing the blockchain with other such applications and is represented by a node. A node might attempt to prioritize its own transactions by including them early in blocks added to the blockchain. A fair block proposal of a node follows a random selection of the transactions among the set of pending transactions the node is aware of. On the contrary, a dishonest node includes more of its transactions at the expense of transactions of other applications. In this work, we propose a toolbox of techniques to enforce such a fair block selection. First, we design an accurate statistical test for the honesty of a proposal and explain it. We conduct experiments demonstrating the accuracy of the new validation scheme. We also describe a technique that enforces fair block selection through concise commitments on the set of pending transactions known to a node. We clarify the advantages of the new mechanisms over state-of-the-art methods.",
    "citationCount": 46,
    "referenceCount": 32
}