{
    "paperId": "c796e010f486aedb1fbd361888e7c789c1e7231f",
    "title": "Cognitive Search: A Free Information Retrieval Web Service to Coronavirus Scientific Papers",
    "year": 2023,
    "venue": "2023 IEEE Colombian Conference on Applications of Computational Intelligence (ColCACI)",
    "authors": [
        "C. M. Villalobos",
        "L. Mendoza",
        "Renato Sayão da Rocha",
        "José Eduardo Ruiz",
        "H. D. de Mello Junior",
        "M. Pacheco"
    ],
    "doi": "10.1109/ColCACI59285.2023.10225924",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c796e010f486aedb1fbd361888e7c789c1e7231f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is an ongoing global health emergency. With millions of people affected by the COVID-19 pandemic, many questions arise concerning transmission, diagnosis, treatment, development of vaccines, and viral pathogens. Bearing that in mind, the dangers of wrong and inaccurate information represent a socio-economic could do more damage than the disease itself. To help fight this ongoing outbreak, we present Cognitive Search - a friendly deployed service application IR exploring the latest language processing advance. The service provides access to CORD-19, a resource of scholarly articles about COVID-19 and related coronaviruses. The system allows rending documents retrieval by Term-Frequency and Semantic Neural Search and the Hybrid Term-Neural. The retrieval performance can often be significantly improved by using several different retrieval algorithms and allowing the user to combine the results instead of just one. Additionally, the Hybrid Term-Neural approach supports the exploitation of temporal information in documents and the usage of such information to anchor search results along a well-defined timeline. So it can generate insights through an intuitive and easy-to-use interface.",
    "citationCount": 0,
    "referenceCount": 26
}