{
    "paperId": "c7a3f66e972fe45171c5df8ae7895799ef747422",
    "title": "Self-supervised Equality Embedded Deep Lagrange Dual for Approximate Constrained Optimization",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Minsoo Kim",
        "Hongseok Kim"
    ],
    "doi": "10.48550/arXiv.2306.06674",
    "arxivId": "2306.06674",
    "url": "https://www.semanticscholar.org/paper/c7a3f66e972fe45171c5df8ae7895799ef747422",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2306.06674",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Conventional solvers are often computationally expensive for constrained optimization, particularly in large-scale and time-critical problems. While this leads to a growing interest in using neural networks (NNs) as fast optimal solution approximators, incorporating the constraints with NNs is challenging. In this regard, we propose deep Lagrange dual with equality embedding (DeepLDE), a framework that learns to find an optimal solution without using labels. To ensure feasible solutions, we embed equality constraints into the NNs and train the NNs using the primal-dual method to impose inequality constraints. Furthermore, we prove the convergence of DeepLDE and show that the primal-dual learning method alone cannot ensure equality constraints without the help of equality embedding. Simulation results on convex, non-convex, and AC optimal power flow (AC-OPF) problems show that the proposed DeepLDE achieves the smallest optimality gap among all the NN-based approaches while always ensuring feasible solutions. Furthermore, the computation time of the proposed method is about 5 to 250 times faster than DC3 and the conventional solvers in solving constrained convex, non-convex optimization, and/or AC-OPF.",
    "citationCount": 5,
    "referenceCount": 52
}