{
    "paperId": "c7d3396aa1959b8d090c17e06f2c35bba44a8ace",
    "title": "FleCom: A Flexible Congestion Control Protocol in Named Data Networking",
    "year": 2023,
    "venue": "Conference on Computer Communications Workshops",
    "authors": [
        "Zhuo Li",
        "Hao Xun",
        "Yang Miao",
        "Weizhe Zhang",
        "Peng Luo",
        "Kaihua Liu"
    ],
    "doi": "10.1109/INFOCOMWKSHPS57453.2023.10225931",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c7d3396aa1959b8d090c17e06f2c35bba44a8ace",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Congestion control has a crucial role in guaranteeing quality-of-service (QoS) in Named Data Networking (NDN). But the unique multi-source and multipath transmission characteristics make the current end-to-end multipath congestion control schemes cannot be directly employed in NDN. At present, hybrid congestion control has gradually developed into a popular mechanism. But it has to address the issues that how to respond to the actual and complex NDN scenarios, and how to dynamically adjust the size of the Interest sending window (cwnd) on the consumer side to achieve congestion control. In this paper, a flexible hybrid congestion control scheme named FleCom is proposed. Specifically, routers choose multipath forwarding or Interest shaping to mitigate congestion timely and flexibly. And consumers moderately constrain the size of cwnd to coordinate with routers. The simulation results show that FleCom consistently achieves higher total throughput than existing work. In particular, the total throughput of consumers deployed with FleCom is 109.7% higher than that of consumers deployed with PCON in the BRITE-generated topology. This value changes to 48.7% after enabling the router's in-network caching feature.",
    "citationCount": 2,
    "referenceCount": 16
}