{
    "paperId": "c80f0c550e8c3ed45d38c16d8fc82cbce3dbb420",
    "title": "AlphaNet: An Attention Guided Deep Network for Automatic Image Matting",
    "year": 2020,
    "venue": "Coins",
    "authors": [
        "Rishab Sharma",
        "Rahul Deora",
        "Anirudha Vishvakarma"
    ],
    "doi": "10.1109/COINS49042.2020.9191371",
    "arxivId": "2003.03613",
    "url": "https://www.semanticscholar.org/paper/c80f0c550e8c3ed45d38c16d8fc82cbce3dbb420",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2003.03613",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we propose an end to end solution for image matting i.e high-precision extraction of foreground objects from natural images. Image matting and background detection can be achieved easily through chroma keying in a studio setting when the background is either pure green or blue. Nonetheless, image matting in natural scenes with complex and uneven depth backgrounds remains a tedious task that requires human intervention. To achieve complete automatic foreground extraction in natural scenes, we propose a method that assimilates semantic segmentation and deep image matting processes into a single network to generate detailed semantic mattes for image composition task. The contribution of our proposed method is two-fold, firstly it can be interpreted as a fully automated semantic image matting method and secondly as a refinement of existing semantic segmentation models.We propose a novel model architecture as a combination of segmentation and matting that unifies the function of upsampling and downsampling operators with the notion of attention. As shown in our work, attention guided downsampling and upsampling can extract high-quality boundary details, unlike other normal downsampling and upsampling techniques. For achieving the same, we utilized an attention guided encoder-decoder framework which does unsupervised learning for generating an attention map adaptively from the data to serve and direct the upsampling and downsampling operators. We also construct a fashion e-commerce focused dataset with high-quality alpha mattes to facilitate the training and evaluation for image matting.",
    "citationCount": 6,
    "referenceCount": 37
}