{
    "paperId": "c826a1774eb7f8d350cb86c6d0beaab3fc13ba9a",
    "title": "Trusted Distributed Artificial Intelligence (TDAI)",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Muhammed Akif Ağca",
        "S. Faye",
        "D. Khadraoui"
    ],
    "doi": "10.1109/ACCESS.2023.3322568",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c826a1774eb7f8d350cb86c6d0beaab3fc13ba9a",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10273674.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the diversity of components increases within the intelligent systems, trusted interactivity also becomes critical challenge for the system components and nodes. Furthermore, emerging SDN (Software Defined Networking) features are also utilized to assure its resiliency and robustness in a dynamic context and monitored by trusted multi-agents’ system to maximize trustworthiness of the system components and the deployed context. However, it is not feasible to deploy the intelligent mechanisms at massive scale with the state-of-the-art architectural design paradigms. Therefore, we define three main architectures (central, decentral/autonomous/embedded, distributed/hybrid) as a basis for TDAI methodology to ensure end-to-end trust in holistic AI system life-cycle. Thanks to such a trusted multi-agents-based trust monitoring mechanism, we will be able to overcome hardware limitations and provide flexible and resilient end-to-end trust mechanism for trusted AI models and emerging massive scale intelligent systems. Finally, we evaluated our TDAI Methodology in CCAM (Connected, Cooperative, Autonomous Mobility) domain of a smart-city to monitor its system trust and user behaviors. By that means, it is exploited as a mean of decision-making mechanism to be deployed either manually or automatically (example of anomalies detection etc.). Such a mechanism improves total system performance and behavioral anomaly detection and risk minimization algorithms over the distributed nodes of a given AI system. Furthermore, smartness features are also improved with human-like intelligence abilities at massive scale thanks to the promising performance of TDAI at real-life deployment experiments to maximize trust factor of the dynamically observed context of the smart-cities during the monitored time-span.",
    "citationCount": 0,
    "referenceCount": 23
}