{
    "paperId": "c839f507f23546320a8aa834ab5f404855b4cd2f",
    "title": "Design and Development of Visual Error Detection System (VEDS) Leveraging Convolutional Neural Networks for Early Detection of Ocular Abnormalities to Mitigate Vision-Related Complications",
    "year": 2024,
    "venue": "2024 International Conference on Computational Intelligence and Computing Applications (ICCICA)",
    "authors": [
        "Kaivaram Sivarama Krishna",
        "Bommala Deepak Kumar",
        "Morumpalli Deekshith Reddy",
        "Ch. Saketh",
        "S. B.",
        "R. M."
    ],
    "doi": "10.1109/ICCICA60014.2024.10584590",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c839f507f23546320a8aa834ab5f404855b4cd2f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ocular disorders are one of the severe eye disease The proposed system is to design and develop an automated system which captures the patient's eye image and uses the benefits of Convolutional Neural Networks (CNN) to predict whether the patient suffers from ocular eye disorders or not. The functionality integrates MongoDB database administration with a visual error detection system. The model is employed in a web-based platform that enhances the usefulness of MongoDB overall by utilizing convolutional neural networks (CNN) to interface with it smoothly. The CNN was selected based on its accuracy and trained on several datasets that included around 5000 photos for each category of eye illness from reputable databases including Eye Recognition, IDRiD, and HRF. Instant eye deployment is possible with the user-friendly website while retinal pictures load. Integration with MongoDB enhances user experience, saves and retrieves diagnostic data, and manages data better. Numerous outcomes supported the model's efficacy and indicated a significant advancement in the early diagnosis and treatment of ocular disorders.",
    "citationCount": 0,
    "referenceCount": 13
}