{
    "paperId": "c840a8951f163ac41d8194ff5c952d6a0635df43",
    "title": "Digital Twin—A Review of the Evolution from Concept to Technology and Its Analytical Perspectives on Applications in Various Fields",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Miruna-Elena Iliuţă",
        "M. Moisescu",
        "Eugen Pop",
        "A. Ionita",
        "S. Caramihai",
        "Traian-Costin Mitulescu"
    ],
    "doi": "10.3390/app14135454",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c840a8951f163ac41d8194ff5c952d6a0635df43",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/14/13/5454/pdf?version=1719211367",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Digital Twin (DT) technology has experienced substantial advancements and extensive adoption across various industries, aiming to enhance operational efficiency and effectiveness. Defined as virtual replicas of physical objects, systems, or processes, Digital Twins enable real-time simulation, monitoring, and analysis of real-world behavior. This comprehensive review delves into the evolution of DT technology, tracing its journey from conceptual origins to contemporary technological implementations. The review provides detailed definitions, a classification of different types of Digital Twins, and a comparative analysis of their architectures. Furthermore, it investigates the application of DT technology in diverse sectors, with a particular emphasis on medicine and manufacturing, exemplified by use cases such as personalized medicine. Moreover, the review highlights emerging trends and future directions in DT technology, underscoring the transformative potential of integrating artificial intelligence and machine learning to augment DT capabilities. This analysis not only elucidates the current state of DT technology but also anticipates its future trajectory and impact across multiple domains.",
    "citationCount": 26,
    "referenceCount": 109
}