{
    "paperId": "c87e667b168bb40be53f3945d16b7fe3d7faa452",
    "title": "Learning to Do or Learning While Doing: Reinforcement Learning and Bayesian Optimisation for Online Continuous Tuning",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Jan Kaiser",
        "Chenran Xu",
        "Annika Eichler",
        "Andrea Santamaria Garcia",
        "O. Stein",
        "E. Bründermann",
        "W. Kuropka",
        "H. Dinter",
        "F. Mayet",
        "T. Vinatier",
        "F. Burkart",
        "H. Schlarb"
    ],
    "doi": "10.48550/arXiv.2306.03739",
    "arxivId": "2306.03739",
    "url": "https://www.semanticscholar.org/paper/c87e667b168bb40be53f3945d16b7fe3d7faa452",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2306.03739",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online tuning of real-world plants is a complex optimisation problem that continues to require manual intervention by experienced human operators. Autonomous tuning is a rapidly expanding field of research, where learning-based methods, such as Reinforcement Learning-trained Optimisation (RLO) and Bayesian optimisation (BO), hold great promise for achieving outstanding plant performance and reducing tuning times. Which algorithm to choose in different scenarios, however, remains an open question. Here we present a comparative study using a routine task in a real particle accelerator as an example, showing that RLO generally outperforms BO, but is not always the best choice. Based on the study's results, we provide a clear set of criteria to guide the choice of algorithm for a given tuning task. These can ease the adoption of learning-based autonomous tuning solutions to the operation of complex real-world plants, ultimately improving the availability and pushing the limits of operability of these facilities, thereby enabling scientific and engineering advancements.",
    "citationCount": 6,
    "referenceCount": 64
}