{
    "paperId": "c8be05e4bc1b88c36d10ddccef84ee72871e9984",
    "title": "Reinforcement Learning for Joint Detection and Mapping Using Dynamic UAV Networks",
    "year": 2024,
    "venue": "IEEE Transactions on Aerospace and Electronic Systems",
    "authors": [
        "A. Guerra",
        "F. Guidi",
        "D. Dardari",
        "P. Djurić"
    ],
    "doi": "10.1109/TAES.2023.3300813",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c8be05e4bc1b88c36d10ddccef84ee72871e9984",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/7/7778228/10198223.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dynamic radar networks (DRNs), usually composed of flying unmanned aerial vehicles (UAVs), have recently attracted great interest for time-critical applications, such as search-and-rescue operations, involving reliable detection of multiple targets and situational awareness through environment radio mapping. Unfortunately, the time available for detection is often limited, and in most settings, there are no reliable models of the environment, which should be learned quickly. One possibility to guarantee short learning time is to enhance cooperation among UAVs. For example, they can share information for properly navigating the environment if they have a common goal. Alternatively, in case of multiple and different goals or tasks, they can exchange their available information to fitly assign tasks (e.g., targets) to each network agent. In this article, we consider ad hoc approaches for task assignment and a multi-agent reinforcement learning algorithm that allow the UAVs to learn a suitable navigation policy to explore an unknown environment while maximizing the accuracy in detecting targets. The obtained results demonstrate that cooperation at different levels accelerates the learning process and brings benefits in accomplishing the team's goals.",
    "citationCount": 12,
    "referenceCount": 87
}