{
    "paperId": "c8e33fa8555af7599f1dfdb6f433b66844411895",
    "title": "Development of an intelligent decision-making system to support scientific and industrial formations VPN connections",
    "year": 2023,
    "venue": "E3S Web of Conferences",
    "authors": [
        "Artur Zaenchkovski",
        "Alexey Lazarev"
    ],
    "doi": "10.1051/e3sconf/202343105034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c8e33fa8555af7599f1dfdb6f433b66844411895",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.e3s-conferences.org/articles/e3sconf/pdf/2023/68/e3sconf_itse2023_05034.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The development of information systems to ensure the safe coordination of information flows in scientific and industrial clusters makes it possible to automate a number of tasks aimed at increasing the cooperative interaction productivity. The use of existing traffic encapsulation solutions or the new client-server algorithms development for network interaction affects the decision-making component for managing the TCP/IP structure, authorization of subjects, and support for correct load distribution. At the moment, most VPN servers do not have the specified functionality, which does not allow integrating solutions into existing scientific and industrial clusters. As the main solution, a flexible decision support system is proposed that takes into account all aspects of the virtual tunnel software component. The proposed solution is based on the use of complex methods for assessing the software modules state to make decisions on changing the operation of functional modules. The development result of the proposed system and the conducted functional testing made it possible to automate the operation of VPN tunnels when working with a complex network interaction structure.",
    "citationCount": 0,
    "referenceCount": 16
}