{
    "paperId": "c8ea9e3877a3ce29b56843cad14d82852ef26ac1",
    "title": "On the Privacy of Adaptive Cuckoo Filters: Analysis and Protection",
    "year": 2024,
    "venue": "IEEE Transactions on Information Forensics and Security",
    "authors": [
        "P. Reviriego",
        "Jim Apple",
        "D. Larrabeiti",
        "Shanshan Liu",
        "Fabrizio Lombardi"
    ],
    "doi": "10.1109/TIFS.2024.3404868",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c8ea9e3877a3ce29b56843cad14d82852ef26ac1",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tifs.2024.3404868",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As probabilistic data structures are widely adopted in computing systems, their privacy is a major issue. Recent works have shown that even though the values stored in these structures look random, information can be extracted from them in some settings. In this paper, we consider the privacy of adaptive cuckoo filters, a probabilistic data structure that implements approximate membership checking. The main novelty and benefit of these filters are that they can adapt to removing false-positives. Unfortunately, our analysis shows that adaptation can dramatically reduce the privacy of the filters, allowing an attacker to extract the set of elements stored in the filter. Indeed, in some settings, the attacker can identify 100% of the elements stored in the filter. This means that the protection of the privacy of adaptive cuckoo filters should be considered. To that end, we propose preprocessing reduction (PR), a scheme that prevents an attacker from extracting the set of elements stored in the filter at the cost of increasing the false-positive probability of the filter. In many settings, the impact on false-positives will be negligible. For example, in a case study with 32-bit universes, the increase in the false-positive probability was smaller than 8% in all the configurations tested. Interestingly, PR is applicable not only to adaptive filters but also to approximate membership check filters in general and thus can be used to protect, for example, Bloom filters.",
    "citationCount": 2,
    "referenceCount": 36
}