{
    "paperId": "c909aaf29267c8a4cd31d8de2a82dbfba351257a",
    "title": "Optimizing Tensor Computations: From Applications to Compilation and Runtime Techniques",
    "year": 2023,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Matthias Boehm",
        "Matteo Interlandi",
        "C. Jermaine"
    ],
    "doi": "10.1145/3555041.3589407",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c909aaf29267c8a4cd31d8de2a82dbfba351257a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) training and scoring fundamentally relies on linear algebra programs and more general tensor computations. Most ML systems utilize distributed parameter servers and similar distribution strategies for mini-batch stochastic gradient descent training. However, many more tasks in the data science and engineering lifecycle can benefit from efficient tensor computations. Examples include primitives for data cleaning, data and model debugging, data augmentation, query processing, numerical simulations, as well as a wide variety of training and scoring algorithms. In this survey tutorial, we first make a case for the importance of optimizing more general tensor computations, and then provide an in-depth survey of existing applications, optimizing compilation techniques, and underlying runtime strategies. Interestingly, there are close connections to data-intensive applications, query rewriting and optimization, as well as query processing and physical design. Our goal for the tutorial is to structure existing work, create common terminology, and identify open research challenges.",
    "citationCount": 3,
    "referenceCount": 139
}