{
    "paperId": "c91ca938a0bf560dd84f9aa7a55463d6688489f4",
    "title": "Hybrid Approach of CNN & RNN for Breast Cancer Detection and Segmentation",
    "year": 2024,
    "venue": "2024 Third International Conference on Smart Technologies and Systems for Next Generation Computing (ICSTSN)",
    "authors": [
        "P. Manju",
        "Bala S. Priyadharshini",
        "S. Usharani",
        "A. Balachandar"
    ],
    "doi": "10.1109/ICSTSN61422.2024.10670832",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c91ca938a0bf560dd84f9aa7a55463d6688489f4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Breast cancer is a serious worldwide health concern, and advanced diagnostic tools are needed for an accurate and timely identification of the illness. In order to classify breast cancer through ultrasound pictures, this method suggests a hybrid strategy that combines Convolutional Neural Networks (CNNs) with Recurrent Neural Networks (RNNs). CNN integration makes it possible to extract spatial data from ultrasound pictures and identify complex patterns that may be signs of cancer. Concurrently, RNNs are used to record temporal relationships between successive ultrasound frames, which enables the model to identify changing features of possible anomalies. By combining the advantages of both CNNs & RNNs, the suggested hybrid architecture improves the model's capacity to identify minute, dynamic patterns that are essential for precise diagnosis. In comparison to standalone CNN or RNN models, the hybrid model performs better in classification, as evidenced by experimental assessments carried out on a variety of ultrasound picture datasets. The findings highlight the hybrid approach's potential to improve breast cancer diagnostic skills and present a viable path for raising the precision and dependability of ultrasound-based tumour classification techniques.",
    "citationCount": 0,
    "referenceCount": 26
}