{
    "paperId": "c92aff47b04da7c0efa88a5a5a927bf9102859bd",
    "title": "CloudyBench: A Testbed for A Comprehensive Evaluation of Cloud-Native Databases",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Chao Zhang",
        "Guoliang Li",
        "Leyao Liu",
        "Tao Lv",
        "Ju Fan"
    ],
    "doi": "10.1109/ICDE65448.2025.00191",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c92aff47b04da7c0efa88a5a5a927bf9102859bd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As more and more on-premise databases are moving towards the cloud service, it is crucial to have a benchmark to holistically evaluate the performance of their core features including elasticity, multi-tenancy, and cost-efficiency. However, existing benchmarks lack specific workload patterns and metrics for evaluating cloud-native databases, and the real workload is often unavailable due to privacy requirements. In this paper, we propose a new testbed for cloud-native databases, named CloudyBench. Its core contribution is to provide tailored workloads and metrics to evaluate the service quality of cloud-native databases in various dimensions. First, we design cloud-native workload patterns with peaks and valleys for elasticity evaluation. Second, we devise new multi-tenancy patterns by posing varied resource contention to evaluate the resource scheduling among tenants. Third, we propose a unified metric that considers performance, cost, elasticity, multitenancy, replication lag time, and fail-over. Fourth, we provide an evaluation testbed for evaluating cloud-native databases. To verify the effectiveness of CloudyBench, extensive experiments have been conducted over five commercial representatives from multiple cloud providers. We also obtain a number of insights for the performance implications of cloud-native databases from the architectural perspective.",
    "citationCount": 3,
    "referenceCount": 48
}