{
    "paperId": "c95b2f15c5541ce6664ac8d0c942054eac0df8b8",
    "title": "Leveraging deep learning for plant disease and pest detection: a comprehensive review and future directions",
    "year": 2025,
    "venue": "Frontiers in Plant Science",
    "authors": [
        "Muhammad Shoaib",
        "Abolghasem Sadeghi-Niaraki",
        "Farman Ali",
        "Irfan Hussain",
        "S. Khalid"
    ],
    "doi": "10.3389/fpls.2025.1538163",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c95b2f15c5541ce6664ac8d0c942054eac0df8b8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Plant diseases and pests pose significant threats to crop yield and quality, prompting the exploration of digital image processing techniques for their detection. Recent advancements in deep learning models have shown remarkable progress in this domain, outperforming traditional methods across various fronts including classification, detection, and segmentation networks. This review delves into recent research endeavors focused on leveraging deep learning for detecting plant and pest diseases, reflecting a burgeoning interest among researchers in artificial intelligence-driven approaches for agricultural analysis. The study begins by elucidating the limitations of conventional detection methods, setting the stage for exploring the challenges and opportunities inherent in deploying deep learning in real-world applications for plant disease and pest infestation detection. Moreover, the review offers insights into potential solutions while critically analyzing the obstacles encountered. Furthermore, it conducts a meticulous examination and prognostication of the trajectory of deep learning models in plant disease and pest infestation detection. Through this comprehensive analysis, the review seeks to provide a nuanced understanding of the evolving landscape and prospects in this vital area of agricultural research. The review highlights that state-of-the-art deep learning models have achieved impressive accuracies, with classification tasks often exceeding 95% and detection and segmentation networks demonstrating precision rates above 90% in identifying plant diseases and pest infestations. These findings underscore the transformative potential of deep learning in revolutionizing agricultural diagnostics.",
    "citationCount": 18,
    "referenceCount": 59
}