{
    "paperId": "c97ef6e524959e3f45104f3d24f82f3d53c799a6",
    "title": "Improving Code Summarization with Block-wise Abstract Syntax Tree Splitting",
    "year": 2021,
    "venue": "IEEE International Conference on Program Comprehension",
    "authors": [
        "Chen Lin",
        "Z. Ouyang",
        "Junqing Zhuang",
        "Jian-qiang Chen",
        "Hui Li",
        "Rongxin Wu"
    ],
    "doi": "10.1109/ICPC52881.2021.00026",
    "arxivId": "2103.07845",
    "url": "https://www.semanticscholar.org/paper/c97ef6e524959e3f45104f3d24f82f3d53c799a6",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2103.07845",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automatic code summarization frees software developers from the heavy burden of manual commenting and benefits software development and maintenance. Abstract Syntax Tree (AST), which depicts the source code’s syntactic structure, has been incorporated to guide the generation of code summaries. However, existing AST based methods suffer from the difficulty of training and generate inadequate code summaries. In this paper, we present the Block-wise Abstract Syntax Tree Splitting method (BASTS for short), which fully utilizes the rich tree-form syntax structure in ASTs, for improving code summarization. BASTS splits the code of a method based on the blocks in the dominator tree of the Control Flow Graph, and generates a split AST for each code split. Each split AST is then modeled by a Tree-LSTM using a pre-training strategy to capture local non-linear syntax encoding. The learned syntax encoding is combined with code encoding, and fed into Transformer to generate high-quality code summaries. Comprehensive experiments on benchmarks have demonstrated that BASTS significantly outperforms state-of-the-art approaches in terms of various evaluation metrics. To facilitate reproducibility, our implementation is available at https://github.com/XMUDM/BASTS.",
    "citationCount": 72,
    "referenceCount": 69
}