{
    "paperId": "c9802d45d2c3f1920006f9b88e14cba87e7d64f8",
    "title": "A New Method Based on Encoding Data Probability Density and Convolutional Neural Network for Rotating Machinery Fault Diagnosis",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Bowen Zhang",
        "Xinyu Pang",
        "Penghui Zhao",
        "Kaibo Lu"
    ],
    "doi": "10.1109/ACCESS.2023.3257041",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c9802d45d2c3f1920006f9b88e14cba87e7d64f8",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10068501.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In order to apply the advantages of image recognition for fault diagnosis using convolutional neural network (CNN), it is necessary to convert one-dimensional (1D) signal data into two-dimensional (2D) images. Traditional signal-based conversion methods face the challenges of complex feature extraction process, high dependence on expert knowledge and poor feature repeatability, which hinder timely and accurate fault diagnosis. Therefore, this paper proposes a fault diagnosis method for rotating machinery in virtue of Data Probability Density-Gram Angle Field-Convolutional Neural Network (DPD-GAF-CNN). DPD-GAF first computes the DPD of a 1D time series through parameter-free statistics, and then encodes the DPD into a 2D feature image that directly reflects the mean and standard deviation of the probability distribution. Besides the simplified transformation process, no artificially designed features are required like the original GAF to encode in the process of fault diagnosis. After that, the CNN based on LeNet-5 transformation is used to achieve high-precision fault classification. The proposed fault diagnosis method is verified and compared with other existing intelligent methods using the experimental data generated by the planetary gearbox test bench with various faulty conditions and the bearing data set of Case Western Reserve University. The results show that the presented method can effectively improve the accuracy and stability of fault diagnosis with the classification accuracy of several fault datasets up to 99.9%.",
    "citationCount": 9,
    "referenceCount": 49
}