{
    "paperId": "c982e4dc3ed07738a6a4d2c795ca69a2da41c587",
    "title": "Robotic warehousing operations: a learn-then-optimize approach to large-scale neighborhood search",
    "year": 2024,
    "venue": "INFORMS Journal on Optimization",
    "authors": [
        "Cynthia Barnhart",
        "Alexandre Jacquillat",
        "Alexandria Schmid"
    ],
    "doi": "10.48550/arXiv.2408.16890",
    "arxivId": "2408.16890",
    "url": "https://www.semanticscholar.org/paper/c982e4dc3ed07738a6a4d2c795ca69a2da41c587",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid deployment of robotics technologies requires dedicated optimization algorithms to manage large fleets of autonomous agents. This paper supports robotic parts-to-picker operations in warehousing by optimizing order–workstation assignments, item–pod assignments, and the schedule of order fulfillment at workstations. The model maximizes throughput, managing human workload at the workstations and congestion in the facility. We solve it via large-scale neighborhood search with a novel learn-then-optimize approach to subproblem generation. The algorithm relies on an off-line machine learning procedure to predict objective improvements based on subproblem features and an online optimization model to generate a new subproblem at each iteration. In collaboration with Amazon Robotics, we show that our model and algorithm generate much stronger solutions for practical problems than state-of-the-art approaches. In particular, our solution enhances the utilization of robotic fleets by coordinating robotic tasks for human operators to pick multiple items at once and by coordinating robotic routes to avoid congestion in the facility. Funding: This research was partially funded by Amazon.com Services LLC under award number 2D-12552417. Supplemental Material: The online appendix is available at https://doi.org/10.1287/ijoo.2024.0033 .",
    "citationCount": 1,
    "referenceCount": 65
}