{
    "paperId": "c9ed5ce784ac3a6a58591eae490a35b7f0024837",
    "title": "ETBench: Characterizing Hybrid Vision Transformer Workloads Across Edge Devices",
    "year": 2025,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Yingkun Zhou",
        "Zhengshuyuan Tian",
        "Wenhao Yang",
        "Tingting Zhang",
        "Jinpeng Ye",
        "Chenji Han",
        "Tianyi Liu",
        "Fuxin Zhang"
    ],
    "doi": "10.1109/TC.2025.3543697",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c9ed5ce784ac3a6a58591eae490a35b7f0024837",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Lightweight Convolution and Vision Transformer hybrid models have increasingly dominated the frontiers of deep learning (DL) on edge devices; however, to the best of our knowledge, no prior work has provided comprehensive evaluation on hybrid models’ performance and analyzed their characteristics by diving deep into the edge ecosystem with diversified modern DL inference engines and heterogeneous hardware. This paper proposes a comprehensive open-source benchmark suite, ETBench, to allow power-efficiency, performance and accuracy assessment for state-of-the-art (SOTA) hybrid models across 11 most widely-used DL engines deployed on diverse edge devices. After building ETBench that satisfies 6 design requirements proposed in our work, we conduct extensive experiments on 14 devices including 19 CPUs, 11 GPUs and 5 NPUs, and obtain benchmark results from all deployment scenarios (combinations of models, quantization formats, software engines, and hardware platforms). Valuable observations and insightful implications are finally summarized. For example, within current DL engines, the INT8 quantization is significantly underperformed in terms of accuracy and speed against FP16 for hybrid models. Overall, ETBench serves as a collaborative platform that assists model architects in better evaluating their models and makes it possible for future co-optimizations of DL engines and hardware accelerators.",
    "citationCount": 1,
    "referenceCount": 45
}