{
    "paperId": "ca1a35edbea05b6c425ce4cbf8ca8261ef24ec87",
    "title": "Improving prenatal diagnosis through standards and aggregation",
    "year": 2024,
    "venue": "Prenatal Diagnosis",
    "authors": [
        "Michael H Duyzend",
        "P. Cacheiro",
        "Julius O. B. Jacobsen",
        "J. Giordano",
        "H. Brand",
        "R. Wapner",
        "M. Talkowski",
        "Peter N. Robinson",
        "D. Smedley"
    ],
    "doi": "10.1002/pd.6522",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca1a35edbea05b6c425ce4cbf8ca8261ef24ec87",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/pd.6522",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Advances in sequencing and imaging technologies enable enhanced assessment in the prenatal space, with a goal to diagnose and predict the natural history of disease, to direct targeted therapies, and to implement clinical management, including transfer of care, election of supportive care, and selection of surgical interventions. The current lack of standardization and aggregation stymies variant interpretation and gene discovery, which hinders the provision of prenatal precision medicine, leaving clinicians and patients without an accurate diagnosis. With large amounts of data generated, it is imperative to establish standards for data collection, processing, and aggregation. Aggregated and homogeneously processed genetic and phenotypic data permits dissection of the genomic architecture of prenatal presentations of disease and provides a dataset on which data analysis algorithms can be tuned to the prenatal space. Here we discuss the importance of generating aggregate data sets and how the prenatal space is driving the development of interoperable standards and phenotype‐driven tools.",
    "citationCount": 4,
    "referenceCount": 92
}