{
    "paperId": "ca2180552db80d7b1492b84976d3632f9e0c871a",
    "title": "Evaluating Dispatching and Scheduling Strategies for Firm Real-Time Jobs in Edge Computing",
    "year": 2023,
    "venue": "Annual Conference of the IEEE Industrial Electronics Society",
    "authors": [
        "S. Salman",
        "A. Papadopoulos",
        "S. Mubeen",
        "Thomas Nolte"
    ],
    "doi": "10.1109/IECON51785.2023.10312523",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca2180552db80d7b1492b84976d3632f9e0c871a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We consider the problem of on-arrival dispatching and scheduling jobs with stochastic execution times, inter-arrival times, and deadlines in multi-server fog and edge computing platforms. In terms of mean response times, it has been shown that size-based scheduling policies, when combined with dispatching policies such as join-shortest-queue, provide better performance over policies such as first-in-first-out. Since job sizes may not always be known apriori, prediction-based policies have been shown to perform reasonably well. However, little is known about the performance of prediction-based policies for jobs with firm deadlines. In this paper, we address this issue by considering the number of jobs that complete within their deadlines as a performance metric and investigate, using simulations, the performance of a prediction-based shortest-job-first scheduling policy for the considered metric and compare it against scheduling policies that prioritize based on deadlines (EDF) and arrival times (FIFO). The evaluation indicates that in under-loaded conditions, the prediction-based policy is outperformed by both FIFO and EDF policies. However, in overloaded scenarios, the prediction-based policy offers slightly better performance.",
    "citationCount": 4,
    "referenceCount": 26
}