{
    "paperId": "ca3385729fe36a151cf38ba825628735e4211a3d",
    "title": "Regaining Lost Seconds: Efficient Page Preloading for SGX Enclaves",
    "year": 2020,
    "venue": "International Middleware Conference",
    "authors": [
        "Ximing Liu",
        "Wenwen Wang",
        "Lizhi Wang",
        "Xiaoli Gong",
        "Ziyi Zhao",
        "P. Yew"
    ],
    "doi": "10.1145/3423211.3425673",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca3385729fe36a151cf38ba825628735e4211a3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Intel SGX is already here, with a strong emphasis on security and privacy. However, it is not free. Studies have shown that it incurs a significant performance overhead to take advantage of the security and privacy enhancement offered by SGX. In particular, it only provides limited physical memory for applications to use SGX. As a result, page faults can be frequently triggered during program execution, especially for memory-intensive applications with a large memory footprint. Therefore, it is imperative to look into possible optimization opportunities to enhance the efficiency of SGX. To this end, this paper proposes to leverage memory page preloading techniques to mitigate such a problem. More specifically, we propose two effective schemes to preload memory pages before they are accessed. This way, the number of page faults can be significantly reduced. To demonstrate the effectiveness of the proposed schemes, we have implemented them in a prototype using LLVM and an untrusted operating system. Experimental results on benchmarks from SPEC CPU2017 and a micro-benchmark program show that, on average, these two mechanisms can achieve 11.4% and 7.0% performance improvement with a maximum performance improvement of 18.6% and 9.0%, respectively. The two mechanisms are also evaluated when they are deployed together. The combined approach can achieve an improvement of 7.1% on some real-world applications such as SIFT and MSER.",
    "citationCount": 8,
    "referenceCount": 42
}