{
    "paperId": "ca3b95b5125312de326cb75ce9d29b24efcc74a3",
    "title": "Teacher Perceptions of AI-Enhanced Educational Technology for Children with Multiple Disabilities",
    "year": 2025,
    "venue": "Journal of Information Systems Engineering & Management",
    "authors": [
        "M.Ramya, R.Shanthi"
    ],
    "doi": "10.52783/jisem.v10i18s.2942",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca3b95b5125312de326cb75ce9d29b24efcc74a3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study explores the teacher perceptions of Artificial Intelligence AI -enhanced educational technology for children with multiple disabilities (CWMD). This is about to learn more about the attitudes, opinions, and perceptions of teacher about the usage of AI-enhanced instructional and educational technology in inclusive classrooms through qualitative research techniques like surveys and interviews.  Inclusive education and technological advancements have opened avenues for learning experiences. However, little research has explored teachers perspectives on the integration of AI in educational tools specifically designed for children with multiple disabilities. Through qualitative research methods such as interviews and surveys, this study aims to analyze the perception of teachers of AI-enhanced Educational Technology for Children with Multiple Disabilities in classrooms. Kazimzade, G., et.al. (2019)This chapter offers a comprehensive overview of AI in education, focusing on inclusivity. It covers adaptive learning, disability inclusion, and cultural biases in technology. It emphasizes the importance of bias mitigation for fostering inclusivity in future developments.",
    "citationCount": 0,
    "referenceCount": 18
}