{
    "paperId": "ca4875f26f5c75011b3a2caf0cbe944b3b1bdcf5",
    "title": "PENGEMBANGAN CHATBOT BERBASIS PDF MENGGUNAKAN LOCAL RETRIEVAL-AUGMENTED GENERATION (RAG) DAN OLLAMA",
    "year": 2025,
    "venue": "Jurnal Informatika dan Teknik Elektro Terapan",
    "authors": [
        "Gerald Dustin Albert",
        "A. Voutama"
    ],
    "doi": "10.23960/jitet.v13i2.6361",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca4875f26f5c75011b3a2caf0cbe944b3b1bdcf5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "Chatbot berbasis PDF dengan pendekatan Local Retrieval-Augmented Generation (RAG) telah dikembangkan untuk meningkatkan aksesibilitas dan efisiensi pencarian informasi dalam dokumen. Penelitian ini bertujuan untuk membangun sistem chatbot yang dapat memahami dan menjawab pertanyaan pengguna berdasarkan isi dokumen PDF secara lokal tanpa bergantung pada layanan cloud. Implementasi sistem ini menggunakan ChromaDB sebagai vector database untuk penyimpanan embedding teks, model embedding nomic_embed_text untuk representasi vektor, serta Ollama sebagai LLM Manager yang mengelola proses inferensi. Metode penelitian yang digunakan adalah Rapid Application Development (RAD), yang terdiri dari tahapan perencanaan, desain, implementasi, dan pengujian. Proses ini memungkinkan pengembangan chatbot secara iteratif dengan penyesuaian cepat terhadap kebutuhan pengguna. Pengujian dilakukan menggunakan metrik ROUGE-L, yang menunjukkan skor sebesar 0,85, menandakan tingkat relevansi jawaban yang cukup tinggi. Meskipun sistem memiliki keunggulan dalam privasi data dan efisiensi pencarian, terdapat keterbatasan dalam dukungan bahasa serta waktu respon yang bervariasi tergantung spesifikasi perangkat. Hasil penelitian ini menunjukkan bahwa chatbot berbasis Local RAG dapat menjadi solusi alternatif yang efisien dalam pencarian informasi berbasis dokumen PDF. Pengembangan lebih lanjut diperlukan untuk meningkatkan kecepatan respon serta mendukung multi-bahasa guna memperluas cakupan penggunaannya.",
    "citationCount": 0,
    "referenceCount": 18
}