{
    "paperId": "ca606626fa2bf794445a757cd80fcf7b80c46f44",
    "title": "ClassBench-ng: Benchmarking Packet Classification Algorithms in the OpenFlow Era",
    "year": 2022,
    "venue": "IEEE/ACM Transactions on Networking",
    "authors": [
        "J. Matoušek",
        "Adam Lucanský",
        "David Janecek",
        "Jozef Sabo",
        "J. Korenek",
        "G. Antichi"
    ],
    "doi": "10.1109/TNET.2022.3155708",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ca606626fa2bf794445a757cd80fcf7b80c46f44",
    "isOpenAccess": true,
    "openAccessPdf": "https://qmro.qmul.ac.uk/xmlui/bitstream/123456789/78942/2/Antichi%20ClassBench-ng%20Benchmarking%20Packet%202022%20Accepted.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Packet classification, i.e., the process of categorizing packets into flows, is a first-class citizen in any networking device. Every time a new packet has to be processed, one or more header fields need to be compared against a set of pre-installed rules. This is done for basic forwarding operations, to apply security policies, application-specific processing, or quality-of-service guarantees. A lot of research efforts have identified better lookup techniques, i.e., finding the best match between packet headers and rules, by capitalizing on the rule sets characteristics. Here, ClassBench has greatly served the community by enabling the generation of IPv4 rule sets. In this paper, we present a new tool, ClassBench-ng, that creates synthetic IPv4, IPv6, and OpenFlow rules. We start from an analysis of classification rules deployed in-the-wild and we use the findings to craft our solution. ClassBench-ng can generate a user-defined number of rules as well as an associated header trace matching them. Compared to state-of-the-art solutions, the rule set generation process is usually more accurate and it is able to produce rules matching a number of different use cases, i.e., from an IPv4 router to an OpenFlow switch, which is unique among current rule set generation tools.",
    "citationCount": 15,
    "referenceCount": 43
}