{
    "paperId": "cab240236c3be7bd90d831415d93298d7303ff92",
    "title": "Dynamic estimation of maize leaf area index and improvement of critical nitrogen concentration curve based on multi-feature fusion of unmanned aerial vehicle images",
    "year": 2025,
    "venue": "Frontiers in Remote Sensing",
    "authors": [
        "Shilong Miao",
        "Xianyue Li",
        "Haibin Shi",
        "Jianwen Yan",
        "Shijie Ding"
    ],
    "doi": "10.3389/frsen.2025.1614958",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cab240236c3be7bd90d831415d93298d7303ff92",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maize is an important food crop grown in the Yellow River irrigation area of Inner Mongolia. Its yield and quality are closely related to nitrogen nutrition status. Traditional nitrogen fertilizer management relies on empirical fertilization, which often leads to low utilization rates and environmental pollution. Therefore, establishing a precise nitrogen nutrition diagnosis and regulation technology system to achieve efficient use of nitrogen fertilizers and the synergy of high crop yield and quality is necessary. This study utilized unmanned aerial vehicle remote sensing technology and integrated multiple feature methods to construct three learning algorithms for the dynamic inversion of maize leaf area index (LAI) values at different growth stages in Yellow River irrigation areas. The LAI prediction values obtained from the model were used to construct critical nitrogen concentration curves for the different irrigation treatments. The curves were improved based on actual farmland conditions and a nitrogen nutrition index (NNI) model was constructed. The nitrogen balance of each fertilization treatment under different irrigation conditions was analyzed, and a fertilization plan was formulated. Spectral indices, texture indices, texture features, and structural information of the maize pixels were calculated. Ridge regression, random forest (RF), and convolutional neural networks were used to construct LAI inversion models for different maize growth periods. The critical nitrogen concentration dilution curves for the different water treatments were improved by combining the LAI prediction values. The accuracy (R2) of simulating maize plant height using multispectral image digital elevation data was >0.8 in three different growth stages. Combining multiple features and three different learning models for predicting maize LAI revealed that the RF model had the highest fitting accuracy, with R2 values of 0.80, 0.82, and 0.83 in different growth stages. Critical nitrogen concentration dilution curves for maize were improved by combining irrigation and density factors. Compared to the original dilution curve, the accuracy (R2) improved to varying degrees. A reasonable fertilization regime for different growth stages was formulated based on the NNI model with a total fertilizer application of 225 kg/hm2. These results can provide theoretical references for unmanned aerial vehicle multispectral precise guidance for farmland fertilization.",
    "citationCount": 0,
    "referenceCount": 48
}