{
    "paperId": "cab224bd59a948accd4faff44380cfeaa4b2f3ca",
    "title": "Maximizing the Efficiency and Performance: The Role of Load Balancer in Modern Cloud Computing Environment",
    "year": 2024,
    "venue": "International Journal For Multidisciplinary Research",
    "authors": [
        "Nagakiran Nelikanti",
        "Kusuma Sareddy",
        "Naga Latha Vadla",
        "Kethineni Vinod Kumar"
    ],
    "doi": "10.36948/ijfmr.2024.v06i01.11833",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cab224bd59a948accd4faff44380cfeaa4b2f3ca",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ijfmr.com/papers/2024/1/11833.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Load balancing is a process of distributing the client requests from client application to the backend servers in an efficient way throughout the internet.There are several algorithms available to distribute this request. Cloud computing generally based on “pay per use” model that provides services like Infrastructure as a Service (IaaS), Platform as a Service (PaaS), Software as a Service (SaaS). we have different types of cloud types like Public, Private, Hybrid and Community clouds. While making the efficiency and performance maximum we will face some challenges and we need to make key strategies, The evolving role it plays in the pursuit of superior performance and scalability. Optimizing resource utilization and maintaining consistent performance are crucial for businesses and organizations in the dynamic cloud computing landscape. In this we have discussed about Golden Eagle optimization Algorithm (GEO) and Mouse And Cat optimization(CMO) algorithm .The proposed Mouse-Cat-Golden Eagle (MCGEO) algorithm employs a unique combination of three animal- inspired optimization techniques to dynamically allocate tasks across servers in a distributed computing environment.",
    "citationCount": 1,
    "referenceCount": 20
}