{
    "paperId": "caf52c94fc4987587cd1c1a9a254348827f20f07",
    "title": "Developing Supervised Learning in Cloud Architectures to Industrialize Repetitive Tasks",
    "year": 2025,
    "venue": "International Journal For Multidisciplinary Research",
    "authors": [
        "Ravi Ravi"
    ],
    "doi": "10.36948/ijfmr.2025.v07i02.42460",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/caf52c94fc4987587cd1c1a9a254348827f20f07",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud computing has been disrupting the way businesses work through an effective, and low-cost platform for delivering services and resources. However, as cloud computing is growing at a faster pace the complexity of administering and upkeep of such huge systems has become more complex. Time-consuming and resource-intensive tasks make repetitive operations like scaling resources or performance monitoring too slow and cumbersome, which in turn makes cloud architecture not well suited to efficiently managing workload fluctuations. This in turn has led to an increasing effort towards automating monotonous tasks for cloud architectures, using perhaps supervised learning techniques. This means that supervised learning algorithms can learn from the past, and can be used for prediction as well (which is very important in any operation: forecasting resource needs so you have capacity ready before it was needed using predictive analytics real-time data). This will relieve human operators of some work, making the system more efficient. By using the power of supervised learning, we can continuously optimize cloud architectures for cost-efficient and efficient resource provisioning. It also provides better scalability & adaptability for the system thus making it more fault-tolerant (in accordance to bootstrapping) against sudden spikes in workload that cannot be mitigated.",
    "citationCount": 0,
    "referenceCount": 19
}