{
    "paperId": "cafeacd3eec868d2ab4e76d4b16a7da49cd369c4",
    "title": "Verifying Deep-RL-Driven Systems",
    "year": 2019,
    "venue": "NetAI@SIGCOMM",
    "authors": [
        "Yafim Kazak",
        "Clark W. Barrett",
        "Guy Katz",
        "Michael Schapira"
    ],
    "doi": "10.1145/3341216.3342218",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cafeacd3eec868d2ab4e76d4b16a7da49cd369c4",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3341216.3342218",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep reinforcement learning (RL) has recently been successfully applied to networking contexts including routing, flow scheduling, congestion control, packet classification, cloud resource management, and video streaming. Deep-RL-driven systems automate decision making, and have been shown to outperform state-of-the-art handcrafted systems in important domains. However, the (typical) non-explainability of decisions induced by the deep learning machinery employed by these systems renders reasoning about crucial system properties, including correctness and security, extremely difficult. We show that despite the obscurity of decision making in these contexts, verifying that deep-RL-driven systems adhere to desired, designer-specified behavior, is achievable. To this end, we initiate the study of formal verification of deep RL and present Verily, a system for verifying deep-RL-based systems that leverages recent advances in verification of deep neural networks. We employ Verily to verify recently-introduced deep-RL-driven systems for adaptive video streaming, cloud resource management, and Internet congestion control. Our results expose scenarios in which deep-RL-driven decision making yields undesirable behavior. We discuss guidelines for building deep-RL-driven systems that are both safer and easier to verify.",
    "citationCount": 74,
    "referenceCount": 35
}