{
    "paperId": "cb0351dd9411cdbf98ad8190c116ddc090ac4144",
    "title": "A Structural Topology Optimization Method Integrating Genetic Algorithm and Bidirectional Evolutionary Structural Optimization",
    "year": 2025,
    "venue": "IEEE Symposium on Computational Intelligence for Engineering Solutions",
    "authors": [
        "Bingcheng Wang",
        "S. Hiwa",
        "Tomoyuki Hiroyasu"
    ],
    "doi": "10.1109/CIES64955.2025.11007626",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cb0351dd9411cdbf98ad8190c116ddc090ac4144",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study introduces a novel framework for topology optimization in structural design by integrating global and local search algorithms. Specifically, a genetic algorithm (GA) is employed as the global search method, leveraging its strengths in handling diverse objective functions while preserving interpretability throughout the optimization process. As a specific example of the framework, a system integrating GA as the global search algorithm and Bidirectional Evolutionary Structural Optimization (BESO) as the local search algorithm is introduced. GA is employed for its global exploration capability, enabling exploration on a diverse set of solutions for a wide range of optimization problems. BESO is applied as a local search method to refine solutions, enhancing the optimization results by precisely adjusting the structural design during the searching process. The effectiveness of this approach is demonstrated through two numerical examples focusing on their own primary objectives: one maximizing the structural stiffness, and the other maximizing the displacement. The results show that the combination of GA and BESO effectively meets the set design goals, highlighting the potential for significant structural design improvements through their synergistic effect, confirming the benefits of combining GA's ability to conduct global exploration with BESO's capacity to fine-tune solutions through local search. This study demonstrates the effectiveness of integrating GA and BESO in structural topology optimization, providing a powerful tool for advancing generative structural design.",
    "citationCount": 0,
    "referenceCount": 26
}