{
    "paperId": "cb06030a371a71425f946ebaee3a5d11be66132f",
    "title": "Mosaic: A Sample-Based Database System for Open World Query Processing",
    "year": 2019,
    "venue": "Conference on Innovative Data Systems Research",
    "authors": [
        "Laurel J. Orr",
        "Samuel Ainsworth",
        "Walter Cai",
        "Kevin G. Jamieson",
        "M. Balazinska",
        "Dan Suciu"
    ],
    "doi": null,
    "arxivId": "1912.07777",
    "url": "https://www.semanticscholar.org/paper/cb06030a371a71425f946ebaee3a5d11be66132f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data scientists have relied on samples to analyze populations of interest for decades. Recently, with the increase in the number of public data repositories, sample data has become easier to access. It has not, however, become easier to analyze. This sample data is arbitrarily biased with an unknown sampling probability, meaning data scientists must manually debias the sample with custom techniques to avoid inaccurate results. In this vision paper, we propose Mosaic, a database system that treats samples as first-class citizens and allows users to ask questions over populations represented by these samples. Answering queries over biased samples is non-trivial as there is no existing, standard technique to answer population queries when the sampling probability is unknown. In this paper, we show how our envisioned system solves this problem by having a unique sample-based data model with extensions to the SQL language. We propose how to perform population query answering using biased samples and give preliminary results for one of our novel query answering techniques.",
    "citationCount": 7,
    "referenceCount": 51
}