{
    "paperId": "cb36b2a823a68fc5a7e7e459cf5006267a095c02",
    "title": "A Review of Deep Learning Security and Privacy Defensive Techniques",
    "year": 2020,
    "venue": "Mobile Information Systems",
    "authors": [
        "M. Tariq",
        "Nisar Ahmed Memon",
        "Shakeel Ahmed",
        "S. Tayyaba",
        "M. T. Mushtaq",
        "N. A. Mian",
        "M. Imran",
        "M. Ashraf"
    ],
    "doi": "10.1155/2020/6535834",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cb36b2a823a68fc5a7e7e459cf5006267a095c02",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/misy/2020/6535834.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent past years, Deep Learning presented an excellent performance in different areas like image recognition, pattern matching, and even in cybersecurity. The Deep Learning has numerous advantages including fast solving complex problems, huge automation, maximum application of unstructured data, ability to give high quality of results, reduction of high costs, no need for data labeling, and identification of complex interactions, but it also has limitations like opaqueness, computationally intensive, need for abundant data, and more complex algorithms. In our daily life, we used many applications that use Deep Learning models to make decisions based on predictions, and if Deep Learning models became the cause of misprediction due to internal/external malicious effects, it may create difficulties in our real life. Furthermore, the Deep Learning training models often have sensitive information of the users and those models should not be vulnerable and expose security and privacy. The algorithms of Deep Learning and machine learning are still vulnerable to different types of security threats and risks. Therefore, it is necessary to call the attention of the industry in respect of security threats and related countermeasures techniques for Deep Learning, which motivated the authors to perform a comprehensive survey of Deep Learning security and privacy security challenges and countermeasures in this paper. We also discussed the open challenges and current issues.",
    "citationCount": 56,
    "referenceCount": 133
}