{
    "paperId": "cb4ff379dacdad9b7dadc98fa67a1ced80a3be1e",
    "title": "Information Retrieval in Business Industry Using Blockchain Technology and Artificial Intelligence",
    "year": 2021,
    "venue": "Advances in Computational Intelligence and Robotics",
    "authors": [
        "K. Sheela",
        "C. Priya"
    ],
    "doi": "10.4018/978-1-7998-7728-8.ch011",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cb4ff379dacdad9b7dadc98fa67a1ced80a3be1e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Industry 5.0 promotes automation in an optimized way. Collaboration with blockchain technology and artificial intelligence helps to enrich Industry 5.0 with its quantifiers and qualifiers. In the business industry, information plays an iconic role. When we consider the issues of storage and retrieval, we need to think about blockchain technology where the data will be stored and shared in a secure way. Here, the data will be distributed across the network in an encrypted format; hence, the original data can be viewed only by the owner of the data. Blockchain stores the information in the form of blocks. Every block has three sections. The first section holds the hash value of the previous block, the second one holds the information to be stored in a block, and the third one holds the hash value of an upcoming block. It does not allow an intruder to hack or modify the data without user's knowledge as these blocks are interconnected on both the sides with their hashes. This synergy of technologies brings supremacy in the field of business industries which will be discussed in this chapter.",
    "citationCount": 3,
    "referenceCount": 17
}