{
    "paperId": "cb4f11fae775775fc7885c4854321fc3b356e91e",
    "title": "The Case for Optimizing the Frequency of Periodic Data Movements over Hybrid Memory Systems",
    "year": 2020,
    "venue": "International Symposium on Memory Systems",
    "authors": [
        "Thaleia Dimitra Doudali",
        "Daniel Zahka",
        "Ada Gavrilovska"
    ],
    "doi": "10.1145/3422575.3422788",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cb4f11fae775775fc7885c4854321fc3b356e91e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Application performance improvements in emerging systems with hybrid memory components, such as DRAM and Intel’s Optane DC persistent memory, are possible via periodic data movements, that maximize the DRAM use and system resource efficiency. Similarly, predominantly used NUMA DRAM-only systems benefit from data balancing solutions, such as AutoNUMA, which periodically remap an application and its data on the same NUMA node. Although there has been a significant body of research focused on the clever selection of the data to be moved periodically, there is little insight as to how to select the frequency of the data movements, i.e., the duration of the monitoring period. Our experimental analysis shows that fine-tuning the period frequency can boost application performance on average by 70% for systems with locally attached memory units and 5x when accessing remote memory via interconnection networks. Thus, there is potential for significant performance improvements just by cleverly selecting the frequency of the data movements apart from choosing the data itself. While existing solutions empirically set the duration of the period, our work provides insights into the application-level properties that influence the choice of the period. More specifically, we show that there is a correlation between the application-level data reuse distance and migration frequency. Future work aims to solidify this correlation and build a profiling solution that provides users with the data movement frequency which dynamic data management solutions can then use to enhance performance.",
    "citationCount": 4,
    "referenceCount": 29
}