{
    "paperId": "cb60f20c2beaf9759bd1a744450db5e6322757b3",
    "title": "Differentiation Through Black-Box Quadratic Programming Solvers",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Connor W. Magoon",
        "Fengyu Yang",
        "Noam Aigerman",
        "S. Kovalsky"
    ],
    "doi": "10.48550/arXiv.2410.06324",
    "arxivId": "2410.06324",
    "url": "https://www.semanticscholar.org/paper/cb60f20c2beaf9759bd1a744450db5e6322757b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Differentiable optimization has attracted significant research interest, particularly for quadratic programming (QP). Existing approaches for differentiating the solution of a QP with respect to its defining parameters often rely on specific integrated solvers. This integration limits their applicability, including their use in neural network architectures and bi-level optimization tasks, restricting users to a narrow selection of solver choices. To address this limitation, we introduce dQP, a modular and solver-agnostic framework for plug-and-play differentiation of virtually any QP solver. Our key theoretical insight is that the solution and its derivative can each be expressed in terms of closely-related and simple linear systems by using the active set at the solution. This insight enables efficient decoupling of the QP's solution, obtained by any solver, from its differentiation. Our open-source, minimal-overhead implementation will be made publicly available and seamlessly integrates with more than 15 state-of-the-art solvers. Comprehensive benchmark experiments demonstrate dQP's robustness and scalability, particularly highlighting its advantages in large-scale sparse problems.",
    "citationCount": 1,
    "referenceCount": 115
}