{
    "paperId": "cb89a4cae34b947052058212e59c99e71ca33e12",
    "title": "Discrete Listwise Collaborative Filtering for Fast Recommendation",
    "year": 2021,
    "venue": "SDM",
    "authors": [
        "Chenghao Liu",
        "Tao Lu",
        "Zhiyong Cheng",
        "Xin Wang",
        "Jianling Sun",
        "S. Hoi"
    ],
    "doi": "10.1137/1.9781611976700.6",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cb89a4cae34b947052058212e59c99e71ca33e12",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1137/1.9781611976700.6",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Listwise collaborative ﬁltering, which directly predicts a ranking list of items for the given user, achieves superior accuracy performance since it is aligned with the ultimate goals of recommender systems. However, in corpus with the enormous number of items, the calculation cost for the learnt model to predict all user-item preferences is tremendous, which makes full corpus retrieval extremely difﬁcult. In this paper, we propose a binarized collaborative ﬁltering method, called Discrete Listwise Collaborative Filtering (DLCF), to represent users and items as binary codes for fast recommendation. As such, the proposed method could accelerate the retrieval procedure, since the user-item similarity could be efﬁciently computed via Hamming distance. We further adopt the discrete coordinate descent method to jointly optimize our proposed model. Extensive experiments performed on three real-world datasets demonstrate that 1) DLCF sig-niﬁcantly outperforms the state-of-the-art binarized recommendation methods, and 2) DLCF shows very competitive ranking accuracy compared to its real-valued version while signiﬁcantly improving the retrieval efﬁciency.",
    "citationCount": 3,
    "referenceCount": 27
}