{
    "paperId": "cb9213c62badbe999e888014da4359142ab77832",
    "title": "Data Mesh: A Systematic Gray Literature Review",
    "year": 2023,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Abel Goedegebuure",
        "Indika Kumara",
        "Stefan W. Driessen",
        "Willem-Jan van den Heuvel",
        "Geert Monsieur",
        "D. Tamburri",
        "Dario Di Nucci"
    ],
    "doi": "10.1145/3687301",
    "arxivId": "2304.01062",
    "url": "https://www.semanticscholar.org/paper/cb9213c62badbe999e888014da4359142ab77832",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3687301",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data mesh is an emerging domain-driven decentralized data architecture that aims to minimize or avoid operational bottlenecks associated with centralized, monolithic data architectures in enterprises. The topic has piqued the practitioners’ interest, and considerable gray literature exists. At the same time, we observe a lack of academic attempts at defining and building upon the concept. Hence, in this article, we aim to start from the foundations and characterize the data mesh architecture regarding its design principles, architectural components, capabilities, and organizational roles. We systematically collected, analyzed, and synthesized 114 industrial gray literature articles. The resulting review provides insights into practitioners’ perspectives on the four key principles of data mesh: data as a product, domain ownership of data, self-serve data platform, and federated computational governance. Moreover, due to the comparability of data mesh and SOA (service-oriented architecture), we mapped the findings from the gray literature into the reference architectures from the SOA academic literature to create the reference architectures for describing three key dimensions of data mesh: organization of capabilities and roles, development, and runtime. Finally, we discuss open research issues in data mesh, partially based on the findings from the gray literature.",
    "citationCount": 25,
    "referenceCount": 179
}