{
    "paperId": "cbf2b5245b991951289331807b9d40ded5541278",
    "title": "Hierarchical Optimization-Derived Learning",
    "year": 2023,
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "authors": [
        "Risheng Liu",
        "Xuan Liu",
        "Shangzhi Zeng",
        "Jin Zhang",
        "Yixuan Zhang"
    ],
    "doi": "10.1109/TPAMI.2023.3315333",
    "arxivId": "2302.05587",
    "url": "https://www.semanticscholar.org/paper/cbf2b5245b991951289331807b9d40ded5541278",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2302.05587",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, by utilizing optimization techniques to formulate the propagation of deep model, a variety of so-called Optimization-Derived Learning (ODL) approaches have been proposed to address diverse learning and vision tasks. Although having achieved relatively satisfying practical performance, there still exist fundamental issues in existing ODL methods. In particular, current ODL methods tend to consider model constructing and learning as two separate phases, and thus fail to formulate their underlying coupling and depending relationship. In this work, we first establish a new framework, named Hierarchical ODL (HODL), to simultaneously investigate the intrinsic behaviors of optimization-derived model construction and its corresponding learning process. Then we rigorously prove the joint convergence of these two sub-tasks, from the perspectives of both approximation quality and stationary analysis. To our best knowledge, this is the first theoretical guarantee for these two coupled ODL components: optimization and learning. We further demonstrate the flexibility of our framework by applying HODL to challenging learning tasks, which have not been properly addressed by existing ODL methods. Finally, we conduct extensive experiments on both synthetic data and real applications in vision and other learning tasks to verify the theoretical properties and practical performance of HODL in various application scenarios.",
    "citationCount": 4,
    "referenceCount": 68
}