{
    "paperId": "cc46815ca9873ae126a937977a890767549ddffd",
    "title": "EXPLORA: AI/ML EXPLainability for the Open RAN",
    "year": 2023,
    "venue": "PACMNET",
    "authors": [
        "Claudio Fiandrino",
        "Leonardo Bonati",
        "Salvatore D’oro",
        "Michele Polese",
        "T. Melodia",
        "Joerg Widmer"
    ],
    "doi": "10.1145/3629141",
    "arxivId": "2310.13667",
    "url": "https://www.semanticscholar.org/paper/cc46815ca9873ae126a937977a890767549ddffd",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2310.13667",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Open Radio Access Network (RAN) paradigm is transforming cellular networks into a system of disaggregated, virtualized, and software-based components. These self-optimize the network through programmable, closed-loop control, leveraging Artificial Intelligence (AI) and Machine Learning (ML) routines. In this context, Deep Reinforcement Learning (DRL) has shown great potential in addressing complex resource allocation problems. However, DRL-based solutions are inherently hard to explain, which hinders their deployment and use in practice. In this paper, we propose EXPLORA, a framework that provides explainability of DRL-based control solutions for the Open RAN ecosystem. EXPLORA synthesizes network-oriented explanations based on an attributed graph that produces a link between the actions taken by a DRL agent (i.e., the nodes of the graph) and the input state space (i.e., the attributes of each node). This novel approach allows EXPLORA to explain models by providing information on the wireless context in which the DRL agent operates. EXPLORA is also designed to be lightweight for real-time operation. We prototype EXPLORA and test it experimentally on an O-RAN-compliant near-real-time RIC deployed on the Colosseum wireless network emulator. We evaluate EXPLORA for agents trained for different purposes and showcase how it generates clear network-oriented explanations. We also show how explanations can be used to perform informative and targeted intent-based action steering and achieve median transmission bitrate improvements of 4% and tail improvements of 10%.",
    "citationCount": 28,
    "referenceCount": 83
}