{
    "paperId": "cc66ad4498322c52efcc6b3162ced71de2220728",
    "title": "Digital Rubber Duck: Leveraging Large Language Models for Extreme Programming",
    "year": 2023,
    "venue": "2023 Congress in Computer Science, Computer Engineering, & Applied Computing (CSCE)",
    "authors": [
        "Timothy Elvira",
        "T. Procko",
        "J. Couder",
        "Omar Ochoa"
    ],
    "doi": "10.1109/CSCE60160.2023.00051",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cc66ad4498322c52efcc6b3162ced71de2220728",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The recent prevalence of Large Language models (LLMs), e.g., GPT-3.5 and GPT-4, has brought about a new age of man-computer symbiosis, where LLMs are employed for a litany of creative, constructive, scientific, or otherwise content-generative tasks, e.g., as general chatbot assistants, writing editors, digital subject matter experts, programming consultants, and so on. Of interest to software engineers is the concept of “rubber duck debugging”, which is the act of expressing code, line-by-line, in natural language, to an inanimate object, e.g., a rubber duck, for the purpose of elucidating potential issues that can then be corrected. In this paper, we detail a workflow process that leverages the concept of rubber duck debugging, replacing the duck with a capable LLM, e.g., GPT-4. We call it Digital Rubber Duck Programming. Furthermore, the Extreme Programming (XP) method, an implementation of the Agile paradigm, is considered as easily integrated with the proposed workflow, as XP is performed in pairs (much like the modern software engineer works in pairwise fashion with an LLM) and because XP places emphasis on performing extensive code reviews and unit testing all code, which capable LLMs like GPT-4 can facilitate.",
    "citationCount": 2,
    "referenceCount": 48
}