{
    "paperId": "cc67008308e76da1c68e9c525fe24f737dd7357f",
    "title": "Development of a Predictive Real-Time Temperature Management Framework for Data Centers Using a Hybrid Deep Learning Model",
    "year": 2025,
    "venue": "International Islamic University Malaysia Engineering Journal",
    "authors": [
        "Patrick Olabisi",
        "Ahmed Mayowa"
    ],
    "doi": "10.31436/iiumej.v26i3.3629",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cc67008308e76da1c68e9c525fe24f737dd7357f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "Traditional cooling systems in data centers often struggle to adapt to dynamic temperature fluctuations caused by varying server loads and environmental conditions, leading to energy inefficiency and potential overheating risks. This research developed a predictive cooling system to address the challenges of maintaining efficient temperature management that will enhance system reliability, cooling efficiency, and energy savings by leveraging deep learning techniques. A hybridization of two deep learning techniques: Convolutional Neural Networks (CNN) and Long Short-Term Memory (LSTM) networks was formed. Over a 24-hour test period, the model demonstrated a high prediction accuracy ranging from 85 to 95% with reliability between 0.97 and 0.99, highlighting the system’s robust design. Cooling efficiency ranged from 0.75 to 0.9, peaking during cooler hours and dipping slightly during midday due to higher energy demands and environmental conditions. Efficiency improvements of 3 to 7% were observed, particularly during high-demand periods. The findings highlight the transformative potential of predictive cooling systems in reducing energy consumption and ensuring thermal stability in modern data centers. Further optimization of the CNN-LSTM model to improve prediction accuracy during peak server activity is recommended. Additionally, integrating real-time feedback loops and incorporating renewable energy sources into the system could enhance its sustainability and reduce operational costs.\nABSTRAK: Sistem penyejukan tradisional di pusat data sering menghadapi masalah menyesuaikan diri dengan suhu dinamik yang disebabkan oleh beban pelayan dan keadaan persekitaran berbeza, membawa kepada risiko ketidakcekapan tenaga dan kemungkinan terlebih panas. Penyelidikan ini membangunkan sistem penyejukan ramalan bagi menangani cabaran dalam mengekalkan pengurusan suhu yang cekap, sekaligus meningkatkan kebolehpercayaan pada sistem, kecekapan penyejukan dan penjimatan tenaga melalui manfaat teknik pembelajaran mendalam. Hibridisasi dua teknik pembelajaran mendalam iaitu: Rangkaian Neural Konvolusi (CNN) dan Rangkaian Memori Jangka Pendek Panjang (LSTM) telah dibentuk. Sepanjang tempoh ujian 24 jam, model menunjukkan ketepatan ramalan yang tinggi antara 85 hingga 95% dengan kebolehpercayaan antara 0.97 dan 0.99 menyerlahkan reka bentuk sistem yang teguh. Kecekapan penyejukan antara 0.75 hingga 0.9, memuncak pada waktu sejuk dan menurun sedikit pada tengah hari disebabkan perningkatan permintaan tenaga dan keadaan persekitaran. Peningkatan kecekapan sebanyak 3 hingga 7% diperhatikan, terutama semasa tempoh permintaan tinggi. Dapatan ini menyerlahkan potensi transformatif sistem penyejukan ramalan dalam mengurangkan penggunaan tenaga dan memastikan kestabilan haba di pusat data moden. Pengoptimuman lanjut terhadap model CNN-LSTM bagi meningkatkan ketepatan ramalan semasa aktiviti waktu puncak adalah disyorkan. Selain itu, penyepaduan gelung maklum balas masa nyata dan gabungan sumber tenaga boleh diperbaharui ke dalam sistem bagi meningkatkan lagi kemampanannya dan mengurangkan kos operasi.",
    "citationCount": 0,
    "referenceCount": 24
}