{
    "paperId": "cca37eab839d5a1eda70c056e67ec6bd3bb83cbd",
    "title": "Convolutional Acceleration Algorithm Combining Loop Optimization and Automatic Scheduling",
    "year": 2023,
    "venue": "2023 International Conference for Advancement in Technology (ICONAT)",
    "authors": [
        "Hongkang Liu",
        "Feifei Deng"
    ],
    "doi": "10.1109/ICONAT57137.2023.10080410",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cca37eab839d5a1eda70c056e67ec6bd3bb83cbd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Convolutional neural networks are widely used in deep learning, and convolutional computation accounts for the largest proportion of time in convolutional neural networks, which basically determines the performance of the whole network, so it is important to perform acceleration optimization for the convolutional layer, which can improve the operation speed of the whole neural network to a certain extent and thus accelerate the forward inference of the model. In this paper, we propose an effective convolutional acceleration method that combines traditional compilation techniques and deep learning compilation techniques, starting from the data layout and computational order of the input matrix for convolutional operations. First, we combine the data layout of the input matrix in the MEC algorithm with the loop unrolling, which enhances the parallelism of data transformation. Next, we integrate the intermediate state matrix multiplication operation with the traditional compilation optimization technique and the Ansor [22] in deep learning compiler TVM, which effectively improves the speed of the matrix multiplication operation. In addition, our experiments show that our method effectively speeds up the convolution operation and reduces the running time.",
    "citationCount": 1,
    "referenceCount": 22
}