{
    "paperId": "cca8a3e1bc5c17f1a964744e29484fcf288795dc",
    "title": "Efficient Selectivity Estimation for Relation-Tree Joins in Multi-Model Databases",
    "year": 2021,
    "venue": "2021 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Linli Qi",
        "Peiquan Jin",
        "Shouhong Wan"
    ],
    "doi": "10.1109/BigData52589.2021.9672047",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cca8a3e1bc5c17f1a964744e29484fcf288795dc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Join selectivity estimation is a fundamental problem in query optimization, which aims to estimate the cardinality returned by a join query. While join selectivity estimation has been extensively studied in relational databases, there are few studies toward join selectivity estimation for cross-model joins in multi-model databases, such as relation-tree joins between a relational table and a tree-structured document like a BSON file in MongoDB. So far, due to the popularity of MongoDB, many applications use both MongoDB and MySQL to organize heterogeneous data. Thus, it is necessary to devise efficient approaches for processing relation-tree joins running on relational and tree models. In this paper, we present an effective and efficient approach to estimate the join selectivity for relation-tree joins, which consists of a value join estimation and a structural join estimation. In particular, we propose a two-level sampling method that samples the relational tuples and tree nodes at two levels. Then, we apply the discrete learning algorithm to the tree node samples to estimate the join value distribution of the tree nodes. With this mechanism, we can capture the correlation between relational tuples and tree nodes and improve the estimation accuracy. We conduct experiments on the DBLP dataset and compare our approach to existing solutions, and the results suggest the effectiveness and efficiency of our proposal.",
    "citationCount": 0,
    "referenceCount": 22
}