{
    "paperId": "ccc4a35f60b8196ed74ea1ac40ad532b286f7235",
    "title": "The telomere-to-telomere (T2T) genome of Peucedanum praeruptorum Dunn provides insights into the genome evolution and coumarin biosynthesis",
    "year": 2024,
    "venue": "GigaScience",
    "authors": [
        "Mingzhou Bai",
        "Sanjie Jiang",
        "S. Chu",
        "Yangyang Yu",
        "Dai Shan",
        "Chun Liu",
        "Liang Zong",
        "Qun Liu",
        "Nana Liu",
        "Weisong Xu",
        "Zhanlong Mei",
        "Jianbo Jian",
        "Chi Zhang",
        "Shancen Zhao",
        "Tsan-Yu Chiu",
        "Henrik Toft Simonsen"
    ],
    "doi": "10.1093/gigascience/giae025",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ccc4a35f60b8196ed74ea1ac40ad532b286f7235",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1093/gigascience/giae025",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Background Traditional Chinese medicine has used Peucedanum praeruptorum Dunn (Apiaceae) for a long time. Various coumarins, including the significant constituents praeruptorin (A–E), are the active constituents in the dried roots of P. praeruptorum. Previous transcriptomic and metabolomic studies have attempted to elucidate the distribution and biosynthetic network of these medicinal-valuable compounds. However, the lack of a high-quality reference genome impedes an in-depth understanding of genetic traits and thus the development of better breeding strategies. Results A telomere-to-telomere (T2T) genome was assembled for P. praeruptorum by combining PacBio HiFi, ONT ultra-long, and Hi-C data. The final genome assembly was approximately 1.798 Gb, assigned to 11 chromosomes with genome completeness >98%. Comparative genomic analysis suggested that P. praeruptorum experienced 2 whole-genome duplication events. By the transcriptomic and metabolomic analysis of the coumarin metabolic pathway, we presented coumarins’ spatial and temporal distribution and the expression patterns of critical genes for its biosynthesis. Notably, the COSY and cytochrome P450 genes showed tandem duplications on several chromosomes, which may be responsible for the high accumulation of coumarins. Conclusions A T2T genome for P. praeruptorum was obtained, providing molecular insights into the chromosomal distribution of the coumarin biosynthetic genes. This high-quality genome is an essential resource for designing engineering strategies for improving the production of these valuable compounds.",
    "citationCount": 7,
    "referenceCount": 95
}