{
    "paperId": "cceeaaa234306bbfa8f94e15b3449f266a7106e1",
    "title": "Designing an Accounting Information Management System Using Big Data and Cloud Technology",
    "year": 2022,
    "venue": "Scientific Programming",
    "authors": [
        "Qin Dai"
    ],
    "doi": "10.1155/2022/7931328",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cceeaaa234306bbfa8f94e15b3449f266a7106e1",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/sp/2022/7931328.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the rapid development of science and technology pushing people into the information age, the appearance of information technology is a major change for the accounting industry, which will redefine the traditional accounting profession. The new management techniques and concepts also gradually change the traditional accounting working mode by promoting the development of accounting professionals from traditional accounting to accounting information. In recent years, cybercrime and attacking information system vulnerability have occurred frequently. This study utilizes the model and technology in the design of an accounting information management system by simply explaining the idea of cloud technology and examining its logical structure of cloud technology. After that, it designs the cloud platform architecture of the accounting information management system (AIMS) by building the SaaS model. It defines the distributed storage mode of the cloud platform and tests the cluster performance of the system after completing the system design and construction to judge the application effect of the system. Finally, the system operation time, local rows of data, and load balancing are tested experimentally. These results demonstrate that the response relationships of distinct tasks are modified higher than TeraSort, TeraSort higher than Inquiry, and response time is proportional to the amount of Reduce slots when input tasks are the same. The analysis shows that the large data cloud platform used in this paper has high operational efficiency, acceleration rate, and task execution rate.",
    "citationCount": 10,
    "referenceCount": 21
}