{
    "paperId": "cd010c6f46ac941fc013207d488c527fe6c1e472",
    "title": "Blockchain State Sharding With Space-Aware Representations",
    "year": 2021,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Avi Mizrahi",
        "Ori Rottenstreich"
    ],
    "doi": "10.1109/TNSM.2020.3031355",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cd010c6f46ac941fc013207d488c527fe6c1e472",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "State sharding is a common solution to the scalability problem in blockchain systems, allowing nodes to hold a partial view of the system state. With sharding, the processing of a transaction might not be completed locally within a node and potentially requires involvement of multiple shards. Such cross-shards transactions have a negative impact on system performance and are frequent with traditional state partition solutions which are often based on a simple mapping of data into shards. By locating together parts of the system state accessed by frequent transactions, the amount of cross-shard transactions can be reduced. On the other hand, the representation of such particular mappings can be memory intensive. In this article, we study traffic-aware sharding that can be described in memory-efficient mappings. We first survey existing mapping schemes in common blockchains. We indicate the tradeoff between the size of the mapping of data to shards and the required transaction processing time and suggest algorithms for finding memory-light sharding of low cross-shard rate. We generalize the approach towards an efficient incremental computation of shards and probabilistic representation of the mapping to shards. We examine the efficiency of the solutions and the required frequency of sharding computation based on real information of the Ethereum network.",
    "citationCount": 36,
    "referenceCount": 40
}