{
    "paperId": "cd04608a702b680490b2444761ecc5e852c9a7fd",
    "title": "Dynamic graph learning-based higher-order graph convolutional networks for fluid classification in oil and gas exploration",
    "year": 2025,
    "venue": "The Physics of Fluids",
    "authors": [
        "Hengxiao Li",
        "Youzhuang Sun",
        "Sibo Qiao"
    ],
    "doi": "10.1063/5.0252513",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cd04608a702b680490b2444761ecc5e852c9a7fd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the field of oil and gas exploration, well-logging data is essential for predicting subsurface fluids. However, the classification of fluids remains a challenging task due to the inherent complexity of well-logging signals and the noise interference that distorts the data. Traditional machine learning techniques, while effective in extracting local features from these signals, often struggle to capture the spatial and topological relationships between data points. This limitation hinders their performance in fluid classification. To address these issues, we propose the deep dynamic higher-order graph convolutional network (DynGraph-FluidNet), a model that leverages dynamic graph learning to reduce the impact of noise and improve classification accuracy. Our approach integrates a higher-order graph convolutional network to extract multi-scale features embedded within the data's connectivity structure. Additionally, we utilize an edge pooling-based downsampling strategy to optimize the feature aggregation process, which further enhances classification performance. A residual convolution module is also incorporated to capture local information from individual well-logging samples more effectively, thereby improving the model's ability to represent intricate patterns. Experimental results demonstrate that DynGraph-FluidNet outperforms traditional models, achieving significantly higher fluid classification accuracy.",
    "citationCount": 1,
    "referenceCount": 43
}