{
    "paperId": "cd30f3b947cd12656a22226a3a5e79030b909b3b",
    "title": "IWEK: An Interpretable What-If Estimator for Database Knobs",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Yu Yan",
        "Hongzhi Wang",
        "Jian Geng",
        "Jian Ma",
        "Geng Li",
        "Zixuan Wang",
        "Zhiyu Dai",
        "Tianqing Wang"
    ],
    "doi": "10.48550/arXiv.2307.16115",
    "arxivId": "2307.16115",
    "url": "https://www.semanticscholar.org/paper/cd30f3b947cd12656a22226a3a5e79030b909b3b",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2307.16115",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The knobs of modern database management systems have significant impact on the performance of the systems. With the development of cloud databases, an estimation service for knobs is urgently needed to improve the performance of database. Unfortunately, few attentions have been paid to estimate the performance of certain knob configurations. To fill this gap, we propose IWEK, an interpretable&transferable what-if estimator for database knobs. To achieve interpretable estimation, we propose linear estimator based on the random forest for database knobs for the explicit and trustable evaluation results. Due to its interpretability, our estimator capture the direct relationships between knob configuration and its performance, to guarantee the high availability of database. We design a two-stage transfer algorithm to leverage historical experiences to efficiently build the knob estimator for new scenarios. Due to its lightweight design, our method can largely reduce the overhead of collecting training data and could achieve cold start knob estimation for new scenarios. Extensive experiments on YCSB and TPCC show that our method performs well in interpretable and transferable knob estimation with limited training data. Further, our method could achieve efficient estimator transfer with only 10 samples in TPCC and YSCB.",
    "citationCount": 0,
    "referenceCount": 39
}