{
    "paperId": "cd349397fe11eae15f5b9fecb8f4ededb99ab112",
    "title": "A Knowledge-Based Sense Disambiguation Method to Semantically Enhanced NL Question for Restricted Domain",
    "year": 2021,
    "venue": "Inf.",
    "authors": [
        "Ammar Arbaaeen",
        "Asadullah Shah"
    ],
    "doi": "10.3390/info12110452",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cd349397fe11eae15f5b9fecb8f4ededb99ab112",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2078-2489/12/11/452/pdf?version=1635925571",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Within the space of question answering (QA) systems, the most critical module to improve overall performance is question analysis processing. Extracting the lexical semantic of a Natural Language (NL) question presents challenges at syntactic and semantic levels for most QA systems. This is due to the difference between the words posed by a user and the terms presently stored in the knowledge bases. Many studies have achieved encouraging results in lexical semantic resolution on the topic of word sense disambiguation (WSD), and several other works consider these challenges in the context of QA applications. Additionally, few scholars have examined the role of WSD in returning potential answers corresponding to particular questions. However, natural language processing (NLP) is still facing several challenges to determine the precise meaning of various ambiguities. Therefore, the motivation of this work is to propose a novel knowledge-based sense disambiguation (KSD) method for resolving the problem of lexical ambiguity associated with questions posed in QA systems. The major contribution is the proposed innovative method, which incorporates multiple knowledge sources. This includes the question’s metadata (date/GPS), context knowledge, and domain ontology into a shallow NLP. The proposed KSD method is developed into a unique tool for a mobile QA application that aims to determine the intended meaning of questions expressed by pilgrims. The experimental results reveal that our method obtained comparable and better accuracy performance than the baselines in the context of the pilgrimage domain.",
    "citationCount": 3,
    "referenceCount": 46
}