{
    "paperId": "cd5f2ebab4cb7f310d577cbc17a2b0b708b99bdc",
    "title": "Query cost estimation in graph databases via emphasizing query dependencies by using a neural reasoning network",
    "year": 2023,
    "venue": "Concurrency and Computation",
    "authors": [
        "Zhenzhen He",
        "Jiong Yu",
        "Tiquan Gu",
        "Zhe Li",
        "Xusheng Du",
        "P. Li"
    ],
    "doi": "10.1002/cpe.7817",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cd5f2ebab4cb7f310d577cbc17a2b0b708b99bdc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the increasing complexity of graph queries, query cost estimation has become a key challenge in graph databases. Accurate estimation results are critical for database administrators or database management systems to perform query processing or optimization tasks. An efficient and accurate estimation model can improve the estimation quality and make the produced results credible. Although learning‐based methods have been applied in query cost estimation, most of them are directed at relational queries and cannot be directly used for graph queries. Furthermore, most estimation approaches focus on the correlations between predicates or columns. The dependencies between query schema and query filter conditions and the correlation between query schema are ignored. In this study, we construct a novel deep learning model composed of reasoning and retrieval processes that can accurately capture the potential logical relationships in graph queries. This solves the above problems to some extent. In addition, we propose a query estimation framework that divides the estimation task into query workload generation, training data collection, feature extraction and encoding, and estimation model construction. The results of the experiment on real‐world datasets show that our estimation model can improve the estimation quality and outperforms other compared deep learning models in terms of estimation accuracy.",
    "citationCount": 3,
    "referenceCount": 48
}