{
    "paperId": "cdb7c046b5e41bfc73a25b92a80bab4866725a87",
    "title": "Artificial Intelligence and Internet of Things Integration in Pharmaceutical Manufacturing: A Smart Synergy",
    "year": 2025,
    "venue": "Pharmaceutics",
    "authors": [
        "Reshma Kodumuru",
        "Soumavo Sarkar",
        "Varun Parepally",
        "Jignesh Chandarana"
    ],
    "doi": "10.3390/pharmaceutics17030290",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cdb7c046b5e41bfc73a25b92a80bab4866725a87",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: The integration of artificial intelligence (AI) with the internet of things (IoTs) represents a significant advancement in pharmaceutical manufacturing and effectively bridges the gap between digital and physical worlds. With AI algorithms integrated into IoTs sensors, there is an improvement in the production process and quality control for better overall efficiency. This integration facilitates enabling machine learning and deep learning for real-time analysis, predictive maintenance, and automation—continuously monitoring key manufacturing parameters. Objective: This paper reviews the current applications and potential impacts of integrating AI and the IoTs in concert with key enabling technologies like cloud computing and data analytics, within the pharmaceutical sector. Results: Applications discussed herein focus on industrial predictive analytics and quality, underpinned by case studies showing improvements in product quality and reductions in downtime. Yet, many challenges remain, including data integration and the ethical implications of AI-driven decisions, and most of all, regulatory compliance. This review also discusses recent trends, such as AI in drug discovery and blockchain for data traceability, with the intent to outline the future of autonomous pharmaceutical manufacturing. Conclusions: In the end, this review points to basic frameworks and applications that illustrate ways to overcome existing barriers to production with increased efficiency, personalization, and sustainability.",
    "citationCount": 10,
    "referenceCount": 209
}