{
    "paperId": "ce09665edbb132fd74d75d6bf312360afb881ec0",
    "title": "Efficient and Fast High-Performance Library Generation for Deep Learning Accelerators",
    "year": 2025,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Jun Bi",
        "Yuanbo Wen",
        "Xiaqing Li",
        "Yongwei Zhao",
        "Yuxuan Guo",
        "Enshuai Zhou",
        "Xingui Hu",
        "Zidong Du",
        "Ling Li",
        "Huaping Chen",
        "Tianshi Chen",
        "Qi Guo"
    ],
    "doi": "10.1109/TC.2024.3475575",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ce09665edbb132fd74d75d6bf312360afb881ec0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The widespread adoption of deep learning accelerators (DLAs) underscores their pivotal role in improving the performance and energy efficiency of neural networks. To fully leverage the capabilities of these accelerators, exploration-based library generation approaches have been widely used to substantially reduce software development overhead. However, these approaches have been challenged by issues related to sub-optimal optimization results and excessive optimization overheads. In this paper, we propose <sc>Heron</sc> to generate high-performance libraries of DLAs in an efficient and fast way. The key is automatically enforcing massive constraints through the entire program generation process and guiding the exploration with an accurate pre-trained cost model. <sc>Heron</sc> represents the search space as a constrained satisfaction problem (CSP) and explores the space via evolving the CSPs. Thus, the sophisticated constraints of the search space are strictly preserved during the entire exploration process. The exploration algorithm has the flexibility to engage in space exploration using either online-trained models or pre-trained models. Experimental results demonstrate that <sc>Heron</sc> averagely achieves 2.71<inline-formula><tex-math notation=\"LaTeX\">$\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"bi-ieq1-3475575.gif\"/></alternatives></inline-formula> speedup over three state-of-the-art automatic generation approaches. Also, compared to vendor-provided hand-tuned libraries, <sc>Heron</sc> achieves a 2.00<inline-formula><tex-math notation=\"LaTeX\">$\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"bi-ieq2-3475575.gif\"/></alternatives></inline-formula> speedup on average. When employing a pre-trained model, <sc>Heron</sc> achieves 11.6<inline-formula><tex-math notation=\"LaTeX\">$\\times$</tex-math><alternatives><mml:math display=\"inline\"><mml:mo>×</mml:mo></mml:math><inline-graphic xlink:href=\"bi-ieq3-3475575.gif\"/></alternatives></inline-formula> compilation time speedup, incurring a minor impact on execution time.",
    "citationCount": 0,
    "referenceCount": 37
}