{
    "paperId": "ce377ee16ee8c3b3c0f26c9daa4d09c8d43f8305",
    "title": "Beyond Quantile Methods: Improved Top-K Threshold Estimation for Traditional and Learned Sparse Indexes",
    "year": 2024,
    "venue": "BigData Congress [Services Society]",
    "authors": [
        "Jinrui Gou",
        "Yifan Liu",
        "Minghao Shao",
        "Torsten Suel"
    ],
    "doi": "10.1109/BigData62323.2024.10825349",
    "arxivId": "2412.10701",
    "url": "https://www.semanticscholar.org/paper/ce377ee16ee8c3b3c0f26c9daa4d09c8d43f8305",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2412.10701",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Top-k threshold estimation is the problem of estimating the score of the k-th highest ranking result of a search query. A good estimate can be used to speed up many common top-k query processing algorithms, and thus a number of researchers have recently studied the problem. Among the various approaches that have been proposed, quantile methods appear to give the best estimates overall at modest computational costs, followed by sampling-based methods in certain cases. In this paper, we make two main contributions. First, we study how to get even better estimates than the state of the art. Starting from quantile-based methods, we propose a series of enhancements that give improved estimates in terms of the commonly used mean under-prediction fraction (MUF). Second, we study the threshold estimation problem on recently proposed learned sparse index structures, showing that our methods also work well for these cases. Our best methods substantially narrow the gap between the state of the art and the ideal MUF of 1.0, at some additional cost in time and space.",
    "citationCount": 0,
    "referenceCount": 39
}