{
    "paperId": "ce5914510776f128229c804c7255548299c7afd0",
    "title": "RNA-seq and whole-genome re-sequencing reveal Micropterus salmoides growth-linked gene and selection signatures under carbohydrate-rich diet and varying temperature",
    "year": 2024,
    "venue": "Scientific Reports",
    "authors": [
        "Caixia Lei",
        "Hanru Song",
        "Hongmei Song",
        "Tao Zhu",
        "Jinxing Du",
        "Shengjie Li"
    ],
    "doi": "10.1038/s41598-024-76685-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ce5914510776f128229c804c7255548299c7afd0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-024-76685-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study was performed on Micropterus salmoides to determine growth-linked gene and single nucleotide polymorphism (SNP) markers under carbohydrate diet and varying temperature through RNA-seq and whole-genome re-sequencing. The results showed that growth-related genes were primarily enriched in the fat digestion and absorption signaling pathway, playing a role in lipid transport and metabolism. Fatty acid binding protein 6, bile salt-activated lipase-like, lysophosphatidylcholine acyltransferase 2, phospholipase A2, minor isoenzyme-like, and phospholipase A2, group IB (pancreas) were identified as the crucial genes. The differentially expressed genes between high and low temperatures were enriched in the pentose phosphate pathway, with carbohydrate transport and metabolism were most affected by temperature. Major facilitator superfamily domain containing 10, phosphogluconate dehydrogenase, fructose-1,6-bisphosphatase 1a, and spinster homolog 3 transcript variant X1(spns3) were the shared genes affected by temperature. From all the common genes, 10 growth-associated SNP markers were identified. The TT genotype at rs7781 was associated with lower body weight, while AA genotype at rs31434173 and CC genotype at rs31435313 showed positive correlation with body weight. Analogously, the GG genotype at rs31436887 and AA genotype at rs31438769 also found to characterize better growth performance. At low temperature, individuals with the AA genotype at rs11506587 and rs31435313 exhibited the slowest growth. For the genotypes labeled with rs11510589, the GG individual grew faster than the AA individual, whereas the opposite phenomenon occurred in these genotypes when labeled with rs11511314. The genotypes at rs32970704 and rs32967921 showed no growth correlation. The AA genotype at rs31435313 in spns3 had the slowest growth under a carbohydrate-rich diet regardless of the temperature. Our study presents candidate genes and SNP markers associated with growth influenced by carbohydrate and temperature, providing basis for the development of M. salmoides strain that better accepts carbohydrate diets at varying temperature. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-024-76685-3.",
    "citationCount": 2,
    "referenceCount": 53
}