{
    "paperId": "ceb1f349070ebb560974f238f33dc0e003fa11a0",
    "title": "Enhancing Neural Network Training Through Neuroevolutionary Models: A Hybrid Approach to Classification Optimization",
    "year": 2025,
    "venue": "Mathematics",
    "authors": [
        "Hyasseliny A. Hurtado-Mora",
        "Luis A. Herrera-Barajas",
        "Luis J. González-del-Ángel",
        "Roberto Pichardo-Ramírez",
        "Alejandro H. García-Ruiz",
        "Katea E. Lira-García"
    ],
    "doi": "10.3390/math13071114",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ceb1f349070ebb560974f238f33dc0e003fa11a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The optimization of Artificial Neural Networks (ANNs) remains a significant challenge in machine learning, particularly in overcoming local-optima limitations during training. Traditional classification algorithms, such as k-Nearest Neighbors (KNN), decision trees, Support Vector Machines (SVMs), and ANNs, often suffer from convergence to suboptimal solutions due to their training methods. This research proposes a hybrid neuroevolutionary approach that integrates a genetic algorithm with a NEAT-based structure to enhance ANN performance. Additionally, a Cellular Processing Algorithm (PCELL) is employed to expand the search space and improve solution quality. The methodology involves designing an initial neural network trained via backpropagation, followed by the application of genetic operators to evolve network structures. Experimental results from diverse benchmark datasets demonstrate that the proposed algorithm outperforms conventional ANN training methods and achieves performance levels comparable to evolutive solutions. The results suggest that integrating evolutionary strategies with cellular processing enhances classification accuracy and contributes to the advancement of neuroevolutionary learning techniques.",
    "citationCount": 0,
    "referenceCount": 21
}