{
    "paperId": "cec946dbfbd8a1b29e03f528c87823ee8abae1b8",
    "title": "Next-Generation Data Center Security Through IoT-Driven Surveillance",
    "year": 2025,
    "venue": "International Conference on Computing and Information",
    "authors": [
        "Ratchapol Chanklat",
        "M. Ketcham"
    ],
    "doi": "10.1109/ICCI64209.2025.10987372",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cec946dbfbd8a1b29e03f528c87823ee8abae1b8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study evaluates the performance of various machine learning models for anomaly detection, comparing their effectiveness in identifying anomalous (−1) and normal (1) cases. The models tested include Random Forest, Isolation Forest, Logistic Regression, Decision Tree, Lasso Regression, Gradient Boosting, Quadratic Discriminant Analysis (QDA), and Deep Learning. Among the models, Random Forest, Decision Tree, and Gradient Boosting exhibit superior performance, achieving 99% accuracy with high precision, recall, and F1-scores for both anomaly and normal cases. Gradient Boosting demonstrates the lowest validation loss (0.0203), indicating high reliability. Isolation Forest and Logistic Regression show moderate effectiveness, with Isolation Forest excelling in recall for anomalies but suffering from lower precision (0.61), while Logistic Regression achieves a balanced performance (94% accuracy). Quadratic Discriminant Analysis (QDA) struggles in detecting anomalies, achieving only 0.35 recall for the anomaly class, resulting in 93% accuracy. Lasso Regression and Deep Learning perform poorly in anomaly detection, with an F1-score of 0.00 for anomalies, indicating their inability to identify such cases. Deep Learning, in particular, has the lowest overall accuracy at 79% and a high validation loss (0.2983).The results suggest that Random Forest, Decision Tree, and Gradient Boosting are the most effective models for anomaly detection, while Lasso Regression and Deep Learning demonstrate significant limitations in detecting anomalies. The findings are illustrated in Figure 1, which compares the accuracy of all models, and Figure 2, which presents the validation loss (MSE) for each model, highlighting the strengths and weaknesses of different approaches.",
    "citationCount": 0,
    "referenceCount": 26
}