{
    "paperId": "ceeee4781bad14f8d323a0d6403e0567116bf39d",
    "title": "Continuously Bulk Loading over Range Partitioned Tables for Large Scale Historical Data",
    "year": 2021,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Xiaolong He",
        "Peng Cai",
        "Xuan Zhou",
        "Aoying Zhou"
    ],
    "doi": "10.1109/ICDE51399.2021.00088",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ceeee4781bad14f8d323a0d6403e0567116bf39d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To support efficiently and continuously loading large scale historical data into a distributed data management system (DDMS), it needs to balance the bulk workload across machines. The fundamental problem is to estimate the time used to merge currently loaded data (defined as incremental data) into previously loaded data (defined as baseline data) for each partition, referred to as partition merge. In this work, we present a learning-based framework, referred to as LeaBalancer, to balance the merge loads across cluster nodes. In the situation where the system is scheduled to have regular bulk loading tasks, LeaBalancer can learn to predict the partition merge time from the merge logs generated by previous bulk loadings. Nevertheless, it is still difficult to balance the bulk workload only using a single plan phase because of inaccurate merge time prediction or other in-progress heavy workloads during the bulk loading. To resolve this problem, we design a multi-round balancing strategy, and at the beginning of each round LeaBalancer carefully chooses partitions for migration according to the remaining merge loads in each node. Experimental results show that LeaBalancer can adaptively perform load balance under various settings.",
    "citationCount": 2,
    "referenceCount": 34
}