{
    "paperId": "cef4f95dc292c30a0cb5234f6ede7e849b87499c",
    "title": "Feasibility-based fixed point networks",
    "year": 2021,
    "venue": "Fixed Point Theory and Algorithms for Sciences and Engineering",
    "authors": [
        "Howard Heaton",
        "S. Wu Fung",
        "A. Gibali",
        "W. Yin"
    ],
    "doi": "10.1186/s13663-021-00706-3",
    "arxivId": "2104.14090",
    "url": "https://www.semanticscholar.org/paper/cef4f95dc292c30a0cb5234f6ede7e849b87499c",
    "isOpenAccess": true,
    "openAccessPdf": "https://fixedpointtheoryandapplications.springeropen.com/track/pdf/10.1186/s13663-021-00706-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Inverse problems consist of recovering a signal from a collection of noisy measurements. These problems can often be cast as feasibility problems; however, additional regularization is typically necessary to ensure accurate and stable recovery with respect to data perturbations. Hand-chosen analytic regularization can yield desirable theoretical guarantees, but such approaches have limited effectiveness recovering signals due to their inability to leverage large amounts of available data. To this end, this work fuses data-driven regularization and convex feasibility in a theoretically sound manner. This is accomplished using feasibility-based fixed point networks (F-FPNs). Each F-FPN defines a collection of nonexpansive operators, each of which is the composition of a projection-based operator and a data-driven regularization operator. Fixed point iteration is used to compute fixed points of these operators, and weights of the operators are tuned so that the fixed points closely represent available data. Numerical examples demonstrate performance increases by F-FPNs when compared to standard TV-based recovery methods for CT reconstruction and a comparable neural network based on algorithm unrolling. Codes are available on Github: github.com/howardheaton/feasibility_fixed_point_networks.",
    "citationCount": 31,
    "referenceCount": 119
}