{
    "paperId": "cf0b1e762d8d88086799849a15c5c06ba76e95d9",
    "title": "A hybrid algorithm for clinical decision support in precision medicine based on machine learning",
    "year": 2023,
    "venue": "BMC Bioinformatics",
    "authors": [
        "Zicheng Zhang",
        "Xinyue Lin",
        "Shanshan Wu"
    ],
    "doi": "10.1186/s12859-022-05116-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cf0b1e762d8d88086799849a15c5c06ba76e95d9",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcbioinformatics.biomedcentral.com/counter/pdf/10.1186/s12859-022-05116-9",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Purpose The objective of the manuscript is to propose a hybrid algorithm combining the improved BM25 algorithm, k-means clustering, and BioBert model to better determine biomedical articles utilizing the PubMed database so, the number of retrieved biomedical articles whose content contains much similar information regarding a query of a specific disease could grow larger. Design/methodology/approach In the paper, a two-stage information retrieval method is proposed to conduct an improved Text-Rank algorithm. The first stage consists of employing the improved BM25 algorithm to assign scores to biomedical articles in the database and identify the 1000 publications with the highest scores. The second stage is composed of employing a method called a cluster-based abstract extraction to reduce the number of article abstracts to match the input constraints of the BioBert model, and then the BioBert-based document similarity matching method is utilized to obtain the most similar search outcomes between the document and the retrieved morphemes. To realize reproducibility, the written code is made available on https://github.com/zzc1991/TREC_Precision_Medicine_Track . Findings The experimental study is conducted based on the data sets of TREC2017 and TREC2018 to train the proposed model and the data of TREC2019 is used as a validation set confirming the effectiveness and practicability of the proposed algorithm that would be implemented for clinical decision support in precision medicine with a generalizability feature. Originality/value This research integrates multiple machine learning and text processing methods to devise a hybrid method applicable to domains of specific medical literature retrieval. The proposed algorithm provides a 3% increase of P@10 than that of the state-of-the-art algorithm in TREC 2019.",
    "citationCount": 6,
    "referenceCount": 57
}