{
    "paperId": "cf93aad25b5d81d1dac1e5f457ed70f40a79c317",
    "title": "FNotify: A Low-Latency and Scalable Publish/Subscribe System using RDMA",
    "year": 2022,
    "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)",
    "authors": [
        "Yusen Xu",
        "Sijie Shen",
        "Mingcong Han",
        "Rong Chen"
    ],
    "doi": "10.1109/HPCC-DSS-SmartCity-DependSys57074.2022.00074",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cf93aad25b5d81d1dac1e5f457ed70f40a79c317",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Publish/subscribe systems are widely used as messaging middleware in various scenarios, such as online business, financial trading, and social media. However, the network overhead intro-duced by the pub/sub system can severely impact application performance. Especially in the latency-sensitive applications of the data center, optimizing the latency of publishing or delivering messages of the pub/sub system is particularly important. RDMA network has gained popularity in relevant applications due to its low latency, high bandwidth and ability to bypass the CPU. Never-theless, it is still challenging to design and optimize the pub/sub system using RDMA. Through an in-depth analysis of RDMA features, we design and implement FNotify, a high-performance RDMA-accelerated pub/sub system. FNotify optimizes latency and CPU load using in-memory message management and one-sided RDMA primitives for message collection. FNotify also proposes a topic-based partitioning scheme to achieve good scal-ability. We conducted a comprehensive evaluation and analysis on an 8-node RDMA cluster to verify the validity of our design by comparing the performance of FNotify with Apache Kafka (a state-of-the-art pub/sub system) in a typical pub/sub application scenario and various micro-benchmarks. Experimental results show that FNotify improves overall performance by $1.5\\times$ to $3.9\\times$ and reduces end-to-end latency by more than $20\\times$ compared to Apache Kafka.",
    "citationCount": 1,
    "referenceCount": 40
}