{
    "paperId": "cfae00c5149d1340300b20c679686a9f623ffd0e",
    "title": "Mitigating Data Hotspots in Distributed Cloud Storage Architecture",
    "year": 2024,
    "venue": "2024 5th International Conference on Computer, Big Data and Artificial Intelligence (ICCBD+AI)",
    "authors": [
        "Junjie Li",
        "Haodong Zou",
        "Wangdong Wu",
        "Lei Wang",
        "Lichen Wang",
        "Wenpan Liu",
        "Mei Yan"
    ],
    "doi": "10.1109/ICCBD-AI65562.2024.00095",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cfae00c5149d1340300b20c679686a9f623ffd0e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cloud storage is a vital component of cloud architecture, often utilizing distributed key-value stores like Amazon S3 and Google Cloud Storage for managing da-ta and metadata. These systems distribute data across nodes using key range or consistent hashing, but they face challenges such as load imbalance and limited parallelism due to uneven data distribution and varying node performance. Cur-rent implementations, such as MongoDB, address these imbalances by migrating data between nodes but often neglect the characteristics of the underlying data structures, leading to increased overhead from costly delete and insert operations. To address these issues, this design leverages the properties of the LSM tree, a commonly used storage engine, to optimize data migration. The approach intro-duces hot zone prediction using nonlinear regression to accurately identify data hotspots based on key characteristics, insertion time, and TTL. A storage engine-aware migration system is developed to migrate grouped SSTable files rather than individual key-value pairs, significantly reducing migration overhead. Additionally, the data migration I/O process is offloaded using the NVMe-oF protocol, minimizing CPU involvement and preserving node performance. Implemented on mongo-rocks, this solution improves load balancing by directly moving SSTable files across nodes, enhancing efficiency and reducing performance degradation in distributed key-value stores.",
    "citationCount": 0,
    "referenceCount": 13
}