{
    "paperId": "cfc2bb8c00b1e5a55f5fe093ad839b6ac3515574",
    "title": "A Probabilistic Method to Find and Visualize Distinct Regions in Protein Sequences",
    "year": 2019,
    "venue": "European Signal Processing Conference",
    "authors": [
        "M. Hosseini",
        "Diogo Pratas",
        "A. Pinho"
    ],
    "doi": "10.23919/EUSIPCO.2019.8902695",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cfc2bb8c00b1e5a55f5fe093ad839b6ac3515574",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Studies on identification of species-specific protein regions, i.e., unique or highly dissimilar regions with respect to close species, will lead us to understanding of evolutionary traits, which can be related to novel functionalities or diseases. In this paper, we propose an alignment-free method to find and visualize distinct regions between two collections of proteins. We applied the proposed method, FRUIT, on multiple synthetic and real datasets to analyze its behavior when different rates of substitutional mutation occur. Testing with different k-mer sizes showed that the higher the mutation rate, the higher the relative uniqueness. We also employed FRUIT to find and visualize distinct regions in modern human proteins relatively to the proteins of Altai, Sidron and Vindija Neanderthals. The results show that four of the most distinct proteins, named ataxin -8, 60S ribosomal protein L26, NADH-ubiquinone oxidoreductase chain 3 and cytochrome c oxidase subunit 2 are involved in SCA8, DBAII, LS and MT-CID, and MT-C4D diseases, respectively. There is also Interferon-induced transmembrane protein 3, among others, which is part of the immune system. Besides, we report the most similar primate exomes to the found modern human one, in terms of identity, query cover and length of sequences. The reported results can give us insight to the evolution of proteomes.",
    "citationCount": 0,
    "referenceCount": 31
}