{
    "paperId": "cfd2e804eb01c433d427c373d967ce255bca3430",
    "title": "Whole‐exome sequencing in families from Lifou Island (New Caledonia) reveals candidate variants involved in gout pathogenesis",
    "year": 2025,
    "venue": "Rheumatology &amp; Autoimmunity",
    "authors": [
        "Philippe Georgel",
        "Y. Ducrot",
        "Anne Molitor",
        "Nicodème Paul",
        "Lydie Naegely",
        "A. Hanauer",
        "T. Bardin",
        "Gaston Rijo de Leon",
        "Etienne Patin",
        "Luis Quintana‐Murci",
        "Mariko Matsui",
        "Marc Jouan",
        "S. Bahram",
        "R. Carapito"
    ],
    "doi": "10.1002/rai2.70002",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/cfd2e804eb01c433d427c373d967ce255bca3430",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1002/rai2.70002",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Gout, which manifests as severe inflammation caused by excessive serum urate levels and monosodium urate deposits in the joints, is associated with multiple genomic loci in Europeans. In this exploratory work, we aimed to identify additional gene variants in Melanesian families from New Caledonia, a population in which the disease is highly prevalent.Two families from Lifou Island (New Caledonia) in which multiple members were diagnosed with gout were selected. Whole exome sequencing and/or targeted sequencing of a panel of genes involved in immunity was performed in patients and their healthy relatives. Rare variants in Melanesian populations were selected using an autosomal dominant segregation model.Several variants were identified in genes not previously involved in immune diseases or hyperuricemia, several of which were not observed in control individuals from Remote Oceania.This work highlights new candidate susceptibility loci for gout in New Caledonians, an underrepresented population in genomic studies, and suggests that novel pathways are likely involved in gout pathogenesis.",
    "citationCount": 0,
    "referenceCount": 25
}