{
    "paperId": "d0200f73cf6ea285d95c4aac5c08aa2eda01a2d3",
    "title": "Spinner: Enabling In-network Flow Clustering Entirely in a Programmable Data Plane",
    "year": 2024,
    "venue": "IEEE/IFIP Network Operations and Management Symposium",
    "authors": [
        "Luigi Cannarozzo",
        "Thiago Bortoluzzi Morais",
        "Paulo Silas Severo de Souza",
        "L. Gobatto",
        "I. Lamb",
        "P. Duarte",
        "J. Azambuja",
        "A. Lorenzon",
        "F. Rossi",
        "Weverton Cordeiro",
        "M. Luizelli"
    ],
    "doi": "10.1109/NOMS59830.2024.10575413",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d0200f73cf6ea285d95c4aac5c08aa2eda01a2d3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data plane programmability is redesigning the way we manage and operate forwarding devices. However, most of the algorithmic decisions performed by data planes are still deterministic and control-plane dependent. We argue that it is possible to break this dependency and make the data plane intelligent, so that it can learn the infrastructure state autonomously. Despite existing efforts to make data planes intelligent, little has been done to design unsupervised ML algorithms that fit the architectural constraints of programmable devices. Executing such approaches in the data plane has the potential to reduce the overall decision-making time, thus meeting packet processing deadlines (which are in the order of nanoseconds). In this paper, we propose Spinner, the first effort to deliver an unsupervised Machine Learning (ML) approach entirely in programmable devices. Spinner is a flow clustering algorithm designed to fit existing architectural constraints of SmartNICs, and that can reach line rate for most packet sizes with complexity O(k). To demonstrate the potential behind in-network clustering, we prototype and deploy Spinner in a programmable testbed and use it to enhance Explicit Congestion Notifications (ECN) at the server side. Spinner-enhanced TCP provides up to 2x higher throughput when comparing to de-facto TCP implementations.",
    "citationCount": 2,
    "referenceCount": 25
}