{
    "paperId": "d02a51e049f92d4cf20a9bc968c48d9d225a1356",
    "title": "LieCMS: A Flow Size Measurement Framework Based on Lie Group Means Learning",
    "year": 2025,
    "venue": "2025 International Conference on Sensor-Cloud and Edge Computing System (SCECS)",
    "authors": [
        "Pengcheng Zhang",
        "Jun Lu",
        "Zhenwei Li",
        "Wei Wang",
        "Jingzi Zhao",
        "Yizhao Luo"
    ],
    "doi": "10.1109/SCECS65243.2025.11065758",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d02a51e049f92d4cf20a9bc968c48d9d225a1356",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Network traffic measurement is a critical function for network management and optimization, providing essential insights for load balancing, congestion control, routing, and Quality of Service. However, due to network devices’ limited memory resources, existing measurement methods typically adopt a counter-sharing strategy, where all flows are mixed and measured together. Such a strategy leads to hash collisions and introduces significant noise that severely impacts accuracy. To address this issue, We propose LieCMS, a flow size measurement framework based on Lie group mean learning, which improves measurement accuracy by identifying and correcting flows susceptible to noise. LieCMS consists of on-chip recording and offchip learning. The on-chip component uses Count-Min Sketch (CMS) for flow storage while incorporating a random sampling module to generate training data. The off-chip part applies Lie Group Linear Discriminant Analysis (Lie-LDA) to extract key flow features and identify flows with large measurement errors. It then employs a regression model to establish a mapping between counter values and actual flow sizes, refining the measurement results. Experiments on real-world traffic datasets demonstrate that LieCMS reduces the average relative error by 65.63% compared to Count-Min Sketch while using only 30KB of onchip memory, significantly enhancing measurement accuracy.",
    "citationCount": 0,
    "referenceCount": 25
}