{
    "paperId": "d03492bdb6e28e3e79a873a36f95174f39b137d6",
    "title": "Artificial intelligence approaches and mechanisms for big data analytics: a systematic study",
    "year": 2021,
    "venue": "PeerJ Computer Science",
    "authors": [
        "A. Rahmani",
        "E. Azhir",
        "Saqib Ali",
        "M. Mohammadi",
        "Omed Hassan Ahmed",
        "Marwan Yassin Ghafour",
        "S. H. Ahmed",
        "M. Hosseinzadeh"
    ],
    "doi": "10.7717/peerj-cs.488",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d03492bdb6e28e3e79a873a36f95174f39b137d6",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7717/peerj-cs.488",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advances in sensor networks and the Internet of Things (IoT) technologies have led to the gathering of an enormous scale of data. The exploration of such huge quantities of data needs more efficient methods with high analysis accuracy. Artificial Intelligence (AI) techniques such as machine learning and evolutionary algorithms able to provide more precise, faster, and scalable outcomes in big data analytics. Despite this interest, as far as we are aware there is not any complete survey of various artificial intelligence techniques for big data analytics. The present survey aims to study the research done on big data analytics using artificial intelligence techniques. The authors select related research papers using the Systematic Literature Review (SLR) method. Four groups are considered to investigate these mechanisms which are machine learning, knowledge-based and reasoning methods, decision-making algorithms, and search methods and optimization theory. A number of articles are investigated within each category. Furthermore, this survey denotes the strengths and weaknesses of the selected AI-driven big data analytics techniques and discusses the related parameters, comparing them in terms of scalability, efficiency, precision, and privacy. Furthermore, a number of important areas are provided to enhance the big data analytics mechanisms in the future.",
    "citationCount": 104,
    "referenceCount": 68
}