{
    "paperId": "d04c52ad353fb8c24173bb98b158e06a94897a77",
    "title": "Scrapetalk: Chatbot Conversation with Web Scraped Insights",
    "year": 2024,
    "venue": "2024 International Conference on Integration of Emerging Technologies for the Digital World (ICIETDW)",
    "authors": [
        "Sriram G",
        "Rahul S",
        "Adaline Suji R",
        "Priyanka Nallusamy",
        "Nivitha K",
        "Arumuga Arun R"
    ],
    "doi": "10.1109/ICIETDW61607.2024.10940054",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d04c52ad353fb8c24173bb98b158e06a94897a77",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ScrapeTalk represents a paradigm shift in the realm of conversational AI, offering users an innovative platform for accessing information with unprecedented efficiency and accuracy. This paper explores the development and implementation of ScrapeTalk, an AI-powered chatbot that integrates web-scraped insights to revolutionize conversational experiences. Leveraging advanced technologies including LangChain, OpenAI, Streamlit UI, BeautifulSoup4, WebBaseLoader, and ChromaDB, ScrapeTalk delivers unparalleled convenience in information retrieval across a vast spectrum of topics. By employing sophisticated web scraping techniques, ScrapeTalk enables users to save up to 50% of their time compared to traditional manual web searches, accessing data from over 1 billion websites. The integration of the RAG Model Methodology and LangChain ensures seamless natural language processing, facilitating coherent and contextually relevant interactions. Additionally, the incorporation of the OpenAI API enhances ScrapeTalk’s ability to generate intelligent responses based on retrieved insights. ChromaDB efficiently handles data transformation and storage, optimizing resource management for swift access to information. Through continuous evolution and integration of new advancements, ScrapeTalk exemplifies the potential of conversational AI to simplify information access and enhance user experiences in the digital age",
    "citationCount": 0,
    "referenceCount": 16
}