{
    "paperId": "d063ab0614c2f78a8924725402059ed04ae633c4",
    "title": "Aggregate Processes as Distributed Adaptive Services for the Industrial Internet of Things",
    "year": 2022,
    "venue": "Pervasive and Mobile Computing",
    "authors": [
        "Lorenzo Testa",
        "Giorgio Audrito",
        "Ferruccio Damiani",
        "G. Torta"
    ],
    "doi": "10.48550/arXiv.2204.00467",
    "arxivId": "2204.00467",
    "url": "https://www.semanticscholar.org/paper/d063ab0614c2f78a8924725402059ed04ae633c4",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2204.00467",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Industrial Internet of Things (IIoT) promises to bring many benefits, including increased productivity, reduced costs, and increased safety to new generation manufacturing plants. The main ingredients of IIoT are the connected, communicating devices directly located in the workshop floor (far edge devices), as well as edge gateways that connect such devices to the Internet and, in particular, to cloud servers. The field of Edge Computing advocates that keeping computations as close as possible to the sources of data can be an effective means of reducing latency, preserving privacy, and improve the overall efficiency of the system, although building systems where (far) edge and cloud nodes cooperate is quite challenging. In the present work we propose the adoption of the Aggregate Programming (AP) paradigm (and, in particular, the\"aggregate process\"construct) as a way to simplify building distributed, intelligent services at the far edge of an IIoT architecture. We demonstrate the feasibility and efficacy of the approach with simulated experiments on FCPP (a C++ library for AP), and with some basic experiments on physical IIoT boards running an ad-hoc porting of FCPP.",
    "citationCount": 14,
    "referenceCount": 69
}