{
    "paperId": "d06a04b1ea860db6080a65057bf09592724adbef",
    "title": "A High-performance Hardware Accelerator for Genome Alignment",
    "year": 2024,
    "venue": "International Symposium on Image and Signal Processing and Analysis",
    "authors": [
        "Haoyu Liao",
        "Yuan Li",
        "Qiang Wang",
        "M. Lai",
        "Hui Su",
        "Ziwen Li",
        "Xingyun Qi"
    ],
    "doi": "10.1109/ISPA63168.2024.00184",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d06a04b1ea860db6080a65057bf09592724adbef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Genome alignment is a vital process in genome sequencing and bio-informatics research. It entails aligning short DNA sequence fragments (usually tens to hundreds of base pairs) with a reference genome sequence, uncovering crucial biological information and variations. However, due to the high computational complexity of current sequence matching algorithms and the rapid growth of genetic data, there exists a computational bottleneck in sequence alignment workflows. Therefore, scholars have turned to using hardware to accelerate this computation, with a focus on high-performance computing. While existing acceleration solutions have mostly concentrated on the classical algorithm, showing significant improvements, there has been limited work on accelerating alignment algorithms in popular bio-informatics software tools (enhanced version). In this paper, we proposed a hardware accelerator for the alignment tasks in the popular sequence alignment tool minimap2 using the KSW2 algorithm. Our approach utilizes an anti-diagonal processing element(PE) array for parallel computation, implements the BAND technology in hardware, and enables support for longer input sequences without sacrificing accuracy. Additionally, we integrated the traceback stage of the KSW2 algorithm in hardware, reducing communication data overhead. We attained a 15.32x acceleration compared to software optimized with Streaming SIMD Extensions (SSE) instruction sets and hyper-threading technology. Additionally, our design shows a 3.42x speedup compared to other high-performance hardware.",
    "citationCount": 1,
    "referenceCount": 25
}