{
    "paperId": "d06ed20758ffeeec5eaeaddb0898067ae4fbbd70",
    "title": "Current trends, limitations and future research in the fungi?",
    "year": 2024,
    "venue": "Fungal diversity",
    "authors": [
        "Kevin D Hyde",
        "P. Baldrian",
        "Yanpeng Chen",
        "K. W. Thilini Chethana",
        "Sybren de Hoog",
        "M. Doilom",
        "A. R. G. de Farias",
        "Micael F. M. Gonçalves",
        "D. Gonkhom",
        "Heng Gui",
        "S. Hilário",
        "Yuwei Hu",
        "R. Jayawardena",
        "Sabin Khyaju",
        "Paul M. Kirk",
        "P. Kohout",
        "T. Luangharn",
        "S. Maharachchikumbura",
        "I. Manawasinghe",
        "P. Mortimer",
        "A. G. Niego",
        "Monthien Phonemany",
        "Birthe Sandargo",
        "I. Senanayake",
        "Marc Stadler",
        "F. Surup",
        "Naritsada Thongklang",
        "D. Wanasinghe",
        "A. Bahkali",
        "Arttapon Walker"
    ],
    "doi": "10.1007/s13225-023-00532-5",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d06ed20758ffeeec5eaeaddb0898067ae4fbbd70",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s13225-023-00532-5.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The field of mycology has grown from an underappreciated subset of botany, to a valuable, modern scientific discipline. As this field of study has grown, there have been significant contributions to science, technology, and industry, highlighting the value of fungi in the modern era. This paper looks at the current research, along with the existing limitations, and suggests future areas where scientists can focus their efforts, in the field mycology. We show how fungi have become important emerging diseases in medical mycology. We discuss current trends and the potential of fungi in drug and novel compound discovery. We explore the current trends in phylogenomics, its potential, and outcomes and address the question of how phylogenomics can be applied in fungal ecology. In addition, the trends in functional genomics studies of fungi are discussed with their importance in unravelling the intricate mechanisms underlying fungal behaviour, interactions, and adaptations, paving the way for a comprehensive understanding of fungal biology. We look at the current research in building materials, how they can be used as carbon sinks, and how fungi can be used in biocircular economies. The numbers of fungi have always been of great interest and have often been written about and estimates have varied greatly. Thus, we discuss current trends and future research needs in order to obtain more reliable estimates. We address the aspects of machine learning (AI) and how it can be used in mycological research. Plant pathogens are affecting food production systems on a global scale, and as such, we look at the current trends and future research needed in this area, particularly in disease detection. We look at the latest data from High Throughput Sequencing studies and question if we are still gaining new knowledge at the same rate as before. A review of current trends in nanotechnology is provided and its future potential is addressed. The importance of Arbuscular Mycorrhizal Fungi is addressed and future trends are acknowledged. Fungal databases are becoming more and more important, and we therefore provide a review of the current major databases. Edible and medicinal fungi have a huge potential as food and medicines, especially in Asia and their prospects are discussed. Lifestyle changes in fungi (e.g., from endophytes, to pathogens, and/or saprobes) are also extremely important and a current research trend and are therefore addressed in this special issue of Fungal Diversity.",
    "citationCount": 52,
    "referenceCount": 609
}