{
    "paperId": "d0b4b891882d90ed363bf277276d7081c26ceb63",
    "title": "ForeSight: A Predictive-Scheduling Deterministic Database",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Junfang Huang",
        "Yu Yan",
        "Hongzhi Wang",
        "Yingze Li",
        "Jinghan Lin"
    ],
    "doi": "10.48550/arXiv.2508.17375",
    "arxivId": "2508.17375",
    "url": "https://www.semanticscholar.org/paper/d0b4b891882d90ed363bf277276d7081c26ceb63",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deterministic databases enable scalable replicated systems by executing transactions in a predetermined order. However, existing designs fail to capture transaction dependencies, leading to insufficient scheduling, high abort rates, and poor resource utilization. By addressing these challenges with lightweight conflict prediction and informed scheduling, we present ForeSight, a high-performance deterministic database system. Our system has three core improvements: (1) We design an Association Sum-Product Network to predict potential transaction conflicts, providing the input for dependency analysis without pre-obtained read/write sets. (2) We enhance the storage engine to integrate multi-version-based optimization, improving the execution process and fallback strategy to boost commit rates and concurrency. (3) We propose a matrix two-pass forward scan algorithm that performs dependency analysis to generate conflict-aware schedules, significantly reducing scheduling overhead. Experimental results on multiple benchmarks show that ForeSight achieves up to 2 times higher throughput on skewed workloads and maintains strong performance under contention, demonstrating that predictive scheduling substantially improves deterministic database scalability.",
    "citationCount": 0,
    "referenceCount": 52
}