{
    "paperId": "d0d0568c6babb4728682084e1c319dcf84d93951",
    "title": "CHaNAS: coordinated search for network architecture and scheduling policy",
    "year": 2021,
    "venue": "ACM SIGPLAN Conference on Languages, Compilers, and Tools for Embedded Systems",
    "authors": [
        "Weiwei Chen",
        "Ying Wang",
        "Gangliang Lin",
        "Chengsi Gao",
        "Cheng Liu",
        "Lei Zhang"
    ],
    "doi": "10.1145/3461648.3463846",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d0d0568c6babb4728682084e1c319dcf84d93951",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3461648.3463846",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automatically design an efficient DNN solution for a given deep learning task on the target hardware mainly decided by the neural network architecture and the schedule mapping strategy, where the two goals are closely coupled with each other to fully exploit the advantages of the underlying hardware. Prior hardware-aware Neural Architecture Search (NAS) methods mostly ignore the impacts of different scheduling policies (e.g., graph-level optimization, loop transformations, parallelization, etc.) on network candidates being evaluated in the search process. Thus, they may miss the true-optimal architecture that can only be discovered by trying-out different scheduling policies. This work proposes a NAS framework (CHaNAS) that searches for not only the network architecture but also the dedicated scheduling policy, as the optimal co-design solution on target hardware that fully exploits the advantages of the underlying hardware. We propose to use a block-based pre-scheduling methodology to reduce the co-design search space, and enable the automatic generation of the optimal co-design, including the network architecture and the tensor programs that practice the scheduling policy. We evaluate CHaNAS on Imagenet on different hardware back-ends against the state-of-the-art hardware-aware search method MobileNet-v3. Experimental results show that the co-design solutions obtained by ChaNAS show up to 1.6x, 1.9x, and 1.7x performance boost on NVIDIA P100 GPU, Intel Xeon 8163 CPU, and Samsung Note 10 Mobile, respectively, over the baselines of the same-level accuracy.",
    "citationCount": 1,
    "referenceCount": 46
}