{
    "paperId": "d0e1cc2aaf8a50471385346916c79fad4752379a",
    "title": "Exploring Dynamic Rule Caching Under Dependency Constraints for Programmable Switches: Theory, Algorithm, and Implementation",
    "year": 2024,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Xinhao Deng",
        "Mingwei Xu",
        "Qi Li",
        "Weijie Wu",
        "Yuan Yang",
        "Menghao Zhang",
        "Yu Zhou",
        "Jianping Wu"
    ],
    "doi": "10.1109/TNSM.2024.3422092",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d0e1cc2aaf8a50471385346916c79fad4752379a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ternary Content Addressable Memory (TCAM) enables fast lookup and is widely used by routers and switches to support policy-based forwarding. Due to high cost and small capacity, only a small subset of important rules can be cached in TCAM, so determining it is critical to increasing the hit ratio. This is more challenging than traditional caching problems because of complicated rule dependency relationships. Existing works are based on heuristics and they don’t work well under all practical scenarios. Worse still, the lack of fundamental understanding of the design space, complexity, and optimality makes all explorations in mystery. In this paper, we use a modeling-based method to formulate the problem, prove its complexity, and propose DROPS, a dynamic rule caching framework with a much higher hit ratio. In particular, we deduce the rule selection problem into a multi-dimensional rule space transformation problem. Thus, we are no longer limited by using the intrinsic rules; rather, we can transform original rules into “new rules” equivalently without rule dependency. We design non-trivial rule placement and update algorithms and implement them in programmable switches. In the experimental evaluation, we show that our method outperforms all existing methods.",
    "citationCount": 1,
    "referenceCount": 52
}