{
    "paperId": "d10e6b3a87f94dccb0cc213b856c66bc492d90ba",
    "title": "NALSpatial: A Natural Language Interface for Spatial Databases",
    "year": 2025,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Mengyi Liu",
        "Xieyang Wang",
        "Jianqiu Xu",
        "Hua Lu",
        "Yongxin Tong"
    ],
    "doi": "10.1109/TKDE.2025.3525587",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d10e6b3a87f94dccb0cc213b856c66bc492d90ba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spatial databases play a vital role in a number of applications ranging from geographic information systems to location-based services. Application tasks typically access underlying spatial data to answer queries. However, non-experts lack the expertise necessary for formulating spatial queries. To fill in this gap, we propose an effective framework that translates <bold><underline>na</underline></bold>tural <underline>l</underline>anguage queries over <underline>spatial</underline> data into executable database queries, called NALSpatial. The framework consists of two core phases: (i) <italic>natural language understanding</italic> and (ii) <italic>natural language translation</italic>. Phase (i) extracts key entity information, comprehends the query intent and determines the query type by employing natural language processing techniques and deep learning algorithms. The key entities and query type are passed to phase (ii), which makes use of entity mapping rules and structured language models to construct executable database queries. NALSpatial supports dealing with five types of queries including (i) <italic>basic queries (e.g. distance and area)</italic>, (ii) <italic>range queries</italic>, (iii) <italic>nearest neighbor queries</italic>, (iv) <italic>spatial join queries</italic> and (v) <italic>aggregation queries</italic>. We develop NALSpatial in an open-source extensible database system SECONDO. Extensive experiments show that NALSpatial on average achieves response time of about 2.5 seconds, translatability of 95% and translation precision of 92%, outperforming three state-of-the-art methods.",
    "citationCount": 3,
    "referenceCount": 55
}