{
    "paperId": "d128f0412a0eb09fe37f991832b7da4a506f613b",
    "title": "Prediction models reloaded: Advanced insights for SMEs in the Bucharest Nine countries",
    "year": 2025,
    "venue": "Oeconomia Copernicana",
    "authors": [
        "Pavol Durana",
        "Miloš Poliak",
        "Erika Kovalova",
        "Roman Blažek"
    ],
    "doi": "10.24136/oc.3764",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d128f0412a0eb09fe37f991832b7da4a506f613b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Research background: Financial health is an essential factor in the success of an enterprise, its survival, competitiveness in the market and sustainable development. Therefore, predicting constraints, weak points and possible risks that could cause financial distress is crucial. Small and medium-sized enterprises (SMEs) remain a key pillar of any prosperous economy during every phase of the economic cycle, particularly in emerging countries, such as the Bucharest Nine.\nPurpose of this article: The objective is to specify indicators of the financial health of SMEs depending on the economic cycle through unconventional incentives under the conditions of the Bucharest Nine. It entails a longitudinal mapping of more than 30,000 enterprises during the pre-crisis, crisis and post-crisis periods, as along with data on economic growth.\nMethods: Financial statements from the Orbis database, covering the period 2018–2023, were used to create a robust final sample of SMEs. Logit least absolute shrinkage and selection operator with 10-fold cross-validation was employed to identify bankruptcy predictors from 75 origin predictors, including liquidity, activity, profitability, indebtedness, earnings management and business development. The resulting models for each period were validated on a test sample of prosperous and non-prosperous enterprises. Furthermore, the classification ability of all models was evaluated using the area under the receiver operating characteristic curve.\nFindings & value added: This research adds value by demonstrating important factors that influence the bankruptcy of SMEs and guiding financial managers to focus on these factors based on the expected economic cycle. Thus, developed prediction models are particularly beneficial for businesses themselves, enabling them to predict financial health depending on the expected state of the economy, which helps overcome the existing animosities of businesses towards predictions. The results of the present study may also prove valuable to agencies dealing with SMEs, financial database providers or auditing companies. The present study enhances the idea of financial distress prediction by including unconventional financial indicators, including earnings management and value-added variables, in traditional bankruptcy modelling frameworks. This innovative combination enhances the theoretical framework of financial economics by providing a more dynamic and context-aware method for assessing SME sustainability over the economic cycle.",
    "citationCount": 0,
    "referenceCount": 133
}