{
    "paperId": "d17028810dc43051f7e0108e97583af874a57c7c",
    "title": "Filter-Centric Vector Indexing: Geometric Transformation for Efficient Filtered Vector Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Alireza Heidari",
        "Wei Zhang"
    ],
    "doi": "10.1145/3735403.3735996",
    "arxivId": "2506.15987",
    "url": "https://www.semanticscholar.org/paper/d17028810dc43051f7e0108e97583af874a57c7c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The explosive growth of vector search applications demands efficient handling of combined vector similarity and attribute filtering; a challenge where current approaches force an unsatisfying choice between performance and accuracy. We introduce Filter-Centric Vector Indexing (FCVI), a novel framework that transforms this fundamental trade-off by directly encoding filter conditions into the vector space through a mathematically principled transformation $\\psi(v, f, \\alpha)$. Unlike specialized solutions, FCVI works with any existing vector index (HNSW, FAISS, ANNOY) while providing theoretical guarantees on accuracy. Our comprehensive evaluation demonstrates that FCVI achieves 2.6-3.0 times higher throughput than state-of-the-art methods while maintaining comparable recall. More remarkably, FCVI exhibits exceptional stability under distribution shifts; maintaining consistent performance when filter patterns or vector distributions change, unlike traditional approaches that degrade significantly. This combination of performance, compatibility, and resilience positions FCVI as an immediately applicable solution for production vector search systems requiring flexible filtering capabilities.",
    "citationCount": 1,
    "referenceCount": 28
}