{
    "paperId": "d17eb8f1a81a27da3ad96bbb7a3b028bb8fbc721",
    "title": "Breaking the barrier of human-annotated training data for machine learning-aided plant research using aerial imagery",
    "year": 2025,
    "venue": "bioRxiv",
    "authors": [
        "Sebastian Varela",
        "Xu-ying Zheng",
        "Joyce Njuguna",
        "Erik Sacks",
        "Dylan P. Allen",
        "Jeremy Ruhter",
        "A. D. Leakey"
    ],
    "doi": "10.1093/plphys/kiaf132",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d17eb8f1a81a27da3ad96bbb7a3b028bb8fbc721",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning (ML) can accelerate biological research. However, the adoption of such tools to facilitate phenotyping based on sensor data has been limited by: (1) the need for a large amount of human-annotated training data for each context in which the tool is used; and (2) phenotypes varying across contexts defined in terms of genetics and environment. This is a major bottleneck because acquiring training data is generally costly and time-consuming. This study demonstrates how a ML approach can address these challenges by minimizing the amount of human supervision needed for tool building. A case study comparing ML approaches that examine images collected by an uncrewed aerial vehicle was performed to determine the presence of panicles (i.e., “heading”) across thousands of field plots containing genetically diverse breeding populations of two Miscanthus species. Automated analysis of aerial imagery enabled the identification of heading approximately nine times faster than in-field visual inspection by humans. Leveraging an Efficiently Supervised Generative and Adversarial Network (ESGAN) learning strategy reduced the requirement for human-annotated data by one to two orders of magnitude compared to traditional, fully supervised learning approaches. The ESGAN model learned the salient features of the dataset by using thousands of unlabeled images to inform the discriminative ability of a classifier so that it required minimal human-labeled training data. This method can accelerate the phenotyping of heading date as a measure of flowering time in Miscanthus across diverse contexts (e.g., in multi-state trials) and opens avenues to promote the broad adoption of ML tools. One-sentence summary Machine learning approach accelerates plant phenotyping by reducing the need for large amounts of human-annotated data, enabling faster and more efficient detection of a plant trait using aerial imagery The author responsible for distribution of materials integral to the findings presented in this article in accordance with the policy described in the Instructions for Authors (https://academic.oup.com/plphys/pages/General-Instructions) is Sebastian Varela.",
    "citationCount": 1,
    "referenceCount": 84
}