{
    "paperId": "d1845f20fddb34e6334c97ffa35533cc88020269",
    "title": "Heterogeneous Graph Contrastive Learning for Recommendation",
    "year": 2023,
    "venue": "Web Search and Data Mining",
    "authors": [
        "Mengru Chen",
        "Chao Huang",
        "Lianghao Xia",
        "Wei Wei",
        "Yong Xu",
        "Ronghua Luo"
    ],
    "doi": "10.1145/3539597.3570484",
    "arxivId": "2303.00995",
    "url": "https://www.semanticscholar.org/paper/d1845f20fddb34e6334c97ffa35533cc88020269",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2303.00995",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph Neural Networks (GNNs) have become powerful tools in modeling graph-structured data in recommender systems. However, real-life recommendation scenarios usually involve heterogeneous relationships (e.g., social-aware user influence, knowledge-aware item dependency) which contains fruitful information to enhance the user preference learning. In this paper, we study the problem of heterogeneous graph-enhanced relational learning for recommendation. Recently, contrastive self-supervised learning has become successful in recommendation. In light of this, we propose a Heterogeneous Graph Contrastive Learning (HGCL), which is able to incorporate heterogeneous relational semantics into the user-item interaction modeling with contrastive learning-enhanced knowledge transfer across different views. However, the influence of heterogeneous side information on interactions may vary by users and items. To move this idea forward, we enhance our heterogeneous graph contrastive learning with meta networks to allow the personalized knowledge transformer with adaptive contrastive augmentation. The experimental results on three real-world datasets demonstrate the superiority of HGCL over state-of-the-art recommendation methods. Through ablation study, key components in HGCL method are validated to benefit the recommendation performance improvement. The source code of the model implementation is available at the link https://github.com/HKUDS/HGCL.",
    "citationCount": 212,
    "referenceCount": 44
}