{
    "paperId": "d18dfca09427eebeffa12dc8fbaa4e13773d9ab2",
    "title": "Analyzing Key Factors Influencing Human Mobility Before and During COVID‐19 With Explainable Machine Learning",
    "year": 2024,
    "venue": "Trans. GIS",
    "authors": [
        "Pingping Wang",
        "Yihong Yuan"
    ],
    "doi": "10.1111/tgis.13271",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d18dfca09427eebeffa12dc8fbaa4e13773d9ab2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The COVID‐19 pandemic highlighted and worsened social inequalities in the United States. This study uses mobile phone location data at the Census Block Group level and explainable machine learning methods to examine the relationships between various factors and human mobility in ten Metropolitan Statistical Areas to uncover how different factors influenced mobility disparities. Our key findings show significant reductions in all mobility indices during the summer of 2020 compared to 2019, mainly due to stay‐at‐home orders, business closures, and health concerns. Median household income was a consistent positive driver of mobility, while the minority rate negatively impacted movement, exacerbating existing inequalities. Remote work significantly affected full‐time and part‐time job mobility. These findings highlight the need for fair and resilient mobility policies that consider decentralized commuting, flexible work models, and sustainable transportation. These insights can help policymakers and urban planners address inequalities, support economic recovery, and build inclusive urban environments.",
    "citationCount": 1,
    "referenceCount": 123
}