{
    "paperId": "d1afea7af0168397189a39a3f351a2ba359ccdca",
    "title": "Software-Based Mass Customization of Artificial Neural Networks and its Benefits",
    "year": 2022,
    "venue": "2022 International Conference on Computational Science and Computational Intelligence (CSCI)",
    "authors": [
        "Dominic Rosch-Grace",
        "J. Straub"
    ],
    "doi": "10.1109/CSCI58124.2022.00026",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d1afea7af0168397189a39a3f351a2ba359ccdca",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Artificial intelligence (AI) is a rapidly growing field of research that aims to create decision-making computing systems Machine learning (ML) is a subclass of AI that processes vast quantities of data to train computational models. ML agents can identify patterns in large datasets and render predictions based on the data they were trained with. Deep learning (DL) is a subclass of ML that develops artificial neural networks with multiple hidden layers of artificial neurons to solve data-intensive problems. ML and DL research requires specialized knowledge and systems, keeping many organizations from using it or achieving the full benefits it could provide. In this paper, a user-friendly approach to building AI, ML and DL models is presented which allows users to build models using diagramming software, thus abstracting much of the complexity otherwise associated with building them, while also achieving benefits potentially only available via customization. This allows users to customize models at the artificial neuron level, allowing them to specify attributes such as individual neurons' activation functions and connectivity. This work aims to broaden the availability of ML/DL technologies and unlock the benefits of low-level customization for users of all sizes.",
    "citationCount": 0,
    "referenceCount": 34
}