{
    "paperId": "d1c0706cf5687ccd45e3de8a4dd8c2eba02235fe",
    "title": "Smart Chaining: Templing and Temple Search",
    "year": 2025,
    "venue": "IEEE Access",
    "authors": [
        "R. Tripathi",
        "Rahul Mishra",
        "Shailesh Kumar Agrahari",
        "Pradeep Kumar Singh",
        "Sarvpal Singh"
    ],
    "doi": "10.1109/ACCESS.2025.3577461",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d1c0706cf5687ccd45e3de8a4dd8c2eba02235fe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hash tables continue to be at the forefront of applications that require fast data lookup, but their usefulness in practice depends on effective collision resolution. Classical approaches like chaining (linked lists) and open addressing (linear/quadratic/random probing) have inherent challenges, like chaining degrades with increasing lists, whereas universal hash functions impose unrealistic computational costs on bulk operations. This work introduced two complementary innovations that can circumvent these flaws. First, Even-Odd Hash Function optimizes prime-number selection for modulo computations so that 95% uniformly distributed load is achieved at zero overhead. Second, chaining is structurally re-architected with linked lists substituted by B-trees of order 5, which gives the Templing and Temple Search framework. By combining combinatorial hashing with hierarchical collision resolution, the scheme avoids linear search delays and resists clustering without increasing the memory footprint. Experimental evidence illustrates the dominance of Templing and Temple Search as it delivers $4.5x$ faster searches and $3.5x$ faster insertions over plain chaining at equal space complexity. Light-weight prime selection and non-contiguous memory structure within the methodology guarantee scalability even under heavy loads. It restates hash table performance, resolving algorithmic advancement against practical exigencies to set the agenda for contemporary data structure design.",
    "citationCount": 0,
    "referenceCount": 51
}