{
    "paperId": "d1c3afca8603984ee0a31f56f069966f38ef3858",
    "title": "A Neural Database for Differentially Private Spatial Range Queries",
    "year": 2021,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Sepanta Zeighami",
        "Ritesh Ahuja",
        "Gabriel Ghinita",
        "C. Shahabi"
    ],
    "doi": "10.14778/3510397.3510404",
    "arxivId": "2108.01496",
    "url": "https://www.semanticscholar.org/paper/d1c3afca8603984ee0a31f56f069966f38ef3858",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2108.01496",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Mobile apps and location-based services generate large amounts of location data. Location density information from such datasets benefits research on traffic optimization, context-aware notifications and public health (e.g., disease spread). To preserve individual privacy, one must sanitize location data, which is commonly done using differential privacy (DP). Existing methods partition the data domain into bins, add noise to each bin and publish a noisy histogram of the data. However, such simplistic modelling choices fall short of accurately capturing the useful density information in spatial datasets and yield poor accuracy. We propose a machine-learning based approach for answering range count queries on location data with DP guarantees. We focus on countering the sources of error that plague existing approaches (i.e., noise and uniformity error) through learning, and we design a neural database system that models spatial data such that density features are preserved, even when DP-compliant noise is added. We also devise a framework for effective system parameter tuning on top of\n public\n data, which helps set important system parameters without expending scarce privacy budget. Extensive experimental results on real datasets with heterogeneous characteristics show that our proposed approach significantly outperforms the state of the art.\n",
    "citationCount": 24,
    "referenceCount": 48
}