{
    "paperId": "d1c5b0bb1d98353615e417f48f58b187ad8bc273",
    "title": "The Effect of Asset Degradation on Trust in Swarms: A Reexamination of System-Wide Trust in Human-Swarm Interaction",
    "year": 2022,
    "venue": "Hum. Factors",
    "authors": [
        "August A. Capiola",
        "Izz Aldin Hamdan",
        "J. Lyons",
        "M. Lewis",
        "Gene M. Alarcon",
        "K. Sycara"
    ],
    "doi": "10.1177/00187208221145261",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d1c5b0bb1d98353615e417f48f58b187ad8bc273",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Objective The effects of asset degradation on trust in human-swarm interaction were investigated through the lens of system-wide trust theory. Background Researchers have begun investigating contextual features that shape human interactions with robotic swarms—systems comprising assets that coordinate behavior based on their nearest neighbors. Recent work has begun investigating how human trust toward swarms is affected by asset degradation through the lens of system-wide trust theory, but these studies have been marked by several limitations. Method In an online study, the current work manipulated asset degradation and measured trust-relevant criteria in a within-subjects design and addressed the limitations of past work. Results Controlling for swarm performance (i.e., target acquisition), asset degradation and trust (i.e., reliance intentions) in swarms were negatively related. In addition, as degradation increased, perceptions of swarm cohesion, obstacle avoidance, target acquisition, and terrain exploration efficiency decreased, the latter two of which (coupled with the reliance intentions criterion) support the tenets of system-wide trust theory as well as replicate and extend past work on the effects of asset degradation on trust in swarms. Conclusion Human-swarm interaction is a context in which system-wide trust is relevant, and future work ought to investigate how to calibrate human trust toward swarm systems. Applications Based on these findings, design professionals should prioritize ways to depict swarm performance and system health such that humans do not abandon trust in systems that are still functional yet not over-trust those systems which are indeed performing poorly.",
    "citationCount": 7,
    "referenceCount": 46
}