{
    "paperId": "d1cb1d5ae07fa8e4599b7cc0c9c650e3794b3c5e",
    "title": "Online Search with Predictions: Pareto-optimal Algorithm and its Applications in Energy Markets",
    "year": 2022,
    "venue": "Energy-Efficient Computing and Networking",
    "authors": [
        "Russell Lee",
        "Bo Sun",
        "John C.S. Lui",
        "M. Hajiesmaili"
    ],
    "doi": "10.1145/3632775.3639590",
    "arxivId": "2211.06567",
    "url": "https://www.semanticscholar.org/paper/d1cb1d5ae07fa8e4599b7cc0c9c650e3794b3c5e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2211.06567",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper develops learning-augmented algorithms for energy trading in volatile electricity markets. The basic problem is to sell (or buy) k units of energy for the highest revenue (lowest cost) over uncertain time-varying prices, which can framed as a classic online search problem in the literature of competitive analysis. State-of-the-art algorithms assume no knowledge about future market prices when they make trading decisions in each time slot, and aim for guaranteeing the performance for the worst-case price sequence. In practice, however, predictions about future prices become commonly available by leveraging machine learning. This paper aims to incorporate machine-learned predictions to design competitive algorithms for online search problems. An important property of our algorithms is that they achieve performances competitive with the offline algorithm in hindsight when the predictions are accurate (i.e., consistency) and also provide worst-case guarantees when the predictions are arbitrarily wrong (i.e., robustness). The proposed algorithms achieve the Pareto-optimal trade-off between consistency and robustness, where no other algorithms for online search can improve on the consistency for a given robustness. Further, we extend the basic online search problem to a more general inventory management setting that can capture storage-assisted energy trading in electricity markets. In empirical evaluations using traces from real-world applications, our learning-augmented algorithms improve the average empirical performance compared to benchmark algorithms, while also providing improved worst-case performance.",
    "citationCount": 10,
    "referenceCount": 31
}