{
    "paperId": "d1fcb53339fdd72f2dd7e48520c8e07b962ee724",
    "title": "The Attitudes of Students' Parents Towards Their Children's Information-Based Learning Under the Background of the Combination of Large-Scale Online Learning and Multimedia Technology",
    "year": 2023,
    "venue": "International Journal of Web-Based Learning and Teaching Technologies",
    "authors": [
        "Zhe Liu"
    ],
    "doi": "10.4018/ijwltt.320519",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d1fcb53339fdd72f2dd7e48520c8e07b962ee724",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.igi-global.com/ViewTitle.aspx?TitleId=320519&isxn=9781668494974",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a stakeholder group in the promotion of basic education informatization, parents' attitudes towards children's informatization learning is an important factor affecting the smooth development of school informatization teaching. Based on the classic convolutional neural network and CK+ dataset, this paper proposes a convolutional neural network model to evaluate the attitude of parents to children's information-based learning in the context of large-scale online learning and multimedia technology. It aims to provide an important reference for promoting the informatization teaching reform in the basic education stage in the post-pandemic era. The experiment shows that the convolution neural network model proposed in this paper can accurately identify the facial information of learners in the live classroom. Based on learners' emotional changes, teachers can adjust teaching strategies in time to improve the teaching process.",
    "citationCount": 0,
    "referenceCount": 25
}