{
    "paperId": "d20773683ddbb5c516131bdfdf674a772714de50",
    "title": "A Comprehensive Survey on Trustworthy Recommender Systems",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Wenqi Fan",
        "Xiangyu Zhao",
        "Xiao Chen",
        "Jingran Su",
        "Jingtong Gao",
        "Lin Wang",
        "Qidong Liu",
        "Yiqi Wang",
        "Hanfeng Xu",
        "Lei Chen",
        "Qing Li"
    ],
    "doi": "10.48550/arXiv.2209.10117",
    "arxivId": "2209.10117",
    "url": "https://www.semanticscholar.org/paper/d20773683ddbb5c516131bdfdf674a772714de50",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2209.10117",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As one of the most successful AI-powered applications, recommender systems aim to help people make appropriate decisions in an effective and efficient way, by providing personalized suggestions in many aspects of our lives, especially for various human-oriented online services such as e-commerce platforms and social media sites. In the past few decades, the rapid developments of recommender systems have significantly benefited human by creating economic value, saving time and effort, and promoting social good. However, recent studies have found that data-driven recommender systems can pose serious threats to users and society, such as spreading fake news to manipulate public opinion in social media sites, amplifying unfairness toward under-represented groups or individuals in job matching services, or inferring privacy information from recommendation results. Therefore, systems' trustworthiness has been attracting increasing attention from various aspects for mitigating negative impacts caused by recommender systems, so as to enhance the public's trust towards recommender systems techniques. In this survey, we provide a comprehensive overview of Trustworthy Recommender systems (TRec) with a specific focus on six of the most important aspects; namely, Safety&Robustness, Nondiscrimination&Fairness, Explainability, Privacy, Environmental Well-being, and Accountability&Auditability. For each aspect, we summarize the recent related technologies and discuss potential research directions to help achieve trustworthy recommender systems in the future.",
    "citationCount": 52,
    "referenceCount": 461
}