{
    "paperId": "d21cb7b9744365f0ada5527be380236495dd3521",
    "title": "Position: Leverage Foundational Models for Black-Box Optimization",
    "year": 2024,
    "venue": "International Conference on Machine Learning",
    "authors": [
        "Xingyou Song",
        "Yingtao Tian",
        "Robert Lange",
        "Chansoo Lee",
        "Yujin Tang",
        "Yutian Chen"
    ],
    "doi": "10.48550/arXiv.2405.03547",
    "arxivId": "2405.03547",
    "url": "https://www.semanticscholar.org/paper/d21cb7b9744365f0ada5527be380236495dd3521",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Undeniably, Large Language Models (LLMs) have stirred an extraordinary wave of innovation in the machine learning research domain, resulting in substantial impact across diverse fields such as reinforcement learning, robotics, and computer vision. Their incorporation has been rapid and transformative, marking a significant paradigm shift in the field of machine learning research. However, the field of experimental design, grounded on black-box optimization, has been much less affected by such a paradigm shift, even though integrating LLMs with optimization presents a unique landscape ripe for exploration. In this position paper, we frame the field of black-box optimization around sequence-based foundation models and organize their relationship with previous literature. We discuss the most promising ways foundational language models can revolutionize optimization, which include harnessing the vast wealth of information encapsulated in free-form text to enrich task comprehension, utilizing highly flexible sequence models such as Transformers to engineer superior optimization strategies, and enhancing performance prediction over previously unseen search spaces.",
    "citationCount": 15,
    "referenceCount": 94
}