{
    "paperId": "d21e4be69bc13b138da5f605aa72441445aba8ec",
    "title": "Bio-inspired motion detection models for improved UAV and bird differentiation: a novel deep learning framework",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Najiba Said Hamed Al-Zadjali",
        "Sundaravadivazhagan Balasubaramanian",
        "Charles Savarimuthu",
        "Emanuel O. Rances"
    ],
    "doi": "10.1038/s41598-025-99951-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d21e4be69bc13b138da5f605aa72441445aba8ec",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41598-025-99951-4",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid increase in Unmanned Aerial Vehicle (UAV) deployments has led to growing concerns about their detection and differentiation from birds, particularly in sensitive areas like airports. Existing detection systems often struggle to distinguish between UAVs and birds due to their similar flight patterns, resulting in high false positive rates and missed detections. This research presents a bio-inspired deep learning model, the Spatiotemporal Bio-Response Neural Network (STBRNN), designed to enhance the differentiation between UAVs and birds in real-time. The model consists of three core components: a Bio-Inspired Convolutional Neural Network (Bio-CNN) for spatial feature extraction, Gated Recurrent Units (GRUs) for capturing temporal motion dynamics, and a novel Bio-Response Layer that adjusts attention based on movement intensity, object proximity, and velocity consistency. The dataset used includes labeled images and videos of UAVs and birds captured in various environments, processed following YOLOv7 specifications. Extensive experiments were conducted comparing STBRNN with five state-of-the-art models, including YOLOv5, Faster R-CNN, SSD, RetinaNet, and R-FCN. The results demonstrate that STBRNN achieves superior performance across multiple metrics, with a precision of 0.984, recall of 0.964, F1 score of 0.974, and an IoU of 0.96. Additionally, STBRNN operates at an inference time of 45ms per frame, making it highly suitable for real-time applications in UAV and bird detection.",
    "citationCount": 0,
    "referenceCount": 27
}