{
    "paperId": "d2a9a198c010a0ff9aebc784e6ab1aa128937c8e",
    "title": "SEMI-SUPERVISED CLASSIFICATION OF 2D MATERIALS USING SELF-TRAINING CONVOLUTIONAL NEURAL NETWORKS",
    "year": 2024,
    "venue": "Eskişehir Technical University Journal of Science and Technology A - Applied Sciences and Engineering",
    "authors": [
        "Cahit Perkgöz",
        "Umut Kaan Kavaklı",
        "Bahar Görgün",
        "Ayşegül Terzi"
    ],
    "doi": "10.18038/estubtda.1545522",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d2a9a198c010a0ff9aebc784e6ab1aa128937c8e",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.18038/estubtda.1545522",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning algorithms require large amounts of data, and their accuracy rates are directly related to the amount and quality of the data. Moreover, supervised learning models require the data to be labeled. However, data labeling is always a time-consuming and laborious process. Labeling data obtained from microscope images can be more laborious. Molybdenum disulfide (MoS2) in monolayer form, which can be produced on large surfaces with the chemical vapor deposition method (CVD) and has advantages for potential electronic applications, is a frequently studied material in the field of nanotechnology. However, MoS2 produced on these large surfaces usually has defective surfaces and needs to be detected. This process is a difficult process to be performed with a microscope by an expert. Artificial intelligence-based supervised learning algorithms, which need labeled data, provide an effective solution for these detections. Furthermore, increasing the number of labeled data increases the accuracy of these algorithms. \n \nIn this study, a teacher-student model is explored using self-training, a semi-supervised learning technique, to effectively train a deep convolutional neural network to detect defects on MoS2 samples. Initially, the teacher model is trained using a small amount of data labeled by an expert. This trained model is enriched by generating pseudo-labels for previously unlabeled data. Then, a student model is trained using these real and pseudo-labeled data. The trained model then replaces the teacher model, and the process repeats, gradually improving labeling accuracy. The results show that the self-training method increases accuracy from 77% to 82% compared to the CNN model trained only on the existing labeled data, and the defect regions in MoS2 are effectively classified with minimal manual labeling.",
    "citationCount": 0,
    "referenceCount": 24
}