{
    "paperId": "d2aed846eede250d40e8192c0ba4df8ae1c36076",
    "title": "Balancing Performance and Human Autonomy With Implicit Guidance Agent",
    "year": 2021,
    "venue": "Frontiers in Artificial Intelligence",
    "authors": [
        "Ryo Nakahashi",
        "S. Yamada"
    ],
    "doi": "10.3389/frai.2021.736321",
    "arxivId": "2109.00414",
    "url": "https://www.semanticscholar.org/paper/d2aed846eede250d40e8192c0ba4df8ae1c36076",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/frai.2021.736321/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The human-agent team, which is a problem in which humans and autonomous agents collaborate to achieve one task, is typical in human-AI collaboration. For effective collaboration, humans want to have an effective plan, but in realistic situations, they might have difficulty calculating the best plan due to cognitive limitations. In this case, guidance from an agent that has many computational resources may be useful. However, if an agent guides the human behavior explicitly, the human may feel that they have lost autonomy and are being controlled by the agent. We therefore investigated implicit guidance offered by means of an agent’s behavior. With this type of guidance, the agent acts in a way that makes it easy for the human to find an effective plan for a collaborative task, and the human can then improve the plan. Since the human improves their plan voluntarily, he or she maintains autonomy. We modeled a collaborative agent with implicit guidance by integrating the Bayesian Theory of Mind into existing collaborative-planning algorithms and demonstrated through a behavioral experiment that implicit guidance is effective for enabling humans to maintain a balance between improving their plans and retaining autonomy.",
    "citationCount": 5,
    "referenceCount": 53
}