{
    "paperId": "d2e3e9eae94d002282a48ac885574ae52d327b94",
    "title": "Blending neural operators and relaxation methods in PDE numerical solvers",
    "year": 2022,
    "venue": "Nat. Mac. Intell.",
    "authors": [
        "Enrui Zhang",
        "Adar Kahana",
        "Eli Turkel",
        "Rishikesh Ranade",
        "Jay Pathak",
        "G. Karniadakis"
    ],
    "doi": "10.1038/s42256-024-00910-x",
    "arxivId": "2208.13273",
    "url": "https://www.semanticscholar.org/paper/d2e3e9eae94d002282a48ac885574ae52d327b94",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks suffer from spectral bias having difficulty in representing the high frequency components of a function while relaxation methods can resolve high frequencies efficiently but stall at moderate to low frequencies. We exploit the weaknesses of the two approaches by combining them synergistically to develop a fast numerical solver of partial differential equations (PDEs) at scale. Specifically, we propose HINTS, a hybrid, iterative, numerical, and transferable solver by integrating a Deep Operator Network (DeepONet) with standard relaxation methods, leading to parallel efficiency and algorithmic scalability for a wide class of PDEs, not tractable with existing monolithic solvers. HINTS balances the convergence behavior across the spectrum of eigenmodes by utilizing the spectral bias of DeepONet, resulting in a uniform convergence rate and hence exceptional performance of the hybrid solver overall. Moreover, HINTS applies to large-scale, multidimensional systems, it is flexible with regards to discretizations, computational domain, and boundary conditions.",
    "citationCount": 52,
    "referenceCount": 94
}