{
    "paperId": "d331d60d6fd8ad8aa0cb49673b2dd20acd0f5ceb",
    "title": "Network Traffic Classification Analysis on Differentiated Services Code Point Using Deep Learning Models for Efficient Deep Packet Inspection",
    "year": 2024,
    "venue": "International Journal of Innovative Computing",
    "authors": [
        "Fazeel Ahmed Khan",
        "A. Ibrahim"
    ],
    "doi": "10.11113/ijic.v14n2.438",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d331d60d6fd8ad8aa0cb49673b2dd20acd0f5ceb",
    "isOpenAccess": true,
    "openAccessPdf": "https://ijic.utm.my/index.php/ijic/article/download/438/310",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The network traffic classification is essential in identifying and categorizing the network traffic data packets in the network transmission. The network traffic transmission is effectively managed and prioritized using Quality of Service (QoS). The Differential Services Code Point within the Differentiated Service (DiffServ) field is primarily used inside the Layer 3 encapsulated network IP packets. Since the user generated data is growing rapidly with variety in data such as, streaming, VoIP, online gaming etc. There is a need to have effective prioritization and classification of IP packets for routers to enable the forwarding of such packets including packets having critical data efficiently and with a lower drop rate. This study develops and analyze using neural network-based models for effective classification of data packets using the DSCP header field. The data was gathered using real-time packet capturing tools which were then processed and moved with model development using different deep learning algorithms such as, LSTM, MLP, RNN and Autoencoders. Most of the algorithms got promising results and classify packets based on DSCP accurately. This study will help to advance network packet classification within the network transmission by network administrators to monitor network more efficiently and to avoid malicious activities within the network environment.",
    "citationCount": 0,
    "referenceCount": 33
}