{
    "paperId": "d357dcf41eea186d2bcb33038ca1ba6d9048ac5f",
    "title": "Verifying Inverse Model Neural Networks",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Chelsea Sidrane",
        "Sydney M. Katz",
        "Anthony Corso",
        "Mykel J. Kochenderfer"
    ],
    "doi": null,
    "arxivId": "2202.02429",
    "url": "https://www.semanticscholar.org/paper/d357dcf41eea186d2bcb33038ca1ba6d9048ac5f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Inverse problems exist in a wide variety of physical domains from aerospace engineering to medical imaging. The goal is to infer the underlying state from a set of observations. When the forward model that produced the observations is nonlinear and stochastic, solving the inverse problem is very challenging. Neural networks are an appealing solution for solving inverse problems as they can be trained from noisy data and once trained are computationally efficient to run. However, inverse model neural networks do not have guarantees of correctness built-in, which makes them unreliable for use in safety and accuracy-critical contexts. In this work we introduce a method for verifying the correctness of inverse model neural networks. Our approach is to overapproximate a nonlinear, stochastic forward model with piecewise linear constraints and encode both the overapproximate forward model and the neural network inverse model as a mixed-integer program. We demonstrate this verification procedure on a real-world airplane fuel gauge case study. The ability to verify and consequently trust inverse model neural networks allows their use in a wide variety of contexts, from aerospace to medicine.",
    "citationCount": 2,
    "referenceCount": 27
}