{
    "paperId": "d37963d96fdec3b1c5cb03547f504e7e0a74e382",
    "title": "A Question Answering and Quiz Generation Chatbot for Education",
    "year": 2019,
    "venue": "2019 Grace Hopper Celebration India (GHCI)",
    "authors": [
        "A. S. Sreelakshmi",
        "S. B. Abhinaya",
        "Aishwarya Nair",
        "S. Jaya Nirmala"
    ],
    "doi": "10.1109/GHCI47972.2019.9071832",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d37963d96fdec3b1c5cb03547f504e7e0a74e382",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent years, there have been a number of chatbots developed in the field of education. While many of them are designed to answer queries based on publicly available information such as in community answering platforms, or from a predefined knowledge base, there is no possibility of customizing the information to be queried. Moreover, there are no existing chatbots capable of generating self assessment quizzes based on any given document. This paper proposes a Question Answering and Quiz Generation Chatbot that allows a user to upload relevant documents and perform two main functions on them, namely answer extraction and question generation. The uploaded document is converted into a knowledge base through a number of data cleaning and preprocessing steps. The Question Answering module uses ranking functions and neural networks to extract the most appropriate answer from the knowledge base and the Quiz Generation module identifies key sentences and generates question-answer pairs, which can be used to generate a quiz for the user.",
    "citationCount": 35,
    "referenceCount": 28
}