{
    "paperId": "d39836f9ac959b6f00d3b2d11c51592bc8853e52",
    "title": "Crop Prediction Model Using Machine Learning Algorithms",
    "year": 2023,
    "venue": "Applied Sciences",
    "authors": [
        "E. Elbasi",
        "Chamseddine Zaki",
        "A. Topcu",
        "Wiem Abdelbaki",
        "A. Zreikat",
        "Elda Cina",
        "A. Shdefat",
        "Louai Saker"
    ],
    "doi": "10.3390/app13169288",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d39836f9ac959b6f00d3b2d11c51592bc8853e52",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/13/16/9288/pdf?version=1692167252",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning applications are having a great impact on the global economy by transforming the data processing method and decision making. Agriculture is one of the fields where the impact is significant, considering the global crisis for food supply. This research investigates the potential benefits of integrating machine learning algorithms in modern agriculture. The main focus of these algorithms is to help optimize crop production and reduce waste through informed decisions regarding planting, watering, and harvesting crops. This paper includes a discussion on the current state of machine learning in agriculture, highlighting key challenges and opportunities, and presents experimental results that demonstrate the impact of changing labels on the accuracy of data analysis algorithms. The findings recommend that by analyzing wide-ranging data collected from farms, incorporating online IoT sensor data that were obtained in a real-time manner, farmers can make more informed verdicts about factors that affect crop growth. Eventually, integrating these technologies can transform modern agriculture by increasing crop yields while minimizing waste. Fifteen different algorithms have been considered to evaluate the most appropriate algorithms to use in agriculture, and a new feature combination scheme-enhanced algorithm is presented. The results show that we can achieve a classification accuracy of 99.59% using the Bayes Net algorithm and 99.46% using Naïve Bayes Classifier and Hoeffding Tree algorithms. These results will indicate an increase in production rates and reduce the effective cost for the farms, leading to more resilient infrastructure and sustainable environments. Moreover, the findings we obtained in this study can also help future farmers detect diseases early, increase crop production efficiency, and reduce prices when the world is experiencing food shortages.",
    "citationCount": 163,
    "referenceCount": 60
}