{
    "paperId": "d39a410b08bff56245cde0b06bf72cd54faaff4c",
    "title": "A survey on machine learning in array databases",
    "year": 2022,
    "venue": "Applied intelligence (Boston)",
    "authors": [
        "Sebastián Villarroya",
        "P. Baumann"
    ],
    "doi": "10.1007/s10489-022-03979-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d39a410b08bff56245cde0b06bf72cd54faaff4c",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10489-022-03979-2.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper provides an in-depth survey on the integration of machine learning and array databases. First,machine learning support in modern database management systems is introduced. From straightforward implementations of linear algebra operations in SQL to machine learning capabilities of specialized database managers designed to process specific types of data, a number of different approaches are overviewed. Then, the paper covers the database features already implemented in current machine learning systems. Features such as rewriting, compression, and caching allow users to implement more efficient machine learning applications. The underlying linear algebra computations in some of the most used machine learning algorithms are studied in order to determine which linear algebra operations should be efficiently implemented by array databases. An exhaustive overview of array data and relevant array database managers is also provided. Those database features that have been proven of special importance for efficient execution of machine learning algorithms are analyzed in detail for each relevant array database management system. Finally, current state of array databases capabilities for machine learning implementation is shown through two example implementations in Rasdaman and SciDB.",
    "citationCount": 3,
    "referenceCount": 78
}