{
    "paperId": "d3b9996a7a923e11fc07a0baabaea065774636f0",
    "title": "Comparison of Optimizers for Fault Isolation and Diagnostics of Control Rod Drives",
    "year": 2024,
    "venue": "International Conference on Prognostics and Health Management",
    "authors": [
        "Ark O. Ifeanyi",
        "Jamie Coble"
    ],
    "doi": "10.1109/ICPHM61352.2024.10626414",
    "arxivId": "2407.06557",
    "url": "https://www.semanticscholar.org/paper/d3b9996a7a923e11fc07a0baabaea065774636f0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper explores the optimization of fault detection and diagnostics (FDD) in the Control Rod Drive System (CRDS) of GE-Hitachi’s BWRX-300 small modular reactor (SMR), focusing on the electrically powered fine motion control rod drive (FMCRD) servomotors. Leveraging the coordinated motion of multiple FMCRDs for control rod adjustments, the study proposes a deep learning approach, utilizing one-dimensional convolutional neural network (1D CNN)-based autoencoders for anomaly detection and encoder-decoder structured 1D CNN classifiers for fault classification. Simulink models simulate normal and fault operations, monitoring electric current and electromagnetic torque. The training of the fault isolation and fault classification models is optimized. Various optimizers, including Adaptive Moment Estimation (Adam), Nesterov Adam (Nadam), Stochastic Gradient Descent (SGD), and Root Mean Square Propagation (RMSProp), are evaluated, with Nadam demonstrating a relatively superior performance across the isolation and classification tasks due to its adaptive gradient and Nesterov components. The research underscores the importance of considering the number of runs (each run has a different set of initial model parameters) as a hyperparameter during empirical optimizer comparisons and contributes insights crucial for enhancing FDD in SMR control systems and for the application of 1D CNN to FDD.",
    "citationCount": 0,
    "referenceCount": 34
}