{
    "paperId": "d3c4548e1af08f19da4127a2da7cfbe85b31471e",
    "title": "FENXI: Deep-learning Traffic Analytics at the edge",
    "year": 2021,
    "venue": "IFIP International Information Security Conference",
    "authors": [
        "Massimo Gallo",
        "A. Finamore",
        "G. Simon",
        "D. Rossi"
    ],
    "doi": "10.1145/3453142.3491273",
    "arxivId": "2105.11738",
    "url": "https://www.semanticscholar.org/paper/d3c4548e1af08f19da4127a2da7cfbe85b31471e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Live traffic analysis at the first aggregation point in the ISP network enables the implementation of complex traffic engineering policies but is limited by the scarce processing capabilities, especially for Deep Learning (DL) based analytics. The introduction of specialized hardware accelerators, offers the opportunity to enhance processing capabilities of network devices at the edge. Yet, no packet processing pipeline is capable of offering DL-based analysis capabilities in the data-plane, without interfering with network operations. In this paper, we present FENXI, a system to run complex analytics by leveraging Tensor Processing Unit (TPU). The design of FENXI decouples forwarding and traffic analytics which operates at different granularities i.e., packet and flow levels. We conceive two independent modules that asynchronously communicate to exchange network data and analytics results, and design data structures to extract flow level statistics without impacting per-packet processing. We prototyped and evaluated FENXI on general-purpose servers considering both adversarial and realistic network conditions. Our analysis shows that FENXI can sustain 100 Gbps line rate traffic processing requiring only limited resources, while also dynamically adapting to variable network conditions.",
    "citationCount": 7,
    "referenceCount": 43
}