{
    "paperId": "d3c5089f35155fe2dd44c193ab4d19dafa6582fa",
    "title": "Exploring Incremental Unlearning: Techniques, Challenges, and Future Directions",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Sadia Qureshi",
        "T. Shaik",
        "Xiaohui Tao",
        "Haoran Xie",
        "Lin Li",
        "J. Yong",
        "Xiaohua Jia"
    ],
    "doi": "10.48550/arXiv.2502.16708",
    "arxivId": "2502.16708",
    "url": "https://www.semanticscholar.org/paper/d3c5089f35155fe2dd44c193ab4d19dafa6582fa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing demand for data privacy in Machine Learning (ML) applications has seen Machine Unlearning (MU) emerge as a critical area of research. As the `right to be forgotten' becomes regulated globally, it is increasingly important to develop mechanisms that delete user data from AI systems while maintaining performance and scalability of these systems. Incremental Unlearning (IU) is a promising MU solution to address the challenges of efficiently removing specific data from ML models without the need for expensive and time-consuming full retraining. This paper presents the various techniques and approaches to IU. It explores the challenges faced in designing and implementing IU mechanisms. Datasets and metrics for evaluating the performance of unlearning techniques are discussed as well. Finally, potential solutions to the IU challenges alongside future research directions are offered. This survey provides valuable insights for researchers and practitioners seeking to understand the current landscape of IU and its potential for enhancing privacy-preserving intelligent systems.",
    "citationCount": 0,
    "referenceCount": 157
}