{
    "paperId": "d3ca5bbff5075e152d276aee3072f6f0a78a2fba",
    "title": "External Validation of a Machine Learning Model for Schizophrenia Classification",
    "year": 2024,
    "venue": "Journal of Clinical Medicine",
    "authors": [
        "Yupeng He",
        "K. Sakuma",
        "T. Kishi",
        "Yuanying Li",
        "Masaaki Matsunaga",
        "Shinichi Tanihara",
        "N. Iwata",
        "A. Ota"
    ],
    "doi": "10.3390/jcm13102970",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d3ca5bbff5075e152d276aee3072f6f0a78a2fba",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2077-0383/13/10/2970/pdf?version=1715955106",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background and Objective: Excellent generalizability is the precondition for the widespread practical implementation of machine learning models. In our previous study, we developed the schizophrenia classification model (SZ classifier) to identify potential schizophrenia patients in the Japanese population. The SZ classifier has exhibited impressive performance during internal validation. However, ensuring the robustness and generalizability of the SZ classifier requires external validation across independent sample sets. In this study, we aimed to present an external validation of the SZ classifier using outpatient data. Methods: The SZ classifier was trained by using online survey data, which incorporate demographic, health-related, and social comorbidity features. External validation was conducted using an outpatient sample set which is independent from the sample set during the model development phase. The model performance was assessed based on the sensitivity and misclassification rates for schizophrenia, bipolar disorder, and major depression patients. Results: The SZ classifier demonstrated a sensitivity of 0.75 when applied to schizophrenia patients. The misclassification rates were 59% and 55% for bipolar disorder and major depression patients, respectively. Conclusions: The SZ classifier currently encounters challenges in accurately determining the presence or absence of schizophrenia at the individual level. Prior to widespread practical implementation, enhancements are necessary to bolster the accuracy and diminish the misclassification rates. Despite the current limitations of the model, such as poor specificity for certain psychiatric disorders, there is potential for improvement if including multiple types of psychiatric disorders during model development.",
    "citationCount": 4,
    "referenceCount": 35
}