{
    "paperId": "d3eae3b99a9ec577cc22c2ab44e4cc11da077771",
    "title": "Evaluating Machine Learning-Based Soft Sensors for Effluent Quality Prediction in Wastewater Treatment Under Variable Weather Conditions",
    "year": 2025,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Daniel Voipan",
        "A. Voipan",
        "Marian Barbu"
    ],
    "doi": "10.3390/s25061692",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d3eae3b99a9ec577cc22c2ab44e4cc11da077771",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maintaining effluent quality in wastewater treatment plants (WWTPs) comes with significant challenges under variable weather conditions, where sudden changes in flow rate and increased pollutant loads can affect treatment performance. Traditional physical sensors became both expensive and susceptible to failure under extreme conditions. In this study, we evaluate the performance of soft sensors based on artificial intelligence (AI) to predict the components underlying the calculation of the effluent quality index (EQI). We thus focus our study on three ML models: Long Short-Term Memory (LSTM), Gated Recurrent Unit (GRU) and Transformer. Using the Benchmark Simulation Model no. 2 (BSM2) as the WWTP, we were able to obtain datasets for training the ML models and to evaluate their performance in dry weather scenarios, rainy episodes, and storm events. To improve the classification of networks according to the type of weather, we developed a Random Forest (RF)-based meta-classifier. The results indicate that for dry weather conditions the Transformer network achieved the best performance, while for rain episodes and storm scenarios the GRU was able to capture sudden variations with the highest accuracy. LSTM performed normally in stable conditions but struggled with rapid fluctuations. These results support the decision to integrate AI-based predictive models in WWTPs, highlighting the top performances of both a recurrent network (GRU) and a feed-forward network (Transformer) in obtaining effluent quality predictions under different weather conditions.",
    "citationCount": 7,
    "referenceCount": 47
}