{
    "paperId": "d428402da00993871f5dc0950ae8f71449fd2dd2",
    "title": "Indexer++: workload-aware online index tuning with transformers and reinforcement learning",
    "year": 2022,
    "venue": "ACM Symposium on Applied Computing",
    "authors": [
        "V. Sharma",
        "Curtis E. Dyreson"
    ],
    "doi": "10.1145/3477314.3507691",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d428402da00993871f5dc0950ae8f71449fd2dd2",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3477314.3507691",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the increasing workload complexity in modern databases, the manual process of index selection is a challenging task. There is a growing need for a database with an ability to learn and adapt to evolving workloads. This paper proposes Indexer++, an autonomous, workload-aware, online index tuner. Unlike existing approaches, Indexer++ imposes low overhead on the DBMS, is responsive to changes in query workloads and swiftly selects indexes. Our approach uses a combination of text analytic techniques and reinforcement learning. Indexer++ consist of two phases: Phase (i) learns workload trends using a novel trend detection technique based on a pre-trained transformer model. Phase (ii) performs online, i.e., continuous or while the DBMS is processing workloads, index selection using a novel online deep reinforcement learning technique using our proposed priority experience sweeping. This paper provides an experimental evaluation of Indexer++ in multiple scenarios using benchmark (TPC-H) and real-world datasets (IMDB). In our experiments, Indexer++ effectively identifies changes in workload trends and selects the set of optimal indexes.",
    "citationCount": 9,
    "referenceCount": 49
}