{
    "paperId": "d456a30f9d2f01d31cf81e41a1df56b9af4e35dc",
    "title": "Phronesis: Efficient Performance Modeling for High-dimensional Configuration Tuning",
    "year": 2022,
    "venue": "ACM Transactions on Architecture and Code Optimization (TACO)",
    "authors": [
        "Yuhao Li",
        "Benjamin C. Lee"
    ],
    "doi": "10.1145/3546868",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d456a30f9d2f01d31cf81e41a1df56b9af4e35dc",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3546868",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present Phronesis, a learning framework for efficiently modeling the performance of data analytic workloads as a function of their high-dimensional software configuration parameters. Accurate performance models are useful for efficiently optimizing data analytic performance. Phronesis explicitly considers the error decomposition in statistical learning and implications for efficient data acquisition and model growth strategies in performance modeling. We demonstrate Phronesis with three popular machine learning models commonly used in performance tuning: neural network, random forest, and regression spline. We implement and evaluate it for Spark configuration parameters. We show that Phronesis significantly reduces data collection time for training predictive models by up to 57% and 37%, on average, compared to state-of-the-art techniques in building Spark performance models. Furthermore, we construct a configuration autotuning pipeline based on Phronesis. Our results indicate up to 30% gains in performance for Spark workloads over previous, state-of-the-art tuning strategies that use high-dimensional models.",
    "citationCount": 7,
    "referenceCount": 77
}