{
    "paperId": "d477fb037eabf867b2ee040ab9f30489b4041c95",
    "title": "High-density SNP-based linkage map construction and QTL analysis for growth-related traits in Luciobarbus brachycephalus using whole-genome resequencing data",
    "year": 2025,
    "venue": "Frontiers in Genetics",
    "authors": [
        "Xuanpeng Wang",
        "Dandan Gao",
        "Gaowei Zhang",
        "Yongchun Ge",
        "Xinhai Wang"
    ],
    "doi": "10.3389/fgene.2025.1644874",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d477fb037eabf867b2ee040ab9f30489b4041c95",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Luciobarbus brachycephalus (commonly known as the Aral barbel) represents a commercially valuable fish species in China, contributing significantly to regional aquaculture economies. High-density genetic linkage mapping coupled with quantitative trait locus (QTL) analysis has emerged as a powerful approach for elucidating the genetic mechanism of complex traits in aquatic species. Method The present study aimed to construct a SNP-based high-density linkage map using male parent, female parent, and 165 F1 full-sib progenies through whole-genome resequencing strategy, and subsequently perform comprehensive QTL mapping of six economically important growth-related traits, in order to identify candidate genes underlying growth regulation in L. brachycephalus. Results Pearson correlation analysis demonstrated strong associations among all six growth-related traits (r > 0.8, P < 0.001), indicating likely pleiotropic regulation through shared genetic factors. The high-density linkage map for L. brachycephalus incorporated 164,435 high-quality SNPs distributed across 50 linkage groups, achieving complete genome coverage of 6,425.95 cM. The exceptional marker density (average inter-marker distance = 0.10 cM) establishes this as the most precise genetic map reported for this species to date, enabling the accurate candidate gene localization and enhanced marker-assisted selection. Through QTL mapping analysis, several genomic regions significantly associated with growth-related traits were identified based on genome-wide peak logarithm of odds scores. Specifically, one major QTL for body height was located on linkage group (LG27), and two distinct QTL for body weight were positioned on LG20 and LG26. Notably, four longitudinal growth traits (total length, body length, fork length, and preanal body length) were found to co-localize within the same significant QTL interval on LG27. These QTL intervals identified 6.27-39.36% of the phenotypic variance explained for the respective traits. Furthermore, putative candidate genes potentially regulating each target trait were identified through comprehensive analysis of these significant QTL intervals. Discussion This integrated approach provides a foundation for marker-assisted selection and enhances the understanding of growth-related genetic mechanisms in this important species.",
    "citationCount": 0,
    "referenceCount": 98
}