{
    "paperId": "d518f377fc5651dff08e2e6b83a98a58d91d189e",
    "title": "Chatbot on LINE Application Using Natural Language Processing for Providing Preliminary Solutions in the Use of Medical Equipment for Healthcare Facilities",
    "year": 2025,
    "venue": "International Conference on Computing and Information",
    "authors": [
        "Atthasaeth Suwannoi",
        "M. Ketcham"
    ],
    "doi": "10.1109/ICCI64209.2025.10987265",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d518f377fc5651dff08e2e6b83a98a58d91d189e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research aims to develop a chatbot on the LINE platform, incorporating Natural Language Processing (NLP) techniques to provide guidance and assist in troubleshooting medical equipment usage within healthcare settings. The proposed system integrates the large language model LLAMA-3.1-8B-Instruct, a vector database, and the LINE Messaging API to enhance the chatbot's capacity to understand user queries and retrieve relevant information swiftly and accurately. The development process emphasizes enabling the chatbot to analyze the context of queries, identify pertinent information, and deliver responses that are both accurate and consistent with medical equipment manuals. The system was evaluated through a series of 30 simulated scenarios, representing common issues encountered in medical equipment use. Evaluation metrics included N-gram Precision, and the performance of the system was assessed through BLEU Score, ROUGE Score, and F1-Score. The results demonstrated that the chatbot provided correct and comprehensive responses in all cases, achieving a BLEU Score of 0.80, a ROUGE Score of 0.83, and an F1-Score of 0.81. These findings indicate that the developed chatbot system possesses significant potential to alleviate the workload of healthcare professionals, reduce the time required to locate information, and enhance the efficiency of patient services. The system provides rapid, accurate, and relevant assistance with medical equipment usage and troubleshooting, aligning with the specific needs of healthcare environments that demand both accuracy and timely responses.",
    "citationCount": 0,
    "referenceCount": 27
}