{
    "paperId": "d52ae0a4077805ba4510c88ae0e73fdcd14efd3d",
    "title": "AI-driven biomarker discovery: enhancing precision in cancer diagnosis and prognosis",
    "year": 2025,
    "venue": "Discover Oncology",
    "authors": [
        "E. Alum"
    ],
    "doi": "10.1007/s12672-025-02064-7",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d52ae0a4077805ba4510c88ae0e73fdcd14efd3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "LettersAndComments",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cancer remains a significant health issue, resulting in around 10 million deaths per year, particularly in developing nations. Demographic changes, socio-economic variables, and lifestyle choices are responsible for the rise in cancer cases. Despite the potential to mitigate the adverse effects of cancer by early detection and the implementation of cancer prevention methods, several nations have limited screening facilities. In oncology, the use of artificial intelligence (AI) represents a transformative advancement in cancer diagnosis, prognosis, and treatment. The use of AI in biomarker discovery improves precision medicine by uncovering biomarker signatures that are essential for early detection and treatment of diseases within vast and diverse datasets. Deep learning and machine learning diagnostics are two examples of AI technologies that are changing the way biomarkers are made by finding patterns in large datasets and making new technologies that make it possible to deliver accurate and effective therapies. Existing gaps include data quality, algorithmic transparency, and ethical concerns around privacy, among others. The advancement of biomarker discovery methodologies with AI seeks to transform cancer by improving patient survival rates through enhanced early diagnosis and targeted therapy. This commentary aims to clarify how AI is improving the identification of novel biomarkers for optimal early diagnosis, focused treatment, and improved clinical outcomes, while also addressing certain obstacles and ethical issues related to the application of artificial intelligence in oncology. Data from reputable scientific databases such as PubMed, Scopus, and ScienceDirect were utilized.",
    "citationCount": 28,
    "referenceCount": 81
}