{
    "paperId": "d54daf15c1ccf2a90082fa0a5705f1474e7b036e",
    "title": "Learned Load Balancing",
    "year": 2023,
    "venue": "International Conference of Distributed Computing and Networking",
    "authors": [
        "Brian Chang",
        "Aditya Akella",
        "Loris D'antoni",
        "Kausik Subramanian"
    ],
    "doi": "10.1145/3571306.3571403",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d54daf15c1ccf2a90082fa0a5705f1474e7b036e",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3571306.3571403",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Effectively balancing traffic in datacenter networks is a crucial operational goal. Most existing load balancing approaches are handcrafted to the structure of the network and/or network workloads. Thus, new load balancing strategies are required if the underlying network conditions change, e.g., due to hard or grey failures, network topology evolution, or workload shifts. While we can theoretically derive the optimal load balancing strategy by solving an optimization problem given certain traffic and topology conditions, these problems take too much time to solve and makes the derived solution stale to deploy. In this paper, we describe a load balancing scheme Learned Load Balancing (LLB), which is a general approach to finding an optimal load balancing strategy for a given network topology and workload, and is fast enough in practice to deploy the inferred strategies. LLB uses deep supervised learning techniques to learn how to handle different traffic patterns and topology changes, and adapts to any failures in the underlying network. LLB leverages emerging trends in network telemetry, programmable switching, and \"smart\" NICs. Our experiments show that LLB performs well under failures and can be expanded to more complex, multi-layered network topologies. We also prototype neural network inference on smartNICs to demonstrate the workability of LLB.",
    "citationCount": 7,
    "referenceCount": 51
}