{
    "paperId": "d57926f654d1eb6e1828d900af413eb5c356e85d",
    "title": "SPARQ: A QoS-Aware Framework for Mitigating Cyber Risk in Self-Protecting IoT Systems",
    "year": 2025,
    "venue": "International Symposium on Software Engineering for Adaptive and Self-Managing Systems",
    "authors": [
        "Alessandro Palma",
        "Houssam Hajj Hassan",
        "Georgios Bouloukakis"
    ],
    "doi": "10.1109/SEAMS66627.2025.00025",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d57926f654d1eb6e1828d900af413eb5c356e85d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Today's smart spaces deploy various IoT devices to offer services for occupants. Such devices are exposed to security risks that may pose serious threats to network services and users' privacy. To avoid the disruption of normal operations, selfprotecting solutions have been developed to allow IoT networks to autonomously respond to cyber threats in real-time. However, existing self-protecting systems focus solely on architectural adaptations to respond to cyber threats, overlooking the mitigation actions described in cybersecurity standards -which represent the correct cybersecurity posture- as well as the impact of the adaptation strategies on the Quality-of-Service (QoS) performance. To overcome these existing limitations, this paper presents SPARQ, a novel framework for designing self-protecting IoT systems that considers both the security exposure to cyber attacks and the QoS performance. We leverage Attack Graph as a threat model for analyzing the cyber exposure of the system and Queuing Network Models to analyze QoS in IoT systems. Based on the analysis outcomes, SPARQ provides mitigation plans to reduce the cyber risk while also minimizing the impact on QoS. We evaluate the proposed approach on two use cases from real-world scenarios including a critical infrastructure and a smart home. The experimental evaluation shows that SPARQ is capable of reducing the cyber risk significantly while also improving the QoS performance by 35% compared to existing approaches.",
    "citationCount": 0,
    "referenceCount": 55
}