{
    "paperId": "d5830895f3eceb1c49d5e9805a9a7db9260c8d73",
    "title": "Don't Splat your Gaussians: Volumetric Ray-Traced Primitives for Modeling and Rendering Scattering and Emissive Media",
    "year": 2024,
    "venue": "ACM Transactions on Graphics",
    "authors": [
        "Jorge Condor",
        "Sébastien Speierer",
        "Lukas Bode",
        "Aljaz Bozic",
        "Simon Green",
        "Piotr Didyk",
        "A. Jarabo"
    ],
    "doi": "10.1145/3711853",
    "arxivId": "2405.15425",
    "url": "https://www.semanticscholar.org/paper/d5830895f3eceb1c49d5e9805a9a7db9260c8d73",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2405.15425",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient scene representations are essential for many computer graphics applications. A general unified representation that can handle both surfaces and volumes simultaneously remains a research challenge. In this work we propose a compact and efficient alternative to existing volumetric representations for rendering such as voxel grids. Inspired by recent methods for scene reconstruction that leverage mixtures of three-dimensional Gaussians to model radiance fields, we formalize and generalize the modeling of scattering and emissive media using mixtures of simple kernel-based volumetric primitives. We introduce closed-form solutions for transmittance and free-flight distance sampling for different kernels and propose several optimizations to use our method efficiently within any off-the-shelf volumetric path tracer. We demonstrate our method in both forward and inverse rendering of complex scattering media. Furthermore, we adapt and showcase our method in radiance field optimization and rendering, providing additional flexibility compared to current state of the art given its ray-tracing formulation. We also introduce the Epanechnikov kernel and demonstrate its potential as an efficient alternative to the traditionally used Gaussian kernel in scene reconstruction tasks. The versatility and physically based nature of our approach allows us to go beyond radiance fields and bring to kernel-based modeling and rendering any path-tracing enabled functionality such as scattering, relighting, and complex camera models.",
    "citationCount": 18,
    "referenceCount": 93
}