{
    "paperId": "d5b3d774d605188f584fd92a8bc715d95b24ced2",
    "title": "AutoCure: Automated Tabular Data Curation Technique for ML Pipelines",
    "year": 2023,
    "venue": "aiDM@SIGMOD",
    "authors": [
        "Mohamed Abdelaal",
        "R. Koparde",
        "Harald Schoening"
    ],
    "doi": "10.1145/3593078.3593930",
    "arxivId": "2304.13636",
    "url": "https://www.semanticscholar.org/paper/d5b3d774d605188f584fd92a8bc715d95b24ced2",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2304.13636",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning algorithms have become increasingly prevalent in multiple domains, such as autonomous driving, healthcare, and finance. In such domains, data preparation remains a significant challenge in developing accurate models, requiring significant expertise and time investment to explore the huge search space of well-suited data curation and transformation tools. To address this challenge, we present AutoCure, a novel and configuration-free data curation pipeline that improves the quality of tabular data. Unlike traditional data curation methods, AutoCure synthetically enhances the density of the clean data fraction through an adaptive ensemble-based error detection method and a data augmentation module. In practice, AutoCure can be integrated with open source tools, e.g., Auto-sklearn, H2O, and TPOT, to promote the democratization of machine learning. As a proof of concept, we provide a comparative evaluation of AutoCure against 28 combinations of traditional data curation tools, demonstrating superior performance and predictive accuracy without user intervention. Our evaluation shows that AutoCure is an effective approach to automating data preparation and improving the accuracy of machine learning models.",
    "citationCount": 9,
    "referenceCount": 39
}