{
    "paperId": "d5bd357bc2bd58270372437eb8452bc7c9c76e40",
    "title": "A Review on the Influence of Deep Learning and Generative AI in the Fashion Industry",
    "year": 2024,
    "venue": "Journal of Future Artificial Intelligence and Technologies",
    "authors": [
        "Azma Imtiaz",
        "Nethmi Pathirana",
        "Shakir Saheel",
        "Kasun Karunanayaka",
        "Carlos Trenado"
    ],
    "doi": "10.62411/faith.3048-3719-29",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d5bd357bc2bd58270372437eb8452bc7c9c76e40",
    "isOpenAccess": true,
    "openAccessPdf": "https://faith.futuretechsci.org/index.php/FAITH/article/download/29/17",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Incorporating deep learning models has marked a significant advancement in integrating trends and technology within the fashion industry. These models are extensively applied in the realm of image recognition, product recommendation, and trend prediction, employing deep learning techniques such as Convolutional Neural Networks (CNNs), Generative Adversarial Networks (GANs), Recurrent Neural Networks (RNNs), and Autoencoders. This paper aims to cover various aspects of the textile industry’s supply chain processes, highlighting these deep learning techniques' present influence and potential future directions. It includes a comprehensive analysis of some of the most recent and well-recognized studies in the industry that focus on different parts of a product’s lifecycle in the industry, such as Design and Trend Forecasting, Production and Quality Control, Marketing and Sales, and Distribution and Retail. While deep learning has significantly improved the efficiency of processes across the supply chain, our review highlights some of the existing challenges, such as dependency on large datasets, manual annotation needs, and limitations in creative design generation, encouraging future research to focus on more sophisticated models incorporating multimodal data and personalized factors like body types and aesthetic preferences. Additionally, areas like sewing pattern generation, body-aware designs, and ethical sourcing are critical areas of the fashion industry that require further exploration.",
    "citationCount": 7,
    "referenceCount": 57
}