{
    "paperId": "d5db5e591db09e3250b1a8c06d739d15d7d1b47e",
    "title": "Variant interpretation using population databases: Lessons from gnomAD",
    "year": 2021,
    "venue": "Human Mutation",
    "authors": [
        "Sanna Gudmundsson",
        "M. Singer-Berk",
        "N. Watts",
        "William Phu",
        "J. Goodrich",
        "M. Solomonson",
        "GenoMEL consortium",
        "H. Rehm",
        "D. MacArthur",
        "A. O’Donnell-Luria"
    ],
    "doi": "10.1002/humu.24309",
    "arxivId": "2107.11458",
    "url": "https://www.semanticscholar.org/paper/d5db5e591db09e3250b1a8c06d739d15d7d1b47e",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9160216",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Reference population databases are an essential tool in variant and gene interpretation. Their use guides the identification of pathogenic variants amidst the sea of benign variation present in every human genome, and supports the discovery of new disease–gene relationships. The Genome Aggregation Database (gnomAD) is currently the largest and most widely used publicly available collection of population variation from harmonized sequencing data. The data is available through the online gnomAD browser (https://gnomad.broadinstitute.org/) that enables rapid and intuitive variant analysis. This review provides guidance on the content of the gnomAD browser, and its usage for variant and gene interpretation. We introduce key features including allele frequency, per‐base expression levels, constraint scores, and variant co‐occurrence, alongside guidance on how to use these in analysis, with a focus on the interpretation of candidate variants and novel genes in rare disease.",
    "citationCount": 391,
    "referenceCount": 183
}