{
    "paperId": "d62ea7609a4ba24566338f8f21dc350c50db9c59",
    "title": "CMLCompiler: A Unified Compiler for Classical Machine Learning",
    "year": 2023,
    "venue": "International Conference on Supercomputing",
    "authors": [
        "Xu Wen",
        "Wanling Gao",
        "An-Dong Li",
        "Lei Wang",
        "Zihan Jiang"
    ],
    "doi": "10.1145/3577193.3593710",
    "arxivId": "2301.13441",
    "url": "https://www.semanticscholar.org/paper/d62ea7609a4ba24566338f8f21dc350c50db9c59",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3577193.3593710",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Classical machine learning (CML) occupies nearly half of machine learning pipelines in production applications. Unfortunately, it fails to utilize the state-of-the-practice devices fully and performs poorly. Without a unified framework, the hybrid deployments of deep learning (DL) and CML also suffer from severe performance and portability issues. This paper presents the design of a unified compiler, called CMLCompiler, for CML inference. We propose two unified abstractions: operator representations and extended computational graphs. The CMLCompiler framework performs the conversion and graph optimization based on two unified abstractions, then outputs an optimized computational graph to DL compilers or frameworks. We implement CMLCompiler on TVM. The evaluation shows CMLCompiler's portability and superior performance. It achieves up to 4.38× speedup on CPU, 3.31× speedup on GPU, and 5.09× speedup on IoT devices, compared to the state-of-the-art solutions --- scikit-learn, intel sklearn, and hummingbird. Our performance of CML and DL mixed pipelines achieves up to 3.04x speedup compared with cross-framework implementations. The project documents and source code are available at https://www.computercouncil.org/cmlcompiler.",
    "citationCount": 0,
    "referenceCount": 52
}