{
    "paperId": "d62f911c162096f44f11de755fe62b67da15c767",
    "title": "AI-Powered Cyber-Physical Systems: A New Frontier in Securing Healthcare from Cyber Attacks",
    "year": 2023,
    "venue": "Stallion Journal for Multidisciplinary Associated Research Studies",
    "authors": [
        "Akhil Ahmedabad"
    ],
    "doi": "10.55544/sjmars.2.4.4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d62f911c162096f44f11de755fe62b67da15c767",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There is a rising need for adequate cybersecurity safeguards to protect patient data, medical equipment, and crucial infrastructure as healthcare systems become more digitized. Effective security solutions are required for these intricate settings because of the range of medical equipment used within this system, i.e., Mobile Devices (MD) and Body Sensor Nodes (BSN). Healthcare facilities may utilize artificial intelligence (AI) techniques and cyber-physical systems (CPS) to identify and thwart cyberattacks. A novel machine learning threat detection framework for safe healthcare data transfer has been suggested in this research. Smart Healthcare Cyber-Physical Systems (SHCPS) can distribute the gathered data to cloud storage. Cyberattack patterns may be predicted using AI models, and this information is processed to aid healthcare professionals in making decisions. The proposed system begins with a medical record and preprocesses it using a normalization method. The novel jellyfish-optimized weighted dropped binary long short-term memory (JFO-WDB-LSTM) technique ultimately distinguishes between valid and erroneous healthcare data. Compared to other models, our suggested model achieves attack prediction ratios of 98%, detection accuracy ratios of 88%, delay ratios of 50%, and communication costs of 67%, according to experimental results.",
    "citationCount": 0,
    "referenceCount": 65
}