{
    "paperId": "d640a36b28fc674fe9f9233940a0abddb71bb006",
    "title": "Guiding Index Tuning Exploration with Potential Estimation",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Kecheng Luo",
        "Ruiyang Ma",
        "Peng Cai",
        "Aoying Zhou",
        "Zhiwei Ye",
        "Dunbo Cai",
        "Ling Qian"
    ],
    "doi": "10.1109/ICDE65448.2025.00116",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d640a36b28fc674fe9f9233940a0abddb71bb006",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Throughout index tuning, existing index advisors allocate tuning budget equally across all queries in the workload, even though a considerable portion of queries benefit negligible from index tuning, leading to high costs and inefficiency. This paper introduces a novel learning-based index advisor named GITEE, which increases tuning efficiency and effectiveness by intelligently guiding the exploration of the large search space on candidate index. Our solution consists of three components. First, we utilize execution plan and predicate information to accurately estimate the maximum improvement indexing can bring, which serves as preliminary knowledge for reasonable tuning budget allocation. Second, we filter out queries based on the impact of indexing on the individual queries and their influence on others, thereby reducing the number of candidate indexes. Third, we leverage a Monte Carlo Tree Search-based solution, guided by the knowledge, to accelerate the selection of high-quality index configurations within the valuable search space. Extensive experiments across various benchmarks demonstrate that GITEE achieves superior tuning performance compared to state-of-theart heuristic or learning-based index advisors, while reducing tuning overhead by 1-2 orders of magnitude.",
    "citationCount": 1,
    "referenceCount": 47
}