{
    "paperId": "d68452007b577825fde0782659d141b3b02ed8b7",
    "title": "Genomic Characteristics of Two Common Pest Starfish in Northern China Seas: A Whole-Genome Survey Approach",
    "year": 2025,
    "venue": "Oceans",
    "authors": [
        "Gang Ni",
        "Zhichao Huang",
        "Zhe Li"
    ],
    "doi": "10.3390/oceans6020035",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d68452007b577825fde0782659d141b3b02ed8b7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Coastal shellfish farming areas in northern China seas face frequent starfish outbreaks, particularly from Asterias amurensis and Patiria pectinifera, leading to significant economic losses. Genomic data are key to understanding the population dynamics and adaptive traits and developing effective control measures for these species. Here, we characterized and compared the genomic information of these two starfish using a whole-genome survey approach. The genome size of A. amurensis is ~477 Mb with 1.52% heterozygosity, 53.60% repetitive sequences, and 39.94% GC content, while P. pectinifera has a ~529 Mb genome, 2.90% heterozygosity, 56.02% repetitive sequences, and 40.63% GC content. Scaffold N50 values were 1823 bp for A. amurensis and 1328 bp for P. pectinifera. We identified 161,786 microsatellite motifs in A. amurensis and 316,245 in P. pectinifera, with mononucleotide repeats being the most common. A total of 171 single-copy homologous genes were found in A. amurensis, with 94 in P. pectinifera. For both species, KEGG annotation showed functional similarities in glycan biosynthesis, translation, metabolism, catabolism, and transport. The Pairwise Sequentially Markovian Coalescent (PSMC) analysis unveiled a bottleneck effect during the Pleistocene glaciation. Additionally, phylogenetic analysis of mitochondrial genomes indicates that P. pectinifera and Patiria miniata of the same genus belong to the same branch in the evolutionary tree as sister groups with the closest genetic relationship, while A. amurensis is most closely related to Astropecten polyacanthus within the class Asteroidea. These findings provide valuable genomic insights for both species.",
    "citationCount": 0,
    "referenceCount": 47
}