{
    "paperId": "d704a9cc47720aceabeabaa23611d1ab488d7c14",
    "title": "Overview of Sustainable Maritime Transport Optimization and Operations",
    "year": 2025,
    "venue": "Sustainability",
    "authors": [
        "Lang Xu",
        "Yalan Chen"
    ],
    "doi": "10.3390/su17146460",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d704a9cc47720aceabeabaa23611d1ab488d7c14",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the continuous expansion of global trade, achieving sustainable maritime transport optimization and operations has become a key strategic direction for transforming maritime transport companies. To summarize the current state of research and identify emerging trends in sustainable maritime transport optimization and operations, this study systematically examines representative studies from the past decade, focusing on three dimensions, technology, management, and policy, using data sourced from the Web of Science (WOS) database. Building on this analysis, potential avenues for future research are suggested. Research indicates that the technological field centers on the integrated application of alternative fuels, improvements in energy efficiency, and low-carbon technologies in the shipping and port sectors. At the management level, green investment decisions, speed optimization, and berth scheduling are emphasized as core strategies for enhancing corporate sustainable performance. From a policy perspective, attention is placed on the synergistic effects between market-based measures (MBMs) and governmental incentive policies. Existing studies primarily rely on multi-objective optimization models to achieve a balance between emission reductions and economic benefits. Technological innovation is considered a key pathway to decarbonization, while support from governments and organizations is recognized as crucial for ensuring sustainable development. Future research trends involve leveraging blockchain, big data, and artificial intelligence to optimize and streamline sustainable maritime transport operations, as well as establishing a collaborative governance framework guided by environmental objectives. This study contributes to refining the existing theoretical framework and offers several promising research directions for both academia and industry practitioners.",
    "citationCount": 4,
    "referenceCount": 194
}