{
    "paperId": "d74af0ecca00617501c399c5a9bc4ae8534c0aaa",
    "title": "Personalized Preference Drift Aware Sequential Recommender System",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "Nakarin Sritrakool",
        "Saranya Maneeroj"
    ],
    "doi": "10.1109/ACCESS.2021.3128769",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d74af0ecca00617501c399c5a9bc4ae8534c0aaa",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2021.3128769",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The user preference patterns are highly dynamic and develop over time. To address the drift of user preference patterns, most of the prior works for sequential recommendation categorize the user preference patterns into different patterns, e.g., short-term and long-term preference. However, the number of user preference patterns is pre-defined and identical for every user, resulting in the drift patterns regardless of the user’s actual drift points. Moreover, existing works recommend the next item by considering the whole historical sequence, which contains the noises from interactions irrelevant to the current user preference pattern. In this work, we propose a model to personalized detects drift of user preference patterns, called PPD. Our proposed method determines the actual drift of user preference patterns by capturing the changes in the characteristics of consecutive items throughout the historical sequence. The detected drift pattern allows PPD to partition the historical sequence into various sub-sequences which contain only a particular preference pattern. As a result, PPD delivers the recommendations relevant to the current user preference pattern by considering only the sub-sequences with similar preference patterns instead of utilizing the whole historical sequence. We conduct the experiments to verify the effectiveness of our proposed method by comparing PPD with the baselines aiming to model the user drift pattern for the recommendation. The experimental results show that our proposed method consistently outperforms the baselines on three benchmark datasets. Additionally, the experiment further shows that PPD delivers superior results when considering only the relevant periods rather than the whole sequence.",
    "citationCount": 11,
    "referenceCount": 46
}