{
    "paperId": "d75ad3733af12867b37aea7ac704d3dba04b9eb5",
    "title": "High Performance Deep Learning GPR Feature Detector Model for Potash Mining",
    "year": 2024,
    "venue": "International Conference on Electrical Engineering/Electronics, Computer, Telecommunications and Information Technology",
    "authors": [
        "Kaveh Sadeghikhah",
        "Raman Paranjape",
        "Victor Okonkwo"
    ],
    "doi": "10.1109/ECTI-CON60892.2024.10594890",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d75ad3733af12867b37aea7ac704d3dba04b9eb5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ground Penetrating Radar (GPR) has been an essential nondestructive geophysical tool in Saskatchewan's potash mines for over six decades. This innovative technology, used in conjunction with an active boring machine, facilitates realtime data collection, particularly for imaging the immediate clay seam (414-clay seam) above the mine roof. Its reliability is demonstrated by the accuracy with which the roof beam thickness (mine roof to 414-clay seam) is interpreted in realtime, crucial for making informed safety decisions during mining operations. The imperative for a robust auto-picking algorithm tailored to handle complexities in potash mine GPR data is emphasized. The previously developed algorithm called the Clustered Ratio Derivative (CRD) algorithm, employing unsupervised machine learning for realtime GPR interpretation showcased promising results. However, the CRD algorithm faces limitations due to potential sensitivity to variations in input data, especially in the presence of noise or anomalies. Geological variations, such as the presence of “stray clays” within the roof beam, pose challenges to the algorithm's performance and accuracy. In response to these challenges, this paper proposes a novel deep learning-based algorithm leveraging two distinct Convolutional Neural Network (CNN) architectures. These CNNs are designed to navigate the intricacies of the GPR data pattern specific to potash mines. The presented results indicate promising levels of accuracy, with the new method achieving 95.4% accuracy in detecting the 414-clay seam and an average of 88% accuracy in finding “stray clays” seen in the dataset when compared to a geophysicist interpretation. The overall analysis suggests that this new approach has the potential to detect mining room roof features with a high degree of accuracy.",
    "citationCount": 0,
    "referenceCount": 23
}