{
    "paperId": "d78e180a5c869d8a16665bcd841ccc0c285a8a41",
    "title": "Niche Partitioning and Intraspecific Variation of Thaumarchaeota in Deep Ocean Sediments.",
    "year": 2025,
    "venue": "Environmental Microbiology",
    "authors": [
        "Ronghua Liu",
        "Xinxin He",
        "Gaoyang Ren",
        "Da-Wei Li",
        "Meixun Zhao",
        "L. Lehtovirta-Morley",
        "J. Todd",
        "Xiaohua Zhang",
        "Jiwen Liu"
    ],
    "doi": "10.1111/1462-2920.70018",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d78e180a5c869d8a16665bcd841ccc0c285a8a41",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep-sea sediments contain a large number of Thaumarchaeota that are phylogenetically distinct from their pelagic counterparts. However, their ecology and evolutionary adaptations are not well understood. Metagenomic analyses were conducted on samples from various depths of a 750-cm sediment core collected from the Mariana Trench Challenger Deep. The abundance of Thaumarchaeota and archaeal amoA generally decreased with depth, except for an unexpected peak midway through the core. The thaumarchaeotal metagenome-assembled genomes were classified into diverse phylogenetic clusters associated with amoA-NP-γ, amoA-NP-θ, and amoA-NP-δ of ammonia-oxidising Thaumarchaeota and non-ammonia-oxidising lineages. The most abundant group was within amoA-NP-γ, which is usually found in coastal and shallow habitats, indicating potential niche expansion from marine shallow to hadal environments. This benthic group showed within-species genomic variations compared to the previously identified Hadal water group, suggesting microdiversification of hadal Thaumarchaeota along with niche separation between benthic and pelagic environments. Evolutionary adaptations associated with the benthic-to-pelagic transition included reduced genome size, loss of motility/cell adhesion, altered energy metabolism, and different mechanisms for substrate acquisition and regulation (e.g., ammonium). These findings offer new insights into the evolution of hadal Thaumarchaeota and demonstrate, for the first time, intraspecies-level genomic variation in Thaumarchaeota related to the benthic-versus-pelagic niche partitioning in the deep ocean.",
    "citationCount": 1,
    "referenceCount": 93
}