{
    "paperId": "d7bb5f8bbd0a2527d97fd4829c2a9edd03491878",
    "title": "Transfer Learning based Search Space Design for Hyperparameter Tuning",
    "year": 2022,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Yang Li",
        "Yu Shen",
        "Huaijun Jiang",
        "Tianyi Bai",
        "Wentao Zhang",
        "Ce Zhang",
        "Bin Cui"
    ],
    "doi": "10.1145/3534678.3539369",
    "arxivId": "2206.02511",
    "url": "https://www.semanticscholar.org/paper/d7bb5f8bbd0a2527d97fd4829c2a9edd03491878",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.02511",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The tuning of hyperparameters becomes increasingly important as machine learning (ML) models have been extensively applied in data mining applications. Among various approaches, Bayesian optimization (BO) is a successful methodology to tune hyperparameters automatically. While traditional methods optimize each tuning task in isolation, there has been recent interest in speeding up BO by transferring knowledge across previous tasks. In this work, we introduce an automatic method to design the BO search space with the aid of tuning history from past tasks. This simple yet effective approach can be used to endow many existing BO methods with transfer learning capabilities. In addition, it enjoys the three advantages: universality, generality, and safeness. The extensive experiments show that our approach considerably boosts BO by designing a promising and compact search space instead of using the entire space, and outperforms the state-of-the-arts on a wide range of benchmarks, including machine learning and deep learning tuning tasks, and neural architecture search.",
    "citationCount": 14,
    "referenceCount": 50
}