{
    "paperId": "d7ebfd64c8ff5b5c41eee71ebfff7d8e8075d049",
    "title": "NOBtree: A NUMA-Optimized Tree Index for Nonvolatile Memory",
    "year": 2024,
    "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "authors": [
        "Zhaole Chu",
        "Peiquan Jin",
        "Yongping Luo",
        "Xiaoliang Wang",
        "Shouhong Wan"
    ],
    "doi": "10.1109/TCAD.2024.3438111",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d7ebfd64c8ff5b5c41eee71ebfff7d8e8075d049",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nonvolatile memory (NVM) suffers from more serious nonuniform memory access (NUMA) effects than DRAM because of the lower bandwidth and higher latency. While numerous works have aimed at optimizing NVM indexes, only a few of them tried to address the NUMA impact. Existing approaches mainly rely on local NVM write buffers or DRAM-based read buffers to mitigate the cost of remote NVM access, which introduces memory overhead and causes performance degradation for lookup and scan operations. In this article, we present NOBtree, a new NUMA-optimized persistent tree index. The novelty of NOBtree is two-fold. First, NOBtree presents per-NUMA replication and an efficient node-migration mechanism to reduce remote NVM access. Second, NOBtree proposes a NUMA-aware NVM allocator to improve the insert performance and scalability. We conducted experiments on six workloads to evaluate the performance of NOBtree. The results show that NOBtree can effectively reduce the number of remote NVM accesses. Moreover, NOBtree outperforms existing persistent indexes, including TLBtree, Fast&Fair, ROART, and PACtree, by up to <inline-formula> <tex-math notation=\"LaTeX\">$3.23\\times $ </tex-math></inline-formula> in throughput and <inline-formula> <tex-math notation=\"LaTeX\">$4.07\\times $ </tex-math></inline-formula> in latency.",
    "citationCount": 1,
    "referenceCount": 22
}