{
    "paperId": "d7f54e7d263bd0ed2f1aeaac10acb285eadbef55",
    "title": "Measures and Metrics of ML Data and Models to Assure Reliable and Safe Systems",
    "year": 2024,
    "venue": "Reliability and Maintainability Symposium",
    "authors": [
        "Benjamin Werner",
        "Benjamin Schumeg",
        "Jon Vigil",
        "Shane N. Hall",
        "Benjamin G. Thengvall",
        "Mikel D Petty"
    ],
    "doi": "10.1109/RAMS51492.2024.10457615",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d7f54e7d263bd0ed2f1aeaac10acb285eadbef55",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The US Army solicited partners through a Broad Agency Announcement to propose solutions under a Small Business Technology Transfer contract mechanism for the program “Metrics and Methods for Verification, Validation, Assurance and Trust of Machine Learning Models & Data for Safety-Critical Applications in Armaments Systems.” OptTek Systems, Inc. and University of Alabama in Huntsville (UAH) were one of the selected proposals for Phase I. Under this contract agreement OptTek and UAH set the goal to research & develop (R&D) fundamental metrics & measures for the certification & qualification of ML training data sets & models. Of particular note, the use of a safety score calculated from the accuracy as well as a dedicated look at data quality have been demonstrated as reasonable approaches to the proposed topic. As the Technical Point of Contact for this effort, the US Army Combat Capabilities Development Command Armaments Center (DEVCOM AC) authored the topic and provided guidance on the effort to align with mission objectives. This paper is an exploration of the research and development conducted by OptTek and UAH within the framework of how it may be applied to the assurance of systems to be developed by the US Army and augment practices in reliability and safety.",
    "citationCount": 1,
    "referenceCount": 17
}