{
    "paperId": "d800c2da0afbb92946c28392ffc3f7aaa7b17870",
    "title": "Enhancing Search and Recommendation Systems with AI-Powered Semantic Indexing and Multi-Modal Integration: An Evaluation Using OpenAI’s Embedding API and PineconeDB",
    "year": 2024,
    "venue": "2024 13th International Conference on Computer Technologies and Development (TechDev)",
    "authors": [
        "Xinke Wang",
        "Yu Sun"
    ],
    "doi": "10.1109/TechDev64369.2024.00018",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d800c2da0afbb92946c28392ffc3f7aaa7b17870",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research paper explores the development and evaluation of a recommendation and search algorithm using OpenAI’s embedding API and PineconeDB, focusing on creating an accessible, efficient, and scalable system capable of handling multimodal content [1]. The study is divided into several sections, including a comprehensive introduction to the challenges and proposed solutions for modern search systems, detailed method analysis, and experimental validation. Two primary experiments were conducted: the first assessed the search algorithm’s semantic indexing accuracy with different datasets, and the second tested the system’s capability to handle searches involving both textual and visual data. Results from the first experiment indicated that while the system performs exceptionally well with semantically rich content (92% accuracy), it struggles with content of lower semantic quality (58% accuracy), highlighting the need for advanced semantic processing techniques. The second experiment demonstrated the system’s proficiency in multi-modal searches, achieving an average precision of 87% and recall of 80%, confirming its suitability for complex search tasks across various data types. These findings validate the effectiveness of using vector embeddings in improving search and recommendation systems, while also pointing out areas for future enhancement, particularly in handling content with vague or sparse semantic details. This paper contributes to the ongoing discussion about the feasibility and efficiency of building sophisticated search systems using state-of-the-art AI technologies [2].",
    "citationCount": 0,
    "referenceCount": 15
}