{
    "paperId": "d8cfd63c52a8021f5eae6f777a263755ef771369",
    "title": "Digital Twin of Microgrid for Predictive Power Control to Buildings",
    "year": 2024,
    "venue": "Sustainability",
    "authors": [
        "Hao Jiang",
        "Rudy Tjandra",
        "C. B. Soh",
        "Shuyu Cao",
        "D. Soh",
        "K. T. Tan",
        "K. J. Tseng",
        "Siva Bala Krishnan"
    ],
    "doi": "10.3390/su16020482",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d8cfd63c52a8021f5eae6f777a263755ef771369",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2071-1050/16/2/482/pdf?version=1704446104",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The increased focus on sustainability in response to climate change has given rise to many new initiatives to meet the rise in building load demand. The concept of distributed energy resources (DER) and optimal control of supply to meet power demands in buildings have resulted in growing interest to adopt microgrids for a precinct or a university campus. In this paper, a model for an actual physical microgrid has been constructed in OPAL-RT for real-time simulation studies. The load demands for SIT@NYP campus and its weather data are collected to serve as input to run on the digital twin model of DERs of the microgrid. The dynamic response of the microgrid model in response to fluctuations in power generation due to intermittent solar PV generation and load demands are examined via real-time simulation studies and compared with the response of the physical assets. It is observed that the simulation results match closely to the performance of the actual physical asset. As such, the developed microgrid model offers plug-and-play capability, which will allow power providers to better plan for on-site deployment of renewable energy sources and energy storage to match the expected building energy demand.",
    "citationCount": 10,
    "referenceCount": 8
}