{
    "paperId": "d910d16c8e3fab1af66105b6244d91c3da41693f",
    "title": "Training Infrastructure as a Service",
    "year": 2022,
    "venue": "GigaScience",
    "authors": [
        "H. Rasche",
        "Cameron J. Hyde",
        "John Davis",
        "Simon L. Gladman",
        "Nate Coraor",
        "A. Bretaudeau",
        "G. Cuccuru",
        "W. Bacon",
        "Beatriz Serrano-Solano",
        "Jennifer Hillman-Jackson",
        "Saskia D. Hiltemann",
        "Miaomiao Zhou",
        "Bjorn Gruening",
        "A. Stubbs"
    ],
    "doi": "10.1093/gigascience/giad048",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d910d16c8e3fab1af66105b6244d91c3da41693f",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/gigascience/article-pdf/doi/10.1093/gigascience/giad048/50784316/giad048.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Background Hands-on training, whether in bioinformatics or other domains, often requires significant technical resources and knowledge to set up and run. Instructors must have access to powerful compute infrastructure that can support resource-intensive jobs running efficiently. Often this is achieved using a private server where there is no contention for the queue. However, this places a significant prerequisite knowledge or labor barrier for instructors, who must spend time coordinating deployment and management of compute resources. Furthermore, with the increase of virtual and hybrid teaching, where learners are located in separate physical locations, it is difficult to track student progress as efficiently as during in-person courses. Findings Originally developed by Galaxy Europe and the Gallantries project, together with the Galaxy community, we have created Training Infrastructure-as-a-Service (TIaaS), aimed at providing user-friendly training infrastructure to the global training community. TIaaS provides dedicated training resources for Galaxy-based courses and events. Event organizers register their course, after which trainees are transparently placed in a private queue on the compute infrastructure, which ensures jobs complete quickly, even when the main queue is experiencing high wait times. A built-in dashboard allows instructors to monitor student progress. Conclusions TIaaS provides a significant improvement for instructors and learners, as well as infrastructure administrators. The instructor dashboard makes remote events not only possible but also easy. Students experience continuity of learning, as all training happens on Galaxy, which they can continue to use after the event. In the past 60 months, 504 training events with over 24,000 learners have used this infrastructure for Galaxy training.",
    "citationCount": 1,
    "referenceCount": 29
}