{
    "paperId": "d91fbf3b9d0b8e9bdd011d27a5f9fb8675234fa3",
    "title": "Novel Defense Method of Malicious Code Injection in High Concurrency Database",
    "year": 2024,
    "venue": "2024 3rd International Conference on Sentiment Analysis and Deep Learning (ICSADL)",
    "authors": [
        "Zhiyong Cao"
    ],
    "doi": "10.1109/ICSADL61749.2024.00084",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d91fbf3b9d0b8e9bdd011d27a5f9fb8675234fa3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research study presents a novel defense method against malicious code injection in high concurrency databases. The proposed approach combines a reliable high concurrency database design with a defense model that emphasizes the importance of robustness, accuracy, and speed. The system incorporates a caching model to optimize response speed and introduces a multi-core HTTP server based on Node.js for efficient high concurrency processing. To protect against code injection, a randomization algorithm is applied that adds random prefixes to HTML and J avaScript keywords in trusted server-side code. This algorithm ensures that the random prefixes are time-sensitive, making the system more resilient to dynamic attacks. Two security modules, a randomization module and a random prefix parser module, work in tandem to identify and filter out potential attacks, particularly XSS vulnerabilities. Experimental results demonstrate the superiority of the proposed method in maintaining high and stable detection accuracy (97% to 99%) compared to alternative approaches, demonstrating its reliability in defending against potential threats. This research provides an innovative solution to improve the security and performance of distributed systems facing high concurrency challenges.",
    "citationCount": 0,
    "referenceCount": 27
}