{
    "paperId": "d9372755f8849540909e191eeb290f8d5b603817",
    "title": "The Missing Data Imputation Method for Medical Data Classification Using Most Probable Value",
    "year": 2025,
    "venue": "International Conference on Communication Systems and Network Technologies",
    "authors": [
        "B. Tarle",
        "Vaishali Tidake",
        "Rupali D. Tajanpure",
        "Ratnesh Litoriya"
    ],
    "doi": "10.1109/CSNT64827.2025.10968852",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d9372755f8849540909e191eeb290f8d5b603817",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In medical data classification, improving the performance of classification is essential when the dataset's size is small, and some attributes' values need to be included. Classification performance can suffer if the training dataset starts with insufficient data samples. The challenges like overfitting, high variance, inability to find real performance of model, biased models, sensitivity to noise, improper evaluation occurs with small dataset. The proposed algorithm uses domain-based multiple imputations to create additional data tuples and appends these tuples to the originally available training data. This improves the classification power of the classifier. This proposed technique uses a set of domain values to impute missing attribute values. The accuracy of imputed tuples is verified using classifier filters. The proposed technique significantly improves the classification performance of the classifier. This technique is suitable for small to medium-sized data sets. Data imputation helps develop improved and more accurate classifiers. The proposed approach offers improved classification performance. The proposed method achieves a 4.01% improvement in the classification accuracy of fuzzy neural network FBNFC. We performed two hypothesis tests, the t-test, and the Wilcoxon rank sum test. It is observed that the alternative hypothesis is true.",
    "citationCount": 0,
    "referenceCount": 30
}