{
    "paperId": "d93a9154e7f690fe8596d51bfebf977022693e1f",
    "title": "Cascaded Segmented Matting Network for Human Matting",
    "year": 2021,
    "venue": "IEEE Access",
    "authors": [
        "Bo Liu",
        "Haipeng Jing",
        "Guangzhi Qu",
        "H. Guesgen"
    ],
    "doi": "10.1109/ACCESS.2021.3125356",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d93a9154e7f690fe8596d51bfebf977022693e1f",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/access.2021.3125356",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Human matting, high quality extraction of humans from natural images, is crucial for a wide variety of applications such as virtual reality, augmented reality, entertainment and so on. Since the matting problem is an ill-posed problem, most previous methods rely on extra user inputs such as trimap or scribbles as guidance to estimate alpha value for the pixels that are in the unknown region of the trimap. This phenomenon makes it difficult to be applied to large scale data. In order to solve these problems, we studied the unique role of semantics and details in image matting, and decomposed the matting task into two sub-tasks: trimap segmentation based on high-level semantic information and alpha regression based on low-level detailed information. Specifically, we proposed a novel Cascaded Segmented Matting Network (CSMNet), which uses a shared encoder and two separate decoders to learn these two tasks in a collaborative way to achieve the end-to-end human image matting. In addition, we established a large-scale dataset with 14,000 fine-labeled human matting images. A background dataset is also built to simulate real pictures. Comprehensive empirical studies on above datasets demonstrate that CSMNet could produce a stable and accurate alpha matte without the input of trimap and achieve an evaluation value that is comparable to the algorithm that requires trimap.",
    "citationCount": 2,
    "referenceCount": 32
}