{
    "paperId": "d9664a81445ab67c8b1c22ff8756388ac860ba71",
    "title": "Improving DBMS Scheduling Decisions with Accurate Performance Prediction on Concurrent Queries",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Ziniu Wu",
        "Markos Markakis",
        "Chunwei Liu",
        "Peter Baille Chen",
        "B. Narayanaswamy",
        "T. Kraska",
        "Samuel Madden"
    ],
    "doi": "10.14778/3749646.3749686",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d9664a81445ab67c8b1c22ff8756388ac860ba71",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Query scheduling is a critical task that directly impacts query performance in database management systems (DBMS). Deeply integrated schedulers, which require changes to DBMS internals, are usually customized for a specific engine and can take months to implement. In contrast, non-intrusive schedulers make coarse-grained decisions, such as controlling query admission and re-ordering query execution, without requiring modifications to DBMS internals. They require much less engineering effort and can be applied across a wide range of DBMS engines, offering immediate benefits to end users. However, most existing non-intrusive scheduling systems rely on simplified cost models and heuristics that cannot accurately model query interactions under concurrency and different system states, possibly leading to suboptimal scheduling decisions.\n \n This work introduces\n IconqSched\n , a new, principled non-intrusive scheduler that optimizes the execution order and timing of queries to enhance total end-to-end runtime as experienced by the user — query queuing time plus system runtime. Unlike previous approaches,\n IconqSched\n features a novel predictor,\n Iconq\n , which treats the DBMS as a black box and accurately estimates the system runtime of concurrently executed queries under different system states. Using these predictions,\n IconqSched\n is able to capture system runtime variations across different query mixes and system loads. It then employs a greedy scheduling algorithm to effectively determine which queries to submit and when to submit them. We compare\n IconqSched\n to other schedulers in terms of end-to-end runtime using realistic workload traces. On Postgres, IconqSched reduces end-to-end runtime by up to 16.5% on average and 33.6% in the tail. Similarly, on Redshift, it reduces end-to-end runtime by up to 14.4% on average and 22.9% in the tail.\n",
    "citationCount": 0,
    "referenceCount": 78
}