{
    "paperId": "d973a905c4ae4efa471d0c74eabbb16e15c93833",
    "title": "Tourism Destination Article Search Features using TF-IDF and Cosine similarity",
    "year": 2023,
    "venue": "DIELEKTRIKA",
    "authors": [
        "Mizanul Ridho Aohana",
        "Fitri Bimantoro",
        "Mizanul Ridho",
        "Aohana"
    ],
    "doi": "10.29303/dielektrika.v10i2.338",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d973a905c4ae4efa471d0c74eabbb16e15c93833",
    "isOpenAccess": true,
    "openAccessPdf": "http://dielektrika.unram.ac.id/index.php/dielektrika/article/download/338/235",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the current digital era, the increasing public interest in searching for information about travel destinations necessitates an effective and accurate search system. However, search results for travel destination articles often yield irrelevant or inadequate outcomes. To address this issue, this paper proposes applying the Term Frequency-Inverse Document Frequency (TF-IDF) algorithm and Cosine Similarity in the search feature for travel destination articles. By employing these algorithms, the search system is anticipated to deliver more relevant and accurate results according to user needs. \nThis research contributes to developing an effective search system for travel destination articles, assisting users in obtaining relevant and high-quality information about the destinations they are searching for. The methodology involves collecting data on travel destination articles, implementing the TF-IDF algorithm to evaluate term importance, and utilizing Cosine Similarity to measure the similarity between articles and user queries. \nThe study results demonstrate that implementing the TF-IDF algorithm and Cosine Similarity in the search feature for travel destination articles enhances the accuracy and relevance of search results. Users can quickly discover articles that align with their queries, improving their search experience. In conclusion, this research highlights that applying the TF-IDF algorithm and Cosine Similarity in the search feature significantly improves the accuracy and relevance of search results for travel destination articles. This enhances the search experience for users seeking information about travel destinations.",
    "citationCount": 0,
    "referenceCount": 18
}