{
    "paperId": "d98d325e7f63359d6c8068731b0bb6b15610958a",
    "title": "Adaptive neuro-fuzzy inference system for customizing investment type based on the potential investors’ demographics and feedback",
    "year": 2023,
    "venue": "Journal of Big Data",
    "authors": [
        "A. Asemi",
        "A. Asemi",
        "Andrea Ko"
    ],
    "doi": "10.1186/s40537-023-00784-7",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d98d325e7f63359d6c8068731b0bb6b15610958a",
    "isOpenAccess": true,
    "openAccessPdf": "https://journalofbigdata.springeropen.com/counter/pdf/10.1186/s40537-023-00784-7",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The proposed model is an adaptive neuro-fuzzy inference recommender system that utilizes customer investment service feedback and fuzzy neural inference solutions to generate personalized investment recommendations. The model is designed to support the investment process for the customers and takes into consideration seven factors to implement the proposed investment system model through the customer or potential investor data set. These include demographic data and investment type. The model is divided into three main phases: data gathering, data analysis, and decision-making. In the data gathering phase, initial data is collected through a web-based platform, and in the data analysis phase, the potential investors' demographic criteria are extracted and grouped, and the types of investments are then clustered. The output obtained is transferred to the ANFIS layer, and investment-type recommendations are extracted for each group of potential investors. Investor feedback is received to improve and develop the system. JMP and MATLAB are used to propose the model, which serves as a framework for investment recommender systems. It demonstrates how to use this framework to offer pertinent and precise recommendations for the best sort of investment type to potential and present investors by combining the expertise of the experts and the demographic information of potential investors. Overall, this paper provides a new, novel model for investment recommender systems, which can assist investment companies, individual investors, and fund managers in their investment decisions.",
    "citationCount": 5,
    "referenceCount": 35
}