{
    "paperId": "d9b5e43ab7ebfc1164f1b129787b6c14abed3a16",
    "title": "Cache Management in Information-Centric Networks using Convolutional Neural Network",
    "year": 2020,
    "venue": "Global Communications Conference",
    "authors": [
        "Kelvin H. T. Chiu",
        "Jun Zhang",
        "B. Bensaou"
    ],
    "doi": "10.1109/GLOBECOM42002.2020.9347965",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d9b5e43ab7ebfc1164f1b129787b6c14abed3a16",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Traditional cache algorithms for information centric networks cache every seen item and rely on simple statistics, such as usage recency, to determine the target for replacement. While they result in a simple and efficient O(1) algorithms, such simple statistics perform poorly when dealing with realistic request patterns, that are non-uniform and that often exhibit daily, weekly and monthly seasonality. As the computational power of processors increased dramatically over the years, it is worth trying to use more complex cache algorithms in order to yield better performance. In this paper, we investigate the use of convolutional neural networks as a means to capture the seasonal patterns in the requests stream, and propose a cache algorithm that is able to consider seasonality and make decisions accordingly. We implement our cache algorithm by building an interface to the real-world ICN forwarder from the CICN open source project, the so-called Metis forwarder; and conduct our experiments on a real-world dataset representing the access statistics of Wikipedia to demonstrate the effectiveness of our algorithm.",
    "citationCount": 3,
    "referenceCount": 17
}