{
    "paperId": "d9c836f636366c1280cef3a4a645ca9f9d74f569",
    "title": "Machine learning in healthcare strategic management: a systematic literature review",
    "year": 2023,
    "venue": "Arab Gulf Journal of Scientific Research",
    "authors": [
        "S. Salhout"
    ],
    "doi": "10.1108/agjsr-06-2023-0252",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d9c836f636366c1280cef3a4a645ca9f9d74f569",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.emerald.com/insight/content/doi/10.1108/AGJSR-06-2023-0252/full/pdf?title=machine-learning-in-healthcare-strategic-management-a-systematic-literature-review",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "PurposeThis study specifically seeks to investigate the strategic implementation of machine learning (ML) algorithms and techniques in healthcare institutions to enhance innovation management in healthcare settings.Design/methodology/approach The papers from 2011 to 2021 were considered following the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. First, relevant keywords were identified, and screening was performed. Bibliometric analysis was performed. One hundred twenty-three relevant documents that passed the eligibility criteria were finalized.Findings Overall, the annual scientific production section results reveal that ML in the healthcare sector is growing significantly. Performing bibliometric analysis has helped find unexplored areas; understand the trend of scientific publication; and categorize topics based on emerging, trending and essential. The paper discovers the influential authors, sources, countries and ML and healthcare management keywords.Research limitations/implications The study helps understand various applications of ML in healthcare institutions, such as the use of Internet of Things in healthcare, the prediction of disease, finding the seriousness of a case, natural language processing, speech and language-based classification, etc. This analysis would help future researchers and developers target the healthcare sector areas that are likely to grow in the coming future.Practical implications The study highlights the potential for ML to enhance medical support within healthcare institutions. It suggests that regression algorithms are particularly promising for this purpose. Hospital management can leverage time series ML algorithms to estimate the number of incoming patients, thus increasing hospital availability and optimizing resource allocation. ML has been instrumental in the development of these systems. By embracing telemedicine and remote monitoring, healthcare management can facilitate the creation of online patient surveillance and monitoring systems, allowing for early medical intervention and ultimately improving the efficiency and effectiveness of medical services.Originality/value By offering a comprehensive panorama of ML's integration within healthcare institutions, this study underscores the pivotal role of innovation management in healthcare. The findings contribute to a holistic understanding of ML's applications in healthcare and emphasize their potential to transform and optimize healthcare delivery.",
    "citationCount": 3,
    "referenceCount": 46
}