{
    "paperId": "d9e1cadb384089b0fd9a6d594c82643a37e4aa96",
    "title": "Interest Development, Knowledge Learning, and Interactive IR: Toward a State-based Approach to Search as Learning",
    "year": 2021,
    "venue": "Conference on Human Information Interaction and Retrieval",
    "authors": [
        "Jiqun Liu",
        "Yong Ju Jung"
    ],
    "doi": "10.1145/3406522.3446015",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/d9e1cadb384089b0fd9a6d594c82643a37e4aa96",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To support complex search tasks that involve prolonged search sessions and learning goals of varying difficulty, information retrieval (IR) researchers need a more comprehensive understanding of in-situ learning progresses and related factors. Among many cognitive factors associated with learning and searching, we consider interest development as an important dimension because it significantly affects users' learning performances but still remains understudied in interactive IR (IIR). To address this gap, our perspective paper proposes an interest-search-learning (ISL) model to reconceptualize learning in search and characterize the dynamic interplay of interest development, knowledge learning, and searching. Specifically, it achieves three interrelated goals: 1) characterizing the interactions between interest development, learning, and search behaviors; 2) synthesizing and proposing useful measures for capturing in-situ progresses and state variations in interest development and knowledge learning related to search behaviors; 3) identifying new research questions and directions linked to conceptualizing, building, and evaluating learning-centric IR systems. This paper uniquely integrates findings from three research communities (i.e. interest development, learning, IIR) into a cohesive framework and better structures our understanding of the multidimensional cognitive changes in search as learning (SAL). Including the exploration of interest development in SAL research will expand both conceptual and practical visions of AI-assisted learning.",
    "citationCount": 21,
    "referenceCount": 83
}