{
    "paperId": "da322bfa5352c19b540756e4b7fc146a6f0d8b02",
    "title": "IR like a SIR: Sense-enhanced Information Retrieval for Multiple Languages",
    "year": 2021,
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "authors": [
        "Rexhina Blloshmi",
        "Tommaso Pasini",
        "Niccolò Campolungo",
        "Somnath Banerjee",
        "Roberto Navigli",
        "G. Pasi"
    ],
    "doi": "10.18653/v1/2021.emnlp-main.79",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/da322bfa5352c19b540756e4b7fc146a6f0d8b02",
    "isOpenAccess": true,
    "openAccessPdf": "https://aclanthology.org/2021.emnlp-main.79.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the advent of contextualized embeddings, attention towards neural ranking approaches for Information Retrieval increased considerably. However, two aspects have remained largely neglected: i) queries usually consist of few keywords only, which increases ambiguity and makes their contextualization harder, and ii) performing neural ranking on non-English documents is still cumbersome due to shortage of labeled datasets. In this paper we present SIR (Sense-enhanced Information Retrieval) to mitigate both problems by leveraging word sense information. At the core of our approach lies a novel multilingual query expansion mechanism based on Word Sense Disambiguation that provides sense definitions as additional semantic information for the query. Importantly, we use senses as a bridge across languages, thus allowing our model to perform considerably better than its supervised and unsupervised alternatives across French, German, Italian and Spanish languages on several CLEF benchmarks, while being trained on English Robust04 data only. We release SIR at https://github.com/SapienzaNLP/sir.",
    "citationCount": 12,
    "referenceCount": 53
}