{
    "paperId": "da6790db2c5f4ae4fe1c6fe3fe25c6188fcd6d76",
    "title": "Intelligent Analytics for Educational Big Data and Its Application to Instructional Management",
    "year": 2025,
    "venue": "Applied Mathematics and Nonlinear Sciences",
    "authors": [
        "Nan Zhang"
    ],
    "doi": "10.2478/amns-2025-0002",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/da6790db2c5f4ae4fe1c6fe3fe25c6188fcd6d76",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract In today’s rapid development of information technology, the use of big data to carry out educational management work in colleges and universities has gradually become the main model for the development of educational management in colleges and universities. Based on data mining technology, this paper constructs a model for student academic early warning and designs an academic early warning system using an XGBoost model. The study analyzes the student achievement and behavior data from Lanzhou University of Technology, clusters the student-generated in-school behaviors using the DBSCAN method, and examines the relationship between borrowing behavior, consumption behavior, and student achievement. It was concluded that there exists a difference between students with good grades and those with failing grades. The performance of the XGB model proposed in this paper was tested with an accuracy of 96%. Subsequently, the distribution of students’ academic performance was studied from different majors and courses, and the Pearson coefficient was used to study the correlation between different semester GPAs and students’ grades. Moreover, finally, it was concluded that second-semester learning indexes have a greater impact on students’ academic performance through feature correlation.",
    "citationCount": 0,
    "referenceCount": 14
}