{
    "paperId": "da74433fe54d2927e3379f0677861e6700af65a3",
    "title": "Continuation Path Learning for Homotopy Optimization",
    "year": 2023,
    "venue": "International Conference on Machine Learning",
    "authors": [
        "Xi Lin",
        "Zhiyuan Yang",
        "Xiao-Yan Zhang",
        "Qingfu Zhang"
    ],
    "doi": "10.48550/arXiv.2307.12551",
    "arxivId": "2307.12551",
    "url": "https://www.semanticscholar.org/paper/da74433fe54d2927e3379f0677861e6700af65a3",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2307.12551",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Homotopy optimization is a traditional method to deal with a complicated optimization problem by solving a sequence of easy-to-hard surrogate subproblems. However, this method can be very sensitive to the continuation schedule design and might lead to a suboptimal solution to the original problem. In addition, the intermediate solutions, often ignored by classic homotopy optimization, could be useful for many real-world applications. In this work, we propose a novel model-based approach to learn the whole continuation path for homotopy optimization, which contains infinite intermediate solutions for any surrogate subproblems. Rather than the classic unidirectional easy-to-hard optimization, our method can simultaneously optimize the original problem and all surrogate subproblems in a collaborative manner. The proposed model also supports real-time generation of any intermediate solution, which could be desirable for many applications. Experimental studies on different problems show that our proposed method can significantly improve the performance of homotopy optimization and provide extra helpful information to support better decision-making.",
    "citationCount": 11,
    "referenceCount": 91
}