{
    "paperId": "da7f4309aca7033b350d9682bd9116c6e4e3e09d",
    "title": "A narrative review of deep learning applications in sports performance analysis: current practices, challenges, and future directions",
    "year": 2025,
    "venue": "BMC Sports Science, Medicine and Rehabilitation",
    "authors": [
        "Yunke Jia",
        "Norli Anida Abdullah",
        "Hafiz Eliza",
        "Qingbo Lu",
        "Deyou Si",
        "Hengwei Guo",
        "Wenliang Wang"
    ],
    "doi": "10.1186/s13102-025-01294-0",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/da7f4309aca7033b350d9682bd9116c6e4e3e09d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background The integration of deep learning techniques into sports performance analysis has significantly advanced athlete monitoring, motion tracking, and predictive modelling. These advancements have significantly improved the ability to assess performance, optimize training strategies, and reduce injury risks. However, despite notable progress, challenges remain in standardizing methodologies, ensuring model reliability, and enhancing real-time application across various sports disciplines. Methods We conducted a systematic literature search of Web of Science Core Collection (WOS), China National Knowledge Infrastructure (CNKI), and Association for Computing Machinery Digital Library (ACM DL) for relevant studies published from 2015 to 2024, with no language restrictions. Eligible studies were those that explicitly applied deep learning techniques (such as convolutional and recurrent neural networks) to sports performance analysis tasks (e.g., action recognition and classification, motion detection and tracking, injury prediction) and reported their methodology and performance metrics. Key data, including sport type, application domain, and model type, were extracted for narrative synthesis. Results A total of 51 studies met the inclusion criteria, covering a broad range of individual and team sports. Deep learning techniques in sports performance analysis were chiefly employed for action recognition, object detection and multi-target tracking, target classification, and performance or injury prediction. CNNs were the most common models for visual recognition tasks, while RNNs (including LSTMs) were frequently used for temporal sequence data. Most studies reported improved performance outcomes with deep learning; however, we observed considerable variability in data quality, model validation approaches, and cross-sport generalizability. Conclusions Deep learning has demonstrated transformative potential in optimizing sports performance analysis by providing automated, data-driven insights. Future research should prioritize integrating multi-modal data sources, refining real-time analytics, and improving the adaptability of deep learning techniques across different sports contexts to support more precise and data-driven performance assessments.",
    "citationCount": 0,
    "referenceCount": 70
}