{
    "paperId": "da9f55ba648a002b3c6eb97941c97e353c68caf4",
    "title": "Characteristics of SARS-CoV-2 variants and potential co-infected pathogens in hospitalized patients based on metagenomic next-generation sequencing",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Xinxin Li",
        "Chenyue Tang",
        "Min Zhou",
        "Jianqing Mi",
        "Jialin Liu",
        "Lizhong Han",
        "Xiaoqi Yu",
        "Xinxin Zhang"
    ],
    "doi": "10.1038/s41598-025-04111-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/da9f55ba648a002b3c6eb97941c97e353c68caf4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Metagenomic next-generation sequencing (mNGS) is widely used to diagnose complex infections in hospitalized patients, particularly those associated with COVID-19 which has garnered significant concern over the past five years. To investigate the molecular epidemic of the viral variant and the potential co-infection pathogens, we conducted retrospective mNGS analysis of 254 SARS-CoV-2-positive specimens collected from 200 hospitalized patients between March and September 2023. Phylogenetic analysis of the identified Omicron subvariants showed minimal evolutionary divergence, with no association between sub-lineages and pneumonia severity. Notably, mNGS demonstrated enhanced detection of polymicrobial coinfections, identifying bacterial, fungal, and viral co-pathogens in 92.5% (185/200) of cases. Pneumonia severity was associated with advanced age (proportion of elderly patients: 61.1 vs 78.3%; p = 0.032) and comorbid conditions, particularly diabetes mellitus (OR 2.03, 95% CI 1.03–4.02, p = 0.041), but showed no correlation with SARS-CoV-2 sub-lineages or coinfecting pathogens. While mNGS enhances coinfection diagnosis, COVID-19 outcomes are predominantly driven by host factors rather than Omicron subvariant evolution. Prioritized monitoring of elderly and comorbid individuals remained critical for severe pneumonia management.",
    "citationCount": 1,
    "referenceCount": 49
}