{
    "paperId": "dab49c93c358b78449623b25f989058989a0cabe",
    "title": "Natural Language Query to SQL query generation using LSTMs, Transformers, LLMs and Gen AI",
    "year": 2025,
    "venue": "American Journal of Technology",
    "authors": [
        "Rama Krishna Raju Samantapudi",
        "Mukesh Reddy Dhanagari",
        "Sai Tarun"
    ],
    "doi": "10.58425/ajt.v4i1.352",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dab49c93c358b78449623b25f989058989a0cabe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aim: This study examined and assessed how these more sophisticated models, Long Short-Term Memory (LSTM) networks, Transformer architectures, and Large Language Models, can automate SQL query generation from natural language input. \nMethods: Benchmark datasets from finance and e-commerce domains were drawn upon and compared to evaluate the models’ ability to respond to different query complexities. \nResults: Transformer-based models with self-attention mechanisms outperformed LSTMs in handling long-range dependencies and complicated query structures by degrees, outperforming LSTMs by 87 % compared to 72 % of LSTMs. SQL generation performance was further enhanced by LLMs like GPT-3, which allowed them to produce more humanlike, context-aware query formulation even where inputs were ambiguous or incomplete. They demonstrated a reduction in the need for skilled professionals for database and increased operational efficiency in data-intensive industries. \nConclusion: The study shows the potential of generative AI for database querying systems and the importance of being responsible with its release. \nRecommendations: Ensuring explainability standards, secure data handling protocols, and regular bias audits must be proactively enforced to address ethical and legal challenges, especially on data privacy, model transparency, and algorithmic bias. These results support the growing trend of applying AI to query systems that are more adaptive, scalable, and usable for nontechnical users in enterprise environments.",
    "citationCount": 0,
    "referenceCount": 59
}