{
    "paperId": "dac55b156e0be2c34a26c0879d92ce9085444654",
    "title": "A Comprehensive Survey on Self-Interpretable Neural Networks",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Yang Ji",
        "Ying Sun",
        "Yuting Zhang",
        "Zhigaoyuan Wang",
        "Yuanxin Zhuang",
        "Zheng Gong",
        "Dazhong Shen",
        "Chuan Qin",
        "Hengshu Zhu",
        "Hui Xiong"
    ],
    "doi": "10.48550/arXiv.2501.15638",
    "arxivId": "2501.15638",
    "url": "https://www.semanticscholar.org/paper/dac55b156e0be2c34a26c0879d92ce9085444654",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks have achieved remarkable success across various fields. However, the lack of interpretability limits their practical use, particularly in critical decision-making scenarios. Post-hoc interpretability, which provides explanations for pre-trained models, is often at risk of robustness and fidelity. This has inspired a rising interest in self-interpretable neural networks, which inherently reveal the prediction rationale through the model structures. Although there exist surveys on post-hoc interpretability, a comprehensive and systematic survey of self-interpretable neural networks is still missing. To address this gap, we first collect and review existing works on self-interpretable neural networks and provide a structured summary of their methodologies from five key perspectives: attribution-based, function-based, concept-based, prototype-based, and rule-based self-interpretation. We also present concrete, visualized examples of model explanations and discuss their applicability across diverse scenarios, including image, text, graph data, and deep reinforcement learning. Additionally, we summarize existing evaluation metrics for self-interpretability and identify open challenges in this field, offering insights for future research. To support ongoing developments, we present a publicly accessible resource to track advancements in this domain: https://github.com/yangji721/Awesome-Self-Interpretable-Neural-Network.",
    "citationCount": 10,
    "referenceCount": 314
}