{
    "paperId": "db062961c47a4e70ef6d48c40341ff5e326a260a",
    "title": "AUTOMATIC DETECTION AND GRADING OF DIABETIC MACULAR EDEMA BASED ON A DEEP NEURAL NETWORK",
    "year": 2022,
    "venue": "Retina",
    "authors": [
        "Xiaoxin Guo",
        "Xinfeng Lu",
        "Baoliang Zhang",
        "Xiaoying Hu",
        "Songtian Che"
    ],
    "doi": "10.1097/IAE.0000000000003434",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db062961c47a4e70ef6d48c40341ff5e326a260a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To solve the problem of automatic grading of macular edema in retinal images in a more stable and reliable way, an automatic detection and grading method of diabetic macular edema based on DNN is proposed. Purpose: To solve the problem of automatic grading of macular edema in retinal images in a more stable and reliable way and reduce the workload of ophthalmologists, an automatic detection and grading method of diabetic macular edema based on a deep neural network is proposed. Methods: The enhanced green channels of fundus images are input into the YOLO network for training and testing. Diabetic macular edema is graded according to the distance of the macula and hard exudate. We used multiscale feature fusion to form more comprehensive features on different grain images to improve the effect of hard exudate detection. We adopted K-means++ algorithm to cluster anchor box size and use LGIoU loss of the original network to guide the regression of hard exudate bounding box and improve the regression accuracy of anchor boxes. We increased the diversity of samples for sample training by data augmentation, including cropping, flipping, and rotating of fundus images, so that each batch of training data can better represent the distribution of samples. Results: The detection accuracy of the proposed method can reach 96% on the MESSIDOR data set. The detection rates of hard exudate with high, median, and low probability are 100%, 79.12%, and 60.40%, respectively. Conclusion: The proposed method exhibits a very good detection stability on healthy and diseased fundus images.",
    "citationCount": 6,
    "referenceCount": 35
}