{
    "paperId": "db0e1ebea97828ee8fc10e5ae19099215a159a46",
    "title": "OTAD: An Optimal Transport-Induced Robust Model for Agnostic Adversarial Attack",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Kuo Gai",
        "Sicong Wang",
        "Shihua Zhang"
    ],
    "doi": "10.48550/arXiv.2408.00329",
    "arxivId": "2408.00329",
    "url": "https://www.semanticscholar.org/paper/db0e1ebea97828ee8fc10e5ae19099215a159a46",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep neural networks (DNNs) are vulnerable to small adversarial perturbations of the inputs, posing a significant challenge to their reliability and robustness. Empirical methods such as adversarial training can defend against particular attacks but remain vulnerable to more powerful attacks. Alternatively, Lipschitz networks provide certified robustness to unseen perturbations but lack sufficient expressive power. To harness the advantages of both approaches, we design a novel two-step Optimal Transport induced Adversarial Defense (OTAD) model that can fit the training data accurately while preserving the local Lipschitz continuity. First, we train a DNN with a regularizer derived from optimal transport theory, yielding a discrete optimal transport map linking data to its features. By leveraging the map's inherent regularity, we interpolate the map by solving the convex integration problem (CIP) to guarantee the local Lipschitz property. OTAD is extensible to diverse architectures of ResNet and Transformer, making it suitable for complex data. For efficient computation, the CIP can be solved through training neural networks. OTAD opens a novel avenue for developing reliable and secure deep learning systems through the regularity of optimal transport maps. Empirical results demonstrate that OTAD can outperform other robust models on diverse datasets.",
    "citationCount": 0,
    "referenceCount": 63
}