{
    "paperId": "db190dd4ac1ef708061ba4984dda7c4707a10434",
    "title": "Report on the Search Futures Workshop at ECIR 2024",
    "year": 2024,
    "venue": "SIGIR Forum",
    "authors": [
        "Leif Azzopardi",
        "Charles L. A. Clarke",
        "Paul B. Kantor",
        "Bhaskar Mitra",
        "Johanne R Trippas",
        "Zhaochun Ren",
        "Mohammad Aliannejadi",
        "Negar Arabzadeh",
        "Raman Chandrasekar",
        "M. D. Rijke",
        "Panagiotis Eustratiadis",
        "William Hersh",
        "Jin Huang",
        "E. Kanoulas",
        "Jasmin Kareem",
        "Yongkang Li",
        "Simon Lupart",
        "Kidist Amde",
        "Adam Mekonnen",
        "Ian Roegiest",
        "Fabrizio Soboroff",
        "Suzan Silvestri",
        "Verberne David",
        "Eugene Vos",
        "Yuyue Yang",
        "Zhao"
    ],
    "doi": "10.1145/3687273.3687288",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db190dd4ac1ef708061ba4984dda7c4707a10434",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The First Search Futures Workshop, in conjunction with the Fourty-sixth European Conference on Information Retrieval (ECIR) 2024, looked into the future of search to ask questions such as: • How can we harness the power of generative AI to enhance, improve and re-imagine Information Retrieval (IR)? • What are the principles and fundamental rights that the field of Information Retrieval should strive to uphold? • How can we build trustworthy IR systems in light of Large Language Models and their ability to generate content at super human speeds? • What new applications and affordances does generative AI offer and enable, and can we go back to the future, and do what we only dreamed of previously? The workshop started with seventeen lightning talks from a diverse set speakers. Instead of conventional paper presentations, the lightning talks provided a rapid and concise overview of ideas, allowing speakers to share critical points or novel concepts quickly. This format was designed to encourage discussion and introduce a wide range of topics within a short period, thereby maximising the exchange of ideas and ensuring that participants could gain insights into various future search areas without the deep dive typically required in longer presentations. This report, co-authored by the workshop's organisers and its participants, summarises the talks and discussions. This report aims to provide the broader IR community with the insights and ideas discussed and debated during the workshop - and to provide a platform for future discussion. Date: 24 March 2024. Website: https://searchfutures.github.io/.",
    "citationCount": 8,
    "referenceCount": 201
}