{
    "paperId": "db463ec35b0dbd305d59cec912dcb51752db7f3b",
    "title": "Usefulness of Information for Achieving Goals with Disjunctive Premises",
    "year": 2024,
    "venue": "Knowledge engineering review (Print)",
    "authors": [
        "Célia da Costa Pereira",
        "Laurence Cholvy"
    ],
    "doi": "10.1017/S0269888924000031",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db463ec35b0dbd305d59cec912dcb51752db7f3b",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/CA57FF08629B6CDD5B61F7C73BC8BFB1/S0269888924000031a.pdf/div-class-title-usefulness-of-information-for-achieving-goals-with-disjunctive-premises-div.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract We propose a logic-based framework to model a system whose aim is to help provide the user with those pieces of information that are useful with respect to his/her current information need, as well as relevant to his/her query. More precisely, we propose three measures of information usefulness which take into account the fact that the user can be represented as a cognitive agent endowed with some beliefs—a partial “picture” about what it already knows—and goals—a certain state of affairs in which the agent would like to be. This paper extends a previous version of the framework by considering a more realistic hypothesis, according to which there are several ways to achieve goals. We present three different approaches: the binary approach, the ordinal approach, and the numerical approach. We take information retrieval (IR) as a particular application domain, and we compare some existing measures with the usefulness measure we introduce here.",
    "citationCount": 0,
    "referenceCount": 45
}