{
    "paperId": "db63b7e3ca79fd453786e6b004c76103b01cf1e9",
    "title": "Preserving Data Privacy in the Internet of Medical Things Using Dual Signature ECDSA",
    "year": 2020,
    "venue": "Secur. Commun. Networks",
    "authors": [
        "M. Cano",
        "Antonio Cañavate-Sanchez"
    ],
    "doi": "10.1155/2020/4960964",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db63b7e3ca79fd453786e6b004c76103b01cf1e9",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/scn/2020/4960964.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The disclosure of personal and private information is one of the main challenges of the Internet of Medical Things (IoMT). Most IoMT-based services, applications, and platforms follow a common architecture where wearables or other medical devices capture data that are forwarded to the cloud. In this scenario, edge computing brings new opportunities to enhance the operation of IoMT. However, despite the benefits, the inherent characteristics of edge computing require countermeasures to address the security and privacy issues that IoMT gives rise to. The restrictions of IoT devices in terms of battery, memory, hardware resources, or computing capabilities have led to a common agreement for the use of elliptic curve cryptography (ECC) with hardware or software implementations. As an example, the elliptic curve digital signature algorithm (ECDSA) is widely used by IoT devices to compute digital signatures. On the other hand, it is well known that dual signature has been an effective method to provide consumer privacy in classic e-commerce services. This article joins both approaches. It presents a novel solution to enhanced security and the preservation of data privacy in communications between IoMT devices and the cloud via edge computing devices. While data source anonymity is achieved from the cloud perspective, integrity and origin authentication of the collected data is also provided. In addition, computational requirements and complexity are kept to a minimum.",
    "citationCount": 34,
    "referenceCount": 45
}