{
    "paperId": "db7264d797dd293c4052b4d19722277138662e06",
    "title": "MapGPT: an autonomous framework for mapping by integrating large language model and cartographic tools",
    "year": 2024,
    "venue": "Cartography and Geographic Information Science",
    "authors": [
        "Yifan Zhang",
        "Zhengting He",
        "Jingxuan Li",
        "Jianfeng Lin",
        "Qingfeng Guan",
        "Wenhao Yu"
    ],
    "doi": "10.1080/15230406.2024.2404868",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db7264d797dd293c4052b4d19722277138662e06",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT The mapping process generally involves intricate operations, such as symbol design, layout design, and text annotation, demanding a high level of professional expertise. The high requirement for map producers hinders the promotion and widespread adoption of mapping. Consequently, researchers are concentrating on techniques to automate and enhance the intelligence of the mapping process. For example, some studies attempt to train deep learning models for mapping, including methods like map style transfer. However, these approaches typically treat the entire map as a global input and generate a new map as output, lacking the flexibility to consider and control detailed elements within a map. Therefore, in this paper, we propose a large language model-based intelligent mapping framework, termed MapGPT, which can be used for mapping by considering the map as an integration of various map elements. Specifically, multiple professional mapping tools are designed in MapGPT, and each tool is designed to control a corresponding map element. With these tools, a large language model is used to first understand the demand of users based on mere natural language descriptions, and subsequently automatically invoke appropriate tools in sequence to generate a map. Furthermore, by utilizing a memory component to store interaction information, users can interact with MapGPT through conversation to adjust map elements such as color and position. In conclusion, MapGPT offers user-friendly mapping experience, showing potential to be a mapping assistant for professional map producers. A comprehensive demonstration of this framework is provided in a visual case study video, accessible at https://github.com/AGI-GIS/MapGPT.",
    "citationCount": 38,
    "referenceCount": 86
}