{
    "paperId": "db729e63a3957278039bbd9dbd5d72eaf728b76b",
    "title": "Can a Client-Server Cache Tango Accelerate Disaggregated Storage?",
    "year": 2025,
    "venue": "USENIX Workshop on Hot Topics in Storage and File Systems",
    "authors": [
        "Linjie Ma",
        "Jian Zhang",
        "Marie Nguyen",
        "Sudarsun Kannan"
    ],
    "doi": "10.1145/3736548.3737838",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db729e63a3957278039bbd9dbd5d72eaf728b76b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Disaggregated storage architectures have become a critical component in modern data centers, offering independent scaling of compute and storage. However, disaggregation introduces performance challenges, particularly due to the overhead of remote storage access. We first conduct a detailed end-to-end analysis of existing caching strategies and identify the critical issues, such as high server resource consumption, data duplication, lack of fair server resources scheduling, inefficient eviction, and prefetching policies. To address these limitations, we present the preliminary design of OrcaCache, an orchestrated, unified caching framework that coordinates between clients and storage servers. OrcaCache aims to carefully shift cache indexing to clients by exposing a global cache view, with an aim to reduce server CPU usage and duplication of data across caches. OrcaCache also aims to improve cache efficiency, adaptiveness, and fairness across servers and clients.",
    "citationCount": 0,
    "referenceCount": 25
}