{
    "paperId": "dbbbb4a1b4e2b84a5a5c69517615cdb7f00d6434",
    "title": "Time series prediction of rock burst based on deep learning: A case study",
    "year": 2025,
    "venue": "Thermal Science",
    "authors": [
        "Hui Li",
        "Si-Yuan Gong",
        "Xiu-Feng Zhang",
        "Lin-Ming Dou",
        "Guo-Ying Li",
        "Hao-Ze Li"
    ],
    "doi": "10.2298/tsci2502319l",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dbbbb4a1b4e2b84a5a5c69517615cdb7f00d6434",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rockburst is a common mining hazard causing dynamic damage to coal and rock\n masses, posing significant threats to personnel and equipment safety.\n Various analytical methods exist to assess impact risks, with microseismic\n monitoring systems playing a pivotal role due to their stability, dynamism,\n and continuity. This approach utilizes a dual residual connection and a\n deeply connected stack architecture to facilitate seasonal-trend\n predictions and enhance their interpretability in time series prediction\n tasks using a purely deep learning model. The time-frequency and total\n energy of microseismic events are predicted using the proposed approach, and\n a comparative experimental study is conducted on the time window lengths of\n M = 7 days and M = 4 days. The results indicate that the proposed approach\n effectively predicts the evolution trend of microseismic event frequency,\n with minor discrepancies between the predicted results and the actual\n monitoring values, showing its excellent prediction performance and\n generalization capability.",
    "citationCount": 0,
    "referenceCount": 5
}