{
    "paperId": "dbe174b01d50177c5407d7dc9f49e85d0d070919",
    "title": "CohortNet: Empowering Cohort Discovery for Interpretable Healthcare Analytics",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Qingpeng Cai",
        "Kaiping Zheng",
        "H. V. Jagadish",
        "B. Ooi",
        "J. Yip"
    ],
    "doi": "10.14778/3675034.3675041",
    "arxivId": "2406.14015",
    "url": "https://www.semanticscholar.org/paper/dbe174b01d50177c5407d7dc9f49e85d0d070919",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2406.14015",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cohort studies are of significant importance in the field of healthcare analytics. However, existing methods typically involve manual, labor-intensive, and expert-driven pattern definitions or rely on simplistic clustering techniques that lack medical relevance. Automating cohort studies with interpretable patterns has great potential to facilitate healthcare analytics and data management but remains an unmet need in prior research efforts. In this paper, we present a cohort auto-discovery framework for interpretable healthcare analytics. It focuses on the effective identification, representation, and exploitation of cohorts characterized by medically meaningful patterns. In the framework, we propose CohortNet, a core model that can learn fine-grained patient representations by separately processing each feature, considering both individual feature trends and feature interactions at each time step. Subsequently, it employs K-Means in an adaptive manner to classify each feature into distinct states and a heuristic cohort exploration strategy to effectively discover substantial cohorts with concrete patterns. For each identified cohort, it learns comprehensive cohort representations with credible evidence through associated patient retrieval. Ultimately, given a new patient, CohortNet can leverage relevant cohorts with distinguished importance which can provide a more holistic understanding of the patient's conditions. Extensive experiments on three real-world datasets demonstrate that it consistently outperforms state-of-the-art approaches, resulting in improvements in AUC-PR scores ranging from 2.8% to 4.1%, and offers interpretable insights from diverse perspectives in a top-down fashion.",
    "citationCount": 2,
    "referenceCount": 55
}