{
    "paperId": "dc06693d2cec80eba531ca41e370ae010c954417",
    "title": "General Equilibrium Model Applications in Energy Research: A Bibliometric Analysis",
    "year": 2025,
    "venue": "Ekonomikalia Journal of Economics",
    "authors": [
        "Maulidar Agustina",
        "Zia Thahira",
        "Naswatun Zikra",
        "Faizah Amalina",
        "Mohd Afjal",
        "Ghalieb Mutig Idroes"
    ],
    "doi": "10.60084/eje.v3i1.291",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dc06693d2cec80eba531ca41e370ae010c954417",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This study investigates the scholarly landscape of General Equilibrium (GE) model applications within the field of energy research through a bibliometric lens. Utilizing a dataset of 864 journal articles indexed in Scopus from 1974 to 2022, the research maps publication trends, identifies leading contributors, and uncovers prevailing thematic clusters within the field. The analysis employs VOSviewer to visualize co-authorship networks, as well as institutional and country-level productivity, source relevance, and keyword co-occurrence patterns. Results reveal that China, the United States, and Japan are the most prolific countries, while Energy Policy and Energy Economics emerge as the most influential journals. Among the authors, Masui T. stands out as the most productive, while Paganetti registers the highest number of citations, reflecting a significant scholarly impact over recent years. Keyword mapping highlights dominant research themes centered on \"computable general equilibrium analysis,\" \"computable general equilibrium model,\" and \"emission control,\" reflecting the field’s alignment with climate-related energy policy evaluation. This bibliometric overview not only provides a structured understanding of intellectual developments in GE-energy research but also identifies underexplored areas that warrant further investigation—particularly the integration of GE models with renewable energy transitions in developing economies and the incorporation of behavioral and distributional dimensions within energy policy assessments. The study contributes to the advancement of interdisciplinary dialogue by informing future research directions and supporting evidence-based policymaking in the energy-climate nexus.",
    "citationCount": 0,
    "referenceCount": 51
}