{
    "paperId": "dc4079d52f3eec79f09a0b678a64ec0f6ba40245",
    "title": "FuseAttenX: Leveraging Attention-Enhanced Deep Learning for Business Strategy Optimization",
    "year": 2025,
    "venue": "International Conference on Multimodal Interaction",
    "authors": [
        "Farhad Uddin Mahmud",
        "Arifur Rahman",
        "MD. Azam Khan",
        "Kanchon Kumar Bishnu",
        "A. Eva",
        "Jannatul Maua"
    ],
    "doi": "10.1109/ICMI65310.2025.11141140",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dc4079d52f3eec79f09a0b678a64ec0f6ba40245",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predictive analytics plays a pivotal role in modern business strategy optimization by enabling data-driven decision-making based on market trends and customer behavior. This paper presents a novel deep learning (DL) model, FuseAttenX, which integrates Convolutional Neural Networks (CNNs), Long Short-Term Memory (LSTM) networks, and Transformer layers with an attention mechanism to enhance predictive accuracy. The model is evaluated on two complementary datasets: US Regional Sales Data for forecasting regional sales performance and Customer Personality Analysis for customer segmentation. The proposed FuseAttenX model achieves a Mean Absolute Error (MAE) of 3.50 and a Root Mean Squared Error (RMSE) of 4.32 for sales prediction, outperforming the Transformer model with an MAE of 3.78 and an RMSE of 4.62. For customer segmentation, the model achieves an accuracy of 80.10%, along with a precision of 0.78, recall of 0.81, and F1-score of 0.79. Feature importance analysis reveals that key factors such as order quantity, discounts, income, and recency of purchases play a critical role in the model's predictions. Including a mechanism for attention improves the model's capacity to focus on the most important features, resulting in greater performance and generalisation on previously unknown data. This study highlights the potential of advanced AI models like FuseAttenX to optimize business strategies by integrating multi-source data for accurate sales forecasting and customer behavior insights, ultimately contributing to more effective making choices in changing business situations.",
    "citationCount": 0,
    "referenceCount": 18
}