{
    "paperId": "dc46789c013a544ca71663d2c0c114c07235c877",
    "title": "An Analysis and Simulation Framework for Systems with Classification Components",
    "year": 2024,
    "venue": "International Conference on Model-Driven Engineering and Software Development",
    "authors": [
        "Francesco Bedini",
        "Tino Jungebloud",
        "Ralph Maschotta",
        "Armin Zimmermann"
    ],
    "doi": "10.5220/0012357000003645",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dc46789c013a544ca71663d2c0c114c07235c877",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5220/0012357000003645",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Machine learning solutions are becoming more widespread as they can solve some classes of problems better than traditional software. Hence, industries look forward to integrating this new technology into their products and workﬂows. However, this calls for new models and analysis concepts in systems design that can incorporate the properties and effects of machine learning components. In this paper, we propose a framework that allows designing, analyzing, and simulating hardware-software systems that contain deep learning classiﬁcation components. We focus on the modeling and predicting uncertainty aspects, which are typical for machine-learning applications. They may lead to incorrect results that may negatively affect the entire system’s dependability, reliability, and even safety. This issue is receiving increasing attention as “explain-able” or “certiﬁable” AI. We propose a Domain-Speciﬁc Language with a precise stochastic colored Petri net semantics to model such systems, which then can be simulated and analyzed to compute performance and reliability measures. The language is extensible and allows adding parameters to any of its elements, supporting the deﬁnition of additional analysis methods for future modular extensions.",
    "citationCount": 3,
    "referenceCount": 53
}