{
    "paperId": "dc678cb0c4b92f88f733ca596c0a48fc0b1a7ac2",
    "title": "HIGGS: HIerarchy-Guided Graph Stream Summarization",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Xuan Zhao",
        "Xike Xie",
        "Christian S. Jensen"
    ],
    "doi": "10.1109/ICDE65448.2025.00114",
    "arxivId": "2412.15516",
    "url": "https://www.semanticscholar.org/paper/dc678cb0c4b92f88f733ca596c0a48fc0b1a7ac2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Graph stream summarization refers to the process of processing a continuous stream of edges that form a rapidly evolving graph. The primary challenges in handling graph streams include the impracticality of fully storing the ever-growing datasets and the complexity of supporting graph queries that involve both topological and temporal information. Recent advancements, such as PGSS and Horae, address these limitations by using domainbased, top-down multi-layer structures in the form of compressed matrices. However, they either suffer from poor query accuracy, incur substantial space overheads, or have low query efficiency. This study proposes a novel item-based, bottom-up hierarchical structure, called HIGGS. Unlike existing approaches, HIGGS leverages its hierarchical structure to localize storage and query processing, thereby confining changes and hash conflicts to small and manageable subtrees, yielding notable performance improvements. HIGGS offers tighter theoretical bounds on query accuracy and space cost. Extensive empirical studies on real graph streams demonstrate that, compared to state-of-the-art methods, HIGGS is capable of notable performance enhancements: it can improve accuracy by over 3 orders of magnitude, reduce space overhead by an average of 30%, increase throughput by more than 5 times, and decrease query latency by nearly 2 orders of magnitude.",
    "citationCount": 0,
    "referenceCount": 48
}