{
    "paperId": "dcb555fad979826c263e44915d6140c57ee26cf4",
    "title": "Identification of co‐localised transcription factors based on paired motifs analysis",
    "year": 2024,
    "venue": "IET Systems Biology",
    "authors": [
        "Li Liu",
        "Lu Han",
        "Kaiyuan Han",
        "Zheng Zhang",
        "Haojiang Zhang",
        "Lirong Zhang"
    ],
    "doi": "10.1049/syb2.12104",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dcb555fad979826c263e44915d6140c57ee26cf4",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1049/syb2.12104",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract The interaction of transcription factors (TFs) with DNA precisely regulates gene transcription. In mammalian cells, thousands of TFs often interact with DNA cis‐regulatory elements in a combinatorial manner rather than act alone. The identification of cooperativity between TFs can help to explore the mechanism of transcriptional regulation. However, little is known about the cooperative patterns of TFs in the genome. To identify which TFs prefer co‐localisation, the authors conducted a paired motif analysis in the accessible regions of the human genome based on the Poisson background model. Especially, the authors distinguish the cooperative binding TFs and the competitive binding TFs according to the distance between TF motifs. In the K562 cell line, the authors find that TFs from a same family are always competing the same binding sites, such as FOS_JUN family, whereas KLF family TFs show significant cooperative binding in the adjacency region. Furthermore, the comparative analysis across 16 human cell lines indicates that most TF combination patterns are conserved, but there are still some cell‐line‐specific patterns. Finally, in human prostate cancer cells (PC‐3) and human prostate normal cells (RWPE‐2), the authors investigate the specific TF combination patterns in the disease cell and normal cell. The results show that the cooperative binding TF pairs shared by PC‐3 and RWPE‐2 account for over 90%. Simultaneously, the authors also identify 26 specific TF combination pairs in PC‐3 cancer cells.",
    "citationCount": 0,
    "referenceCount": 61
}