{
    "paperId": "dcb7514a0a9cbe6e467e3ecedd191dfe5bfd4e44",
    "title": "RL-Cache: Learning-Based Cache Admission for Content Delivery",
    "year": 2019,
    "venue": "IEEE Journal on Selected Areas in Communications",
    "authors": [
        "V. Kirilin",
        "Aditya Sundarrajan",
        "Sergey Gorinsky",
        "R. Sitaraman"
    ],
    "doi": "10.1109/JSAC.2020.3000415",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dcb7514a0a9cbe6e467e3ecedd191dfe5bfd4e44",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/jsac.2020.3000415",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Content delivery networks (CDNs) distribute much of the Internet content by caching and serving the objects requested by users. A major goal of a CDN is to maximize the hit rates of its caches, thereby enabling faster content downloads to the users. Content caching involves two components: an admission algorithm to decide whether to cache an object and an eviction algorithm to determine which object to evict from the cache when it is full. In this paper, we focus on cache admission and propose a novel algorithm called RL-Cache that uses model-free reinforcement learning (RL) to decide whether or not to admit a requested object into the CDN’s cache. Unlike prior approaches that use a small set of criteria for decision making, RL-Cache weights a large set of features that include the object size, recency, and frequency of access. We develop a publicly available implementation of RL-Cache and perform an evaluation using production traces for the image, video, and web traffic classes from Akamai’s CDN. The evaluation shows that RL-Cache improves the hit rate in comparison with the state of the art and imposes only a modest resource overhead on the CDN servers. Further, RL-Cache is robust enough that it can be trained in one location and executed on request traces of the same or different traffic classes in other locations of the same geographic region. The paper also reports extensive analyses of the RL-Cache sensitivity to its features and hyperparameter values. The analyses validate the made design choices and reveal interesting insights into the RL-Cache behavior.",
    "citationCount": 97,
    "referenceCount": 39
}