{
    "paperId": "dd0ad9c96eba0edfcc3bea8d4d0f7243436ea084",
    "title": "Algorithm 1036: ATC, An Advanced Tucker Compression Library for Multidimensional Data",
    "year": 2021,
    "venue": "ACM Transactions on Mathematical Software",
    "authors": [
        "Wouter Baert",
        "N. Vannieuwenhoven"
    ],
    "doi": "10.1145/3585514",
    "arxivId": "2107.01384",
    "url": "https://www.semanticscholar.org/paper/dd0ad9c96eba0edfcc3bea8d4d0f7243436ea084",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/action/downloadSupplement?doi=10.1145%2F3585514&file=3585514_calgosuppl.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present ATC, a C++ library for advanced Tucker-based lossy compression of dense multidimensional numerical data in a shared-memory parallel setting, based on the sequentially truncated higher-order singular value decomposition (ST-HOSVD) and bit plane truncation. Several techniques are proposed to improve speed, memory usage, error control and compression rate. First, a hybrid truncation scheme is described which combines Tucker rank truncation and TTHRESH quantization. We derive a novel expression to approximate the error of truncated Tucker decompositions in the case of core and factor perturbations. We parallelize the quantization and encoding scheme and adjust this phase to improve error control. Implementation aspects are described, such as an ST-HOSVD procedure using only a single transposition. We also discuss several usability features of ATC, including the presence of multiple interfaces, extensive data type support, and integrated downsampling of the decompressed data. Numerical results show that ATC maintains state-of-the-art Tucker compression rates while providing average speed-up factors of 2.2 to 3.5 and halving memory usage. Our compressor provides precise error control, deviating only 1.4% from the requested error on average. Finally, ATC often achieves higher compression than non-Tucker-based compressors in the high-error domain.",
    "citationCount": 5,
    "referenceCount": 71
}