{
    "paperId": "dd1fcaa531de69442a3ea40ed939123f6da47258",
    "title": "Plen-VDB: Memory Efficient VDB-Based Radiance Fields for Fast Training and Rendering",
    "year": 2023,
    "venue": "Computer Vision and Pattern Recognition",
    "authors": [
        "Han Yan",
        "Celong Liu",
        "Chao Ma",
        "Xing Mei"
    ],
    "doi": "10.1109/CVPR52729.2023.00017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dd1fcaa531de69442a3ea40ed939123f6da47258",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, we present a new representation for neural radiance fields that accelerates both the training and the inference processes with VDB, a hierarchical data structure for sparse volumes. VDB takes both the advantages of sparse and dense volumes for compact data representation and efficient data access, being a promising data structure for NeRF data interpolation and ray marching. Our method, Plenoptic VDB (PlenVDB), directly learns the VDB data structure from a set of posed images by means of a novel training strategy and then uses it for real-time rendering. Experimental results demonstrate the effectiveness and the efficiency of our method over previous arts: First, it converges faster in the training process. Second, it delivers a more compact data format for NeRF data presentation. Finally, it renders more efficiently on commodity graphics hardware. Our mobile PlenVDB demo achieves 30+ FPS, 1280×720 resolution on an iPhone12 mobile phone. Check plenvdb.github.io for details.",
    "citationCount": 5,
    "referenceCount": 32
}