{
    "paperId": "dd2d40ce5e6fe8489116fc8ae035597b4d4dc8b0",
    "title": "BERT4Cache: a bidirectional encoder representations for data prefetching in cache",
    "year": 2024,
    "venue": "PeerJ Computer Science",
    "authors": [
        "Jing Shang",
        "Zhihui Wu",
        "Zhiwen Xiao",
        "Yifei Zhang",
        "Jibin Wang"
    ],
    "doi": "10.7717/peerj-cs.2258",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dd2d40ce5e6fe8489116fc8ae035597b4d4dc8b0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7717/peerj-cs.2258",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cache plays a crucial role in improving system response time, alleviating server pressure, and achieving load balancing in various aspects of modern information systems. The data prefetch and cache replacement algorithms are significant factors influencing caching performance. Due to the inability to learn user interests and preferences accurately, existing rule-based and data mining caching algorithms fail to capture the unique features of the user access behavior sequence, resulting in low cache hit rates. In this article, we introduce BERT4Cache, an end-to-end bidirectional Transformer model with attention for data prefetch in cache. BERT4Cache enhances cache hit rates and ultimately improves cache performance by predicting the user’s imminent future requested objects and prefetching them into the cache. In our thorough experiments, we show that BERT4Cache achieves superior results in hit rates and other metrics compared to generic reactive and advanced proactive caching strategies.",
    "citationCount": 1,
    "referenceCount": 26
}