{
    "paperId": "dd37714491c3b778f1cbe83dda2c88ca4b9b0104",
    "title": "vPALs: Towards Verified Performance-aware Learning System For Resource Management",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Guoliang He",
        "Gingfung Yeung",
        "Sheriffo Ceesay",
        "Adam Barker"
    ],
    "doi": "10.48550/arXiv.2404.03079",
    "arxivId": "2404.03079",
    "url": "https://www.semanticscholar.org/paper/dd37714491c3b778f1cbe83dda2c88ca4b9b0104",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurately predicting task performance at runtime in a cluster is advantageous for a resource management system to determine whether a task should be migrated due to performance degradation caused by interference. This is beneficial for both cluster operators and service owners. However, deploying performance prediction systems with learning methods requires sophisticated safeguard mechanisms due to the inherent stochastic and black-box natures of these models, such as Deep Neural Networks (DNNs). Vanilla Neural Networks (NNs) can be vulnerable to out-of-distribution data samples that can lead to sub-optimal decisions. To take a step towards a safe learning system in performance prediction, We propose vPALs that leverage well-correlated system metrics, and verification to produce safe performance prediction at runtime, providing an extra layer of safety to integrate learning techniques to cluster resource management systems. Our experiments show that vPALs can outperform vanilla NNs across our benchmark workload.",
    "citationCount": 0,
    "referenceCount": 44
}