{
    "paperId": "dd4b15c0f80e293de173ade067dc695b6c1a8293",
    "title": "A Comparative Analysis of CNN Feature Extractors and Parameter Tuning with Ray Tune Search Algorithms for Image Quality Assessment",
    "year": 2024,
    "venue": "Aswan University Journal of Sciences and Technology",
    "authors": [
        "Hossam Mady",
        "Adel Agamy",
        "Abdel-Magid Mohamed",
        "Mohamed Abdelnaser"
    ],
    "doi": "10.21608/aujst.2024.304615.1112",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dd4b15c0f80e293de173ade067dc695b6c1a8293",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Image quality assessment (IQA) is crucial for the creation and assessment of visual intelligence systems to ensure end users receive high-quality visual content. Traditional IQA methods are frequently based on knowledge-driven, simplistic models. IQA has advanced significantly with the advent of deep learning, specifically convolutional neural networks (CNNs), which effectively model perceptual image distortions. This paper presents an extensive study on various CNN architectures as feature extractors in DISTS (Deep Image Structure and Texture Similarity) framework for IQA. Through the optimization of learnable parameters for various CNNs using various search algorithms and methods, we achieve substantial improvements in image quality assessment task. Our results show that optimized CNN-based metrics, particularly those built using VGG19 and SqueezeNet architectures, not only perform better but also outperform the CNN architectures used in the original DISTS model. These models closely match human perceptual judgments in their ability to capture and represent complex image features. This study opens the door for more accurate and user-aligned visual quality assessments by highlighting the potential of advanced deep learning techniques, especially when choosing the best CNN architecture and tuning method for particular task or application to improve the accuracy and reliability of IQA methods.",
    "citationCount": 1,
    "referenceCount": 47
}