{
    "paperId": "dd8e6c33b1cd3bcd0c1248914042f7563388df11",
    "title": "Viral Diversity and Ecological Impact of DNA Viruses in Dominant Tick Species in China",
    "year": 2024,
    "venue": "Microorganisms",
    "authors": [
        "Yueyang Yan",
        "Zhangpeng Shi",
        "Cunmin Wang",
        "Zi Jin",
        "Jigang Yin",
        "Guan Zhu"
    ],
    "doi": "10.3390/microorganisms12081736",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dd8e6c33b1cd3bcd0c1248914042f7563388df11",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/microorganisms12081736",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Ticks are blood-feeding ectoparasites that also transmit various pathogens, posing severe risks to human and animal health. DNA viruses play a crucial role in the microbial ecology of ticks, but their distribution and ecological significance remain largely undetermined. Here, we assembled an extensive catalog encompassing 4320 viral operational taxonomic units (vOTUs) from six main dominant tick species in China, of which 94.8% have not been found in any other environment. To bridge the knowledge gap in tick DNA virus research and provide a crucial resource platform, we developed the Tick DNA Virus Database. This database includes the vOTUs that are known to cause diseases. Most of the predicted vOTUs are associated with dominant bacterial and archaeal phyla. We identified 105 virus-encoded putative auxiliary metabolic genes (AMGs) that are involved in host metabolism and environmental adaptation, potentially influencing ticks through both top-down and bottom-up mechanisms. The identification of microbial communities and antibiotic resistance in wild tick species suggests that wild ticks are reservoirs of antibiotic resistance and potential spreaders of antibiotic resistance. These findings reveal the potential role of tick viruses in ecosystems, highlighting the importance of monitoring tick microbiomes to address global public health challenges.",
    "citationCount": 1,
    "referenceCount": 44
}