{
    "paperId": "ddc9bcd2f0ba00c51fcf4a022ba28ff3659f42ff",
    "title": "Understanding the Use of Emerging Technologies in the Public Sector: A Review of Horizon 2020 Projects",
    "year": 2023,
    "venue": "Digit. Gov. Res. Pract.",
    "authors": [
        "E. Kalampokis",
        "N. Karacapilidis",
        "Dimitris Tsakalidis",
        "K. Tarabanis"
    ],
    "doi": "10.1145/3580603",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ddc9bcd2f0ba00c51fcf4a022ba28ff3659f42ff",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3580603",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The main purpose of this article is to provide an up-to-date understanding of the utilization and deployment of emerging technologies in the public sector, as this is reflected through 19 recently funded Horizon 2020 research projects. For the needs of this study, we have adopted a well-known literature review method that enables a concept-centric analysis of the accumulated knowledge in the field under consideration, and accordingly proposed a conceptual framework that facilitates such an analysis. Through a detailed consideration of these projects and their pilot case implementations, a series of insights about recent research development and applications in the public sector are extracted and discussed. To the best of our knowledge, this is the first attempt to gain such insights from a research projects perspective, which may reveal useful information about the utilization and deployment of these technologies in real-life pilots. The findings of this study are also justified or challenged by referring to recent review articles that investigate the use of emerging technologies in the public sector.",
    "citationCount": 17,
    "referenceCount": 100
}