{
    "paperId": "ddcbbc2a0cf3da6a54e4006c3da409e0af3360f8",
    "title": "Flow-Level Bandwidth Allocation on P4 Tofino Switch with In-Network DRL Inference",
    "year": 2025,
    "venue": "Digital Signal Processing and Signal Processing Education Workshop",
    "authors": [
        "Muhammad Irfan",
        "Hang Hu",
        "Myung J. Lee",
        "Arslan Qadeer",
        "Yang G. Kim",
        "Kazi J. Ahmed",
        "Daiki Nobayashi"
    ],
    "doi": "10.1109/ICAIIC64266.2025.10920802",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ddcbbc2a0cf3da6a54e4006c3da409e0af3360f8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Software-Defined Networking (SDN) paradigm has significantly improved network efficiency by integrating machine learning (ML) capabilities into the control plane (CP). This integration allows adaptive management of network resources in response to dynamic traffic conditions. However, the significant geographical distance between the CP and data plane (DP) causes considerable round-trip latency, measured in milliseconds, which poses a major challenge to time-sensitive traffic. To address this challenge, our research proposes a novel in-network Reinforcement Learning (RL) inference framework. This framework extends programmability from the CP to the DP, enabling timely and precise control of network resources to meet the stringent Quality of Service (QoS) requirements of mission-critical applications. The in-network RL inference is implemented using match-action tables within the Protocol Independent Switch Architecture (PISA) framework in the DP and validated through hardware deployment of protocol-independent packet processors (P4). To allocate bandwidth precisely based on QoS requirements, a P4 meter extern is used to differentiate the unique demands of individual traffic flows. Our enhanced deep-deterministic policy gradient (eDDPG)-based RL inference achieves superior performance with minimal processing overhead, reducing latency by 88.7% and jitter by 89.1 % compared to systems without RL inference.",
    "citationCount": 1,
    "referenceCount": 18
}