{
    "paperId": "ddd282a8481939cf76f7e639f310d1653c676524",
    "title": "A General Cardinality Estimation Framework for Subgraph Matching in Property Graphs",
    "year": 2021,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Wilco van Leeuwen",
        "G. Fletcher",
        "N. Yakovets"
    ],
    "doi": "10.1109/TKDE.2022.3161328",
    "arxivId": "2108.05275",
    "url": "https://www.semanticscholar.org/paper/ddd282a8481939cf76f7e639f310d1653c676524",
    "isOpenAccess": true,
    "openAccessPdf": "https://pure.tue.nl/ws/files/298221640/A_General_Cardinality_Estimation_Framework_for_Subgraph_Matching_in_Property_Graphs.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We introduce a framework for cardinality estimation of query patterns over property graph databases. This framework makes it possible to analyze, compare and combine different cardinality estimation approaches. It consists of three phases: obtaining a set of estimates for some subqueries, extending this set and finally combining the set into a single cardinality estimate for the query. We show that (parts of) many existing cardinality estimation approaches can be used as techniques in one of the phases from our framework. The phases are loosely coupled, making it possible to combine (parts of) current cardinality estimation approaches. We created a graph version of the Join Order Benchmark to perform experiments with different combinations of techniques. The results showed that query patterns without property constraints can be accurately estimated using synopses for small patterns. Accurate estimation of query patterns with property constraints require new estimation techniques to be developed that capture correlations between the property constraints and the topology in graph databases.",
    "citationCount": 6,
    "referenceCount": 35
}