{
    "paperId": "ddf43caee1c3c33eb847bd953d62ddf418b80efe",
    "title": "AN OPTIMIZED SFC APPROACH FOR ND WINDOW QUERYING ON POINT CLOUDS",
    "year": 2020,
    "venue": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences",
    "authors": [
        "Haicheng Liu",
        "P. V. Oosterom",
        "M. Meijers",
        "E. Verbree"
    ],
    "doi": "10.5194/isprs-annals-vi-4-w1-2020-119-2020",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ddf43caee1c3c33eb847bd953d62ddf418b80efe",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.isprs-ann-photogramm-remote-sens-spatial-inf-sci.net/VI-4-W1-2020/119/2020/isprs-annals-VI-4-W1-2020-119-2020.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract. Dramatically increasing collection of point clouds raises an essential demand for highly efficient data management. It can also facilitate modern applications such as robotics and virtual reality. Extensive studies have been performed on point data management and querying, but most of them concentrate on low dimensional spaces. High dimensional data management solutions from computer science have not considered the special features of spatial data; so, they may not be optimal. A Space Filling Curve (SFC) based approach, PlainSFC which is capable of nD point querying has been proposed and tested in low dimensional spaces. However, its efficiency in nD space is still unknown. Besides that, PlainSFC performs poorly on skewed data querying. This paper develops HistSFC which utilizes point distribution information to improve the querying efficiency on skewed data. Then, the paper presents statistical analysis of how PlainSFC and HistSFC perform when dimensionality increases. By experimenting on simulated nD data and real data, we confirmed the patterns deduced: for inhomogeneous data querying, the false positive rate (FPR) of PlainSFC increases drastically as dimensionality goes up. HistSFC alleviates such deterioration to a large extent. Despite performance degeneration in ultra high dimensional spaces, HistSFC can be applied with high efficiency for most spatial applications. The generic theoretical framework developed also allows us to study related topics such as visualization and data transmission in the future.\n",
    "citationCount": 7,
    "referenceCount": 20
}