{
    "paperId": "ddf677fb1581740a7e285c1b0d3b1cf32825fa44",
    "title": "Robust Online Selection with Uncertain Offer Acceptance",
    "year": 2021,
    "venue": "Mathematics of Operations Research",
    "authors": [
        "Sebastian Perez-Salazar",
        "Mohit Singh",
        "A. Toriello"
    ],
    "doi": "10.1287/moor.2023.0210",
    "arxivId": "2112.00842",
    "url": "https://www.semanticscholar.org/paper/ddf677fb1581740a7e285c1b0d3b1cf32825fa44",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2112.00842",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Online advertising has motivated interest in online selection problems. Displaying ads to the right users benefits both the platform (e.g., via pay-per-click) and the advertisers (by increasing their reach). In practice, not all users click on displayed ads, while the platform’s algorithm may miss the users most disposed to do so. This mismatch decreases the platform’s revenue and the advertiser’s chances to reach the right customers. With this motivation, we propose a secretary problem where a candidate may or may not accept an offer according to a known probability p. Because we do not know the top candidate willing to accept an offer, the goal is to maximize a robust objective defined as the minimum over integers k of the probability of choosing one of the top k candidates, given that one of these candidates will accept an offer. Using Markov decision process theory, we derive a linear program for this max-min objective whose solution encodes an optimal policy. The derivation may be of independent interest, as it is generalizable and can be used to obtain linear programs for many online selection models. We further relax this linear program into an infinite counterpart, which we use to provide bounds for the objective and closed-form policies. For [Formula: see text], an optimal policy is a simple threshold rule that observes the first [Formula: see text] fraction of candidates and subsequently makes offers to the best candidate observed so far. Funding: Financial support from the U.S. National Science Foundation [Grants CCF-2106444, CCF-1910423, and CMMI 1552479] is gratefully acknowledged.",
    "citationCount": 4,
    "referenceCount": 78
}