{
    "paperId": "de02646fa73963be7d956411732872028e5df0a8",
    "title": "Towards Understanding Graph Neural Networks: An Algorithm Unrolling Perspective",
    "year": 2022,
    "venue": "arXiv.org",
    "authors": [
        "Zepeng Zhang",
        "Ziping Zhao"
    ],
    "doi": "10.48550/arXiv.2206.04471",
    "arxivId": "2206.04471",
    "url": "https://www.semanticscholar.org/paper/de02646fa73963be7d956411732872028e5df0a8",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.04471",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The graph neural network (GNN) has demonstrated its superior performance in various applications. The working mechanism behind it, however, remains mysterious. GNN models are designed to learn effective representations for graph-structured data, which intrinsically coincides with the principle of graph signal denoising (GSD). Algorithm unrolling, a\"learning to optimize\"technique, has gained increasing attention due to its prospects in building efficient and interpretable neural network architectures. In this paper, we introduce a class of unrolled networks built based on truncated optimization algorithms (e.g., gradient descent and proximal gradient descent) for GSD problems. They are shown to be tightly connected to many popular GNN models in that the forward propagations in these GNNs are in fact unrolled networks serving specific GSDs. Besides, the training process of a GNN model can be seen as solving a bilevel optimization problem with a GSD problem at the lower level. Such a connection brings a fresh view of GNNs, as we could try to understand their practical capabilities from their GSD counterparts, and it can also motivate designing new GNN models. Based on the algorithm unrolling perspective, an expressive model named UGDGNN, i.e., unrolled gradient descent GNN, is further proposed which inherits appealing theoretical properties. Extensive numerical simulations on seven benchmark datasets demonstrate that UGDGNN can achieve superior or competitive performance over the state-of-the-art models.",
    "citationCount": 4,
    "referenceCount": 84
}