{
    "paperId": "de08b7f6f31d25444e439a2a9a5d3dccd03afca2",
    "title": "Updating Machine Learning Models in Real-World Applications: Finding Best Deployment Settings",
    "year": 2025,
    "venue": "2025 International Conference on Artificial Intelligence, Computer, Data Sciences and Applications (ACDSA)",
    "authors": [
        "Julia Poray",
        "Paul Jungmann",
        "Bogdan Franczyk",
        "Thomas Heller"
    ],
    "doi": "10.1109/ACDSA65407.2025.11166305",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/de08b7f6f31d25444e439a2a9a5d3dccd03afca2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Effective deployment and updating of machine learning models are crucial for maintaining operational efficiency in industrial environments. Model performance often degrades over time due to Concept Drift, necessitating regular updates of initially trained machine learning models. This study addresses gaps in the literature, particularly the lack of comparisons of model adaptation techniques across different machine learning regression model types and the empirical evaluation of these update techniques in real-world scenarios. In the course of this work, experiments were conducted on deploying machine learning models in two virtual metrology cases from semiconductor fabrication, investigating the performance of model-type independent update techniques. The study examines how update frequency and the amount of new data used for the model updates influence performance of the update techniques. Results confirm that update techniques using a sliding window including historical labeled data are optimal across all frequencies and batch sizes. The optimal update technique out of the family of sliding window update techniques varies across the different use cases and model types. The findings highlight the need for case-specific testing to determine the best update technique as well as the best update frequency and amount of data used for updates.",
    "citationCount": 0,
    "referenceCount": 26
}