{
    "paperId": "de66f26e0d700835d6f26d45a3592e5d3f907bac",
    "title": "Privacy Preservation Techniques (PPTs) in IoT Systems: A Scoping Review and Future Directions",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "E. Alalade",
        "Ashraf Matrawy"
    ],
    "doi": "10.48550/arXiv.2503.02455",
    "arxivId": "2503.02455",
    "url": "https://www.semanticscholar.org/paper/de66f26e0d700835d6f26d45a3592e5d3f907bac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Privacy preservation in Internet of Things (IoT) systems requires the use of privacy-enhancing technologies (PETs) built from innovative technologies such as cryptography and artificial intelligence (AI) to create techniques called privacy preservation techniques (PPTs). These PPTs achieve various privacy goals and address different privacy concerns by mitigating potential privacy threats within IoT systems. This study carried out a scoping review of different types of PPTs used in previous research works on IoT systems between 2010 and early 2023 to further explore the advantages of privacy preservation in these systems. This scoping review looks at privacy goals, possible technologies used for building PET, the integration of PPTs into the computing layer of the IoT architecture, different IoT applications in which PPTs are deployed, and the different privacy types addressed by these techniques within IoT systems. Key findings, such as the prominent privacy goal and privacy type in IoT, are discussed in this survey, along with identified research gaps that could inform future endeavors in privacy research and benefit the privacy research community and other stakeholders in IoT systems.",
    "citationCount": 0,
    "referenceCount": 305
}