{
    "paperId": "df37a7b2355ccde289c35400efcc807396464569",
    "title": "A Data Integrity Verification Scheme for Centralized Database Using Smart Contract and Game Theory",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "Siqi He",
        "Xiaofei Xing",
        "Guojun Wang",
        "Zeyu Sun"
    ],
    "doi": "10.1109/ACCESS.2023.3284850",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/df37a7b2355ccde289c35400efcc807396464569",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/10005208/10147781.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Currently, many companies and institutions use centralized or distributed databases to store massive amounts of data. However, the use of untrusted centralized third-party auditors can result in security issues because these auditors may be malicious and tamper with or delete user data. This poses a significant challenge for ensuring the reliability of the data verification results. Although introducing a third-party auditor can help address this issue, it may also be untrustworthy and collude with the database service provider to forge false data verification results. In this study, we propose a data integrity verification scheme using smart contracts (DIV-SC) to address this challenge in a centralized database environment. Our approach utilizes blockchain technology as a decentralized third-party auditor, ensuring that the information stored on the blockchain is immutable and cannot be tampered with maliciously. In addition, smart contracts deployed on the blockchain can ensure that the verification procedures are correct and are not affected by any malicious party. We also leverage game theory to improve the reliability of multiple verifications, reduce verification time and improve overall performance. Our proposed scheme reduces the total verification time consumption by up to 53.44% while increasing the number of verifiable times by nearly 3.8 times, compared to conventional data integrity verification schemes.",
    "citationCount": 6,
    "referenceCount": 42
}