{
    "paperId": "df9be5632f07a9de378a0e4e08ec823e8d9d13d7",
    "title": "Large-scale Data Exploration Using Explanatory Regression Functions",
    "year": 2020,
    "venue": "ACM Transactions on Knowledge Discovery from Data",
    "authors": [
        "Fotis Savva",
        "C. Anagnostopoulos",
        "P. Triantafillou",
        "Kostas Kolomvatsos"
    ],
    "doi": "10.1145/3410448",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/df9be5632f07a9de378a0e4e08ec823e8d9d13d7",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.gla.ac.uk/220291/7/220291.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analysts wishing to explore multivariate data spaces, typically issue queries involving selection operators, i.e., range or equality predicates, which define data subspaces of potential interest. Then, they use aggregation functions, the results of which determine a subspace’s interestingness for further exploration and deeper analysis. However, Aggregate Query (AQ) results are scalars and convey limited information and explainability about the queried subspaces for enhanced exploratory analysis. Analysts have no way of identifying how these results are derived or how they change w.r.t query (input) parameter values. We address this shortcoming by aiding analysts to explore and understand data subspaces by contributing a novel explanation mechanism based on machine learning. We explain AQ results using functions obtained by a three-fold joint optimization problem which assume the form of explainable piecewise-linear regression functions. A key feature of the proposed solution is that the explanation functions are estimated using past executed queries. These queries provide a coarse grained overview of the underlying aggregate function (generating the AQ results) to be learned. Explanations for future, previously unseen AQs can be computed without accessing the underlying data and can be used to further explore the queried data subspaces, without issuing more queries to the backend analytics engine. We evaluate the explanation accuracy and efficiency through theoretically grounded metrics over real-world and synthetic datasets and query workloads.",
    "citationCount": 5,
    "referenceCount": 59
}