{
    "paperId": "dfa5ba89364d011e9adca084afc5ca11fecf44ee",
    "title": "A Spectral Approach for Learning Spatiotemporal Neural Differential Equations",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Mingtao Xia",
        "Xiangting Li",
        "Qijing Shen",
        "Tom Chou"
    ],
    "doi": "10.48550/arXiv.2309.16131",
    "arxivId": "2309.16131",
    "url": "https://www.semanticscholar.org/paper/dfa5ba89364d011e9adca084afc5ca11fecf44ee",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.16131",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Rapidly developing machine learning methods has stimulated research interest in computationally reconstructing differential equations (DEs) from observational data which may provide additional insight into underlying causative mechanisms. In this paper, we propose a novel neural-ODE based method that uses spectral expansions in space to learn spatiotemporal DEs. The major advantage of our spectral neural DE learning approach is that it does not rely on spatial discretization, thus allowing the target spatiotemporal equations to contain long range, nonlocal spatial interactions that act on unbounded spatial domains. Our spectral approach is shown to be as accurate as some of the latest machine learning approaches for learning PDEs operating on bounded domains. By developing a spectral framework for learning both PDEs and integro-differential equations, we extend machine learning methods to apply to unbounded DEs and a larger class of problems.",
    "citationCount": 0,
    "referenceCount": 33
}