{
    "paperId": "dfd5224dc386778f2f57d1461c41c41d93210b7e",
    "title": "IRONMAN: GNN-assisted Design Space Exploration in High-Level Synthesis via Reinforcement Learning",
    "year": 2021,
    "venue": "ACM Great Lakes Symposium on VLSI",
    "authors": [
        "Nan Wu",
        "Yuan Xie",
        "Cong Hao"
    ],
    "doi": "10.1145/3453688.3461495",
    "arxivId": "2102.08138",
    "url": "https://www.semanticscholar.org/paper/dfd5224dc386778f2f57d1461c41c41d93210b7e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2102.08138",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite the great success of High-Level Synthesis (HLS) tools, we observe several unresolved challenges: 1) the high-level abstraction of programming styles in HLS conceals optimization opportunities; 2) existing HLS tools do not provide flexible trade-offs among different objectives and constraints; 3) the actual quality of the resulting RTL designs is hard to predict. To this end, we propose an end-to-end framework, IRONMAN. The primary goal is to enable a flexible and automated design space exploration (DSE), which can provide either optimized solutions under user-specified constraints, or Pareto trade-offs among different objectives (e.g., resource types, area, and latency). IronMan consists of three components: GPP (a highly accurate graph-neural-network-based performance predictor), RLMD (a reinforcement-learning-based DSE engine that explores the optimized resource allocation strategy), and CT (a code transformer that assists RLMD and GPP by extracting data flow graphs from original HLS C/C++). Experimental results show that, 1) GPP achieves high prediction accuracy, reducing prediction errors of HLS tools by 10.9X in resource usage and 5.7X in timing; 2) RLMD obtains optimized or Pareto solutions outperforming genetic algorithm and simulated annealing by 12.7% and 12.9%, respectively; 3) IronMan can find optimized solutions perfectly matching various DSP constraints, with 2.54X fewer DSPs and up to 6X shorter latency than those of HLS tools. IronMan is also up to 400X faster than meta-heuristic techniques and HLS tools.",
    "citationCount": 64,
    "referenceCount": 22
}