{
    "paperId": "dfe85e7d51e70bb10ef9f3acdc5d8f15e8ce98b5",
    "title": "A Learned Query Optimizer for Spatial Join",
    "year": 2021,
    "venue": "SIGSPATIAL/GIS",
    "authors": [
        "Tin Vu",
        "A. Belussi",
        "S. Migliorini",
        "Ahmed Eldawy"
    ],
    "doi": "10.1145/3474717.3484217",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/dfe85e7d51e70bb10ef9f3acdc5d8f15e8ce98b5",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3474717.3484217",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The importance and complexity of spatial join resulted in many join algorithms, some of which run on big-data platforms such as Hadoop and Spark. This paper proposes the first machine-learning-based query optimizer for spatial join operation which can accommodate the skewness of the spatial datasets and the complexity of the different algorithms. The main challenge is how to develop portable cost models that take into account the important input characteristics such as data distribution, spatial partitioning, logic of spatial join algorithms, and the relationship between the two datasets. The proposed system defines a set of features that can all be computed efficiently for the data to catch the intricate aspects of spatial join. Then, it uses these features to train three machine learning models that capture several metrics to estimate the cost of four spatial join algorithms according to user requirements. The first model can estimate the cardinality of spatial join algorithm. The second model can predict the number of rough comparisons for a specific join algorithm. Finally, the third model is a classification model that can choose the best join algorithm to run. Experiments on large scale synthetic and real data show the efficiency of the proposed models over baseline methods.",
    "citationCount": 15,
    "referenceCount": 38
}