{
    "paperId": "e001a0ce38165a0a996a5a04b44040cc7913bcf1",
    "title": "Online Demand Peak Shaving with Machine-Learned Advice in Cyber-Physical Energy Systems",
    "year": 2023,
    "venue": "2023 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)",
    "authors": [
        "Minxi Fengl",
        "Wei Li",
        "Bo Qin",
        "Albert Y. Zomaya"
    ],
    "doi": "10.1109/DASC/PiCom/CBDCom/Cy59711.2023.10361461",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e001a0ce38165a0a996a5a04b44040cc7913bcf1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the deep integration of cyber tools, control algorithms are increasingly employed in cyber-physical energy systems to enhance management, cost efficiency, and robustness. Effective demand load management is crucial in cyber-physical energy systems as it directly impacts operational costs. Failure to adequately manage spiky or seasonal demand loads can lead to significant expenses on monthly utility bills. In this study, we propose AMPAMOD, a randomized online algorithm with machine-learned advice, to optimize battery operations and mitigate highly dynamic peak loads. AMPAMOD utilizes limited advice from machine learning algorithms to guide our online algorithm and ensure cost-effective peak load management. The theoretical analysis shows that our solution has minimal advice complexity, a linear computational cost, and an improved competitive ratio. Finally, we conduct extensive trace-driven experiments on real-world datasets. AMPAMOD achieves a peak shaving success rate of over 90%, outperforming baselines by at least 50%. These experimental results confirm theoretical findings and demonstrate the potential of AMPAMOD.",
    "citationCount": 0,
    "referenceCount": 25
}