{
    "paperId": "e049b083357cd8751183a804374172e2f5ae245e",
    "title": "A Survey of Multi-Dimensional Indexes: Past and Future Trends",
    "year": 2024,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Mingxin Li",
        "Hancheng Wang",
        "Haipeng Dai",
        "Meng Li",
        "Chengliang Chai",
        "Rong Gu",
        "Feng Chen",
        "Zhiyuan Chen",
        "Shuaituan Li",
        "Qizhi Liu",
        "Guihai Chen"
    ],
    "doi": "10.1109/TKDE.2024.3364183",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e049b083357cd8751183a804374172e2f5ae245e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index structures are powerful tools for improving query performance and reducing disk access in database systems. Multi-dimensional indexes, in particular, are used to filter records effectively based on multiple attributes. Classical multi-dimensional index structures, such as KD-Tree, Quadtree, and R-Tree, have been widely used in modern databases. However, advancements in hardware and algorithms have led to the emergence of new types of multi-dimensional index structures. In this paper, we begin by reviewing classical multi-dimensional indexes. Next, we explore the approaches that leverage modern hardware features, such as Solid-State Drive, Non-Volatile Memory, Dynamic Random Access Memory, and Graphics Processing Unit, to improve the performance of multi-dimensional indexes in various aspects. Then, we investigate the novel work of multi-dimensional indexes that apply state-of-the-art machine learning techniques. Finally, we discuss the challenges and future research directions for multi-dimensional indexing methods.",
    "citationCount": 8,
    "referenceCount": 135
}