{
    "paperId": "e0838131a51ba69f6829100b6a17f032e5debd4e",
    "title": "An Improved Data Management Approach for IoT-Enabled Smart Healthcare: Integrating Semantic Web and Reinforcement Learning",
    "year": 2023,
    "venue": "Annual International Computer Software and Applications Conference",
    "authors": [
        "Aytug Turkmen",
        "Özgü Can"
    ],
    "doi": "10.1109/COMPSAC57700.2023.00226",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e0838131a51ba69f6829100b6a17f032e5debd4e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Smart healthcare systems that are able to monitor and manage patients' health in real-time have emerged as a result of the Internet of Things (IoT)-enabled healthcare systems. However, the volume of data created by IoT devices makes data management more challenging in the healthcare industry. Thus, Reinforcement Learning (RL) and Ontology-Based Data Access (OBDA) have been suggested as approaches to address these issues. RL enables computers to learn from their surroundings by making mistakes. Hence, it is used to enhance data management procedures by recognizing patterns in the data and automatically adapting to changes in the data environment. OBDA provides interoperability and data integration through the usage of ontologies that offer a common language and shared understanding of data. Moreover, OBDA allows effective query processing and the smooth integration of several heterogeneous data sources. Ontologies provide formal representations for concepts and their relationships and facilitate the integration of data from multiple sources by overcoming the variety and variability of data. In this study, an OBDA-based approach for IoT-enabled smart healthcare systems is proposed. The proposed approach integrates OBDA with RL to enhance data management and leverages OBDA to offer a common understanding of data across various healthcare applications by supporting effective data integration and interoperability. Therefore, the paper investigates the usage of OBDA and RL to integrate diverse data sources, adjust index architectures, learn from query patterns, and enhance query performance. Thus, the proposed approach offers a promising solution for handling the vast amounts of data produced by IoT-enabled smart healthcare systems. Besides, the query performance will be optimized and query response time will be decreased.",
    "citationCount": 1,
    "referenceCount": 23
}