{
    "paperId": "e0a1b02b702f213b342c706ea6b4577c9a125498",
    "title": "Automated machine learning: past, present and future",
    "year": 2024,
    "venue": "Artificial Intelligence Review",
    "authors": [
        "M. Baratchi",
        "Can Wang",
        "Steffen Limmer",
        "J. N. V. Rijn",
        "Holger H. Hoos",
        "Thomas Bäck",
        "M. Olhofer"
    ],
    "doi": "10.1007/s10462-024-10726-1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e0a1b02b702f213b342c706ea6b4577c9a125498",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s10462-024-10726-1.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automated machine learning (AutoML) is a young research area aiming at making high-performance machine learning techniques accessible to a broad set of users. This is achieved by identifying all design choices in creating a machine-learning model and addressing them automatically to generate performance-optimised models. In this article, we provide an extensive overview of the past and present, as well as future perspectives of AutoML. First, we introduce the concept of AutoML, formally define the problems it aims to solve and describe the three components underlying AutoML approaches: the search space, search strategy and performance evaluation. Next, we discuss hyperparameter optimisation (HPO) techniques commonly used in AutoML systems design, followed by providing an overview of the neural architecture search, a particular case of AutoML for automatically generating deep learning models. We further review and compare available AutoML systems. Finally, we provide a list of open challenges and future research directions. Overall, we offer a comprehensive overview for researchers and practitioners in the area of machine learning and provide a basis for further developments in AutoML.",
    "citationCount": 66,
    "referenceCount": 109
}