{
    "paperId": "e0a342b5e252ecb1e48f975fdd5e8efa46835895",
    "title": "eccDB: a comprehensive repository for eccDNA-mediated chromatin contacts in multi-species",
    "year": 2022,
    "venue": "bioRxiv",
    "authors": [
        "Min Yang",
        "Bo Qiu",
        "Guo-You He",
        "Jianyuan Zhou",
        "Haoming Yu",
        "Yuying Zhang",
        "Yanshang Li",
        "Taisong Li",
        "Jinping Guo",
        "Xuecang Li",
        "Jianjun Xie"
    ],
    "doi": "10.1101/2022.09.22.509011",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e0a342b5e252ecb1e48f975fdd5e8efa46835895",
    "isOpenAccess": true,
    "openAccessPdf": "https://academic.oup.com/bioinformatics/article-pdf/39/4/btad173/50015848/btad173.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The role of extrachromosomal circular DNA (eccDNA) has been highlighted. More recently, eccDNA-chromosome interactions were identified, suggesting a potential role of eccDNA in transcriptional regulation. Several databases currently provide valuable resources for the study of eccDNAs. However, these databases are primarily focused on Human eccDNAs and do not provide analysis of eccDNA-chromosome interaction and eccDNA gene expression in different tissues. Herein, to further integrate available resources for eccDNA data across multiple species, we developed the eccDB database. The current version of eccDB has collected a total of 1,317,182 eccDNAs in 424 samples from four species (homo sapiens, mus musculus, saccharomyces cerevisiae, and arabidopsis thaliana). eccDB provides regulatory and epigenetic information on eccDNA, including typical enhancers, super-enhancers, transcription factors, DNA methylation positions, risk SNPs, expression quantitative trait locus, chromatin accessibility regions, and chromHMM states. In particular, eccDB provides eccDNAs intrachromosomal and interchromosomal interaction analysis to predict the transcriptional regulatory functions of eccDNA. Moreover, eccDB identifies eccDNAs from unknown DNA sequences and analyzes the functional and evolutionary relationships of an eccDNA among different species. Overall, eccDB offers web-based analytical tools and a comprehensive resource for biologists and clinicians to decipher the molecular regulatory mechanisms of eccDNA. eccDB is freely available at http://www.xiejjlab.bio/eccDB",
    "citationCount": 16,
    "referenceCount": 65
}