{
    "paperId": "e0e3e3ae2279c6aeb65cd9ba1ef66bce25c02016",
    "title": "OpticNet: Self-Adjusting Networks for ToR-Matching-ToR Optical Switching Architectures",
    "year": 2023,
    "venue": "IEEE Conference on Computer Communications",
    "authors": [
        "Caio Caldeira",
        "O. A. D. O. Souza",
        "Olga Goussevskaia",
        "Stefan Schmid"
    ],
    "doi": "10.1109/INFOCOM53939.2023.10228883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e0e3e3ae2279c6aeb65cd9ba1ef66bce25c02016",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Demand-aware reconfigurable datacenter networks can be modeled as a ToR-Matching-ToR (TMT) two-layer architecture, in which each top-of-rack (ToR) is represented by a static switch, and n ToRs are connected by a set of reconfigurable optical circuit switches (OCS). Each OCS internally connects a set of in-out ports via a matching that may be updated at runtime. The matching model is a formalization of such networks, where the datacenter topology is defined by the union of matchings over the set of nodes, each of which can be reconfigured at unit cost.In this work we propose a scalable matching model for scenarios where OCS have a constant number of ports. Furthermore, we present OpticNet, a framework that maps a set of n static ToR switches to a set of p-port OCS to form any constant-degree topology. We prove that OpticNet uses a minimal number of reconfigurable switches to realize any desired network topology and allows to apply any existing self-adjusting network (SAN) algorithm on top of it, also preserving amortized performance guarantees. Our experimental results based on real workloads show that OpticNet is a flexible and efficient framework to design efficient SANs.",
    "citationCount": 2,
    "referenceCount": 47
}