{
    "paperId": "e0fe6efa4e0046f6b03d83e5bad4516277c22cee",
    "title": "On Representing Linear Programs by Graph Neural Networks",
    "year": 2022,
    "venue": "International Conference on Learning Representations",
    "authors": [
        "Ziang Chen",
        "Jialin Liu",
        "Xinshang Wang",
        "Jian Lu",
        "W. Yin"
    ],
    "doi": "10.48550/arXiv.2209.12288",
    "arxivId": "2209.12288",
    "url": "https://www.semanticscholar.org/paper/e0fe6efa4e0046f6b03d83e5bad4516277c22cee",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2209.12288",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Learning to optimize is a rapidly growing area that aims to solve optimization problems or improve existing optimization algorithms using machine learning (ML). In particular, the graph neural network (GNN) is considered a suitable ML model for optimization problems whose variables and constraints are permutation--invariant, for example, the linear program (LP). While the literature has reported encouraging numerical results, this paper establishes the theoretical foundation of applying GNNs to solving LPs. Given any size limit of LPs, we construct a GNN that maps different LPs to different outputs. We show that properly built GNNs can reliably predict feasibility, boundedness, and an optimal solution for each LP in a broad class. Our proofs are based upon the recently--discovered connections between the Weisfeiler--Lehman isomorphism test and the GNN. To validate our results, we train a simple GNN and present its accuracy in mapping LPs to their feasibilities and solutions.",
    "citationCount": 43,
    "referenceCount": 57
}