{
    "paperId": "e100c92e1c692e7d99557ee621e284dd236052b4",
    "title": "One Backward from Ten Forward, Subsampling for Large-Scale Deep Learning",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Chaosheng Dong",
        "Xiaojie Jin",
        "Weihao Gao",
        "Yijia Wang",
        "Hongyi Zhang",
        "Xiang Wu",
        "Jianchao Yang",
        "Xiaobing Liu"
    ],
    "doi": null,
    "arxivId": "2104.13114",
    "url": "https://www.semanticscholar.org/paper/e100c92e1c692e7d99557ee621e284dd236052b4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning models in large-scale machine learning systems are often continuously trained with enormous data from production environments. The sheer volume of streaming training data poses a significant challenge to real-time training subsystems and ad-hoc sampling is the standard practice. Our key insight is that these deployed ML systems continuously perform forward passes on data instances during inference, but ad-hoc sampling does not take advantage of this substantial computational effort. Therefore, we propose to record a constant amount of information per instance from these forward passes. The extra information measurably improves the selection of which data instances should participate in forward and backward passes. A novel optimization framework is proposed to analyze this problem and we provide an efficient approximation algorithm under the framework of Mini-batch gradient descent as a practical solution. We also demonstrate the effectiveness of our framework and algorithm on several large-scale classification and regression tasks, when compared with competitive baselines widely used in industry.",
    "citationCount": 5,
    "referenceCount": 62
}