{
    "paperId": "e11bd8c43a4d9f18a59e06a6ffd5e0c7f3eec95a",
    "title": "Fast Video Classification based on unidirectional temporal differences based dynamic spatial selection with custom loss function and new class suggestion",
    "year": 2023,
    "venue": "International Conference on Database Theory",
    "authors": [
        "Prashant Kaushik",
        "Vikas Saxena"
    ],
    "doi": "10.1109/ICDT57929.2023.10150644",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e11bd8c43a4d9f18a59e06a6ffd5e0c7f3eec95a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the new and emerging usages of faster video classification and identifications of new classes has pushed the research in this direction. Be it like similar video detection, percentage of similarity, anomaly detection or finding something trending in the current videos. Use of identification of objects in frames and features in surrounding has proven its advantages for video classifications specially for short video similarity detection. Use of temporally important objects and actions has also proved advantages for video classifications. However existing methods takes huge computation to train the model and does not detect the possibility of new classes. To address this scenario for faster video classification and reducing the training time and computation cost, we propose one directional temporal difference of frames and selectively selecting the spatial information with custom loss function. This allows faster training of the models and has a capability of detecting the new classes in the production videos. This new class detection will provide us new ways looking at video data and thus new kinds of platform conceptualization. Experiments were conducted in UCF and MSVD datasets. Validations were done using statistical methods like f-test etc. Validation for being faster in training are done using comparison of state of the art methods. The novelty of the work lies in the processing of video data for similarity detection in short video and new kinds of intelligence extraction. Which is generated from regression values for possible new classes of video.",
    "citationCount": 2,
    "referenceCount": 24
}