{
    "paperId": "e140c06e9b75286afa64ba9bafe0c2cce2346477",
    "title": "Beyond the Sequence: Statistics-Driven Pre-training for Stabilizing Sequential Recommendation Model",
    "year": 2023,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Sirui Wang",
        "Peiguang Li",
        "Yunsen Xian",
        "Hongzhi Zhang"
    ],
    "doi": "10.1145/3604915.3608821",
    "arxivId": "2404.05342",
    "url": "https://www.semanticscholar.org/paper/e140c06e9b75286afa64ba9bafe0c2cce2346477",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3604915.3608821",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The sequential recommendation task aims to predict the item that user is interested in according to his/her historical action sequence. However, inevitable random action, i.e. user randomly accesses an item among multiple candidates or clicks several items at random order, cause the sequence fails to provide stable and high-quality signals. To alleviate the issue, we propose the StatisTics-Driven Pre-traing framework (called STDP briefly). The main idea of the work lies in the exploration of utilizing the statistics information along with the pre-training paradigm to stabilize the optimization of recommendation model. Specifically, we derive two types of statistical information: item co-occurrence across sequence and attribute frequency within the sequence. And we design the following pre-training tasks: 1) The co-occurred items prediction task, which encourages the model to distribute its attention on multiple suitable targets instead of just focusing on the next item that may be unstable. 2) We generate a paired sequence by replacing items with their co-occurred items and enforce its representation close with the original one, thus enhancing the model’s robustness to the random noise. 3) To reduce the impact of random on user’s long-term preferences, we encourage the model to capture sequence-level frequent attributes. The significant improvement over six datasets demonstrates the effectiveness and superiority of the proposal, and further analysis verified the generalization of the STDP framework on other models.",
    "citationCount": 0,
    "referenceCount": 34
}