{
    "paperId": "e1728155f8cd5cda5719b8d8f2f046518d147030",
    "title": "DLT architectures for trust anchors in 6G",
    "year": 2023,
    "venue": "Annals of Telecommunications",
    "authors": [
        "Dennis Krummacker",
        "Benedikt Veith",
        "Daniel Lindenschmitt",
        "H. Schotten"
    ],
    "doi": "10.1007/s12243-022-00941-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e1728155f8cd5cda5719b8d8f2f046518d147030",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s12243-022-00941-8.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This manuscript investigates viable Distributed Ledger Technology (DLT) architecture approaches to be used as basis for the distribution of integrity verification data. We discuss what can be a Trust Anchor and how the property of trust can be enabled as a service for mobile communications infrastructures. This follows up on a preceding publication, in the course of which a service was developed that can be utilized to create trust and traceability in transactions between other services. Crucial for the integrity of such an audit trail is proof for which side was committing, in case a tampering was detected. For such verification in the aftermath, mechanisms for the distribution of meta data are necessary. Where our ultimate goal is to develop a versatile framework for Trust as a Service (TaaS), the work at hand contributes the investigation on header distribution. We put a major focus on providing Trust as a Service (TaaS) especially in the mobile communications domain since a reliable concept for trustworthiness is indispensable for the vision of organic infrastructures beyond 5G, which means that such networks are flexible regarding their composition and open for stakeholders.",
    "citationCount": 5,
    "referenceCount": 21
}