{
    "paperId": "e17c08757818cede374f02521d7a6cdc08a94e96",
    "title": "Short stem hip arthroplasty with the optimys prosthesis is a safe and effective option for obese patients: a mid-term follow-up multicenter study",
    "year": 2023,
    "venue": "Archives of Orthopaedic and Trauma Surgery",
    "authors": [
        "Nico Hinz",
        "Giulia Marsoni",
        "H. Mittelstädt",
        "Falk Sonnabend",
        "Karsten Wallroth",
        "Carsten Johl",
        "Ulrich Weigert",
        "C. Anderl",
        "Reinhold Ortmaier",
        "Natividad Zeleny",
        "A. Schulz"
    ],
    "doi": "10.1007/s00402-023-05105-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e17c08757818cede374f02521d7a6cdc08a94e96",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s00402-023-05105-4.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Short stems are a valuable option in young patients undergoing total hip arthroplasty (THA) because of their bone stock preserving properties facilitating revision hip arthroplasty. Although the effect of obesity on conventional THA is well studied, data about short stem THA in obese patients are lacking. Therefore, this study aimed to investigate the influence of obesity on complications, revisions, and outcome after short stem THA. Materials and methods This multicenter, observational cohort study included patients undergoing short stem THA with the optimys prosthesis. Follow-up examinations were performed at specific intervals up to 7 years postoperatively. Operation characteristics, general and specific complications, revisions, VAS rest pain, VAS load pain, VAS patient satisfaction, and Harris Hip Score (HHS) were recorded and statistically compared between obese (BMI ≥ 30 kg/m2) and non-obese (BMI < 30 kg/m2) patients. Results Of the 224 patients included with a mean follow-up of 87.2 months (range 81.9–104.0), 69 were assigned to the OB group and 155 to the non-OB group. A minimally invasive approach was significantly less often selected in obese patients (p = 0.049), whereas operating time and length of hospital stay were not significantly different. The rate of general and specific complications did not significantly differ between both groups. Survival of the optimys prosthesis was 99.1% at 7-year follow-up and one patient per group had to undergo revision surgery. VAS rest pain, load pain, and satisfaction improved from preoperatively to postoperatively in both groups without a significant difference between both groups. While the HHS was improved from preoperatively to postoperatively, obese patients showed a significantly lower HHS at the 7-year follow-up (p = 0.01) but still exhibited an excellent scoring above the PASS threshold. Conclusion Short stem THA with the optimys prosthesis is a safe and effective option also in obese patients with an excellent clinical outcome and a low complication rate.",
    "citationCount": 4,
    "referenceCount": 83
}