{
    "paperId": "e17c7f60569c4ddec44709524614e0fd4ef8db20",
    "title": "From Conventional to Machine Learning Methods for Maritime Risk Assessment",
    "year": 2021,
    "venue": "TransNav: International Journal on Marine Navigation and Safety of Sea Transportation",
    "authors": [
        "Andrew Rawson",
        "M. Brito",
        "Z. Sabeur",
        "Long Tran-Thanh"
    ],
    "doi": "10.12716/1001.15.04.06",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e17c7f60569c4ddec44709524614e0fd4ef8db20",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.12716/1001.15.04.06",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Within the last thirty years, the range and complexity of methodologies proposed to assess maritime risk have increased significantly. Techniques such as expert judgement, incident analysis, geometric models, domain analysis and Bayesian Networks amongst many others have become dominant within both the literature and industry. On top of this, advances in machine learning algorithms and big data have opened opportunities for new methods which might overcome some limitations of conventional approaches. Yet, determining the suitability or validity of one technique over another is challenging as it requires a systematic multicriteria approach to compare the inputs, assumptions, methodologies and results of each method. Within this paper, such an approach is proposed and tested within an isolated waterway in order to justify the proposed advantages of a machine learning approach to maritime risk assessment and should serve as inspiration for future work. http://www.transnav.eu the International Journal on Marine Navigation and Safety of Sea Transportation Volume 15",
    "citationCount": 9,
    "referenceCount": 42
}