{
    "paperId": "e1a73ff22dd2e34188874e5421b546a71d82a76b",
    "title": "SUM'20: State-based User Modelling",
    "year": 2020,
    "venue": "Web Search and Data Mining",
    "authors": [
        "Sahan Bulathwela",
        "M. Pérez-Ortiz",
        "Rishabh Mehrotra",
        "D. Orlic",
        "C. D. L. Higuera",
        "J. Shawe-Taylor",
        "Emine Yilmaz"
    ],
    "doi": "10.1145/3336191.3371883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e1a73ff22dd2e34188874e5421b546a71d82a76b",
    "isOpenAccess": true,
    "openAccessPdf": "https://discovery.ucl.ac.uk/10093840/1/WSDM_state_based_workshop%284%29.pdf",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Capturing and effectively utilising user states and goals is becoming a timely challenge for successfully leveraging intelligent and usercentric systems in differentweb search and data mining applications. Examples of such systems are conversational agents, intelligent assistants, educational and contextual information retrieval systems, recommender/match-making systems and advertising systems, all of which rely on identifying the user state in order to provide the most relevant information and assist users in achieving their goals. There has been, however, limited work towards building such state-aware intelligent learning mechanisms. Hence, devising information systems that can keep track of the user's state has been listed as one of the grand challenges to be tackled in the next few years [1]. It is thus timely to organize a workshop that re-visits the problem of designing and evaluating state-aware and user-centric systems, ensuring that the community (spanning academic and industrial backgrounds) works together to tackle these challenges.",
    "citationCount": 6,
    "referenceCount": 3
}