{
    "paperId": "e1b01eb98a15b81f3529e45020fdc5c0654bdd14",
    "title": "Position-aware Graph Transformer for Recommendation",
    "year": 2024,
    "venue": "ACM Transactions on Information Systems",
    "authors": [
        "Jiajia Chen",
        "Jiancan Wu",
        "Jiawei Chen",
        "Chongming Gao",
        "Yong Li",
        "Xiang Wang"
    ],
    "doi": "10.48550/arXiv.2412.18731",
    "arxivId": "2412.18731",
    "url": "https://www.semanticscholar.org/paper/e1b01eb98a15b81f3529e45020fdc5c0654bdd14",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Collaborative recommendation fundamentally involves learning high-quality user and item representations from interaction data. Recently, graph convolution networks (GCNs) have advanced the field by utilizing high-order connectivity patterns in interaction graphs, as evidenced by state-of-the-art methods like PinSage and LightGCN. However, one key limitation has not been well addressed in existing solutions: capturing long-range collaborative filtering signals, which are crucial for modeling user preference. In this work, we propose a new graph transformer (GT) framework—Position-aware Graph Transformer for Recommendation (PGTR), which combines the global modeling capability of Transformer blocks with the local neighborhood feature extraction of GCNs. The key insight is to explicitly incorporate node position and structure information from the user-item interaction graph into GT architecture via several purpose-designed positional encodings. The long-range collaborative signals from the Transformer block are then combined linearly with the local neighborhood features from the GCN backbone to enhance node embeddings for final recommendations. Empirical studies demonstrate the effectiveness of the proposed PGTR method when implemented on various GCN-based backbones across four real-world datasets and the robustness against interaction sparsity as well as noise. Our implementations are available in GitHub: https://github.com/MEICRS/PGTR.",
    "citationCount": 0,
    "referenceCount": 53
}