{
    "paperId": "e1d89e5a9585a28c9530e2e336876d3dd41c021d",
    "title": "PARADE: Passage Representation Aggregation forDocument Reranking",
    "year": 2020,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Canjia Li",
        "Andrew Yates",
        "Sean MacAvaney",
        "Ben He",
        "Yingfei Sun"
    ],
    "doi": "10.1145/3600088",
    "arxivId": "2008.09093",
    "url": "https://www.semanticscholar.org/paper/e1d89e5a9585a28c9530e2e336876d3dd41c021d",
    "isOpenAccess": true,
    "openAccessPdf": "https://eprints.gla.ac.uk/298257/2/298257.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Pre-trained transformer models, such as BERT and T5, have shown to be highly effective at ad hoc passage and document ranking. Due to the inherent sequence length limits of these models, they need to process document passages one at a time rather than processing the entire document sequence at once. Although several approaches for aggregating passage-level signals into a document-level relevance score have been proposed, there has yet to be an extensive comparison of these techniques. In this work, we explore strategies for aggregating relevance signals from a document’s passages into a final ranking score. We find that passage representation aggregation techniques can significantly improve over score aggregation techniques proposed in prior work, such as taking the maximum passage score. We call this new approach PARADE. In particular, PARADE can significantly improve results on collections with broad information needs where relevance signals can be spread throughout the document (such as TREC Robust04 and GOV2). Meanwhile, less complex aggregation techniques may work better on collections with an information need that can often be pinpointed to a single passage (such as TREC DL and TREC Genomics). We also conduct efficiency analyses and highlight several strategies for improving transformer-based aggregation.",
    "citationCount": 122,
    "referenceCount": 127
}