{
    "paperId": "e1dc3b7dfd9a37d400c7e37495c535e544c00353",
    "title": "Spanning Tree-based Query Plan Enumeration",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Yesdaulet Izenov",
        "Asoke Datta",
        "Brian Tsan",
        "Abylay Amanbayev",
        "Florin Rusu"
    ],
    "doi": "10.48550/arXiv.2403.04026",
    "arxivId": "2403.04026",
    "url": "https://www.semanticscholar.org/paper/e1dc3b7dfd9a37d400c7e37495c535e544c00353",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this work, we define the problem of finding an optimal query plan as finding spanning trees with low costs. This approach empowers the utilization of a series of spanning tree algorithms, thereby enabling systematic exploration of the plan search space over a join graph. Capitalizing on the polynomial time complexity of spanning tree algorithms, we present the Ensemble Spanning Tree Enumeration (ESTE) strategy. ESTE employs two conventional spanning tree algorithms, Prim's and Kruskal's, together to enhance the robustness of the query optimizer. In ESTE, multiple query plans are enumerated exploring different areas of the search space. This positions ESTE as an intermediate strategy between exhaustive and heuristic enumeration strategies. We show that ESTE is more robust in identifying efficient query plans for large queries. In the case of data modifications and workload demand increase, we believe that our approach can be a cheaper alternative to maintain optimizer robustness by integrating additional spanning tree algorithms rather than completely changing the optimizer to another plan enumeration algorithm. The experimental evaluation shows that ESTE achieves better consistency in plan quality and optimization time than existing solutions while identifying similarly optimal plans.",
    "citationCount": 0,
    "referenceCount": 46
}