{
    "paperId": "e1f2a3c0dc2619406919584294edac0c437a789d",
    "title": "Optimizing Tag-Based Image Search: A Social Re-Ranking Strategy for Enhanced Relevance and Diversity",
    "year": 2024,
    "venue": "2024 2nd International Conference on Advances in Computation, Communication and Information Technology (ICAICCIT)",
    "authors": [
        "Murlidhar Mouriya",
        "P. Sammulal"
    ],
    "doi": "10.1109/ICAICCIT64383.2024.10912244",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e1f2a3c0dc2619406919584294edac0c437a789d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The paper introduces a social re-ranking system for tag-based image retrieval to optimize search results’ relevance and diversity. It tackles the challenge of ensuring that the top-ranked images are relevant and diverse by accounting for visual, semantic, and social dimensions. The retrieval process begins with images sourced based on user-contributed tags, likely triggered by a user-entered search query. Following this, the images are ranked according to the contributions of the users who uploaded them, with users contributing more significantly to the query ranking higher. This step suggests that images from these top-ranking users are considered more relevant to the search. An additional re-ranking occurs Within each user’s set of images, designed to maintain diversity and prevent numerous similar images from the same user from dominating the results. The selected images from this intra-user re-ranking phase form the final output, offering a mix of relevant and diverse content. This process likely involves indexing images using associated tags and metadata. The method’s performance and efficiency are validated through experimental tests on a Flickr dataset. Overall, this approach offers a comprehensive solution to critical challenges in tag-based image retrieval on social media platforms, as it thoughtfully integrates both inter-user and intra-user considerations to enhance the user experience with more relevant and diverse results.",
    "citationCount": 0,
    "referenceCount": 30
}