{
    "paperId": "e2a0685a56ef39bf840747ee99e9b0a8dc54b2fa",
    "title": "Reducing UI Complexity Using Use Case Analysis in Adaptive Interfaces",
    "year": 2025,
    "venue": "Computers, Materials &amp; Continua",
    "authors": [
        "Qing-Xing Qu",
        "Le Zhang",
        "Fu Guo",
        "Vincent G. Duffy"
    ],
    "doi": "10.32604/cmc.2025.069245",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e2a0685a56ef39bf840747ee99e9b0a8dc54b2fa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": This study aims to validate the Object-Oriented User Interface Customization (OOUIC) framework by employing Use Case Analysis (UCA) to facilitate the development of adaptive User Interfaces (UIs). The OOUIC framework advocates for User-Centered Design (UCD) methodologies, including UCA, to systematically identify intricate user requirements and construct adaptive UIs tailored to diverse user needs. To operationalize this approach, thirty users of Product Lifecycle Management (PLM) systems were interviewed across six distinct use cases. Interview transcripts were subjected to deductive content analysis to classify UI objects systematically. Subsequently, adaptive UIs were developed for each use case, and their complexity was quantitatively compared against the original system UIs. The results demonstrated a significant reduction in complexity across all adaptive UIs (Mean Difference, MD = 0.11, t(5) = 8.26, p < 0.001), confirming their superior efficiency. The findings validate the OOUIC framework, demonstrating that UCD effectively captures complex requirements for adaptive UI development, while adaptive UIs mitigate interface complexity through object reduction and optimized layout design. Furthermore, UCA and deductive content analysis serve as robust methodologies for object categorization in adaptive UI design. Beyond eliminating redundant elements and prioritizing object grouping, designers can further reduce complexity by adjusting object dimensions and window sizing. This study underscores the efficacy of UCA in developing adaptive UIs and streamlining complex interfaces. Ultimately, UCD proves instrumental in gathering intricate requirements, while adaptive UIs enhance usability by minimizing object clutter and refining spatial organization.",
    "citationCount": 0,
    "referenceCount": 45
}