{
    "paperId": "e3192264cf30097adb6e5c223662ad49004194d7",
    "title": "Learned Index on GPU",
    "year": 2022,
    "venue": "2022 IEEE 38th International Conference on Data Engineering Workshops (ICDEW)",
    "authors": [
        "Xun Zhong",
        "Yong Zhang",
        "Yu Chen",
        "Chao Li",
        "Chunxiao Xing"
    ],
    "doi": "10.1109/icdew55742.2022.00024",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e3192264cf30097adb6e5c223662ad49004194d7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index is a key structure created to quickly access specific information in database. Recent research on “learned indexes” has received extensive attention. The key idea is that index can be regarded as a model that maps keys to specific locations in data sets, so the traditional index structure can be replaced by machine learning models. Current learned indexes universally gain higher time efficiency and occupy smaller space than traditional indexes, but their query efficiency and concurrency are limited by CPU. GPU is widely used in computing intensive tasks because of its unique architecture and powerful computing ability. According to the research on learned index in recent years, we propose a new trait of thought to combine the advantages of GPU and learned index, which puts learned index in GPU memory and makes full use of the high concurrency and computing power of GPU. We implement the PGM-index on GPU and conduct an extensive set of experiments on several real-life and synthetic datasets. The results demonstrate that our method beats the original learned index on CPU by up to 20× for static workloads when query scale is large.",
    "citationCount": 6,
    "referenceCount": 16
}