{
    "paperId": "e397e8cd1b3193846841f2e87534c3fcff145b84",
    "title": "Fairness-Aware Graph Learning: A Benchmark",
    "year": 2025,
    "venue": "Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.2",
    "authors": [
        "Yushun Dong",
        "Song Wang",
        "Zhenyu Lei",
        "Zaiyi Zheng",
        "Jing Ma",
        "Chen Chen",
        "Jundong Li"
    ],
    "doi": "10.1145/3711896.3737392",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e397e8cd1b3193846841f2e87534c3fcff145b84",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fairness-aware graph learning has gained increasing attention in recent years. Nevertheless, there lacks a comprehensive benchmark to evaluate and compare different fairness-aware graph learning methods, which blocks practitioners from choosing appropriate ones for broader real-world applications. In this paper, we present an extensive benchmark on ten representative fairness-aware graph learning methods. Specifically, we design a systematic evaluation protocol and conduct experiments on seven real-world datasets to evaluate these methods from multiple perspectives, including group fairness, individual fairness, the balance between different fairness criteria, and computational efficiency. Our in-depth analysis reveals key insights into the strengths and limitations of existing methods. Additionally, we provide practical guidance for applying fairness-aware graph learning methods in applications. To the best of our knowledge, this work serves as an initial step towards comprehensively understanding representative fairness-aware graph learning methods to facilitate future advancements in this area. Open-source code can be found at: https://github.com/yushundong/Fairness-Aware-Graph-Learning-Benchmark.",
    "citationCount": 1,
    "referenceCount": 91
}