{
    "paperId": "e3ad40c607557b4ce071ad4a44bfcd4fec7cfe87",
    "title": "Discrete Listwise Content-aware Recommendation",
    "year": 2023,
    "venue": "ACM Transactions on Knowledge Discovery from Data",
    "authors": [
        "Fangyuan Luo",
        "Jun Wu",
        "Tao Wang"
    ],
    "doi": "10.1145/3609334",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e3ad40c607557b4ce071ad4a44bfcd4fec7cfe87",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To perform online inference efficiently, hashing techniques, devoted to encoding model parameters as binary codes, play a key role in reducing the computational cost of content-aware recommendation (CAR), particularly on devices with limited computation resource. However, current hashing methods for CAR fail to align their learning objectives (e.g., squared loss) with the ranking-based metrics (e.g., Normalized Discounted Cumulative Gain (NDCG)), resulting in suboptimal recommendation accuracy. In this article, we propose a novel ranking-based CAR hashing method based on Factorization Machine (FM), called Discrete Listwise FM (DLFM), for fast and accurate recommendation. Concretely, our DLFM is to optimize NDCG in the Hamming space for preserving the listwise user-item relationships. We devise an efficient algorithm to resolve the challenging DLFM problem, which can directly learn binary parameters in a relaxed continuous solution space, without additional quantization. Particularly, our theoretical analysis shows that the optimal solution to the relaxed continuous optimization problem is approximately the same as that of the original discrete optimization problem. Through extensive experiments on two real-world datasets, we show that DLFM consistently outperforms state-of-the-art hashing-based recommendation techniques.",
    "citationCount": 3,
    "referenceCount": 62
}