{
    "paperId": "e3d3e0d9eeda97086ff267361107e7c372a82122",
    "title": "Optimization of Cyber Tactics in Sports Strategies Using Hybrid AI Decision-Making Technologies",
    "year": 2022,
    "venue": "Computational Intelligence and Neuroscience",
    "authors": [
        "Mei-Mei Duan"
    ],
    "doi": "10.1155/2022/3762755",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e3d3e0d9eeda97086ff267361107e7c372a82122",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/cin/2022/3762755.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "One of the main problems of modern research concerns the optimal design of solutions to address cybersecurity problems, with methods that provide the ability to choose an objective function different from that of the classic problem of more economical design while allowing the use of constraints on any possible variable during planning, including financial resources. The number of corresponding solutions concerns the issue of optimal design of security strategies with a simulation that lies in game theory, with players, the defender on one side defending the system managing the available options of strategic solutions, and the attacker, who chooses the way to strike the system, based on some attack scenarios that cannot be easily predicted. The inherent difficulty of implementing the proposed solutions lies in the combined explosion of all possible combinations that make up the solution space, the complete examination of which requires a lot of computational time and computing resources, to the point that their use becomes unprofitable. This weakness is attributed to even minor problems, and the possible strategies available to the defender are finite but at the same time numerous. To solve the abovementioned problem, the work proposes a hybrid system that aims to identify the best possible approach in the theoretically optimal solution in a short time and with minimal computing resources. Specifically, a heuristic optimization methodology is used with overlapping answers between two contiguous neighborhoods based on the Bloom Filters structure that supports fast listings and searches. This methodology, which is evaluated in optimizing safety strategies in the sports industry, brings about 40% optimization.",
    "citationCount": 2,
    "referenceCount": 62
}