{
    "paperId": "e3e7884cb365668d415416d584c376a48146c667",
    "title": "Explainable autonomous robots in continuous state space based on graph-structured world model",
    "year": 2023,
    "venue": "Adv. Robotics",
    "authors": [
        "Site Hu",
        "Takayuki Nagai"
    ],
    "doi": "10.1080/01691864.2023.2236189",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e3e7884cb365668d415416d584c376a48146c667",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/01691864.2023.2236189?needAccess=true",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Autonomous robots using deep reinforcement learning have demonstrated superior capabilities on relatively simple specific tasks, but they often lack high-level, abstract planning capabilities when faced with complex, long-horizon tasks. Even if the autonomous robot successfully achieves long-horizon goals, users find it difficult to trust their decision-making process. To increase user trust in the decision-making process when an autonomous robot executes a long-horizon task, this paper proposes an algorithm that empowers the autonomous agent to explain to users the transition from the current state to the target state in a continuous state space, as well as to explain the errors in user estimates. A framework that uses a graph-based world model is proposed to identify important nodes and reachability between nodes in the decision-making process; based on these nodes and reachability, the model generates the required explanations. To validate our proposed method's ability to generate long-horizon plans and explanations, we conducted experiments in PointMaze environments. Our simulation results confirm the effectiveness of our approach in generating reliable world models for long-horizon tasks. Moreover, our explanations, based on these world models, significantly enhance the user's understanding of the autonomous robotic decision-making process and the system's capabilities and limitations. GRAPHICAL ABSTRACT",
    "citationCount": 4,
    "referenceCount": 38
}