{
    "paperId": "e40ca38b869514db0268dd45bdf261da086d9edf",
    "title": "Revisiting BPR: A Replicability Study of a Common Recommender System Baseline",
    "year": 2024,
    "venue": "ACM Conference on Recommender Systems",
    "authors": [
        "Aleksandr Milogradskii",
        "Oleg Lashinin",
        "Alexander P",
        "Marina Ananyeva",
        "Sergey Kolesnikov"
    ],
    "doi": "10.1145/3640457.3688073",
    "arxivId": "2409.14217",
    "url": "https://www.semanticscholar.org/paper/e40ca38b869514db0268dd45bdf261da086d9edf",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3640457.3688073",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bayesian Personalized Ranking (BPR), a collaborative filtering approach based on matrix factorization, frequently serves as a benchmark for recommender systems research. However, numerous studies often overlook the nuances of BPR implementation, claiming that it performs worse than newly proposed methods across various tasks. In this paper, we thoroughly examine the features of the BPR model, indicating their impact on its performance, and investigate open-source BPR implementations. Our analysis reveals inconsistencies between these implementations and the original BPR paper, leading to a significant decrease in performance of up to 50% for specific implementations. Furthermore, through extensive experiments on real-world datasets under modern evaluation settings, we demonstrate that with proper tuning of its hyperparameters, the BPR model can achieve performance levels close to state-of-the-art methods on the top-n recommendation tasks and even outperform them on specific datasets. Specifically, on the Million Song Dataset, the BPR model with hyperparameters tuning statistically significantly outperforms Mult-VAE by 10% in NDCG@100 with binary relevance function.",
    "citationCount": 12,
    "referenceCount": 66
}