{
    "paperId": "e41b2f474d5ca81ad6d907ce7e8c7cc34410df81",
    "title": "The First Telomere-to-Telomere Chromosome-Level Genome Assembly of Stagonospora tainanensis Causing Sugarcane Leaf Blight",
    "year": 2022,
    "venue": "Journal of Fungi",
    "authors": [
        "Fu Xu",
        "Xiuxiu Li",
        "Hui Ren",
        "R. Zeng",
        "Zhoutao Wang",
        "Hongli Hu",
        "Jiandong Bao",
        "Y. Que"
    ],
    "doi": "10.3390/jof8101088",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e41b2f474d5ca81ad6d907ce7e8c7cc34410df81",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2309-608X/8/10/1088/pdf?version=1666698729",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The sexual morph Leptosphaeria taiwanensis Yen and Chi and its asexual morph Stagonospora tainanensis W. H. Hsieh is an important necrotrophic fungal phytopathogen, which causes sugarcane leaf blight, resulting in loss of cane tonnage and sucrose in susceptible sugarcane varieties. Decoding the genome and understanding of the basis of virulence is vitally important for devising effective disease control strategies. Here, we present a 38.25-Mb high-quality genome assembly of S. tainanensis strain StFZ01, denovo assembled with 10.19 Gb Nanopore sequencing long reads (~267×) and 3.82 Gb Illumina short reads (~100×). The genome assembly consists of 12 contigs with N50 of 2.86 Mb of which 5 belong to the telomere to telomere (T2T) chromosome. It contains 13.20% repeat sequences, 12,543 proteins, and 12,206 protein-coding genes with the BUSCO completeness 99.18% at fungi (n = 758) and 99.87% at ascomycota (n = 1706), indicating the high accuracy and completeness of our gene annotations. The virulence analysis in silico revealed the presence of 2379 PHIs, 599 CAZys, 248 membrane transport proteins, 191 cytochrome P450 enzymes, 609 putative secreted proteins, and 333 effectors in the StFZ01 genome. The genomic resources presented here will not only be helpful for development of specific molecular marker and diagnosis technique, population genetics, molecular taxonomy, and disease managements, it can also provide a significant precise genomic reference for investigating the ascomycetous genome, the necrotrophic lifestyle, and pathogenicity in the future.",
    "citationCount": 7,
    "referenceCount": 81
}