{
    "paperId": "e4207f37eaa14fabfa14b41e96975b51938bbdcc",
    "title": "EnhanceGraph: A Continuously Enhanced Graph-based Index for High-dimensional Approximate Nearest Neighbor Search",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Xiaoyao Zhong",
        "Jiabao Jin",
        "Peng Cheng",
        "Mingyu Yang",
        "Lei Chen",
        "Haoyang Li",
        "Zhitao Shen",
        "Xuemin Lin",
        "H. Shen",
        "Jingkuan Song"
    ],
    "doi": "10.48550/arXiv.2506.13144",
    "arxivId": "2506.13144",
    "url": "https://www.semanticscholar.org/paper/e4207f37eaa14fabfa14b41e96975b51938bbdcc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recently, Approximate Nearest Neighbor Search in high-dimensional vector spaces has garnered considerable attention due to the rapid advancement of deep learning techniques. We observed that a substantial amount of search and construction logs are generated throughout the lifespan of a graph-based index. However, these two types of valuable logs are not fully exploited due to the static nature of existing indexes. We present the EnhanceGraph framework, which integrates two types of logs into a novel structure called a conjugate graph. The conjugate graph is then used to improve search quality. Through theoretical analyses and observations of the limitations of graph-based indexes, we propose several optimization methods. For the search logs, the conjugate graph stores the edges from local optima to global optima to enhance routing to the nearest neighbor. For the construction logs, the conjugate graph stores the pruned edges from the proximity graph to enhance retrieving of k nearest neighbors. Our experimental results on several public and real-world industrial datasets show that EnhanceGraph significantly improves search accuracy with the greatest improvement on recall from 41.74% to 93.42%, but does not sacrifices search efficiency. In addition, our EnhanceGraph algorithm has been integrated into Ant Group's open-source vector library, VSAG.",
    "citationCount": 0,
    "referenceCount": 46
}