{
    "paperId": "e42a3b4f94bb42b91adca6c4429b85fb24f9aeed",
    "title": "Learned Data Compression: Challenges and Opportunities for the Future",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Qiyu Liu",
        "Siyuan Han",
        "Jianwei Liao",
        "Jin Li",
        "Jingshu Peng",
        "Jun Du",
        "Lei Chen"
    ],
    "doi": "10.48550/arXiv.2412.10770",
    "arxivId": "2412.10770",
    "url": "https://www.semanticscholar.org/paper/e42a3b4f94bb42b91adca6c4429b85fb24f9aeed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Compressing integer keys is a fundamental operation among multiple communities, such as database management (DB), information retrieval (IR), and high-performance computing (HPC). Recent advances in \\emph{learned indexes} have inspired the development of \\emph{learned compressors}, which leverage simple yet compact machine learning (ML) models to compress large-scale sorted keys. The core idea behind learned compressors is to \\emph{losslessly} encode sorted keys by approximating them with \\emph{error-bounded} ML models (e.g., piecewise linear functions) and using a \\emph{residual array} to guarantee accurate key reconstruction. While the concept of learned compressors remains in its early stages of exploration, our benchmark results demonstrate that an SIMD-optimized learned compressor can significantly outperform state-of-the-art CPU-based compressors. Drawing on our preliminary experiments, this vision paper explores the potential of learned data compression to enhance critical areas in DBMS and related domains. Furthermore, we outline the key technical challenges that existing systems must address when integrating this emerging methodology.",
    "citationCount": 2,
    "referenceCount": 85
}