{
    "paperId": "e442a5c053035754ffc6e5bf98bfb884f5fc3a06",
    "title": "Machine learning study of shoreline change in Western and Southwestern coastlines of Sri Lanka",
    "year": 2025,
    "venue": "Maritime Engineering",
    "authors": [
        "Horagolle Gedara Devinda Vimukthi Dananjaya",
        "Pattiyage Ishan Ayantha Gomes",
        "Dongfang Liang"
    ],
    "doi": "10.1680/jmaen.25.00028",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e442a5c053035754ffc6e5bf98bfb884f5fc3a06",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Shoreline change per year, also known as end point rate (EPR), showed a skewed normal distribution but without a clear spatial trend for the period 2013–2023 in the western and southern coastal belts. The performance of four machine learning (ML) algorithms was evaluated by dividing the EPR into three or five classes. The three-class EPR approach gave more predictive power. With hyperparameter tuning, the random forest (RF) algorithm demonstrated 0.69 accuracy in EPR prediction, whereas the artificial neural network, support vector machine, and k-nearest neighbour showed accuracies at 0.63, 0.58, and 0.52, respectively. The RF model in any EPR class showed more than 50% accuracy and was thus used as the ML prediction tool. Global Shapely additive explanations illustrated that the presence of port structures, distance to the river mouth, and geomorphology contributed significantly to the overall predictions. Model validation using a separate coastal stretch resulted in a 0.66 accuracy, demonstrating the model’s generalisation ability.",
    "citationCount": 0,
    "referenceCount": 42
}