{
    "paperId": "e457ea702fcbb1b93f5348a1588d640f18ba2126",
    "title": "Query Performance Explanation through Large Language Model for HTAP Systems",
    "year": 2024,
    "venue": "International Conference on Extending Database Technology",
    "authors": [
        "Haibo Xiu",
        "Li Zhang",
        "Tieying Zhang",
        "Jun Yang",
        "Jianjun Chen"
    ],
    "doi": "10.48550/arXiv.2412.01709",
    "arxivId": "2412.01709",
    "url": "https://www.semanticscholar.org/paper/e457ea702fcbb1b93f5348a1588d640f18ba2126",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In hybrid transactional and analytical processing (HTAP) systems, users often struggle to understand why query plans from one engine (OLAP or OLTP) perform significantly slower than those from another. Although optimizers provide plan details via the EXPLAIN function, these explanations are frequently too technical for non-experts and offer limited insights into performance differences across engines. To address this, we propose a novel framework that leverages large language models (LLMs) to explain query performance in HTAP systems. Built on Retrieval-Augmented Generation (RAG), our framework constructs a knowledge base that stores historical query executions and expert-curated explanations. To enable efficient retrieval of relevant knowledge, query plans are embedded using a lightweight tree-CNN classifier. This augmentation allows the LLM to generate clear, context-aware explanations of performance differences between engines. Our approach demonstrates the potential of LLMs in hybrid engine systems, paving the way for further advancements in database optimization and user support.",
    "citationCount": 1,
    "referenceCount": 23
}