{
    "paperId": "e487aeec1209264482259220972375ffaa9ba4ed",
    "title": "Prediction of Soybean Yield at the County Scale Based on Multi-Source Remote-Sensing Data and Deep Learning Models",
    "year": 2025,
    "venue": "Agriculture",
    "authors": [
        "Hongkun Fu",
        "Jian Li",
        "Jian Lu",
        "Xinglei Lin",
        "Junrui Kang",
        "Wenlong Zou",
        "Xiangyu Ning",
        "Yue Sun"
    ],
    "doi": "10.3390/agriculture15131337",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e487aeec1209264482259220972375ffaa9ba4ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Against the backdrop of global food security challenges, precise pre-harvest yield estimation of large-scale soybean crops is crucial for optimizing agricultural resource allocation and ensuring stable food supplies. This study developed an integrated prediction model for county-level soybean yield forecasting, which combines multi-source remote-sensing data with advanced deep learning techniques. The ant colony optimization-convolutional neural network with gated recurrent units and multi-head attention (ACGM) model showcases remarkable predictive prowess, as evidenced by a coefficient of determination (R2) of 0.74, a root mean square error (RMSE) of 123.94 kg/ha, and a mean absolute error (MAE) of 105.39 kg/ha. When pitted against other models, including the random forest regression (RFR), support vector regression (SVR), extreme gradient boosting (XGBoost), and convolutional neural network (CNN) models, the ACGM model clearly emerges as the superior performer. This study identifies August as the optimal period for early soybean yield prediction, with the model performing best when combining environmental and photosynthetic parameters (ED + PP). The ACGM model demonstrates a good accuracy and generalization ability, providing a practical approach for refined agricultural management. By integrating deep learning with open-source remote-sensing data, this research opens up new avenues for enhancing agricultural decision-making and safeguarding food security.",
    "citationCount": 0,
    "referenceCount": 72
}