{
    "paperId": "e49e18033c02dd1c691c3146662e272a4c96b94d",
    "title": "Cross-Subject EEG Feedback for Implicit Image Generation",
    "year": 2024,
    "venue": "IEEE Transactions on Cybernetics",
    "authors": [
        "Carlos de la Torre-Ortiz",
        "Michiel M. A. Spapé",
        "N. Ravaja",
        "Tuukka Ruotsalo"
    ],
    "doi": "10.1109/TCYB.2024.3406159",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e49e18033c02dd1c691c3146662e272a4c96b94d",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tcyb.2024.3406159",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative models are powerful tools for producing novel information by learning from example data. However, the current approaches require explicit manual input to steer generative models to match human goals. Furthermore, how these models would integrate implicit, diverse feedback and goals of multiple users remains largely unexplored. Here, we present a first-of-its-kind system that produces novel images of faces by inferring human goals directly from cross-subject brain signals while study subjects are looking at example images. We report on an experiment where brain responses to images of faces were recorded using electroencephalography in 30 subjects, focusing on specific salient visual features (VFs). Preferences toward VFs were decoded from subjects’ brain responses and used as implicit feedback for a generative adversarial network (GAN), which generated new images of faces. The results from a follow-up user study evaluating the presence of the target salient VFs show that the images generated from brain feedback represent the goal of the study subjects and are comparable to images generated with manual feedback. The methodology provides a stepping stone toward humans-in-the-loop image generation.",
    "citationCount": 7,
    "referenceCount": 72
}