{
    "paperId": "e4be418380acf63f95ca494a6418d28a752ae163",
    "title": "TieredKV: A Tiered LSM-Learned Index Design for Superior Performance on Storage",
    "year": 2025,
    "venue": "Annual Haifa Experimental Systems Conference",
    "authors": [
        "Wenlong Wang",
        "D. Du"
    ],
    "doi": "10.1145/3757347.3759135",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e4be418380acf63f95ca494a6418d28a752ae163",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We present TieredKV, a novel tiered key-value store that seamlessly integrates a Log-Structured Merge (LSM) tree with a Learned Index to achieve superior read and write performance on storage systems. While existing approaches use learned indexes primarily as auxiliary components within LSM trees, TieredKV employs a two-tier design where the LSM tree handles recent write operations while a separate Learned Index accelerates read performance. Our design includes a non-blocking conversion mechanism that efficiently transforms LSM data into a Learned Index during garbage collection, maintaining high performance without interrupting operations. TieredKV dramatically reduces LSM size through this tiered approach, leading to significant performance gains in both reads and writes. Extensive evaluations across diverse workloads show that TieredKV outperforms state-of-the-art LSM-based solutions by up to 4.32x for read operations and 1.43x for writes, and achieves up to 7.9x better overall performance compared with on-storage Learned Index. The system demonstrates robust performance across different data distributions, access patterns, and storage media including both SSDs and HDDs.",
    "citationCount": 0,
    "referenceCount": 49
}