{
    "paperId": "e4c1dae16c6e8e7a8724fa7b573e874536fcf735",
    "title": "Kiln predictive modelization for performance optimization",
    "year": 2023,
    "venue": "The International Journal of Advanced Manufacturing Technology",
    "authors": [
        "Mohammed Toum Benchekroun",
        "S. Zaki",
        "M. Aboussaleh"
    ],
    "doi": "10.1007/s00170-023-11563-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e4c1dae16c6e8e7a8724fa7b573e874536fcf735",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.researchsquare.com/article/rs-2462189/latest.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The process of cement manufacturing is both energy intensive and difficult to control. This complicated process results in inefficiencies in energy consumption and variations in cement quality with many complex influencing process factors such as input raw materials, variable fuels, firing conditions including temperature, burning, and reside time. Therefore, in order to address these challenges and investigate the effect of parameters and system optimization, the processes must be modeled first. This predictive model will be used to support process energy use reductions while maintaining and improving product quality. This article presents a study on the use of machine learning models to predict clinker kiln flow rate based on process parameters. The study tested different models such as linear regression, Extra Trees regressor, random forest, K-nearest neighbor, XGB regressor, and neural network and found that the linear regression model performed the best due to its ability to handle overfitting pretty well using dimensionally reduction techniques, regularization, and cross-validation. In fact, the predictive model found enable to predict kiln feed rate at an early stage based on a total of 91 significant input parameters and enable to make future suggestions for action to optimize the control of the kiln process. The findings have significant implications for the process and operation related to the kiln performances which implies potential reduction in terms of energy consumption and gas emissions and improvement of operational efficiency.",
    "citationCount": 4,
    "referenceCount": 18
}