{
    "paperId": "e4c5359643d34a6ed56bfa0b34b5d3d8a7af7c0b",
    "title": "End-to-End AutoML Implementation Framework",
    "year": 2022,
    "venue": "The eurasia proceedings of science, technology, engineering & mathematics",
    "authors": [
        "Muhammet Ali Kadioglu"
    ],
    "doi": "10.55549/epstem.1218713",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e4c5359643d34a6ed56bfa0b34b5d3d8a7af7c0b",
    "isOpenAccess": true,
    "openAccessPdf": "http://www.epstem.net/en/download/article-file/2830394",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Automated machine learning (AutoML) has been an active research area in recent years. Researchers investigate the potential of AutoML as more stakeholders want to maximize the value of their data. The methods are designed to increase the effectiveness of machine learning (ML), accelerate model development processes, and make it accessible for domain experts that are not ML professionals. The systems without the aid of humans are feasible with AutoML, an area that has been increasingly studied recently. Even though efficiency and automation are two of AutoML's key points, a number of critical steps still require human involvement, such as understanding the characteristics of domain-specific data, defining prediction problems, creating a suitable training dataset, and choosing a promising ML technique. A comprehensive and updated analysis of the state-of-the-art in AutoML is presented in the study. AutoML techniques, including hyperparameter optimization (HPO), feature engineering, and data preparation are presented. As-is prediction structure and AutoML-based benchmark model are compared to show how to implement these methods. It is stated what a real end-to-end machine learning pipeline looks like and which parts of the pipeline have already been automated. Our AutoML implementation framework has been introduced and presented as a road map for the entire ML pipeline. Several unresolved issues with the current AutoML techniques are discussed. The obstacles have been outlined that must be overcome in order to achieve this objective.",
    "citationCount": 0,
    "referenceCount": 19
}