{
    "paperId": "e50e6b6508a6af5a22b5f763d5a79e246ed379c6",
    "title": "Pyramid Convolutional RNN for MRI Image Reconstruction",
    "year": 2019,
    "venue": "IEEE Transactions on Medical Imaging",
    "authors": [
        "Eric Z. Chen",
        "Puyang Wang",
        "Xiao Chen",
        "Terrence Chen",
        "Shanhui Sun"
    ],
    "doi": "10.1109/TMI.2022.3153849",
    "arxivId": "1912.00543",
    "url": "https://www.semanticscholar.org/paper/e50e6b6508a6af5a22b5f763d5a79e246ed379c6",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1912.00543",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fast and accurate MRI image reconstruction from undersampled data is crucial in clinical practice. Deep learning based reconstruction methods have shown promising advances in recent years. However, recovering fine details from undersampled data is still challenging. In this paper, we introduce a novel deep learning based method, Pyramid Convolutional RNN (PC-RNN), to reconstruct images from multiple scales. Based on the formulation of MRI reconstruction as an inverse problem, we design the PC-RNN model with three convolutional RNN (ConvRNN) modules to iteratively learn the features in multiple scales. Each ConvRNN module reconstructs images at different scales and the reconstructed images are combined by a final CNN module in a pyramid fashion. The multi-scale ConvRNN modules learn a coarse-to-fine image reconstruction. Unlike other common reconstruction methods for parallel imaging, PC-RNN does not employ coil sensitive maps for multi-coil data and directly model the multiple coils as multi-channel inputs. The coil compression technique is applied to standardize data with various coil numbers, leading to more efficient training. We evaluate our model on the fastMRI knee and brain datasets and the results show that the proposed model outperforms other methods and can recover more details. The proposed method is one of the winner solutions in the 2019 fastMRI competition.",
    "citationCount": 48,
    "referenceCount": 123
}