{
    "paperId": "e50e6dc551701ab3263545e0b04c85e1b43596e7",
    "title": "Hook: A Pattern Locality Guided Prefetch with Enhanced Read Performance for Hybrid SSDs",
    "year": 2024,
    "venue": "IEEE Non-Volatile Memory System and Applications Symposium",
    "authors": [
        "Yumiao Zhao",
        "Jiancong Zheng",
        "Gangyong Jia",
        "Liang Shi",
        "Congming Gao"
    ],
    "doi": "10.1109/NVMSA63038.2024.10693661",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e50e6dc551701ab3263545e0b04c85e1b43596e7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "SLC- TLC hybrid SSDs offer a promising solution to the growing demand for high-capacity, high-performance data storage systems. By leveraging a fraction of SLC flash memory as a buffer alongside TLC flash memory, these SSDs optimize both performance and storage capacity. Current optimizations for hybrid SSDs primarily focus on exploiting the write performance advantages of the SLC buffer. This involves writing host data to the SLC buffer initially and transferring it to TLC space during idle periods. However, it's important to note that the benefits of the SLC buffer extend beyond accelerating write speeds; it also enhances read speeds. In this work, a novel approach called Hook is introduced, utilizing lightweight prediction to enable prefetching with the SLC buffer, aimed at enhancing read performance without sacrificing write performance. The approach includes a novel temporal and spatial locality-aware prediction method, a coordination strategy for prefetch and host requests, and collaboration between RAM and SLC to manage prefetched data effectively. To validate the effectiveness of Hook, a prototype is implemented based on FEMU, and its performance is evaluated across various workloads. Experimental results demonstrate a significant improvement in the hit rate of prefetched data and enhanced read performance compared to conventional hybrid SSDs.",
    "citationCount": 1,
    "referenceCount": 10
}