{
    "paperId": "e526939ca089806607e637fad643690d208eac5c",
    "title": "Towards Data-Centric AI: A Comprehensive Survey of Traditional, Reinforcement, and Generative Approaches for Tabular Data Transformation",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Dongjie Wang",
        "Yanyong Huang",
        "Wangyang Ying",
        "Haoyue Bai",
        "Nanxu Gong",
        "Xinyuan Wang",
        "Sixun Dong",
        "Tao Zhe",
        "Kunpeng Liu",
        "Meng Xiao",
        "Pengfei Wang",
        "Pengyang Wang",
        "Hui Xiong",
        "Yanjie Fu"
    ],
    "doi": "10.48550/arXiv.2501.10555",
    "arxivId": "2501.10555",
    "url": "https://www.semanticscholar.org/paper/e526939ca089806607e637fad643690d208eac5c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Tabular data is one of the most widely used formats across industries, driving critical applications in areas such as finance, healthcare, and marketing. In the era of data-centric AI, improving data quality and representation has become essential for enhancing model performance, particularly in applications centered around tabular data. This survey examines the key aspects of tabular data-centric AI, emphasizing feature selection and feature generation as essential techniques for data space refinement. We provide a systematic review of feature selection methods, which identify and retain the most relevant data attributes, and feature generation approaches, which create new features to simplify the capture of complex data patterns. This survey offers a comprehensive overview of current methodologies through an analysis of recent advancements, practical applications, and the strengths and limitations of these techniques. Finally, we outline open challenges and suggest future perspectives to inspire continued innovation in this field.",
    "citationCount": 12,
    "referenceCount": 180
}