{
    "paperId": "e5379c6b2328c1d4832a2efaf276e49324fbb05a",
    "title": "Trends in Integration of Knowledge and Large Language Models: A Survey and Taxonomy of Methods, Benchmarks, and Applications",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Zhangyin Feng",
        "Weitao Ma",
        "Weijiang Yu",
        "Lei Huang",
        "Haotian Wang",
        "Qianglong Chen",
        "Weihua Peng",
        "Xiaocheng Feng",
        "Bing Qin",
        "Ting Liu"
    ],
    "doi": "10.48550/arXiv.2311.05876",
    "arxivId": "2311.05876",
    "url": "https://www.semanticscholar.org/paper/e5379c6b2328c1d4832a2efaf276e49324fbb05a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Large language models (LLMs) exhibit superior performance on various natural language tasks, but they are susceptible to issues stemming from outdated data and domain-specific limitations. In order to address these challenges, researchers have pursued two primary strategies, knowledge editing and retrieval augmentation, to enhance LLMs by incorporating external information from different aspects. Nevertheless, there is still a notable absence of a comprehensive survey. In this paper, we propose a review to discuss the trends in integration of knowledge and large language models, including taxonomy of methods, benchmarks, and applications. In addition, we conduct an in-depth analysis of different methods and point out potential research directions in the future. We hope this survey offers the community quick access and a comprehensive overview of this research area, with the intention of inspiring future research endeavors.",
    "citationCount": 40,
    "referenceCount": 125
}