{
    "paperId": "e5963c9765184c2bc1089e52b5550b995f285ce1",
    "title": "Large Language Models for Enterprise Data Engineering: Automating ETL, Query Optimization & Compliance Reporting",
    "year": 2025,
    "venue": "European journal of computer science and information technology",
    "authors": [
        "Deepika Annam"
    ],
    "doi": "10.37745/ejcsit.2013/vol13n316575",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e5963c9765184c2bc1089e52b5550b995f285ce1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This article explores the transformative role of Large Language Models (LLMs) in enterprise data engineering, focusing on their capacity to automate ETL processes, optimize queries, and streamline compliance reporting. The article examines how LLMs possess sophisticated capabilities for understanding data structures, generating code, transferring knowledge across platforms, and applying probabilistic reasoning for data quality. It delves into technical implementations of LLM-powered ETL automation, including script generation, schema evolution handling, and integration with modern data stacks. The article further investigates how these models optimize SQL queries and create natural language interfaces, making data more accessible to non-technical users. Through industry case studies in financial services, healthcare, retail, and manufacturing, the article demonstrates how LLMs are delivering substantial improvements in operational efficiency, data utilization, and business outcomes, representing a fundamental shift in how organizations perceive data engineering challenges. It also acknowledges the limitations of current LLM applications in data engineering and suggests directions for future research, including addressing ethical considerations such as potential biases and the need for explainable AI.",
    "citationCount": 0,
    "referenceCount": 3
}