{
    "paperId": "e5a43b67920428640dd65af91a09558eb5e61cff",
    "title": "MVideoIndex: Querying and Indexing of Geo-referenced Videos",
    "year": 2022,
    "venue": "HP3C",
    "authors": [
        "Mengru Ma",
        "Yingjie Chen",
        "Qingbin Yu",
        "Zhongxin Du",
        "Wei Ding"
    ],
    "doi": "10.1145/3546000.3546017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e5a43b67920428640dd65af91a09558eb5e61cff",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The geo-referenced video consists of space-temporal information such as time, spatial location, camera shooting direction, camera viewing angle, viewable distance, etc. This type of video is widely applicable with sensors loaded on video capture devices. The application of geo-referenced video queries is increasingly popular recently (e.g., travel recommendation, intelligent transportation, road anomaly detection). And each of them needs to realize the query process of geo-referenced video at a specific time or spatial location. However, existing mobile video indexing methods still have room for improvement. There still exist problems with efficiency and accuracy. In this paper, we proposed a novel indexing method named MVideoIndex. MVideoIndex can process point or range queries quickly by utilizing Minimum Bounding Tilted Rectangle (MBTR) in leaf nodes based on the linear change of movement direction in geo-referenced videos. For representing the viewable regions of geo-referenced videos along the trajectory better, we constructed the index with a memory buffer limit to avoid the situation, where the query target falls into a large index and is inconvenient to query. We experimentally analyzed the performance of MVideoIndex and the state-of-art video index method GeoVideoIndex to verify our theory. The performance shows that MVideoIndex is capable of reducing the index construction time and query time, presenting a better performance than other methods. We further compared the impact of the memory buffer threshold size on query efficiency and found that the optimal memory buffer threshold size is about 8-kilometer Byte. We also conducted experiments to explore the effect of MVideoIndex and GeoVideoIndex on different datasets and found a more suitable application scenario for MVideoIndex.",
    "citationCount": 1,
    "referenceCount": 21
}