{
    "paperId": "e5c082e4a8df4ea77787c9c5d42326787c914b61",
    "title": "DIEL: Interactive Visualization Beyond the Here and Now",
    "year": 2019,
    "venue": "IEEE Transactions on Visualization and Computer Graphics",
    "authors": [
        "Yifan Wu",
        "Remco Chang",
        "Joseph M Hellerstein",
        "Arvind Satyanarayan",
        "Eugene Wu"
    ],
    "doi": "10.1109/TVCG.2021.3114796",
    "arxivId": "1907.00062",
    "url": "https://www.semanticscholar.org/paper/e5c082e4a8df4ea77787c9c5d42326787c914b61",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1907.00062",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Interactive visualization design and research have primarily focused on local data and synchronous events. However, for more complex use cases–e.g., remote database access and streaming data sources–developers must grapple with distributed data and asynchronous events. Currently, constructing these use cases is difficult and time-consuming; developers are forced to operationally program low-level details like asynchronous database querying and reactive event handling. This approach is in stark contrast to modern methods for browser-based interactive visualization, which feature high-level declarative specifications. In response, we present DIEL, a declarative framework that supports asynchronous events over distributed data. As in many declarative languages, DIEL developers specify only what data they want, rather than procedural steps for how to assemble it. Uniquely, DIEL models asynchronous events (e.g., user interactions, server responses) as streams of data that are captured in event logs. To specify the state of a visualization at any time, developers write declarative queries over the data and event logs; DIEL compiles and optimizes a corresponding dataflow graph, and automatically generates necessary low-level distributed systems details. We demonstrate DIEL's performance and expressivity through example interactive visualizations that make diverse use of remote data and asynchronous events. We further evaluate DIEL's usability using the Cognitive Dimensions of Notations framework, revealing wins such as ease of change, and compromises such as premature commitments.",
    "citationCount": 6,
    "referenceCount": 65
}