{
    "paperId": "e5ccf998cb5b8c5785da8163176fb96cf249783a",
    "title": "Binary and Multi-Class Classification of Colorectal Polyps Using CRP-ViT: A Comparative Study Between CNNs and QNNs",
    "year": 2025,
    "venue": "Life",
    "authors": [
        "Jothiraj Selvaraj",
        "Fadhiyah Almutairi",
        "S. Aslam",
        "S. Umapathy"
    ],
    "doi": "10.3390/life15071124",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e5ccf998cb5b8c5785da8163176fb96cf249783a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Colorectal cancer (CRC) is a major contributor to cancer mortality on a global scale, with polyps being critical precursors. The accurate classification of colorectal polyps (CRPs) from colonoscopy images is essential for the timely diagnosis and treatment of CRC. Method: This research proposes a novel hybrid model, CRP-ViT, integrating ResNet50 with Vision Transformers (ViTs) to enhance feature extraction and improve classification performance. This study conducted a comprehensive comparison of the CRP-ViT model against traditional convolutional neural networks (CNNs) and emerging quantum neural networks (QNNs). Experiments were conducted for binary classification to predict the presence of polyps and multi-classification to predict specific polyp types (hyperplastic, adenomatous, and serrated). Results: The results demonstrate that CRPQNN-ViT achieved superior classification performance while maintaining computational efficiency. CRPQNN-ViT achieved an accuracy of 98.18% for training and 97.73% for validation on binary classification and 98.13% during training and 97.92% for validation on multi-classification tasks. In addition to the key metrics, computational parameters were compared, where CRPQNN-ViT excelled in computational time. Conclusions: This comparative analysis reveals the potential of integrating quantum computing into medical image analysis and underscores the effectiveness of transformer-based architectures for CRP classification.",
    "citationCount": 0,
    "referenceCount": 58
}