{
    "paperId": "e5d88cd009d9efaeec265918a0c47da1e98fffaf",
    "title": "Dehydrator: Enhancing Provenance Graph Storage via Hierarchical Encoding and Sequence Generation",
    "year": 2024,
    "venue": "IEEE Transactions on Information Forensics and Security",
    "authors": [
        "Jie Ying",
        "Tiantian Zhu",
        "Tieming Chen",
        "Mingqi Lv"
    ],
    "doi": "10.1109/TIFS.2025.3592824",
    "arxivId": "2501.00446",
    "url": "https://www.semanticscholar.org/paper/e5d88cd009d9efaeec265918a0c47da1e98fffaf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the scope and impact of cyber threats have expanded, analysts utilize provenance graphs constructed from kernel logs to hunt for threats and investigate attacks. The high frequency of kernel events and the persistence of attacks pose challenges for the efficient storage of provenance graphs. Current approaches can be categorized into two types: pruning-based storage (e.g., LogGC, CPR, and NodeMerge) and encoding-based storage (e.g., DeepZip, SLEUTH, ELISE, and Leonard). However, none of these methods simultaneously satisfy the following three requirements: 1) lossless content, 2) storage efficiency, and 3) query support. To address this gap, we propose <sc>Dehydrator</sc>, an efficient provenance graph storage system that fulfills all these requirements. For the logs generated by auditing frameworks, <sc>Dehydrator</sc> uses field mapping encoding to filter field-level redundancy, hierarchical encoding to filter structure-level redundancy, and finally learns a deep neural network to support batch querying. We have conducted evaluations on seven datasets totaling over one billion log entries. Experimental results show that <sc>Dehydrator</sc> reduces the storage space by 84.55%. <sc>Dehydrator</sc> is <inline-formula> <tex-math notation=\"LaTeX\">$7.36\\times $ </tex-math></inline-formula> more efficient than PostgreSQL, <inline-formula> <tex-math notation=\"LaTeX\">$7.16\\times $ </tex-math></inline-formula> than Neo4j, and <inline-formula> <tex-math notation=\"LaTeX\">$16.17\\times $ </tex-math></inline-formula> than Leonard (the work most closely related to <sc>Dehydrator</sc>, published at Usenix Security’23).",
    "citationCount": 0,
    "referenceCount": 79
}