{
    "paperId": "e5e2b7fc3c2683caa7aaccb39833b0a08c3cfdc5",
    "title": "Machine Learning Should Maximize Welfare, but Not by (Only) Maximizing Accuracy",
    "year": 2025,
    "venue": "",
    "authors": [
        "Nir Rosenfeld",
        "Haifeng Xu"
    ],
    "doi": null,
    "arxivId": "2502.11981",
    "url": "https://www.semanticscholar.org/paper/e5e2b7fc3c2683caa7aaccb39833b0a08c3cfdc5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Decades of research in machine learning have given us powerful tools for making accurate predictions. This has made such tools appealing for use in social settings and on human inputs. Yet despite a lack of justification for why the generic approach of accuracy maximization can or should improve our collective well-being -- and mounting evidence of likely adverse outcomes -- it remains the widespread default. This position paper asserts that for machine learning to become socially beneficial, it must be embedded within a broader economic framework that explicitly aims to maximize social welfare. The field of welfare economics asks: how should we allocate limited resources among self-interested agents to maximize overall benefits? We contend that this perspective applies to many contemporary applications of machine learning in social contexts, and advocate for its adoption. Rather than disposing of prediction, we propose to leverage this forte of machine learning towards welfare maximization. We demonstrate this idea by portraying a conceptual framework that gradually transitions from accuracy maximization (with awareness to welfare) to welfare maximization (via accurate prediction). We detail applications and use-cases for which this framework can be effective, identify technical challenges and practical opportunities, and highlight future avenues worth pursuing.",
    "citationCount": 1,
    "referenceCount": 89
}