{
    "paperId": "e5e978c36572445e6291889713b8a06aed56d94c",
    "title": "SoundnessBench: A Soundness Benchmark for Neural Network Verifiers",
    "year": 2024,
    "venue": "",
    "authors": [
        "Xingjian Zhou",
        "Hongji Xu",
        "Andy Xu",
        "Zhouxing Shi",
        "Cho-Jui Hsieh",
        "Huan Zhang"
    ],
    "doi": null,
    "arxivId": "2412.03154",
    "url": "https://www.semanticscholar.org/paper/e5e978c36572445e6291889713b8a06aed56d94c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural network (NN) verification aims to formally verify properties of NNs, which is crucial for ensuring the behavior of NN-based models in safety-critical applications. In recent years, the community has developed many NN verifiers and benchmarks to evaluate them. However, existing benchmarks typically lack ground-truth for hard instances where no current verifier can verify the property and no counterexample can be found. This makes it difficult to validate the soundness of a verifier, when it claims verification on such challenging instances that no other verifier can handle. In this work, we develop a new benchmark for NN verification, named\"SoundnessBench\", specifically for testing the soundness of NN verifiers. SoundnessBench consists of instances with deliberately inserted counterexamples that are hidden from adversarial attacks commonly used to find counterexamples. Thereby, it can identify false verification claims when hidden counterexamples are known to exist. We design a training method to produce NNs with hidden counterexamples and systematically construct our SoundnessBench with instances across various model architectures, activation functions, and input data. We demonstrate that our training effectively produces hidden counterexamples and our SoundnessBench successfully identifies bugs in state-of-the-art NN verifiers. Our code is available at https://github.com/MVP-Harry/SoundnessBench and our benchmark is available at https://huggingface.co/datasets/SoundnessBench/SoundnessBench.",
    "citationCount": 1,
    "referenceCount": 34
}