{
    "paperId": "e665320a12d4bf35ecf7a46a65daaf2203c00e33",
    "title": "Selectivity Estimation of Spatial Query Types to Preserve Location Privacy using Innovative User-based Anonymity and Area-based Anonymity over K-Anonymity",
    "year": 2024,
    "venue": "International Conference on Computing Communication and Networking Technologies",
    "authors": [
        "CharanTeja Reddy Voddu",
        "Gnana Soundari"
    ],
    "doi": "10.1109/ICCCNT61001.2024.10725651",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e665320a12d4bf35ecf7a46a65daaf2203c00e33",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research activity is aimed to perform selectivity estimation of novel query processing types on spatial data in geographic information systems for the preservation of location privacy of the users using location-based services for retrieving nearest point of interests (POI) using innovative properties like User based anonymity & Area based anonymity over k-anonymity. The proposed anonymity model is tested and trained using a product ratings dataset made up of 100836 results of various items with 8 attributes that were taken as samples from the GroupLens website. It is considered as two batches such as innovative User based anonymity & Area based Anonymity over K-Anonymity where $\\mathbf{N}=\\mathbf{1 0}$ sample iterations to test the accuracy of the model for preserving location privacy while querying spatial data. For calculating the sample size and performing the t -test analysis G-power is considered as $\\mathbf{8 0 \\%}$. The results of the obtained accuracy for innovative User based anonymity & Area based Anonymity model has potential up to (79.83%) and the K-Anonymity indexing model has an accuracy of (61.90%). There is an existing statistical significance difference with ($\\mathbf{p} \\lt \\mathbf{0. 0 5}$) between the User & Area based Anonymity and K-Anonymity. $\\mathbf{p}=\\mathbf{0. 0 0 1}$ is the obtained study’s significance value. The results obtained for selectivity estimation of spatial query processing types to preserve location privacy shows that using innovative User based anonymity & Area based Anonymity has better accuracy ($\\mathbf{7 9. 8 3 \\%}$), performance and significance than K-Anonymity with accuracy of (61.90%).",
    "citationCount": 0,
    "referenceCount": 13
}