{
    "paperId": "e66a1959d98f4445406c7f314154683482c14ef2",
    "title": "TardySketch: A Framework for Cardinality Estimation Adaptable to Sliding Windows",
    "year": 2025,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Xuyang Jing",
        "Qinghua Cao",
        "Chenhao Zhang",
        "Zheng Yan",
        "Wenxiu Ding",
        "W. Pedrycz",
        "Pu Wang"
    ],
    "doi": "10.1109/ICDE65448.2025.00224",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e66a1959d98f4445406c7f314154683482c14ef2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sliding cardinality estimation is crucial in many data analysis scenarios, e.g., detecting abnormal network behav-iors by monitoring unique connections in real time, detecting fraud in online transactions by monitoring unique user behavior patterns, and improving inventory management in supply chains by analyzing unique buyer behaviors. However, existing sliding cardinality estimation methods suffer from a cardinality barrel-down problem caused by unexpired item elimination in advance and item excessive removal, which remains unresolved so far. In this paper, we propose TardySketch, a sketch framework to make sliding cardinality estimation accurate and efficient by solving the above problem. The cornerstone of TardySketch is a Bidirectional Pointer-based Bitmap (BP-Bitmap), which stores the arrival sequence of items without timestamps. To prevent the premature elimination of unexpired items, we propose a Gap mechanism to enhance the accuracy of BP-Bitmap for identifying truly expired items through intermittent monitoring. To ensure an appropriate number of items are eliminated as the window moves, we design a Slow-Down mechanism to slacken the reset rate of bucket in BP- Bitmap to prevent over removal of items. Experimental results based on real-world datasets demonstrate that TardySketch significantly outperforms state-of-the-art methods, achieving a performance improvement of 5–40 times. The source code of TardySketch is available on GitHub.",
    "citationCount": 0,
    "referenceCount": 39
}