{
    "paperId": "e68f351acc22e56a043f1fcd3cee14352fbd9973",
    "title": "Analyzing Binary Tree based Topology Configuration for Energy Efficient Multicore Architectures",
    "year": 2022,
    "venue": "IEEE Uttar Pradesh Section International Conference on Electrical, Computer and Electronics Engineering",
    "authors": [
        "Aarya Chaumal",
        "Amit M. Joshi"
    ],
    "doi": "10.1109/UPCON56432.2022.9986479",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e68f351acc22e56a043f1fcd3cee14352fbd9973",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern computer architectures are moving towards domain-specific designs of processors. ARM-based processors domi-nate the embedded domain due to their compact and energy-efficient design. x86 processors have higher computing capabilities but at the cost of high energy consumption. This work tries to improve the Network-on-Chip design of x86 processors to have an energy-efficient Chip Multi-Processor configuration with similar computing power. Network-on-Chip is a significant part of modern computer architecture. It helps to efficiently navigate on-chip traffic on current Chip Multi-Processors where the number of cores is increasing rapidly. The topology of a Network-on-Chip significantly impacts system performance as it directly affects the network bandwidth and the area of the system. Therefore, Network-on-Chip topology affects the system's execution time, area, and energy consumption. This work proposes a novel topology to improve performance in terms of energy consumption and execution time, and affects L1D miss rate of the considered specification with few benchmark programs. The proposed topology is inspired from the traditional binary tree topology and tries to overcome its shortcomings to improve the system performance. The experiment results suggest that the proposed topology improves system performance on applications belonging to domains that are suited for embedded class processors.",
    "citationCount": 0,
    "referenceCount": 29
}