{
    "paperId": "e6a2edefabeeac18fd4b6a8fcffece071bc117c8",
    "title": "OptimAIzerSQL: Optimizing SQL Queries with Heuristic and ML-Based Multi-Agent Systems",
    "year": 2025,
    "venue": "2025 5th International Conference on Machine Learning and Intelligent Systems Engineering (MLISE)",
    "authors": [
        "Nisuli Hettiarachchi",
        "Prasan Yapa"
    ],
    "doi": "10.1109/MLISE66443.2025.11100226",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e6a2edefabeeac18fd4b6a8fcffece071bc117c8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "SQL query optimization (QO) is a critical component of database management systems, essential for improving query execution times, enhancing resource utilization, and ensuring scalability in the face of growing data volumes. This study presents OptimAIzerSQL, an innovative multi-agent system that leverages both heuristic-based and machine learning (ML) approaches to address the limitations of traditional optimizers. The system integrates three specialized agents: a heuristic-based Join Order Agent (JOA) to optimize table join sequences and a ML-driven Index Selection Agent (ISA) utilizing reinforcement learning (RL) for dynamic index recommendations. The effectiveness of OptimAIzerSQL is demonstrated using the IMDb dataset, a well-structured benchmark, showcasing significant improvements in execution time, cost efficiency, and query performance. Key evaluation metrics such as reward-based execution time reduction, prediction accuracy, and cost savings evident the system's capabilities. By combining heuristic efficiency with the adaptability of ML, this research bridges gaps in traditional SQL optimization techniques, offering a scalable and robust solution for modern database workloads. The proposed framework provides valuable insights into how multi-agent systems can revolutionize database optimization by delivering tailored, high-performance query plans for complex real-world scenarios.",
    "citationCount": 0,
    "referenceCount": 41
}