{
    "paperId": "e6c10670496d229049e5cc62f4b4bb5828d6ec8a",
    "title": "Human-Machine Teaming and Team Effectiveness in AI Tools for Software Engineering",
    "year": 2025,
    "venue": "IEEE/ACM International Conference on Connected Health: Applications, Systems and Engineering Technologies",
    "authors": [
        "Irum Rauf",
        "Helen Sharp",
        "Tamara Lopez",
        "Michel Wermelinger"
    ],
    "doi": "10.1109/CHASE66643.2025.00017",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e6c10670496d229049e5cc62f4b4bb5828d6ec8a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Background: Artificial Intelligence (AI) is increasingly being used to support software engineering (SE), shifting the role of AI tools for SE (AI4SE) towards team members rather than simply tools. Human-machine teaming (HMT) views humans and machines as members of a team. This approach may be useful in AI4SE but HMT and team effectiveness have received little attention in the software engineering community. Objective: To unpick whether and how HMT and team effectiveness have been applied in AI4SE, and to identify recommendations. Method: A mapping study approach identifies 21 papers on developercentred AI4SE. Each one is analysed to identify its use of HMT, its focus regarding AI-developer interaction, and any elements of team effectiveness. Results: Different aspects of AI-developer interaction have been considered but only one paper explicitly uses the HMT concept. Some elements of team effectiveness are considered, but others are not addressed at all, and several studies do not consider any. Conclusion: Researchers are encouraged to consider HMT as a framework for AI4SE, to leverage research in all-human teams, adaptive UX and developer motivation to inform tool design, and reduce reliance on human monitoring.",
    "citationCount": 0,
    "referenceCount": 55
}