{
    "paperId": "e727cb4eacdd321f5a57b0a46b40397a9ba62fc3",
    "title": "Exploring needs and challenges for AI in nursing care – results of an explorative sequential mixed methods study",
    "year": 2023,
    "venue": "BMC Digital Health",
    "authors": [
        "Kathrin Seibert",
        "Dominik Domhoff",
        "Daniel Fürstenau",
        "F. Biessmann",
        "Matthias Schulte-Althoff",
        "K. Wolf-Ostermann"
    ],
    "doi": "10.1186/s44247-023-00015-2",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e727cb4eacdd321f5a57b0a46b40397a9ba62fc3",
    "isOpenAccess": true,
    "openAccessPdf": "https://bmcdigitalhealth.biomedcentral.com/counter/pdf/10.1186/s44247-023-00015-2",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While artificial intelligence (AI) is being adapted for various life domains and applications related to medicine and healthcare, the use of AI in nursing practice is still scarce. The German Ministry for Education and Research funded a study in order to explore needs, application scenarios, requirements, facilitators and barriers for research and development projects in the context of AI in nursing care. A sequential explorative mixed methods study including a stakeholder and expert workshop (N = 21), expert interviews (N = 14), an online survey (N = 53) and a Datathon (N = 80) was conducted with an emphasis on qualitative data. Needs and application scenarios encompassed the micro- and meso-level of care and derived from typical phenomena inherent to nursing care as well as from skill- and staff mix and consequences arising from staff shortages, from the extend of informal care and an associated need for information and education of informal caregivers and nursing assistants. Requirements for and characteristics of successful research and development projects included regulatory, processual, technological, ethical and legal aspects and supportive eco-systems. A key element in the design of research projects remains participatory and demand-driven development that aims to bring AI solutions out of the lab and into practice. However, influencing factors remain that are outside the sphere of influence of individual projects, in particular the creation of resilient legal foundations for data use and the use of AI in practice, standardization of data structures and the establishment of infrastructures for data exchange across institutions and projects.",
    "citationCount": 22,
    "referenceCount": 72
}