{
    "paperId": "e74dfc36dca2ce49b0690e62ddb5d8de7f7b288f",
    "title": "SQLGovernor: An LLM-powered SQL Toolkit for Real World Application",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Jie Jiang",
        "Siqi Shen",
        "Haining Xie",
        "Yang Li",
        "Yu Shen",
        "Danqing Huang",
        "Bo Qian",
        "Yinjun Wu",
        "Wentao Zhang",
        "Bin Cui",
        "Peng Chen"
    ],
    "doi": "10.48550/arXiv.2509.08575",
    "arxivId": "2509.08575",
    "url": "https://www.semanticscholar.org/paper/e74dfc36dca2ce49b0690e62ddb5d8de7f7b288f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "SQL queries in real world analytical environments, whether written by humans or generated automatically often suffer from syntax errors, inefficiency, or semantic misalignment, especially in complex OLAP scenarios. To address these challenges, we propose SQLGovernor, an LLM powered SQL toolkit that unifies multiple functionalities, including syntax correction, query rewriting, query modification, and consistency verification within a structured framework enhanced by knowledge management. SQLGovernor introduces a fragment wise processing strategy to enable fine grained rewriting and localized error correction, significantly reducing the cognitive load on the LLM. It further incorporates a hybrid self learning mechanism guided by expert feedback, allowing the system to continuously improve through DBMS output analysis and rule validation. Experiments on benchmarks such as BIRD and BIRD CRITIC, as well as industrial datasets, show that SQLGovernor consistently boosts the performance of base models by up to 10%, while minimizing reliance on manual expertise. Deployed in production environments, SQLGovernor demonstrates strong practical utility and effective performance.",
    "citationCount": 0,
    "referenceCount": 57
}