{
    "paperId": "e79204fb9ad191a4f6e2ee667ced8d75e9521a8d",
    "title": "Real-Time Forecasting from Wearable-Monitored Heart Rate Data Through Autoregressive Models",
    "year": 2025,
    "venue": "J. Heal. Informatics Res.",
    "authors": [
        "Giulio De Sabbata",
        "Giovanni Simonini"
    ],
    "doi": "10.1007/s41666-025-00191-y",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e79204fb9ad191a4f6e2ee667ced8d75e9521a8d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Heart rate (HR) analysis is of paramount importance in healthcare, particularly for monitoring cardiovascular health, a global concern. The advent of wearable sensors has enabled continuous HR monitoring, with researchers attempting to develop early detection systems by forecasting HR in a univariate fashion. This study analyzes real-world HR time series gathered during participants daily routines to critically assess the predictive power of past HR data in short-term, univariate forecasting. The literature emphasizes a minute-by-minute, univariate forecasting approach, where state-of-the-art predictive models predominantly employ autoregressive integrated moving average (ARIMA). Yet, its superiority has been proved without studying its optimized hyper-parameters, which could not only improve forecast accuracy but also provide valuable insights. By leveraging the interpretability of ARIMA, we tune its hyper-parameters within a minute-by-minute forecasting structure to address the central research question: how does historical HR data contribute to generate accurate short-term HR forecasts? Our analysis finds that the random walk model, a special case of ARIMA, consistently performs comparably to, or even better than, more complex ARIMA specifications. This indicates that HR values alone offer limited predictive power for short-term forecasting, casting doubt on the value of further refinement in univariate models for alarm system development. These findings highlight the limitations of univariate HR forecasting in real-time health monitoring. Rather than increasing model complexity, future research might benefit from exploring alternative approaches to improve early warning system capabilities in real-world settings. Supplementary Information The online version contains supplementary material available at 10.1007/s41666-025-00191-y.",
    "citationCount": 0,
    "referenceCount": 44
}