{
    "paperId": "e7a3241e18890dd2ca16d63d5fc3042d0850cba0",
    "title": "Energy-Efficient Differential Spin Hall Effect Ternary Content Addressable Memory",
    "year": 2023,
    "venue": "2023 IEEE 23rd International Conference on Nanotechnology (NANO)",
    "authors": [
        "Seema Dhull",
        "Sandeep Soni",
        "Arshid Nisar",
        "Brajesh Kumar Kaushik"
    ],
    "doi": "10.1109/NANO58406.2023.10231186",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e7a3241e18890dd2ca16d63d5fc3042d0850cba0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In this paper, a ternary content addressable memory (TCAM) design based on the differential spin Hall effect (DSHE)-magnetoresistive random access memory (MRAM) is proposed. The proposed TCAM comprises 3 transistors and 2 magnetic tunnel junctions (3T-2MTJs) structure and utilizes DSHE technique that enables high-density memory with reduced power consumption and latency. DSHE technique is an energy efficient method as it stores complementary bits in MTJs placed on both sides of a heavy metal layer by passing a single spin orbit torque (SOT) current through it. The findings demonstrate that the efficiency in terms of energy and the latency for the search operation of the proposed DSHE-TCAM is improved by 30% and 13.9%, respectively, when compared to SOT-MRAM-based TCAM. Also, the write energy efficiency of the proposed TCAM is enhanced by 47.5% and area is reduced by 42.1% in comparison to SOT-MRAM based TCAM. Furthermore, the proposed TCAM shows better performance in comparison to other counterparts that are based on different memory technologies such as static RAM (SRAM), ferroelectric field-effect transistor (FeFET), and spin transfer torque-MRAM (STT-MRAM). Hence, DSHE-MRAM-based TCAM are potential candidature for high-speed and energy-efficient search operations in future computing systems.",
    "citationCount": 2,
    "referenceCount": 22
}