{
    "paperId": "e7afa6bf4e7f72d622497d4ca869b65ee1a3f862",
    "title": "Efficient Online Weighted Multi-Level Paging",
    "year": 2021,
    "venue": "ACM Symposium on Parallelism in Algorithms and Architectures",
    "authors": [
        "N. Bansal",
        "J. Naor",
        "Ohad Talmon"
    ],
    "doi": "10.1145/3409964.3461801",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e7afa6bf4e7f72d622497d4ca869b65ee1a3f862",
    "isOpenAccess": true,
    "openAccessPdf": "https://ir.cwi.nl/pub/30957/30957.pdf",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We study the writeback-aware caching problem, a variant of classic paging where paging requests that modify data and requests that leave data intact are treated differently. We give an O(łog^2 k) competitive randomized algorithm, answering an open question of Beckmann ηl~BGHM20 and Even et al. (21) about the existence of a randomized poly-logarithmic competitive algorithm. Our algorithm also works for arbitrary page weights. We also give an O(k) competitive deterministic algorithm, extending the previous result of Beckmann et al. BGHM20 to the weighted setting. Interestingly, we also show that any polynomial-time randomized algorithm must be Ø(łog^2 k)-competitive, assuming NP BPP, based on a connection to online set-cover and using ideas of Feige and Korman (24). This gives a surprising separation from the classical paging problem, where several tight O(łog k)-competitive algorithms are known. A key underlying observation is that writeback-aware caching is algorithmically equivalent to Read/Write (RW) paging, which is an interesting problem on its own and has also been studied previously. We consider a further generalization of RW-paging to multi-level paging, where a page can have l different types (RW-paging corresponds to l=2), and give O(k)-competitive deterministic and O(łog^2 k)-competitive polynomial-time randomized algorithms, without any dependence on l. Our randomized algorithms are based on first finding an O(łog k)-competitive fractional solution to an online linear problem that has additional complicating constraints beyond the usual covering or packing type. Then, we round this fractional solution online losing an additional O(łog k) factor. For l=1, which corresponds to the well-studied weighted paging, our approach gives a substantially simpler and natural rounding algorithm compared to the previous approaches, which might be of independent interest, albeit at the loss of an additional O(łog k) factor.",
    "citationCount": 5,
    "referenceCount": 40
}