{
    "paperId": "e7b2afc8127d03d07d9902eb041d202af6eb4ae1",
    "title": "Landing AI on Networks: An Equipment Vendor Viewpoint on Autonomous Driving Networks",
    "year": 2022,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Dario Rossi",
        "Liang Zhang"
    ],
    "doi": "10.1109/TNSM.2022.3169988",
    "arxivId": "2205.08347",
    "url": "https://www.semanticscholar.org/paper/e7b2afc8127d03d07d9902eb041d202af6eb4ae1",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2205.08347",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The tremendous achievements of Artificial Intelligence (AI) in computer vision, natural language processing, games and robotics, has extended the reach of the AI hype to other fields: in telecommunication networks, the long term vision is to let AI fully manage, and autonomously drive, all aspects of network operation. In this industry vision paper, we discuss challenges and opportunities of Autonomous Driving Network (ADN) driven by AI technologies. To understand how AI can be successfully landed in current and future networks, we start by outlining challenges that are specific to the networking domain, putting them in perspective with advances that AI has achieved in other fields. We then present a system view, clarifying how AI can be fitted in the network architecture. We finally discuss current achievements as well as future promises of AI in networks, mentioning a roadmap to avoid bumps in the road that leads to true large-scale deployment of AI technologies in networks.",
    "citationCount": 15,
    "referenceCount": 156
}