{
    "paperId": "e7b64ea51f35b48613d6bf66f94860bfe3289e16",
    "title": "PDETime: Rethinking Long-Term Multivariate Time Series Forecasting from the perspective of partial differential equations",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Shiyi Qi",
        "Zenglin Xu",
        "Yiduo Li",
        "Liangjiang Wen",
        "Qingsong Wen",
        "Qifan Wang",
        "Yuan Qi"
    ],
    "doi": "10.48550/arXiv.2402.16913",
    "arxivId": "2402.16913",
    "url": "https://www.semanticscholar.org/paper/e7b64ea51f35b48613d6bf66f94860bfe3289e16",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advancements in deep learning have led to the development of various models for long-term multivariate time-series forecasting (LMTF), many of which have shown promising results. Generally, the focus has been on historical-value-based models, which rely on past observations to predict future series. Notably, a new trend has emerged with time-index-based models, offering a more nuanced understanding of the continuous dynamics underlying time series. Unlike these two types of models that aggregate the information of spatial domains or temporal domains, in this paper, we consider multivariate time series as spatiotemporal data regularly sampled from a continuous dynamical system, which can be represented by partial differential equations (PDEs), with the spatial domain being fixed. Building on this perspective, we present PDETime, a novel LMTF model inspired by the principles of Neural PDE solvers, following the encoding-integration-decoding operations. Our extensive experimentation across seven diverse real-world LMTF datasets reveals that PDETime not only adapts effectively to the intrinsic spatiotemporal nature of the data but also sets new benchmarks, achieving state-of-the-art results",
    "citationCount": 2,
    "referenceCount": 45
}