{
    "paperId": "e7c7280c671fdd7d7da37a99b7f4a7a97c1f3958",
    "title": "Mitigating Hallucinations Using Ensemble of Knowledge Graph and Vector Store in Large Language Models to Enhance Mental Health Support",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Abdul Muqtadir",
        "H. M. Bilal",
        "A. Yousaf",
        "Hafiz Farooq Ahmed",
        "J. Hussain"
    ],
    "doi": "10.48550/arXiv.2410.10853",
    "arxivId": "2410.10853",
    "url": "https://www.semanticscholar.org/paper/e7c7280c671fdd7d7da37a99b7f4a7a97c1f3958",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research work delves into the manifestation of hallucination within Large Language Models (LLMs) and its consequential impacts on applications within the domain of mental health. The primary objective is to discern effective strategies for curtailing hallucinatory occurrences, thereby bolstering the dependability and security of LLMs in facilitating mental health interventions such as therapy, counseling, and the dissemination of pertinent information. Through rigorous investigation and analysis, this study seeks to elucidate the underlying mechanisms precipitating hallucinations in LLMs and subsequently propose targeted interventions to alleviate their occurrence. By addressing this critical issue, the research endeavors to foster a more robust framework for the utilization of LLMs within mental health contexts, ensuring their efficacy and reliability in aiding therapeutic processes and delivering accurate information to individuals seeking mental health support.",
    "citationCount": 0,
    "referenceCount": 26
}