{
    "paperId": "e7d88802cc6aa3d9d89dadefbcc44ea8a8742cf6",
    "title": "Heuristics, Answer Set Programming and Markov Decision Process for Solving a Set of Spatial Puzzles*",
    "year": 2019,
    "venue": "Applied intelligence (Boston)",
    "authors": [
        "Thiago Freitas dos Santos",
        "P. Santos",
        "L. Ferreira",
        "Reinaldo A. C. Bianchi",
        "Pedro Cabalar"
    ],
    "doi": "10.1007/s10489-021-02423-1",
    "arxivId": "1903.03411",
    "url": "https://www.semanticscholar.org/paper/e7d88802cc6aa3d9d89dadefbcc44ea8a8742cf6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Spatial puzzles composed of rigid objects, flexible strings and holes offer interesting challenges for reasoning about spatial entities that are common in the human daily-life’s activities. This motivates the use of spatial puzzles as domains of study in this work. The goal of this paper is to investigate the automated solution of this kind of problems by extending an algorithm that combines Answer Set Programming (ASP) with Markov Decision Process (MDP) and Reinforcement Learning (RL), called oASP(MDP). This method is capable of constructing the set of domain states online, i.e., while the agent interacts with a changing environment. The aim of the extension proposed in this work is to add heuristics as a mechanism to accelerate the learning process, resulting in the main contribution of this paper: the Heuristic oASP(MDP) (HoASP(MDP)) algorithm. Experiments were performed on deterministic, non-deterministic and non-stationary versions of the puzzles. Results show that the proposed approach can considerably accelerate the learning process, outperforming other state-of-the-art methods.",
    "citationCount": 2,
    "referenceCount": 91
}