{
    "paperId": "e80e1859a8319dfa7ee6ea010fbc52383196046e",
    "title": "Memorization in Deep Learning: A Survey",
    "year": 2024,
    "venue": "ACM Computing Surveys",
    "authors": [
        "Jiaheng Wei",
        "Yanjun Zhang",
        "Leo Yu Zhang",
        "Ming Ding",
        "Chao Chen",
        "Kok-Leong Ong",
        "Jun Zhang",
        "Yang Xiang"
    ],
    "doi": "10.48550/arXiv.2406.03880",
    "arxivId": "2406.03880",
    "url": "https://www.semanticscholar.org/paper/e80e1859a8319dfa7ee6ea010fbc52383196046e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep Learning (DL) powered by Deep Neural Networks (DNNs) has revolutionized various domains, yet understanding the details of DNN decision-making and learning processes remains a significant challenge. Recent investigations have uncovered an interesting memorization phenomenon in which DNNs tend to memorize specific details from examples rather than learning general patterns, affecting model generalization, security, and privacy. This raises critical questions about the nature of generalization in DNNs and their susceptibility to security breaches. In this survey, we present a systematic framework to organize memorization definitions based on the generalization and security/privacy domains and summarize memorization evaluation methods at both the example and model levels. Through a comprehensive literature review, we explore DNN memorization behaviors and their impacts on security and privacy. We also introduce privacy vulnerabilities caused by memorization and the phenomenon of forgetting and explore its connection with memorization. Furthermore, we spotlight various applications leveraging memorization mechanisms. This survey offers the first-in-kind understanding of memorization in DNNs, providing insights into its challenges and opportunities for enhancing AI development while addressing critical ethical concerns.",
    "citationCount": 13,
    "referenceCount": 137
}