{
    "paperId": "e8327b84e4c8c631bb11443ad13af18c9f5ee634",
    "title": "MoESys: A Distributed and Efficient Mixture-of-Experts Training and Inference System for Internet Services",
    "year": 2022,
    "venue": "IEEE Transactions on Services Computing",
    "authors": [
        "Liang Shen",
        "Zhihua Wu",
        "Weibao Gong",
        "Hongxiang Hao",
        "Yangfan Bai",
        "Huachao Wu",
        "Xinxuan Wu",
        "Haoyi Xiong",
        "Dianhai Yu",
        "Yanjun Ma"
    ],
    "doi": "10.1109/TSC.2024.3399654",
    "arxivId": "2205.10034",
    "url": "https://www.semanticscholar.org/paper/e8327b84e4c8c631bb11443ad13af18c9f5ee634",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While modern internet services, such as chatbots, search engines, and online advertising, demand the use of large-scale deep neural networks (DNNs), distributed training and inference over heterogeneous computing systems are desired to facilitate these DNN models. Mixture-of-Experts (MoE) is one the most common strategies to lower the cost of training subject to the overall size of models/data through gating and parallelism in a divide-and-conquer fashion. While DeepSpeed Rasley et al. 2020 has made efforts in carrying out large-scale MoE training over heterogeneous infrastructures, the efficiency of training and inference could be further improved from several system aspects, including load balancing, communication/computation efficiency, and memory footprint limits. In this work, we present a novel MoESys that boosts efficiency in both large-scale training and inference. Specifically, in the training procedure, the proposed MoESys adopts an Elastic MoE training strategy with 2D prefetch and Fusion communication over Hierarchical storage, so as to enjoy efficient parallelisms. For scalable inference in a single node, especially when the model size is larger than GPU memory, MoESys builds the CPU-GPU memory jointly into a ring of sections to load the model, and executes the computation tasks across the memory sections in a round-robin manner for efficient inference. We carried out extensive experiments to evaluate MoESys, where MoESys successfully trains a Unified Feature Optimization Zhang et al. 2021 (UFO) model with a Sparsely-Gated Mixture-of-Experts model of 12B parameters in 8 days on 48 A100 GPU cards. The comparison against the state-of-the-art shows that MoESys outperformed DeepSpeed with 33% higher throughput (tokens per second) in training and 13% higher throughput in inference in general. Particularly, under unbalanced MoE Tasks, e.g., UFO, MoESys achieved 64% higher throughput with 18% lower memory footprints.",
    "citationCount": 38,
    "referenceCount": 60
}