{
    "paperId": "e835af492de740ebfeca8d65bbce9f2b0c04e5fe",
    "title": "A Study of The Geographical Information System (GIS) based Energy Station Identification and Frequency Analysis Using ETA",
    "year": 2024,
    "venue": "Journal for Research in Applied Sciences and Biotechnology",
    "authors": [
        "Ravindra Gupta"
    ],
    "doi": "10.55544/jrasb.3.5.18",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e835af492de740ebfeca8d65bbce9f2b0c04e5fe",
    "isOpenAccess": true,
    "openAccessPdf": "https://jrasb.com/index.php/jrasb/article/download/649/595",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The energy corporation entity recently pays maximum attention to the environmental and social safe guards associated with its operations. In developing countries mainly suffers to balance the gap between generation and demand for effective operation by the energy utilities. An inadequate transmission capacity, non-uniform location of energy stations may lead to worst consequences when the occurrences of fault and may end up with black out. To overcome the above situation and to improve the stability of such system, In this research proposes a Geographical Information System (GIS) based identification of location of the uncertainty power stations and also a technique called Islanding Scheme to protect the severely affected system by measuring its frequency parameters. The severely disturbed large interconnected power system is divided into number of subsystems with two or more generating buses feeding its nearby loads by disintegrating the tie lines. The sample 50 bus test case system taken from Tamilnadu Electricity Board (TNEB), INDIA to analyze and simulate the results using Electrical Transient Analyzer Program (ETAP) and Geographical Information System (GIS). In this paper, ETAP and GIS effective software tools used for identify the energy station in various locations and analyzing the frequency status of different buses for better operation in electric utilities and thus ensure better management, enhance the improved stability by mapping the data and outage management.",
    "citationCount": 0,
    "referenceCount": 114
}