{
    "paperId": "e863156c7e853629a0d16bcb183593ee7fcd5aa0",
    "title": "From Traditional Recommender Systems to GPT-Based Chatbots: A Survey of Recent Developments and Future Directions",
    "year": 2024,
    "venue": "Big Data and Cognitive Computing",
    "authors": [
        "T. M. Al-Hasan",
        "A. Sayed",
        "Fayal Bensaali",
        "Yassine Himeur",
        "Iraklis Varlamis",
        "G. Dimitrakopoulos"
    ],
    "doi": "10.3390/bdcc8040036",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e863156c7e853629a0d16bcb183593ee7fcd5aa0",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2504-2289/8/4/36/pdf?version=1711520930",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recommender systems are a key technology for many applications, such as e-commerce, streaming media, and social media. Traditional recommender systems rely on collaborative filtering or content-based filtering to make recommendations. However, these approaches have limitations, such as the cold start and the data sparsity problem. This survey paper presents an in-depth analysis of the paradigm shift from conventional recommender systems to generative pre-trained-transformers-(GPT)-based chatbots. We highlight recent developments that leverage the power of GPT to create interactive and personalized conversational agents. By exploring natural language processing (NLP) and deep learning techniques, we investigate how GPT models can better understand user preferences and provide context-aware recommendations. The paper further evaluates the advantages and limitations of GPT-based recommender systems, comparing their performance with traditional methods. Additionally, we discuss potential future directions, including the role of reinforcement learning in refining the personalization aspect of these systems.",
    "citationCount": 25,
    "referenceCount": 98
}