{
    "paperId": "e86ff06bce614d217072b32c50b2ae5190ea359c",
    "title": "Comparative genomics of Shiga toxin-producing Escherichia coli reveals host-specific adhesiome adaptations in humans and cattle",
    "year": 2025,
    "venue": "Frontiers in Veterinary Science",
    "authors": [
        "Víctor Martínez",
        "José T. Cartajena",
        "Estefanía Méndez",
        "Jessica Dörner",
        "Diego Méndez",
        "Gabriel Arriagada",
        "Jorge Toledo",
        "Richard Arancibia",
        "Nicolás Pizarro",
        "Daniela Castro",
        "Daniela Luna",
        "Romina Ramos",
        "Joaquín Jorquera",
        "Beatriz Escobar",
        "I. Kudva",
        "Nicolás Galarce"
    ],
    "doi": "10.3389/fvets.2025.1639243",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e86ff06bce614d217072b32c50b2ae5190ea359c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Introduction Shiga toxin-producing Escherichia coli (STEC) is a zoonotic pathogen responsible for severe human infections, with cattle recognized as the principal animal reservoir for human infection. Adhesion is a critical step in STEC colonization, facilitating persistence and transmission. While human-associated adhesion mechanisms have been extensively studied, those driving colonization in cattle remain less understood. In this study, we characterized the adhesiome of STEC strains isolated from Chilean cattle and compared them with a global collection to identify host-specific adhesion patterns and genetic adaptations. Methods A total of 948 fecal samples from Chilean cattle were screened, yielding 71 confirmed STEC isolates, which were analyzed alongside 546 publicly available genomes to compare host-specific adhesion patterns. The adhesiome was examined based on gene presence/absence patterns, followed by a genome-wide association study (GWAS) and variant effect analysis to identify host-specific adhesion genes and their functional implications. Results Adhesin gene analysis revealed distinct adhesion strategies between hosts. Several genes, including ehaA, stgABC, yadLMN, and iha, were significantly associated with cattle, while eae, cah, ypjA, and paa were more frequent in human-associated STEC. Functional enrichment analysis revealed differences in biological processes, including protein folding and fimbrial usher porin activity in cattle, and response to methylglyoxal in humans. GWAS identified yeeJ, espP, and fimC as strongly associated with cattle strains, whereas clpV, ybgQ, and sab were linked to human isolates. Variant analysis showed higher genetic diversity in human isolates, with yadK, espP, and ybgP exhibiting the highest variant densities. However, the functional effects of adhesin mutations were largely conserved across hosts, suggesting selective constraints on adhesion mechanisms. Discussion Our findings provide new insights into STEC host adaptation and highlight potential targets to reduce zoonotic transmission and improve pre-harvest food safety strategies. Future research should focus on functional validation of host-specific adhesin variants and their potential as preventive strategies.",
    "citationCount": 0,
    "referenceCount": 118
}