{
    "paperId": "e8761d52d8f79d0ace1dde1ba31554728ae84602",
    "title": "Peran Manajemen Pendidikan Islam dalam Mempersiapkan Generasi Muslim di Era Society 5.0",
    "year": 2024,
    "venue": "Berkala Ilmiah Pendidikan",
    "authors": [
        "Dika Tripitasari"
    ],
    "doi": "10.51214/bip.v4i3.1167",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e8761d52d8f79d0ace1dde1ba31554728ae84602",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "Latar belakang penelitian ini didorong oleh perkembangan pesat teknologi dan digitalisasi yang terjadi di era Society 5.0, di mana teknologi tidak hanya berfungsi sebagai alat, tetapi juga sebagai sistem yang mempengaruhi aspek kehidupan masyarakat secara menyeluruh. Dalam konteks ini, pendidikan Islam diharapkan mampu menyiapkan generasi Muslim yang tidak hanya cerdas secara intelektual, tetapi juga memiliki karakter moral yang kuat sesuai dengan ajaran Islam. Tujuan penelitian ini adalah untuk menggali peran manajemen pendidikan Islam dalam mempersiapkan generasi Muslim yang unggul, adaptif, dan relevan dengan tuntutan era Society 5.0. Penelitian ini menggunakan pendekatan kualitatif dengan metode studi literatur dan wawancara mendalam pada pendidik dan pengelola lembaga pendidikan Islam. Hasil penelitian menunjukkan bahwa manajemen pendidikan Islam memiliki peran strategis dalam pengembangan kurikulum yang integratif, penerapan teknologi dalam pembelajaran, serta pembentukan karakter berbasis nilai-nilai Islam yang mendukung kesiapan generasi muda untuk menghadapi tantangan global. Implikasi dari penelitian ini adalah perlunya pembaruan dalam sistem manajemen pendidikan Islam yang lebih fleksibel dan adaptif terhadap kemajuan teknologi, sekaligus memperkuat karakter generasi muda agar dapat berperan aktif dalam pembangunan masyarakat yang berlandaskan pada prinsip-prinsip Islam. Penelitian ini diharapkan dapat memberikan kontribusi dalam mengembangkan strategi manajerial yang lebih efektif dalam pendidikan Islam di era digital.",
    "citationCount": 4,
    "referenceCount": 52
}