{
    "paperId": "e87993923b6a6c4cc58d160edf92c4e26454dbe0",
    "title": "FusionInsight LibrA: Huawei's Enterprise Cloud Data Analytics Platform",
    "year": 2018,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Le Cai",
        "Jianjun Chen",
        "Jun Chen",
        "Yu Chen",
        "Kuorong Chiang",
        "Marko A. Dimitrijevic",
        "Yonghua Ding",
        "Yu Dong",
        "A. Ghazal",
        "Jacques Hebert",
        "Kamini Jagtiani",
        "Suzhen Lin",
        "Ye Liu",
        "Demai Ni",
        "Chunfeng Pei",
        "Jason Sun",
        "Li Zhang",
        "Mingyi Zhang",
        "Cheng Zhu"
    ],
    "doi": "10.14778/3229863.3229870",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e87993923b6a6c4cc58d160edf92c4e26454dbe0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Huawei Fusion Insight Libr A (FI-MPPDB) is a petabyte scale enterprise analytics platform developed by the Huawei data-base group. It started as a prototype more than five years ago, and is now being used by many enterprise customers over the globe, including some of the world's largest financial institutions. Our product direction and enhancements have been mainly driven by customer requirements in the fast evolving Chinese market.\n This paper describes the architecture of FI-MPPDB and some of its major enhancements. In particular, we focus on top four requirements from our customers related to data analytics on the cloud: system availability, auto tuning, query over heterogeneous data models on the cloud, and the ability to utilize powerful modern hardware for good performance. We present our latest advancements in the above areas including online expansion, auto tuning in query optimizer, SQL on HDFS, and intelligent JIT compiled execution. Finally, we present some experimental results to demonstrate the effectiveness of these technologies.",
    "citationCount": 14,
    "referenceCount": 25
}