{
    "paperId": "e8976e00855f7e4e63db5c1c79c8c3b3c1efc4bb",
    "title": "Efficient Additive 3D Modeling from Single Images via Layered Morphing Techniques",
    "year": 2025,
    "venue": "2025 4th International Symposium on Computer Applications and Information Technology (ISCAIT)",
    "authors": [
        "Hengheng Zhao",
        "Ping Huang",
        "Ruolong Wang",
        "Xiying Wang"
    ],
    "doi": "10.1109/ISCAIT64916.2025.11010556",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e8976e00855f7e4e63db5c1c79c8c3b3c1efc4bb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Art",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A novel technique for single-image-driven rapid additive 3D modeling is presented, integrating principles of 3D printing with topological relationships between adjacent layers. By incorporating innovative curve morphing techniques, efficient transformation from a single image to complex three-dimensional models is achieved. Experimental evaluations demonstrate that superior performance in modeling efficiency, geometric accuracy, and visual fidelity is attained, particularly for regular geometric shapes and transitional forms. While potential for refinement in detailed reconstruction of complex cultural artifacts is noted, competitive overall results are still observed. Compared to traditional manual modeling, significant enhancements in speed are realized, while high levels of accuracy and appearance similarity are maintained, and data requirements along with computational complexity are substantially reduced. Practical solutions for rapid product design, digital heritage preservation, and augmented/virtual reality (AR/VR) applications are provided, with optimized layer structuring and topological control addressing precision limitations inherent in deep learning approaches. This research advances the field of 3D modeling by offering a robust, efficient framework with broad theoretical and practical implications.",
    "citationCount": 0,
    "referenceCount": 36
}