{
    "paperId": "e8d0f7aaa29b8c3e91643d0a4a352203f194234a",
    "title": "ServerlessLSM: Fast RDMA-Codesigned Disaggregated Compaction for Elastic Serverless LSM-Tree Key-Value Store",
    "year": 2025,
    "venue": "2025 IEEE International Conference on Web Services (ICWS)",
    "authors": [
        "Mingxuan Liu",
        "Jianhua Gu",
        "Tianhai Zhao"
    ],
    "doi": "10.1109/ICWS67624.2025.00100",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e8d0f7aaa29b8c3e91643d0a4a352203f194234a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Log-Structured Merge-tree (LSM-tree) has become a cornerstone of modern key-value stores (KVSs) due to its efficiency in handling write-intensive workloads. However, traditional monolithic LSM-tree designs suffer from write stalls caused by resource contention between Memtable flushing and SSTable compaction, while existing distributed systems adopt coarse-grained elasticity that limits resource utilization and responsiveness. This paper introduces ServerlessLSM, a kernelspace RDMA-odesigned Serverless workflow architecture for LSM-trees. By decoupling Memtable flushing and compaction into independent Serverless functions, ServerlessLSM enables fine-grained elasticity and low-latency state transfers through distributed OS primitives (e.g., remote fork, remote memory mapping). Evaluations demonstrate that ServerlessLSM reduces cold-start latency by $\\mathbf{9 8 \\%}$ and achieves $\\mathbf{2. 4} \\times$ higher throughput compared to state-of-the-art solutions, while maintaining space amplification below 11 %, validating its efficiency and costeffectiveness in cloud environments.",
    "citationCount": 0,
    "referenceCount": 51
}