{
    "paperId": "e9037a582bd2bf811df6dc955f9dea795beda742",
    "title": "Crust & Crumb sampling: efficient sampling design for high dimensional parameter recovery",
    "year": 2025,
    "venue": "Measurement science and technology",
    "authors": [
        "Robert James Ward",
        "Felipe Orihuela-Espina"
    ],
    "doi": "10.1088/1361-6501/adde7a",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e9037a582bd2bf811df6dc955f9dea795beda742",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Colouration maps offer a look-up table solution to inverse reconstruction problems in optical imaging. The initial generation of these maps is, however, expensive due to combinatorial explosion or exposed to large errors if the number of forward simulated points is compromised. Here, Crust & Crumb, a pseudo-random gradient-weighted sampling design is put forward aiming to circumvent the combinatorial explosion whilst keeping the reconstruction error at bay. A synthetic exponential model alike the Beer–Lambert law is constructed to establish the validity of the new sampling design, and a finite element diffusion model exemplifies its feasibility against spectroscopic data. A real-data example illustrates haemodynamic reconstruction against a typical linear least-squares approach. When compared to alternative sampling designs, Crust & Crumb affords the same reconstruction error as a formal gradient-based approach, and posit that it exhibits the scalability needed for applications such as broadband near-infrared spectroscopy. The algorithm is agnostic to the domain of application, and hence, it may have implications for other applications of interpolation.",
    "citationCount": 0,
    "referenceCount": 27
}