{
    "paperId": "e91247e9bf65e06b52897bc73e1ec6bcb8b054a1",
    "title": "Towards Practical Oblivious Map",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Xinle Cao",
        "Weiqi Feng",
        "Jian Liu",
        "Jinjin Zhou",
        "Wenjing Fang",
        "Lei Wang",
        "Quanqing Xu",
        "Chuanhui Yang",
        "Kui Ren"
    ],
    "doi": "10.14778/3712221.3712235",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e91247e9bf65e06b52897bc73e1ec6bcb8b054a1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Oblivious map (OMAP) is an important component in encrypted databases, utilized to prevent the server inferring sensitive information about client's encrypted databases based on\n access patterns.\n Despite its widespread usage and importance, existing OMAP solutions face practical challenges, including the need for a large number of interaction rounds between the client and server, as well as substantial communication bandwidth. For example, the SOTA protocol OMIX++ in VLDB 2024 still requires\n O\n (log\n n\n ) interaction rounds and\n O\n (log\n 2\n n\n ) communication bandwidth per access, where\n n\n denotes the total number of key-value pairs stored. In this work, we introduce more practical and efficient OMAP constructions. Consistent with all prior OMAPs, our constructions also adapt only the\n tree-based Oblivious RAM (ORAM)\n and\n oblivious data structures\n (ODS) to achieve OMAP for enhanced practicality. In complexity, our approach needs\n O\n (log\n n\n /log log\n n\n )+\n O\n (log\n λ\n ) interaction rounds and\n O\n (log\n 2\n n\n /log log\n n\n ) +\n O\n (log\n λ\n log\n n\n ) communication bandwidth per data access where\n λ\n is the security parameter. This new complexity results from our two main contributions. First, unlike prior works relying solely on\n search trees\n , we design a novel framework for OMAP that combines\n hash table\n with search trees. Second, we propose a more efficient tree-based ORAM named DAORAM, which is of significant independent interest. This new ORAM accelerates our constructions as it supports obliviously accessing hash tables more efficiently. We implement both our proposed constructions and prior methods to experimentally demonstrate that our constructions substantially outperform prior methods in terms of efficiency.\n",
    "citationCount": 2,
    "referenceCount": 86
}