{
    "paperId": "e938f371f28f4393c2c1677c7e6735620c23f436",
    "title": "A Review of Benchmark and Test Functions for Global Optimization Algorithms and Metaheuristics",
    "year": 2025,
    "venue": "WIREs Computational Statistics",
    "authors": [
        "M. Naser",
        "M. al-Bashiti",
        "Arash Teymori Gharah Tapeh",
        "Ahmad Z. Naser",
        "Venkatesh Kodur",
        "Rami Hawileeh",
        "Jamal Abdalla",
        "N. Khodadadi",
        "Amir H. Gandomi",
        "A. Eslamlou"
    ],
    "doi": "10.1002/wics.70028",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e938f371f28f4393c2c1677c7e6735620c23f436",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Benchmarking in optimization is a critical step in evaluating the performance, robustness, and scalability of machine learning algorithms and metaheuristics. While trends in benchmark design continue to evolve, synthetic functions remain vital for fundamental stress tests and theoretical evaluations. As several benchmark and test functions have been developed and derived over the past decades, little attention has been given to classifying such test functions and the rationale behind their usage. From this lens, this paper reviews and categorizes a broad range of functions often employed in assessing optimizers and metaheuristics. More specifically, we classify test functions based on modality, dimensionality, separability, smoothness, constraints, and noise characteristics to offer a broad view that aids in selecting appropriate benchmarks for various algorithmic challenges. Then, this review also discusses in detail the 25 most commonly used functions in the open literature and proposes two new, highly dimensional, dynamic, and challenging functions that could be used for testing new algorithms. Finally, this review identifies gaps in current benchmarking practices and directions for future research, as well as suggests best practices and guidelines.",
    "citationCount": 1,
    "referenceCount": 165
}