{
    "paperId": "e9533390e10044af60e32a6bde21827e720ea2ca",
    "title": "Evaluating the Impact of Spatial Features of Mobility Data and Index Choice on Database Performance",
    "year": 2025,
    "venue": "2025 IEEE International Conference on Cloud Engineering (IC2E)",
    "authors": [
        "Tim C. Rese",
        "Alexandra Kapp",
        "David Bermbach"
    ],
    "doi": "10.1109/IC2E65552.2025.00007",
    "arxivId": "2505.14466",
    "url": "https://www.semanticscholar.org/paper/e9533390e10044af60e32a6bde21827e720ea2ca",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growing number of moving Internet-of-Things (IoT) devices has led to a surge in moving object data, powering applications such as traffic routing, hotspot detection, or weather forecasting. When managing such data, spatial database systems offer various index options and data formats, e.g., point-based or trajectory-based. Likewise, dataset characteristics such as geographic overlap and skew can vary severely. All three can strongly affect database performance. While this has been studied in existing papers, none of them explore the effects and trade-offs resulting from a combination of all three aspects.In this paper, we evaluate the performance impact of index choice, data format, and dataset characteristics on a popular spatial database system, PostGIS. We focus on two aspects of dataset characteristics, the degree of overlap and the degree of skew, and propose novel metrics and approximation methods to determine these features. We design a benchmark that compares a variety of spatial indexing strategies and data formats, while also considering the impact of dataset characteristics on database performance. We include a variety of real-world and synthetic datasets, and write and read operations to cover a broad range of scenarios that might occur during application runtime.Our results offer practical guidance for developers looking to optimize spatial storage and querying, while also providing insights into dataset characteristics and their impact on database performance.",
    "citationCount": 2,
    "referenceCount": 45
}