{
    "paperId": "e98bad6faa759455ab8e6abe6679bb69870f15f4",
    "title": "Scalable Nanopore sequencing of human genomes provides a comprehensive view of haplotype-resolved variation and methylation",
    "year": 2023,
    "venue": "bioRxiv",
    "authors": [
        "M. Kolmogorov",
        "Kimberley J. Billingsley",
        "Melissa Meredith",
        "J. Monlong",
        "R. Lorig-Roach",
        "Mobin Asri",
        "Pilar Alvarez Jerez",
        "Lakshay Malik",
        "Ramita Dewan",
        "X. Reed",
        "Rylee M. Genner",
        "Kensuke Daida",
        "S. Behera",
        "Kishwar Shafin",
        "Trevor Pesout",
        "Jeshuwin Prabakaran",
        "P. Carnevali",
        "Jianzhi Yang",
        "A. Rhie",
        "Sonja W. Scholz",
        "B. Traynor",
        "K. Miga",
        "Miten Jain",
        "W. Timp",
        "A. Phillippy",
        "Mark J. P. Chaisson",
        "F. Sedlazeck",
        "C. Blauwendraat",
        "B. Paten"
    ],
    "doi": "10.1101/2023.01.12.523790",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e98bad6faa759455ab8e6abe6679bb69870f15f4",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9882142",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Long-read sequencing technologies substantially overcome the limitations of short-reads but to date have not been considered as feasible replacement at scale due to a combination of being too expensive, not scalable enough, or too error-prone. Here, we develop an efficient and scalable wet lab and computational protocol for Oxford Nanopore Technologies (ONT) long-read sequencing that seeks to provide a genuine alternative to short-reads for large-scale genomics projects. We applied our protocol to cell lines and brain tissue samples as part of a pilot project for the NIH Center for Alzheimer's and Related Dementias (CARD). Using a single PromethION flow cell, we can detect SNPs with F1-score better than Illumina short-read sequencing. Small indel calling remains to be difficult inside homopolymers and tandem repeats, but is comparable to Illumina calls elsewhere. Further, we can discover structural variants with F1-score comparable to state-of the-art methods involving Pacific Biosciences HiFi sequencing and trio information (but at a lower cost and greater throughput). Using ONT based phasing, we can then combine and phase small and structural variants at megabase scales. Our protocol also produces highly accurate, haplotype-specific methylation calls. Overall, this makes large-scale long-read sequencing projects feasible; the protocol is currently being used to sequence thousands of brain-based genomes as a part of the NIH CARD initiative. We provide the protocol and software as open-source integrated pipelines for generating phased variant calls and assemblies.",
    "citationCount": 0,
    "referenceCount": 53
}