{
    "paperId": "e9b4a4820da16a28d56f3ffcb9c47f78c8f7c467",
    "title": "A Multi-Aspect Informed GRU: A Hybrid Model of Flight Fare Forecasting with Sentiment Analysis",
    "year": 2024,
    "venue": "Applied Sciences",
    "authors": [
        "Worku Abebe Degife",
        "Bor-Shen Lin"
    ],
    "doi": "10.3390/app14104221",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e9b4a4820da16a28d56f3ffcb9c47f78c8f7c467",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/14/10/4221/pdf?version=1715851961",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents an advanced method for forecasting flight fares that combines aspect-based sentiment analysis (ABSA) with deep learning techniques, particularly the gated recurrent unit (GRU) model. This approach leverages historical airline ticket transaction data and customer reviews to better understand airline fare dynamics and the impact of customer sentiments on pricing. The aspect analysis extracts key service aspects from customer feedback and provides insightful correlations with airfare. These were further categorized into nine groups for sensitivity analysis, which offered a deeper understanding of how each group influences customers’ attitudes. This ABSA-driven forecasting method marks a departure from traditional models by utilizing sentiment data alongside airline transaction data to improve the predictive accuracy. Its effectiveness is demonstrated through metrics including a root mean square error (RMSE) of 0.0071, a mean absolute error (MAE) of 0.0137, and a coefficient of determination (R2) of 0.9899. Additionally, this model shows strong prediction performance in both short- and long-term fare predictions. It not only advances airfare forecasting methods but provides valuable insights for decision makers of airline industry to refine the pricing strategies or make improvements when it is indicated some services require further attention.",
    "citationCount": 3,
    "referenceCount": 33
}