{
    "paperId": "e9f1e762723cd4772e8428868dc9be82faa0a711",
    "title": "Developing a More Accurate Biomedical Literature Retrieval Method using Deep Learning and Citations in PubMed Central Full-text Articles",
    "year": 2021,
    "venue": "bioRxiv",
    "authors": [
        "Chun-chao Lo",
        "Shubo Tian",
        "Yuchuan Tao",
        "Jie Hao",
        "Jinfeng Zhang"
    ],
    "doi": "10.1101/2021.10.21.465340",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e9f1e762723cd4772e8428868dc9be82faa0a711",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1101/2021.10.21.465340",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Most queries submitted to a literature search engine can be more precisely written as sentences to give the search engine more specific information. Sentence queries should be more effective, in principle, than short queries with small numbers of keywords. Querying with full sentences is also a key step in question-answering and citation recommendation systems. Despite the considerable progress in natural language processing (NLP) in recent years, using sentence queries on current search engines does not yield satisfactory results. In this study, we developed a deep learning-based method for sentence queries, called DeepSenSe, using citation data available in full-text articles obtained from PubMed Central (PMC). A large amount of labeled data was generated from millions of matched citing sentences and cited articles, making it possible to train quality predictive models using modern deep learning techniques. A two-stage approach was designed: in the first stage we used a modified BM25 algorithm to obtain the top 1000 relevant articles; the second stage involved re-ranking the relevant articles using DeepSenSe. We tested our method using a large number of sentences extracted from real scientific articles in PMC. Our method performed substantially better than PubMed and Google Scholar for sentence queries.",
    "citationCount": 1,
    "referenceCount": 45
}