{
    "paperId": "e9f26f7674fdf385177f6ad7d3aa7d5670000b4f",
    "title": "Design Space Exploration for Scalable DNN Accelerators Using a Memory-Centric Analytical Model for HW/SW Co-Design",
    "year": 2025,
    "venue": "ACM Trans. Design Autom. Electr. Syst.",
    "authors": [
        "Wei-Chun Huang",
        "Chih-Wei Tang",
        "Kuei-Chung Chang",
        "Tien-Fu Chen",
        "Hsiang-Cheng Hsieh",
        "Ming-Hsuan Tsai"
    ],
    "doi": "10.1145/3729227",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e9f26f7674fdf385177f6ad7d3aa7d5670000b4f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As Deep Neural Network (DNN) models became more complex, the escalating computational demands on hardware made DNN accelerators a critical research topic. The rapid growth of DNN models required DNN accelerators to keep pace with these computational demands. However, the cost of hardware design was significant, and hardware and software were tightly coupled in the design of DNN accelerators. Much research on HW/SW co-design was evident, highlighting the importance of having a comprehensive framework to help find the optimal hardware and software design during the design phase. The cost models used in most of the current research relied on data reuse and mathematical estimation to calculate costs, an approach that was fast but inaccurate. In this article, we propose a framework for HW/SW co-design and introduce a hybrid cost model based on Gem5 that provides fast and precise performance evaluation. The framework uses a memory-centric approach to accurately model off-chip memory behavior. In addition, we discuss how to find the best design in a large co-design space and integrate a design point through a traffic generator and a cost model. Finally, we demonstrate that our framework can accurately assist DNN accelerator developers in exploring the optimal hardware and software co-design quickly and efficiently.",
    "citationCount": 0,
    "referenceCount": 39
}