{
    "paperId": "ea1545e840e9db47cd8c6af9f8bb542736d41a57",
    "title": "Assessment of the Clinic's Digital Maturity Achievement in Terms of Patient-orientation via Call-Center Dialogues Emotional Analysis",
    "year": 2025,
    "venue": "2025 IEEE Ural-Siberian Conference on Biomedical Engineering, Radioelectronics and Information Technology (USBEREIT)",
    "authors": [
        "Pavel Kalinin",
        "Dmitriy Fedorov"
    ],
    "doi": "10.1109/USBEREIT65494.2025.11054192",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea1545e840e9db47cd8c6af9f8bb542736d41a57",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Every year more and more patients are becoming involved in taking care of their health through the use of digital services and telemedicine technologies. The effective use of information technology in management decision making in a medical organization is one of the key indicators for achieving digital maturity. The article is devoted to the issue of the effectiveness of healthcare digitalization in terms of patient-orientation. Literature review on the topic of data-driven patient-oriented healthcare system management, and analysis of the elaboration of this issue in scientific discourse are provided. The article examines the possibilities of using large language models in the healthcare sector, highlights the key aspects of managing patient-oriented organizational systems. Also, emphasis is placed on the existence of dependencies between the principles of 4P-Medicine and the effects of IT activities, developed dependency scheme is provided. The article sets out the task of ranking the principles of 4P-Medicine for different social groups of patients. The article describes an approach to evaluate P-3 principle by conducting an emotional analysis of call center dialogues. The results of the experiment conducted to recognize patients' emotions using dataset Dusha and GigaAm-Emo model are provided. Additionally, the vector for future research on the implementation of a medical organization assessment methodology based on the principles of 4P-Medicine for use in the management decision support system is set 3 the main stages are explained.",
    "citationCount": 1,
    "referenceCount": 25
}