{
    "paperId": "ea1a45a39cd37f159d2e98bd0fde50fdd3550e86",
    "title": "Data Management and Exchange between a Meta-Orchestration Platform and Data Spaces",
    "year": 2024,
    "venue": "eSAAM",
    "authors": [
        "Anastasios Zafeiropoulos",
        "Nikos Filinis",
        "Dimitrios Spatharakis",
        "Ioannis Dimolitsas",
        "Eleni Fotopoulou",
        "Constantinos Vassilakis",
        "S. Papavassiliou"
    ],
    "doi": "10.1145/3685651.3686698",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea1a45a39cd37f159d2e98bd0fde50fdd3550e86",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A transition is underway towards the development of orchestration systems for the distributed computing continuum, where microservices-based applications are deployed and managed over resources that span from the Internet of Things (IoT) to the edge to the cloud part of it. In parallel, distributed monitoring frameworks are deployed to manage the vast amount of data produced to assist orchestration actions, optimal deployment of Machine Learning (ML) workflows, and processing of data produced by the IoT infrastructure that are related to vertical industries. In the current work, we detail the data collection and management approach that we follow in the development of a novel meta-orchestration platform for processing and sharing such data. For the latter, the potential for exploitation of the produced data is analyzed along with the interlinkage of the meta-orchestration platform with emerging work in the domain of Data Spaces. Opportunities and limitations for such an interlinkage are discussed.",
    "citationCount": 1,
    "referenceCount": 17
}