{
    "paperId": "ea2f72b979e2646dec92a9ce9b6b07dd0a20e789",
    "title": "Retrieval-Augmented Generation in Biomedicine: A Survey of Technologies, Datasets, and Clinical Applications",
    "year": 2025,
    "venue": "",
    "authors": [
        "Jiawei He",
        "Boya Zhang",
        "H. Rouhizadeh",
        "Yingjian Chen",
        "Rui Yang",
        "Jin Lu",
        "Xudong Chen",
        "Nan Liu",
        "Irene Li",
        "Douglas Teodoro"
    ],
    "doi": null,
    "arxivId": "2505.01146",
    "url": "https://www.semanticscholar.org/paper/ea2f72b979e2646dec92a9ce9b6b07dd0a20e789",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advances in large language models (LLMs) have demonstrated remarkable capabilities in natural language processing tasks. However, their application in the biomedical domain presents unique challenges, particularly regarding factual accuracy and up-to-date knowledge integration. Retrieval Augmented Generation (RAG) has emerged as a promising solution to address these challenges by combining the generative capabilities of LLMs with external knowledge retrieval. This comprehensive survey examines the application of RAG in the biomedical domain, focusing on its technological components, available datasets, and clinical applications. We present a systematic analysis of retrieval methods, ranking strategies, and generation models, while also exploring the challenges and future directions in this rapidly evolving field. Our work provides researchers and practitioners with a thorough understanding of the current state of biomedical RAG systems and identifies key areas for future research and development.",
    "citationCount": 2,
    "referenceCount": 244
}