{
    "paperId": "ea364940799df4911577020802830e2690755c70",
    "title": "Beyond the Human Genome Project: The Age of Complete Human Genome Sequences and Pangenome References",
    "year": 2024,
    "venue": "Annual review of genomics and human genetics (Print)",
    "authors": [
        "Dylan J. Taylor",
        "Jordan M. Eizenga",
        "Qiuhui Li",
        "Arun Das",
        "Katharine M. Jenike",
        "E. Kenny",
        "K. Miga",
        "J. Monlong",
        "R. McCoy",
        "B. Paten",
        "Michael C Schatz"
    ],
    "doi": "10.1146/annurev-genom-021623-081639",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea364940799df4911577020802830e2690755c70",
    "isOpenAccess": true,
    "openAccessPdf": "https://hal.inrae.fr/hal-04696423v1/file/annurev-genom-021623-081639.pdf",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Human Genome Project was an enormous accomplishment, providing a foundation for countless explorations into the genetics and genomics of the human species. Yet for many years, the human genome reference sequence remained incomplete and lacked representation of human genetic diversity. Recently, two major advances have emerged to address these shortcomings: complete gap-free human genome sequences, such as the one developed by the Telomere-to-Telomere Consortium, and high-quality pangenomes, such as the one developed by the Human Pangenome Reference Consortium. Facilitated by advances in long-read DNA sequencing and genome assembly algorithms, complete human genome sequences resolve regions that have been historically difficult to sequence, including centromeres, telomeres, and segmental duplications. In parallel, pangenomes capture the extensive genetic diversity across populations worldwide. Together, these advances usher in a new era of genomics research, enhancing the accuracy of genomic analysis, paving the path for precision medicine, and contributing to deeper insights into human biology.",
    "citationCount": 18,
    "referenceCount": 149
}