{
    "paperId": "ea3eb40b232063948159975a29fb06394b001f10",
    "title": "Enhancing Weed and Crop Classification Using Hybrid Visual Features",
    "year": 2024,
    "venue": "International Conference on Intelligent Computing",
    "authors": [
        "F. D. Adhinata",
        "Wahyono",
        "Raden Sumiharto"
    ],
    "doi": "10.1109/ICIC64337.2024.10956509",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea3eb40b232063948159975a29fb06394b001f10",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Weed and crop classification is essential because weeds can absorb nutrients from the soil that are meant for crops. Manual weed removal is inefficient and causes fatigue for farmers. Additionally, inappropriate herbicide use can damage the environment. Recently, researchers have begun developing Artificial Intelligence (AI) to assist farmers in classifying weeds and crops. One of the crucial stages in using AI is the feature extraction stage. The use of single features for weed and crop classification is less accurate, so this research proposes the use of hybrid features. This research uses a combination of visual features, such as color, shape, and texture, to increase accuracy compared to using only a single feature. Experimental results show an accuracy of 0.968 for the classification of corn, potato, and weed plants. In fact, the proposed method can classify potato and corn plants correctly. This research also presents a comparison using non-handcrafted features, which we evaluate with a transfer learning model. Experimental results show that our proposed method is still more accurate. It is hoped that these results can help farmers modernize agricultural technology in weed removal.",
    "citationCount": 0,
    "referenceCount": 24
}