{
    "paperId": "ea50529131a53ec2cf5ecf246e4b12776f9f6475",
    "title": "Towards a Universal Vibration Analysis Dataset: A Framework for Transfer Learning in Predictive Maintenance and Structural Health Monitoring",
    "year": 2025,
    "venue": "International Journal of Prognostics and Health Management",
    "authors": [
        "Mert Sehri",
        "I. Varejão",
        "Zehui Hua",
        "V. Bonella",
        "Adriano Santos",
        "F. D. A. Boldt",
        "Patrick Dumond",
        "F. M. Varejão"
    ],
    "doi": "10.48550/arXiv.2504.11581",
    "arxivId": "2504.11581",
    "url": "https://www.semanticscholar.org/paper/ea50529131a53ec2cf5ecf246e4b12776f9f6475",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the realm of machine learning (ML), particularly in visual computing, ImageNet has established itself as an indispensable resource for transfer learning (TL), enabling the development of highly effective models with reduced training time and data requirements. However, the domain of vibration analysis, which is critical in fields such as predictive maintenance, structural health monitoring, and fault diagnosis, lacks a comparable large-scale, annotated dataset to facilitate similar advancements. To address this gap, we propose a dataset framework that begins with a focus on bearing vibration data as an initial step towards creating a universal dataset for vibration-based spectrogram analysis for all machinery. \nThe initial phase should feature a curated collection of bearing vibration signals, designed to represent a wide array of real-world scenarios, including vibration data of various public bearing datasets. To demonstrate the initial efficacy of this approach, experiments should be conducted using a state-of-the-art deep learning (DL) architecture, showing improvements in model performance when pre-trained on bearing vibration data and fine-tuned on smaller, domain-specific datasets. These findings will illustrate the potential to parallel the success of ImageNet in visual computing, but for vibration analysis. \nIn future iterations, this proposal will evolve to encompass a broader range of vibration signals from multiple types of machinery and sensors, with an emphasis on generating spectrogram-based representations of the data. Multi-sensor data, including signals from accelerometers, microphones, and other devices should be used, ensuring versatility for both domain-specific and generalized applications. They will be incorporated to create a more holistic and comprehensive dataset, enabling the application of advanced sensor fusion techniques in vibration analysis. Each sample will be labeled with detailed metadata, such as machinery type, operational status, and the presence or type of faults, ensuring its utility for supervised and unsupervised learning tasks. This extension will position this work as a universal resource for various industries, enhancing the ability of researchers and practitioners to apply TL to diverse vibration analysis problems. In addition to the dataset, a comprehensive framework for data preprocessing, feature extraction, and model training specific to vibration data should be developed. This framework will standardize methodologies across the research community, fostering collaboration and accelerating progress in predictive maintenance, structural health monitoring, and related fields. \nIn conclusion, this proposal represents a transformative step in vibration analysis, starting with bearing data as its foundation and ultimately evolving into a universal dataset for spectrograms and multi-sensor data for all machinery. By mirroring the success of ImageNet in visual computing, it has the potential to significantly improve the development of intelligent systems in industrial applications, enabling more efficient and reliable operations.",
    "citationCount": 2,
    "referenceCount": 18
}