{
    "paperId": "ea5c359b1183e519a969102105ccfd3943b6bf02",
    "title": "A Novel Fast Searching Algorithm Based on Least Square Regression",
    "year": 2021,
    "venue": "Rev. d'Intelligence Artif.",
    "authors": [
        "R. Challa",
        "Siva Prasad Chintha",
        "B. Reddaiah",
        "K. S. Rao"
    ],
    "doi": "10.18280/ria.350111",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea5c359b1183e519a969102105ccfd3943b6bf02",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Currently, the machine learning group is well-understood and commonly used for predictive modelling and feature generation through linear methodologies such as reversals, principal analysis and canonical correlation analyses. All these approaches are typically intended to capture fascinating subspaces in the original space of high dimensions. These methods have all a closed-form approach because of its simple linear structures, which makes estimation and theoretical analysis for small datasets very straightforward. However, it is very common for a data set to have millions or trillions of samples and features in modern machine learning problems. We deal with the problem of fast estimation from large volumes of data for ordinary squares. The search operation is a very important operation and it is useful in many applications. Some applications when the data set size is large, the linear search takes the time which is proportional to the size of the data set. Binary search and interpolation search performs good for the search of elements in the data set in O(logn) and ⋅O(log(⋅logn)) respectively in the worst case. Now, in this paper, an effort is made to develop a novel fast searching algorithm based on the least square regression curve fitting method. The algorithm is implemented and its execution results are analyzed and compared with binary search and interpolation search performance. The proposed model is compared with the traditional methods and the proposed fast searching algorithm exhibits better performance than the traditional models.",
    "citationCount": 1,
    "referenceCount": 18
}