{
    "paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a",
    "title": "Hydro: Adaptive Query Processing of ML Queries",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Gaurav Tarlok Kakkar",
        "Jiashen Cao",
        "Aubhro Sengupta",
        "Joy Arulraj",
        "Hyesoon Kim"
    ],
    "doi": "10.48550/arXiv.2403.14902",
    "arxivId": "2403.14902",
    "url": "https://www.semanticscholar.org/paper/ea63aefb4979c9e46e82247b364afb391ac8cd6a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Query optimization in relational database management systems (DBMSs) is critical for fast query processing. The query optimizer relies on precise selectivity and cost estimates to effectively optimize queries prior to execution. While this strategy is effective for relational DBMSs, it is not sufficient for DBMSs tailored for processing machine learning (ML) queries. In ML-centric DBMSs, query optimization is challenging for two reasons. First, the performance bottleneck of the queries shifts to user-defined functions (UDFs) that often wrap around deep learning models, making it difficult to accurately estimate UDF statistics without profiling the query. This leads to inaccurate statistics and sub-optimal query plans. Second, the optimal query plan for ML queries is data-dependent, necessitating DBMSs to adapt the query plan on the fly during execution. So, a static query plan is not sufficient for such queries. In this paper, we present Hydro, an ML-centric DBMS that utilizes adaptive query processing (AQP) for efficiently processing ML queries. Hydro is designed to quickly evaluate UDF-based query predicates by ensuring optimal predicate evaluation order and improving the scalability of UDF execution. By integrating AQP, Hydro continuously monitors UDF statistics, routes data to predicates in an optimal order, and dynamically allocates resources for evaluating predicates. We demonstrate Hydro's efficacy through four illustrative use cases, delivering up to 11.52x speedup over a baseline system.",
    "citationCount": 2,
    "referenceCount": 51
}