{
    "paperId": "ea6f8426be7b8761a089d541379f208814de9c73",
    "title": "Society 5.0 and the future of work skills for software engineers and developers",
    "year": null,
    "venue": "EPiC series in computing",
    "authors": [
        "Stefan Smuts",
        "Hanlie Smuts"
    ],
    "doi": "10.29007/9kzd",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ea6f8426be7b8761a089d541379f208814de9c73",
    "isOpenAccess": true,
    "openAccessPdf": "https://easychair.org/publications/open/tXG6",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Society 5.0, with all its different cyber-physical aspects not only presents a technical challenge, but also significantly changes the structures and business processes of organizations. It requires software engineers and developers to consider a new level of socio-technical interaction and planning. Software should not be the point of friction among products, services and users, but should rather encourage software engineers and developers to become more human-oriented. Therefore, the purpose of this study was to investigate the future of work skills in Society 5.0 for software engineers and developers. We collected and analyzed two datasets; one dataset containing academic peer reviewed publications and the second dataset encompassed popular press articles that predicted the future of software engineering and development. We used the Software Engineering Body of Knowledge (SWEBOK) to map the data and found that future of work skills for software engineers and developers are driven by software foundations and the evolution of new programming languages and technologies e.g. quantum computing. In addition, software professional practices such as containerization, no / low-code development and fast innovation / prototyping cycles will affect the future of work together with software development practices such as cross-platform development, continuous integration and deployment, and cybersecurity. Based on the findings, we developed a skills evaluation tool that could be used to establish a future of work skills profile. By considering the evolution of the software engineering and –development role, as well as the future requirement due to technology evolution, a software engineer and developer may be able to prepare themselves for the Society 5.0 domain.",
    "citationCount": 6,
    "referenceCount": 56
}