{
    "paperId": "ea9d84730b3cbd67327c9bafda817c40cb11f126",
    "title": "UREM: A High-performance Unified and Resilient Enhancement Method for Multi- and High-Dimensional Indexes",
    "year": 2025,
    "venue": "",
    "authors": [
        "Ming Sheng",
        "Shuliang Wang",
        "Yong Zhang",
        "Yi Luo",
        "Xianbo Liu",
        "Zeming Li"
    ],
    "doi": null,
    "arxivId": "2510.20110",
    "url": "https://www.semanticscholar.org/paper/ea9d84730b3cbd67327c9bafda817c40cb11f126",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Numerous multi- or high-dimensional indexes with distinct advantages have been proposed on various platforms to meet application requirements. To achieve higher-performance queries, most indexes employ enhancement methods, including structure-oriented and layout-oriented enhancement methods. Existing structure-oriented methods tailored to specific indexes work well under static workloads but lack generality and degrade under dynamic workloads. The layout-oriented methods exhibit good generality and perform well under dynamic workloads, but exhibit suboptimal performance under static workloads. Therefore, it is an open challenge to develop a unified and resilient enhancement method that can improve query performance for different indexes adaptively under different scenarios. In this paper, we propose UREM, which is the first high-performance Unified and Resilient Enhancement Method designed for both multi- and high-dimensional indexes, capable of adapting to different scenarios. Specifically, UREM (1) can be uniformly applied with different indexes on various platforms; (2) enhances the query performance of indexes by layout optimization under static workloads; (3) enables indexes to stabilize performance when queries shift through partial layout reorganization. We evaluate UREM on 20 widely used indexes. Experimental results demonstrate that UREM improves the query performance of multi- and high-dimensional indexes by up to 5.73x and 9.18x under static workloads, and by an average of 5.72x and 9.47x under dynamic workloads. Moreover, some traditional indexes enhanced by UREM even achieve performance comparable to or even surpassing that of recent advanced indexes.",
    "citationCount": 0,
    "referenceCount": 66
}