{
    "paperId": "eaa2676f35fd78ca3442f6995002a76e64879e82",
    "title": "PAV-A-kNN: A Novel Approachable kNN Query Method in Road Network Environments",
    "year": 2025,
    "venue": "Computers, Materials &amp; Continua",
    "authors": [
        "Kailai Zhou",
        "Weikang Xia",
        "Jiatai Wang"
    ],
    "doi": "10.32604/cmc.2025.065334",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eaa2676f35fd78ca3442f6995002a76e64879e82",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Ride-hailing (e.g., DiDi and Uber) has become an important tool for modern urban mobility. To improve the utilization efficiency of ride-hailing vehicles, a novel query method, called Approachable k -nearest neighbor (A-k NN), has recently been proposed in the industry. Unlike traditional k NN queries, A-k NN considers not only the road network distance but also the availability status of vehicles. In this context, even vehicles with passengers can still be considered potential candidates for dispatch if their destinations are near the requester’s location. The V-Tree-based query method, due to its structural characteristics, is capable of efficiently finding k -nearest moving objects within a road network. It is a currently popular query solution in ride-hailing services. However, when vertices to be queried are close in the graph but distant in the index, the V-Tree-based method necessitates the traversal of numerous irrelevant subgraphs, which makes its processing of A-k NN queries less efficient. To address this issue, we optimize the V-Tree-based method and propose a novel index structure, the Path-Accelerated V-Tree (PAV-Tree), to improve query performance by introducing shortcuts. Leveraging this index, we introduce a novel query optimization algorithm, PAV- A-k NN, specifically designed to process A-k NN queries efficiently. Experimental results show that PAV-A-k NN achieves query times up to 2.2–15 times faster than baseline methods, with microsecond-level latency.",
    "citationCount": 0,
    "referenceCount": 35
}