{
    "paperId": "ead5cb7b6f4091c8ec345029ba23bc4b4e42be64",
    "title": "Digital-driven optimisation methods for the thermal comfort and spatial form of traditional Beijing Siheyuan architecture",
    "year": 2025,
    "venue": "Indoor and Built Environment",
    "authors": [
        "Rui Wu",
        "Ming Huang",
        "Guanjun Huang",
        "Xiaoyu Liu"
    ],
    "doi": "10.1177/1420326X251333053",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ead5cb7b6f4091c8ec345029ba23bc4b4e42be64",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Addressing the issue of low thermal comfort in Siheyuan, this article proposes a rapid intelligent optimisation method integrating XGBoost (eXtreme Gradient Boosting) with genetic algorithm. The design variables of Siheyuan were encoded in the study using parametric modelling techniques, and parameter correlations and constraints were established to control the traditional architectural features. Based on genetic algorithm, an indoor comfort Predicted Mean Vote and building area multi-objective optimisation model were constructed to automatically generate and iteratively optimise individual architectural spatial forms. Finally, XGBoost was employed to learn and train from a large number of simulation samples, rapidly predicting indoor thermal comfort results, and using this as the optimisation target to obtain the optimal solution set of Siheyuan spatial forms. Compared with traditional empirical design methods, this method efficiently traverses vast solution spaces, intelligently generating Siheyuan renovation schemes that balance cultural heritage and health comfort. The research results demonstrate that this method could significantly improve the living environment of Siheyuan and would promote the sustainable development of architecture.",
    "citationCount": 0,
    "referenceCount": 55
}