{
    "paperId": "eaff30a3b9b66d2bf68597edfd1cafe50377dda4",
    "title": "On the Privacy of Counting Bloom Filters Under a Black-Box Attacker",
    "year": 2023,
    "venue": "IEEE Transactions on Dependable and Secure Computing",
    "authors": [
        "Sergio Galan",
        "P. Reviriego",
        "Stefan Walzer",
        "A. Sánchez-Macián",
        "Shanshan Liu",
        "Fabrizio Lombardi"
    ],
    "doi": "10.1109/TDSC.2022.3217115",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eaff30a3b9b66d2bf68597edfd1cafe50377dda4",
    "isOpenAccess": true,
    "openAccessPdf": "https://oa.upm.es/76679/1/Black_Box_Counting_Bloom_Filters.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Counting Bloom Filters (CBFs) are approximate membership checking data structures, and it is normally believed that at most an approximate reconstruction of the underlying set can be derived when interacting with a CBF. This paper decisively refutes this assumption. In a recent paper, we considered the privacy of CBFs when the attacker has access to the implementation details and thus, it sees the filter as a white-box. In that setting, we showed that the attacker may be able to extract the elements stored in the filter when the number of false positives over the entire universe is not significantly larger than the number of elements stored in the filter. In this work, we consider a black-box attacker that can only perform user interactions on the CBF to insert, remove and query elements with no knowledge of the filter implementation details. We show that even in this case, an attacker may be able to extract information from the filter at the cost of using more complex and time-consuming attack algorithms. The proposed algorithms have been implemented and compared with the white-box attack, showing that in most cases, almost the same information can be extracted from the filter.",
    "citationCount": 3,
    "referenceCount": 24
}