{
    "paperId": "eb0fc9be1da8ded652bb68182bdf5dab2954a8bb",
    "title": "LiRe: Efficient Query Rewriting for Retrieval Augmented Generation Systems",
    "year": 2024,
    "venue": "2024 4th International Conference on Computer Science, Electronic Information Engineering and Intelligent Control Technology (CEI)",
    "authors": [
        "Chengfeng Chen",
        "Xiaodong Huang",
        "Yangzhen Xu",
        "Runfeng Lin",
        "Gangliang Li",
        "Shouqiang Liu"
    ],
    "doi": "10.1109/CEI63587.2024.10871553",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb0fc9be1da8ded652bb68182bdf5dab2954a8bb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the continuous advancement of information retrieval technologies, query rewriting has become a key technique for enhancing retrieval effectiveness. In the context of the widespread application of large language models and retrieval-augmented generation technologies, high-quality query rewriting plays a crucial role in tasks like open-domain question answering. Conventional Conversational Query Rewriting (CQR) methods often prioritize human-friendly query formulation, which may not consistently produce optimal retriever-friendly results. To address this limitation, we present LiRe, a lightweight and training-free query rewriting system. LiRe employs a retrieval-oriented strategy to refine queries, optimizing them for retrievers. This approach allows for seamless integration into diverse Retrieval-Augmented Generation (RAG) systems. Our approach involves problem categorization, keyword augmentation from contextual information, and integration with the filtering process. LiRe-enhanced queries demonstrate superior performance compared to existing CQR methods, as evidenced by experimental outcomes.",
    "citationCount": 1,
    "referenceCount": 9
}