{
    "paperId": "eb14c3a905c020105bdc7736387fa7263c99dcef",
    "title": "Is the Pull-Down Effect Overstated? An Examination of Trust Propagation Among Fighter Pilots in a High-Fidelity Simulation",
    "year": 2024,
    "venue": "Journal of Cognitive Engineering and Decision Making",
    "authors": [
        "Joseph B. Lyons",
        "Janine D. Mator",
        "Tony Orr",
        "Gene M. Alarcon",
        "Kristen Barrera"
    ],
    "doi": "10.1177/15553434231225909",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb14c3a905c020105bdc7736387fa7263c99dcef",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Research on trust propagation has primarily been conducted with undergraduates using low-fidelity scenarios. It is unclear if the pull-down effect (e.g., system-wide trust) occurs in more applied domains with actual operators. A sample of experienced US Air Force fighter pilots (n = 13) engaged in six trials using a high-fidelity simulation for Collaborative Combat Aircraft (CCA). The pilots were given command of four CCAs to complete realistic targeting missions. They were asked to monitor the CCAs, report any errors, evaluate a number of potential targets, select a valid target, and select one of the CCAs to perform a strike. One of the CCAs evidenced an error in four of the six trials (17% of all observations), and if the pilots did not report the error, they were prompted to it by an experimenter playing the role of Air Battle Manager. After each trial, reliance intentions and subjective workload were assessed for each of the four CCAs. The presence of an error reduced trust and increased workload for that CCA referent only. There was no evidence of a pull-down effect, nor did the composition of the CCA group (homogenous vs. heterogenous) influence trust propagation. Implications for trust research are discussed.",
    "citationCount": 5,
    "referenceCount": 44
}