{
    "paperId": "eb295df3a682acc2b749352fc2663d715122f40c",
    "title": "A Deep Reinforcement Learning-based Routing Scheme with Two Modes for Dynamic Networks",
    "year": 2021,
    "venue": "ICC 2021 - IEEE International Conference on Communications",
    "authors": [
        "Peizhuang Cong",
        "Yuchao Zhang",
        "Wendong Wang",
        "Ke Xu",
        "Ruidong Li",
        "Fuliang Li"
    ],
    "doi": "10.1109/ICC42927.2021.9500466",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb295df3a682acc2b749352fc2663d715122f40c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of communication and transmission technologies, more and more applications, like Internet of vehicles and tele-medicine, become more sensitive to network latency and accuracy, which requires routing schemes to be more efficient. In order to meet such urgent need, learning-based routing strategies emerges, with the advantages of high flexibility and accuracy. These strategies can be divided into two categories, centralized and distributed, enjoying the advantages of high precision and high efficiency, respectively. However, routing become more complex in dynamic network, where the link connections and access states are time-varying, so these learning-based routing mechanisms are required to be able to adapt to network changes in real time. In this paper, we designed and implemented both two of centralized and distributed reinforcement learning-based routing schemes (RLR-T). By conducting a series of experiments, we deeply analyzed the results and gave the conclusion that the centralized is better to cope with dynamic networks due to its faster reconvergence, while the distributed is better to handle with large-scale networks by its high scalability.",
    "citationCount": 4,
    "referenceCount": 26
}