{
    "paperId": "eb2db79f60a3c83a94b335c459b8b4b8274cef0a",
    "title": "Human Instance Matting via Mutual Guidance and Multi-Instance Refinement",
    "year": 2022,
    "venue": "Computer Vision and Pattern Recognition",
    "authors": [
        "Yanan Sun",
        "Chi-Keung Tang",
        "Yu-Wing Tai"
    ],
    "doi": "10.1109/CVPR52688.2022.00267",
    "arxivId": "2205.10767",
    "url": "https://www.semanticscholar.org/paper/eb2db79f60a3c83a94b335c459b8b4b8274cef0a",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2205.10767",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper introduces a new matting task called human instance matting (HIM), which requires the pertinent model to automatically predict a precise alpha matte for each human instance. Straightforward combination of closely related techniques, namely, instance segmentation, soft segmentation and human/conventional matting, will easily fail in complex cases requiring disentangling mingled colors belonging to multiple instances along hairy and thin boundary structures. To tackle these technical challenges, we propose a human instance matting framework, called InstMatt, where a novel mutual guidance strategy working in tandem with a multi-instance refinement module is used, for delineating multi-instance relationship among humans with complex and overlapping boundaries if present. A new instance matting metric called instance matting quality (IMQ) is proposed, which addresses the absence of a unified and fair means of evaluation emphasizing both instance recognition and matting quality. Finally, we construct a HIM benchmark for evaluation, which comprises of both synthetic and natural benchmark images. In addition to thorough experimental results on complex cases with multiple and overlapping human instances each has intricate boundaries, preliminary results are presented on general instance matting. Code and benchmark are available in https://github.com/nowsyn/InstMatt.",
    "citationCount": 28,
    "referenceCount": 62
}