{
    "paperId": "eb673ea1fbd9c930030ed642f63b4be78a809dac",
    "title": "Online Learning Based Underwater Robotic Thruster Fault Detection",
    "year": 2021,
    "venue": "Applied Sciences",
    "authors": [
        "Gaofei Xu",
        "Wei Guo",
        "Yang Zhao",
        "Yue Zhou",
        "Yinlong Zhang",
        "Xinyu Liu",
        "Gaopeng Xu",
        "Guangwei Li"
    ],
    "doi": "10.3390/APP11083586",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb673ea1fbd9c930030ed642f63b4be78a809dac",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2076-3417/11/8/3586/pdf?version=1618567446",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a novel online learning-based fault detection designed for underwater robotic thruster health monitoring. In the fault detection algorithm, we build a mathematical model between the control variable and the propeller speed by fitting collected online work status data to the model. To improve the accuracy of online modeling, a multi-center PSO algorithm with memory ability is utilized to optimize the modeling parameters. Additionally, a model online update mechanism is designed to accommodate the model to the change of thruster work status and sea environment. During the operation, propeller speed of the underwater robot is predicted through the online learning-based model, and the model residuals are used for thruster health monitoring. To avoid false alarm, an adaptive fault detection strategy is established based on model online update mechanism. The proposed method has been extensively evaluated using different underwater robotics, through a sea trial data simulation, a pool test fault detection experiment and a sea trial fault detection experiment. Compared with fixed model-based method, speed prediction MAE of the online learning model is at least 37.9% lower than that of the fixed model. The online learning-based method show no misdiagnosis in experiments, while the fixed model-based method is misdiagnosed. Experimental results show that the proposed method is competitive in terms of accuracy, adaptability, and robustness.",
    "citationCount": 9,
    "referenceCount": 54
}