{
    "paperId": "eb6ede43f730cd8a08230d6d394559bcc84514cc",
    "title": "Haplotype-resolved genomes of octoploid species in Phyllanthaceae family reveal a critical role for polyploidization and hybridization in speciation.",
    "year": 2024,
    "venue": "The Plant Journal",
    "authors": [
        "Fangping Li",
        "Zhuangwei Hou",
        "Shiqiang Xu",
        "Danlu Han",
        "Bin Li",
        "Haifei Hu",
        "Jieying Liu",
        "Shike Cai",
        "Zhenpeng Gan",
        "Yan Gu",
        "Xiufeng Zhang",
        "Xiaofan Zhou",
        "Shaokui Wang",
        "Junliang Zhao",
        "Yu Mei",
        "Jisen Zhang",
        "Zefu Wang",
        "Jihua Wang"
    ],
    "doi": "10.1111/tpj.16767",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb6ede43f730cd8a08230d6d394559bcc84514cc",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The Phyllanthaceae family comprises a diverse range of plants with medicinal, edible, and ornamental value, extensively cultivated worldwide. Polyploid species commonly occur in Phyllanthaceae. Due to the rather complex genomes and evolutionary histories, their speciation process has been still lacking in research. In this study, we generated chromosome-scale haplotype-resolved genomes of two octoploid species (Phyllanthus emblica and Sauropus spatulifolius) in Phyllanthaceae family. Combined with our previously reported one tetraploid (Sauropus androgynus) and one diploid species (Phyllanthus cochinchinensis) from the same family, we explored their speciation history. The three polyploid species were all identified as allopolyploids with subgenome A/B. Each of their two distinct subgenome groups from various species was uncovered to independently share a common diploid ancestor (Ancestor-AA and Ancestor-BB). Via different evolutionary routes, comprising various scenarios of bifurcating divergence, allopolyploidization (hybrid polyploidization), and autopolyploidization, they finally evolved to the current tetraploid S. androgynus, and octoploid S. spatulifolius and P. emblica, respectively. We further discuss the variations in copy number of alleles and the potential impacts within the two octoploids. In addition, we also investigated the fluctuation of metabolites with medical values and identified the key factor in its biosynthesis process in octoploids species. Our study reconstructed the evolutionary history of these Phyllanthaceae species, highlighting the critical roles of polyploidization and hybridization in their speciation processes. The high-quality genomes of the two octoploid species provide valuable genomic resources for further research of evolution and functional genomics.",
    "citationCount": 3,
    "referenceCount": 70
}