{
    "paperId": "eb8be50b6516458e2b9e84f20a8c01d55f023b87",
    "title": "Моделювання багатопортової гетероасоціативної пам'яті (БГАП) на основі еквівалентністних моделей, що реалізуються на векторно-матричних перемножувачах",
    "year": 2023,
    "venue": "Modeling Control and Information Technologies",
    "authors": [
        "Володимир Красиленко",
        "Ілля Чіков",
        "Д.В. Нікітович"
    ],
    "doi": "10.31713/mcit.2023.037",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eb8be50b6516458e2b9e84f20a8c01d55f023b87",
    "isOpenAccess": true,
    "openAccessPdf": "https://itconfdoc.nuwm.edu.ua/index.php/ITConf/article/download/357/198",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Анотація - Робота присвячена розгляду питань стосовно асоціативної обробки інформації з метою апаратно-програмної реалізації відповідних математичних, імітаційних та фізичних моделей асоціативної пам’яті. На основі огляду відомих публікацій, в тому числі тих, у яких були розглянуті еквівалентністні моделі асоціативної та гетероасоціативної памяті та показані їх переваги, обгрунтовано необхідність подальших досліджень таких моделей АП чи ГАП та проведення імітаційних модельних експериментів в плані пошуку їх ефективних реалізацій. Наведені результати імітаційного моделювання двох реалізацій багатопортової гетероасоціативної памяті (БГАП) на основі векторно-матричних перемножувачів та векторно-матричних еквіваленторів, які, як прискорювачі, адаптовані до еквівалентністних моделей. Резльтати моделювання процесів гетеро-асоціативного розпізнавання кортежу букв, виконані у Mathcad для двох варіантів реалізації БГАП, підтверджують їх правильне функціонування, оскільки на виходах-портах БГАП сформовані моделями правильні кортежі всіх вихідних 100 букв, попарно асоційованих зі 100 вхідними буквами. \nThe work is devoted to consideration of issues related to associative processing of information for the purpose of hardware and software implementation of relevant mathematical, simulation and physical models of associative memory. On the basis of a review of known publications, including those in which equivalence models of associative and heteroassociative memory were considered and their advantages were shown, the need for further research of such models of AM or GAM and conducting simulation model experiments in order to find their effective implementations is substantiated. The results of simulation modeling of two implementations of multi-port heteroassociative memory (MBHM) based on vector-matrix multipliers and vector-matrix equivalents, which, as accelerators, are adapted to equivalence models, are given. The results of modeling the processes of hetero-associative letter tuple recognition, performed in Mathcad for two versions of the BGAP implementation, confirm their correct functioning, since the correct tuples of all 100 output letters pairwise associated with 100 input letters are formed by the models at the outputs-ports of the BGAM. \n ",
    "citationCount": 0,
    "referenceCount": 19
}