{
    "paperId": "ebbc096b81e1e0d2bac5bb6a5535b75b567eb78d",
    "title": "Long Short-Term Memory (LSTM) Networks for Accurate River Flow Forecasting: A Case Study on the Morava River Basin (Serbia)",
    "year": 2025,
    "venue": "Water",
    "authors": [
        "Igor Leščešen",
        "Mitra Tanhapour",
        "Pavla Pekárová",
        "Pavol Miklánek",
        "Z. Bajtek"
    ],
    "doi": "10.3390/w17060907",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ebbc096b81e1e0d2bac5bb6a5535b75b567eb78d",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/w17060907",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate forecasting of river flows is essential for effective water resource management, flood risk reduction and environmental protection. The ongoing effects of climate change, in particular the shift in precipitation patterns and the increasing frequency of extreme weather events, necessitate the development of advanced forecasting models. This study investigates the application of long short-term memory (LSTM) neural networks in predicting river runoff in the Velika Morava catchment in Serbia, representing a pioneering application of LSTM in this region. The study uses daily runoff, precipitation and temperature data from 1961 to 2020, interpolated using the inverse distance weighting method. The LSTM model, which was optimized using a trial-and-error approach, showed a high prediction accuracy. For the Velika Morava station, the model showed a mean square error (MSE) of 2936.55 and an R2 of 0.85 in the test phase. The findings highlight the effectiveness of LSTM networks in capturing nonlinear hydrological dynamics, temporal dependencies and regional variations. This study underlines the potential of LSTM models to improve river forecasting and water management strategies in the Western Balkans.",
    "citationCount": 3,
    "referenceCount": 64
}