{
    "paperId": "ebc31dc2dc3a15e678e92c6ee040981477fcc539",
    "title": "Investigate How Reinforcement Learning or Other Ml Methods can Automatically Optimize Query Performance and Indexing Strategies in Older Relational Databases",
    "year": 2023,
    "venue": "International Journal of Innovative Research in Engineering &amp; Multidisciplinary Physical Sciences",
    "authors": [
        "Bhanu Prakash Reddy Rella"
    ],
    "doi": "10.37082/ijirmps.v11.i3.232230",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ebc31dc2dc3a15e678e92c6ee040981477fcc539",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Pollinating query and indexing techniques in ancient relational databases is a widespread crisis now that numerous businesses. With the exponential growth of data volumes and the user's need for ever faster access to information strongly rising, routine optimization strategies typically cannot cope with shifting workloads and data habits. This paper analyses the probability of using reinforcement learning (RL) and any other machine learning (ML) system towards letting legacy relational databases be manipulated for proactive improvements. Companies can use complex algorithms to change the dynamic indexing techniques and query program plans, significantly improving performance, resource consumption, and overall operational efficiency.\nReinforcement learning is a suitable model for designing adaptive tuning strategies tailored to the attributes of old relational databases. Additionally, in this context, an RL agent could learn to develop good indexing strategies and efficient query execution plans by interacting with the DB environment. The agent receives feedback as the behavior. As time passes, the RL agent will evolve its behavior, adjusting indexing techniques and execution plans, relying on past and real-time data. This continuing training states that the database can dynamically change its adaptability regarding changing workload patterns, so it stays responsive to the user's demands.\nThe reinforcement learning, in turn, is supplemented with machine learning techniques to improve query optimization even more. Swarm intelligence algorithms that anticipate how different indexing strategies will impact run times, are something supervised learning algorithms can try to find out from historical query performance records. Clustering techniques can gather one's access patterns across queries, which helps identify if we can gather insights to inform rebooting of indexes and the arrangement of indexes. With the completion of more diverse ML algorithms, companies have started setting up a comprehensive optimization system for database tuning, improving query performance, and saving person-hoursof work.\nMachine learning-based optimizations can significantly improve query performance, efficiency, and system efficacy. Automated or during the optimization process, companies can decentralize the task load from the Database Administrator and focus more on leading business activities. PBS can also decrease the necessity for manual tuning, a process typically tedious and threatened by human error. As a result, it allows organisations to enhance query turnaround times, increase user satisfaction, and improve productivity.\nMachine learning techniques can also learn from historical data and modify in a shifting environment. With the growing data-driven enterprise, communication companies for data fetching and analysis will expand. By leveraging the power of reinforcement learning plus other types of machine learning, companies can maintain their current relational database active and agile, and beyond that for tactical potential dilemmas.\nIn conclusion, inculcating reinforcement learning and other machine learning techniques in optimizing the quality of query and indexing procedures in the traditional relational databases is advantageous for the entities enlisting. This paper demonstrates the benefits of automating and improving database management policies. As businesses come up against the challenges of today's data, leaving machine learning by the wayside will be essential to remaining competitive and gaining a grip on the exploitation of data management.",
    "citationCount": 0,
    "referenceCount": 22
}