{
    "paperId": "ebdbe8cd6d06b80d544472cbb9efc805782d0782",
    "title": "Protein pathways as a catalyst to directed evolution of the topology of artificial neural networks",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Oscar Lao",
        "Konstantinos Zacharopoulos",
        "A. Fournaris",
        "Rossano Schifanella",
        "Ioannis Arapakis"
    ],
    "doi": "10.48550/arXiv.2406.04929",
    "arxivId": "2406.04929",
    "url": "https://www.semanticscholar.org/paper/ebdbe8cd6d06b80d544472cbb9efc805782d0782",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In the present article, we propose a paradigm shift on evolving Artificial Neural Networks (ANNs) towards a new bio-inspired design that is grounded on the structural properties, interactions, and dynamics of protein networks (PNs): the Artificial Protein Network (APN). This introduces several advantages previously unrealized by state-of-the-art approaches in NE: (1) We can draw inspiration from how nature, thanks to millions of years of evolution, efficiently encodes protein interactions in the DNA to translate our APN to silicon DNA. This helps bridge the gap between syntax and semantics observed in current NE approaches. (2) We can learn from how nature builds networks in our genes, allowing us to design new and smarter networks through EA evolution. (3) We can perform EA crossover/mutation operations and evolution steps, replicating the operations observed in nature directly on the genotype of networks, thus exploring and exploiting the phenotypic space, such that we avoid getting trapped in sub-optimal solutions. (4) Our novel definition of APN opens new ways to leverage our knowledge about different living things and processes from biology. (5) Using biologically inspired encodings, we can model more complex demographic and ecological relationships (e.g., virus-host or predator-prey interactions), allowing us to optimise for multiple, often conflicting objectives.",
    "citationCount": 0,
    "referenceCount": 45
}