{
    "paperId": "ec10f374e33ecf900fd4fce0fce3c6fc5e2a3746",
    "title": "VIZPLAN: A VISUAL ANALYTICS PLATFORM FOR THE ASSESSMENT OF MULTIDIMENSIONAL INDICATORS OVER TIME",
    "year": 2022,
    "venue": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences",
    "authors": [
        "L. Leplat",
        "R. S. Torres",
        "D. Aspen",
        "A. Amundsen"
    ],
    "doi": "10.5194/isprs-annals-x-4-w3-2022-127-2022",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ec10f374e33ecf900fd4fce0fce3c6fc5e2a3746",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.isprs-ann-photogramm-remote-sens-spatial-inf-sci.net/X-4-W3-2022/127/2022/isprs-annals-X-4-W3-2022-127-2022.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract. In this paper, we introduce VizPlan, a new platform to support the assessment of multidimensional indicators over time. VizPlan includes a visualisation scheme based on a radial visual structure that allows the direct comparison of indicator values over time, a search tool to support the identification of entities whose indicators are similar to each other, and a clustering tool to group entities according to their indicator scores. VizPlan was designed and implemented to be flexible; it can be easily tailored to the visualization and analysis of any multidimensional temporal data. In this paper, the use of VizPlan is illustrated in the context of three case studies concerning the analysis of sustainability indicators to support urban planning: key performance indicators related to the sustainable development goals, walkability analysis, and bus service availability assessment. All case studies refer to real data related to Norwegian cities, especially Ålesund. VizPlan is available as an open source software at https://github.com/Rylern/VizPlan – As of May 2022.\n",
    "citationCount": 0,
    "referenceCount": 27
}