{
    "paperId": "ec17c8840cacb723741f76302b6bce5358231238",
    "title": "Predicting the Performance of Students Using Deep Ensemble Learning",
    "year": 2024,
    "venue": "Journal of Intelligence",
    "authors": [
        "Bo Tang",
        "Senlin Li",
        "Changhua Zhao"
    ],
    "doi": "10.3390/jintelligence12120124",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ec17c8840cacb723741f76302b6bce5358231238",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-3200/12/12/124/pdf?version=1733206464",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Universities and schools rely heavily on the ability to forecast student performance, as it enables them to develop efficient strategies for enhancing academic results and averting student attrition. The automation of processes and the management of large datasets generated by technology-enhanced learning tools can facilitate the analysis and processing of these data, which provides crucial insights into the knowledge of students and their engagement with academic endeavors. The method under consideration aims to forecast the academic achievement of students through an ensemble of deep neural networks. The proposed method presents a new feature-ranking mechanism based on existing approaches. This mechanism is effective in identifying the most pertinent features and their correlation with the academic performance of students. The proposed method employs an optimization strategy to concurrently configure and train the deep neural networks within our ensemble system. Furthermore, the proposed ensemble model uses weighted voting among its learning components for more accurate prediction. Put simply, the suggested approach enhances the accuracy of academic performance predictions for students not only by employing weighted ensemble techniques, but also by optimizing the parameters of deep learning models. These experimental outcomes provide evidence that the proposed method outperformed the alternative approaches, accurately predicting student performance with a root-mean-square error (RMSE) value of 1.66, a Mean Absolute Percentage Error (MAPE) value of 9.75, and an R-squared value of 0.7430. These results show a significant improvement compared to the null model (RMSE = 4.05, MAPE = 24.89, and R-squared = 0.2897) and prove the efficiency of the techniques employed in the proposed method.",
    "citationCount": 2,
    "referenceCount": 54
}