{
    "paperId": "ecf535449115be22b80ad77fbe649d9255343feb",
    "title": "Intelligent Embedded Platforms: Co-Design of VLSI Architectures and Deep Learning Models for Scalable Optimization and Real-World Deployment",
    "year": 2025,
    "venue": "Scholars Journal of Engineering and Technology",
    "authors": [
        "Muhammad Inam ul Haq",
        "Sayyed Talha",
        "Gohar Naqvi",
        "M. I. Khan",
        "Md. Maruf Shaikh",
        "Shahroz Shabbir",
        "A. Soomro",
        "S. Q. Paracha",
        "M. U. Sajjad",
        "S. A. Niazi",
        "Abid Munir",
        "S. M. Sahabi",
        "Muhammad Inam",
        "Haq"
    ],
    "doi": "10.36347/sjet.2025.v13i09.001",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ecf535449115be22b80ad77fbe649d9255343feb",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid evolution of embedded systems has amplified the demand for intelligent, energy-efficient, and scalable computing platforms capable of handling data-intensive workloads in domains such as IoT, autonomous systems, and healthcare. Traditional VLSI design approaches, while effective at circuit-level optimization, struggle to meet the requirements of modern deep learning applications due to energy, latency, and scalability constraints. This paper presents a synergistic co-design framework that integrates hardware-aware deep learning models with VLSI-based accelerators to achieve significant gains in throughput, energy efficiency, and latency reduction. By leveraging techniques such as pruning, quantization, parallelism, and pipelining, the proposed framework aligns algorithmic efficiency with hardware constraints, ensuring real-world feasibility in resource-constrained environments. Experimental evaluations on CIFAR-10, ImageNet, and IoT workloads demonstrate up to 3.5× performance improvements with minimal accuracy loss. FPGA-based prototypes further validate the framework’s adaptability for edge intelligence, paving the way for next-generation embedded platforms optimized for power, scalability, and application-specific intelligence.",
    "citationCount": 0,
    "referenceCount": 20
}