{
    "paperId": "ed7950085d9b76ff7b69f933c899a7bbba912858",
    "title": "Leveraging Algorithms to Improve Decision-Making Workflows for Genomic Data Access and Management",
    "year": 2022,
    "venue": "Biopreservation and Biobanking",
    "authors": [
        "V. Rahimzadeh",
        "Jonathan Lawson",
        "Gregory A. Rushton",
        "E. Dove"
    ],
    "doi": "10.1089/bio.2022.0042",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ed7950085d9b76ff7b69f933c899a7bbba912858",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1089/bio.2022.0042",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Studies on the ethics of automating clinical or research decision making using artificial intelligence and other algorithmic tools abound. Less attention has been paid, however, to the scope for, and ethics of, automating decision making within regulatory apparatuses governing the access, use, and exchange of data involving humans for research. In this article, we map how the binary logic flows and real-time capabilities of automated decision support (ADS) systems may be leveraged to accelerate one rate-limiting step in scientific discovery: data access management. We contend that improved auditability, consistency, and efficiency of the data access request process using ADS systems have the potential to yield fairer outcomes in requests for data largely sourced from biospecimens and biobanked samples. This procedural justice rationale reinforces a broader set of participant and data subject rights that data access committees (DACs) indirectly protect. DACs protect the rights of citizens to benefit from science by bringing researchers closer to the data they need to advance that science. DACs also protect the informational dignities of individuals and communities by ensuring the data being accessed are used in ways consistent with participant values. We discuss the development of the Global Alliance for Genomics and Health Data Use Ontology standard as a test case of ADS for genomic data access management specifically, and we synthesize relevant ethical, legal, and social challenges to its implementation in practice. We conclude with an agenda of future research needed to thoughtfully advance strategies for computational governance that endeavor to instill public trust in, and maximize the scientific value of, health-related human data across data types, environments, and user communities.",
    "citationCount": 7,
    "referenceCount": 33
}