{
    "paperId": "edaa2e92a2202de7ad8d3685c8de55d7b148bda5",
    "title": "Active Physics-Informed Deep Learning: Surrogate Modeling for Nonplanar Wavefront Excitation of Topological Nanophotonic Devices.",
    "year": 2024,
    "venue": "Nano letters (Print)",
    "authors": [
        "Fatemeh Davoodi"
    ],
    "doi": "10.1021/acs.nanolett.4c05120",
    "arxivId": "2410.16905",
    "url": "https://www.semanticscholar.org/paper/edaa2e92a2202de7ad8d3685c8de55d7b148bda5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Topological plasmonics combines principles of topology and plasmonics to provide new methods for controlling light, analogous to topological edge states in photonics. However, designing such topological states remains challenging due to the complexity of the high-dimensional design space. We present a novel method that uses supervised, physics-informed deep learning and surrogate modeling to design topological devices for desired wavelengths. By embedding physical constraints in the neural network's training, our model efficiently explores the design space, significantly reducing simulation time. Additionally, we use nonplanar wavefront excitations to probe topologically protected plasmonic modes, making the design and training process nonlinear. Using this approach, we design a topological device with unidirectional edge modes in a ring resonator at specific operational frequencies. Our method reduces computational cost and time while maintaining high accuracy, highlighting the potential of combining machine learning and advanced techniques for photonic device innovation.",
    "citationCount": 6,
    "referenceCount": 54
}