{
    "paperId": "edea9d77e34d12d57302dbba3c2458e75726cbae",
    "title": "Intermediate Judgments and Trust in Artificial Intelligence-Supported Decision-Making",
    "year": 2024,
    "venue": "Entropy",
    "authors": [
        "Scott A. Humr",
        "M. Canan"
    ],
    "doi": "10.3390/e26060500",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/edea9d77e34d12d57302dbba3c2458e75726cbae",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1099-4300/26/6/500/pdf?version=1717809826",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Human decision-making is increasingly supported by artificial intelligence (AI) systems. From medical imaging analysis to self-driving vehicles, AI systems are becoming organically embedded in a host of different technologies. However, incorporating such advice into decision-making entails a human rationalization of AI outputs for supporting beneficial outcomes. Recent research suggests intermediate judgments in the first stage of a decision process can interfere with decisions in subsequent stages. For this reason, we extend this research to AI-supported decision-making to investigate how intermediate judgments on AI-provided advice may influence subsequent decisions. In an online experiment (N = 192), we found a consistent bolstering effect in trust for those who made intermediate judgments and over those who did not. Furthermore, violations of total probability were observed at all timing intervals throughout the study. We further analyzed the results by demonstrating how quantum probability theory can model these types of behaviors in human–AI decision-making and ameliorate the understanding of the interaction dynamics at the confluence of human factors and information features.",
    "citationCount": 2,
    "referenceCount": 99
}