{
    "paperId": "ee0e99a137f4d7553a81153e2d5c6afd96aed801",
    "title": "Operational Characterization of a Public Scientific Datacenter During and Beyond the COVID-19 Period",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Mehmet Çetin"
    ],
    "doi": null,
    "arxivId": "2110.12244",
    "url": "https://www.semanticscholar.org/paper/ee0e99a137f4d7553a81153e2d5c6afd96aed801",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Datacenters are imperative for the digital society. They offer services such as computing, telecommunication, media, and entertainment. Datacenters, however, consume a lot of power. Thus, Improving datacenter operations is important and may result in better services, reduced energy consumption and reduced costs. To improve datacenters, we must understand what is going on inside them. Therefore, we use operational traces from a scientific cluster in the Netherlands to investigate and understand how that cluster operates. Due to work-from-home circumstance, the covid period might have changed our daily usage of online applications, such as zoom and google meet. In this research, we focus on the operations of a scientific cluster (LISA) inside the SURF datacenter. The global pandemic might have changed how the LISA cluster operates. To understand the change, we collect, combine, and analyze operational logs from the LISA cluster. The tool to collect the data that belongs to the non-covid period was accomplished in previous research. Nonetheless, both the tool and instrument to combine and analyze the traces are lacking. This research focuses on designing an instrument that can combine and analyze the traces during and before the coronavirus period. The instrument can also produce graphs for customarily selected rack, nodes and periods. Moreover, we characterize the traces that belong to the coronavirus period using the scientific instrument and additional tools. The outcome of this research helps us understand how the operations for a scientific cluster (LISA) in the Netherlands has changed after the global pandemic.",
    "citationCount": 0,
    "referenceCount": 12
}