{
    "paperId": "eeaf3bbbaa547bf75012f283494415e8b4ea9575",
    "title": "A Parallelized, Adam-Based Solver for Reserve and Security Constrained AC Unit Commitment",
    "year": 2023,
    "venue": "Electric power systems research",
    "authors": [
        "Samuel Chevalier"
    ],
    "doi": "10.48550/arXiv.2310.06650",
    "arxivId": "2310.06650",
    "url": "https://www.semanticscholar.org/paper/eeaf3bbbaa547bf75012f283494415e8b4ea9575",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.06650",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Power system optimization problems which include the nonlinear AC power flow equations require powerful and robust numerical solution algorithms. Within this sub-field of nonlinear optimization, interior point methods have come to dominate the solver landscape. Over the last decade, however, a number of efficient numerical optimizers have emerged from the field of Machine Learning (ML). One algorithm in particular, Adam, has become the optimizer-of-choice for a massive percentage of ML training problems (including, e.g., the training of GPT-3), solving some of the largest unconstrained optimization problems ever conceived of. Inspired by such progress, this paper designs a parallelized Adam-based numerical solver to overcome one of the most challenging power system optimization problems: security and reserve constrained AC Unit Commitment. The resulting solver, termed QuasiGrad, recently competed in the third ARPA-E Grid Optimization (GO3) competition. In the day-ahead market clearing category (with systems ranging from 3 to 23,643 buses over 48 time periods), QuasiGrad's aggregated market surplus scores were within 5% of the winningest market surplus scores. The QuasiGrad solver is now released as an open-source Julia package: QuasiGrad.jl. The internal gradient-based solver (Adam) can easily be substituted for other ML-inspired solvers (e.g., AdaGrad, AdaDelta, RMSProp, etc.). Test results from large experiments are provided.",
    "citationCount": 5,
    "referenceCount": 20
}