{
    "paperId": "eebf1a2705bf4ac256d141b0067f1b0ea1dc7632",
    "title": "Data Management Challenges for Deep Learning",
    "year": 2019,
    "venue": "EUROMICRO Conference on Software Engineering and Advanced Applications",
    "authors": [
        "A. Munappy",
        "J. Bosch",
        "H. H. Olsson",
        "Anders Arpteg",
        "B. Brinne"
    ],
    "doi": "10.1109/SEAA.2019.00030",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eebf1a2705bf4ac256d141b0067f1b0ea1dc7632",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep learning is one of the most exciting and fast-growing techniques in Artificial Intelligence. The unique capacity of deep learning models to automatically learn patterns from the data differentiates it from other machine learning techniques. Deep learning is responsible for a significant number of recent breakthroughs in AI. However, deep learning models are highly dependent on the underlying data. So, consistency, accuracy, and completeness of data is essential for a deep learning model. Thus, data management principles and practices need to be adopted throughout the development process of deep learning models. The objective of this study is to identify and categorise data management challenges faced by practitioners in different stages of end-to-end development. In this paper, a case study approach is employed to explore the data management issues faced by practitioners across various domains when they use real-world data for training and deploying deep learning models. Our case study is intended to provide valuable insights to the deep learning community as well as for data scientists to guide discussion and future research in applied deep learning with real-world data.",
    "citationCount": 71,
    "referenceCount": 25
}