{
    "paperId": "eed3d0466d14baa97c09c1a4e26347f522a57c38",
    "title": "A survey of the opportunities and challenges of supervised machine learning in maritime risk analysis",
    "year": 2022,
    "venue": "Transport reviews",
    "authors": [
        "Andrew Rawson",
        "M. Brito"
    ],
    "doi": "10.1080/01441647.2022.2036864",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eed3d0466d14baa97c09c1a4e26347f522a57c38",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/01441647.2022.2036864?needAccess=true",
    "publicationTypes": [
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Identifying and assessing the likelihood and consequences of maritime accidents has been a key focus of research within the maritime industry. However, conventional methods utilised for maritime risk assessment have been dominated by a few methodologies each of which have recognised weaknesses. Given the growing attention that supervised machine learning and big data applications for safety assessments have been receiving in other disciplines, a comprehensive review of the academic literature on this topic in the maritime domain has been conducted. The review encapsulates the prediction of accident occurrence, accident severity, ship detentions and ship collision risk. In particular, the purpose, methods, datasets and features of such studies are compared to better understand how such an approach can be applied in practice and its relative merits. Several key challenges within these themes are also identified, such as the availability and representativeness of the datasets and methodological challenges associated with transparency, model development and results evaluation. Whilst focused within the maritime domain, many of these findings are equally relevant to other transportation topics. This work, therefore, highlights both novel applications for applying these techniques to maritime safety and key challenges that warrant further research in order to strengthen this methodological approach.",
    "citationCount": 76,
    "referenceCount": 108
}