{
    "paperId": "eed389680196b3bb643289e716def03af8898100",
    "title": "Search and Society: Reimagining Information Access for Radical Futures",
    "year": 2024,
    "venue": "Inf. Retr. Res. J.",
    "authors": [
        "Bhaskar Mitra"
    ],
    "doi": "10.54195/irrj.19654",
    "arxivId": "2403.17901",
    "url": "https://www.semanticscholar.org/paper/eed389680196b3bb643289e716def03af8898100",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2403.17901",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Information retrieval (IR) technologies and research are undergoing transformative changes. It is our perspective that the community should accept this opportunity to re-center our research agendas on societal needs while dismantling the artificial separation between the work on fairness, accountability, transparency, and ethics in IR and the rest of IR research. Instead of adopting a reactionary strategy of trying to mitigate potential social harms from emerging technologies, the community should aim to proactively set the research agenda for the kinds of systems we should build inspired by diverse explicitly stated sociotechnical imaginaries. The sociotechnical imaginaries that underpin the design and development of information access technologies needs to be explicitly articulated, and we need to develop theories of change in context of these diverse perspectives. Our guiding future imaginaries must be informed by other academic fields, such as social and political sciences, and should be co-developed with cross-disciplinary scholars, legal and policy experts, civil rights and social justice activists, and artists, among others. In this perspective paper, we motivate why the community must consider this radical shift in how we do research and what we work on, and sketch a path forward towards this transformation.",
    "citationCount": 6,
    "referenceCount": 327
}