{
    "paperId": "ef1958eb3e09b3c25b3ea9a4eff35c72d08f6d34",
    "title": "Correlation-Based Analytics of Time Series Data",
    "year": 2020,
    "venue": "2020 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Ramoza Ahsan",
        "Rodica Neamtu",
        "Muzammil Bashir",
        "Elke A. Rundensteiner",
        "Gabor N. Sarkozy"
    ],
    "doi": "10.1109/BigData50022.2020.9378155",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ef1958eb3e09b3c25b3ea9a4eff35c72d08f6d34",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Correlation-based analytics of time series data is important for a wide range of applications from stock analysis to weather forecasting. Yet performing these analytics at the granularity of subsequences of time series is prohibitively costly for large data sets. Our proposed framework CORAL (CORrelation based AnaLytics) tackles this challenge by adopting a preprocess-once and query-many-times paradigm. In a preprocessing step, CORAL compresses time series data into compact clusters, each identified by a unique representative, taking advantage of the Euclidean distance triangle inequality property. Using a mapping between the metric Euclidean distance and non-metric Pearson correlation, we establish inter- and intra-cluster correlation bounds as foundation for CORAL processing. In the CORAL model, inter-cluster correlation relationships are captured as a compact overlay graph with representatives as nodes and the correlation between cluster representatives as edges. The two CORAL bounds support time series matching by realizing the comparison among the cluster representatives at the abstract level in the CORAL graph model in place of the underlying huge collection of raw time series. The resulting CORAL model effectively supports a rich set of analytics operations including retrieval of the best-correlated subsequence, self-correlation, and detection of groups of correlated subsequences. Our comprehensive experimental evaluation on 85 real benchmark datasets demonstrates that CORAL is many fold faster than state-of-the-art systems while returning highly accurate results.",
    "citationCount": 1,
    "referenceCount": 31
}