{
    "paperId": "ef636d9e5db88f433ca9630c1c4016ee302e6df0",
    "title": "DiPair: Fast and Accurate Distillation for Trillion-ScaleText Matching and Pair Modeling",
    "year": 2020,
    "venue": "Findings",
    "authors": [
        "Jiecao Chen",
        "Liu Yang",
        "K. Raman",
        "Michael Bendersky",
        "Jung-Jung Yeh",
        "Yun Zhou",
        "Marc Najork",
        "Danyang Cai",
        "Ehsan Emadzadeh"
    ],
    "doi": "10.18653/v1/2020.findings-emnlp.264",
    "arxivId": "2010.03099",
    "url": "https://www.semanticscholar.org/paper/ef636d9e5db88f433ca9630c1c4016ee302e6df0",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.aclweb.org/anthology/2020.findings-emnlp.264.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Pre-trained models like BERT ((Devlin et al., 2018) have dominated NLP / IR applications such as single sentence classification, text pair classification, and question answering. However, deploying these models in real systems is highly non-trivial due to their exorbitant computational costs. A common remedy to this is knowledge distillation (Hinton et al., 2015), leading to faster inference. However – as we show here – existing works are not optimized for dealing with pairs (or tuples) of texts. Consequently, they are either not scalable or demonstrate subpar performance. In this work, we propose DiPair — a novel framework for distilling fast and accurate models on text pair tasks. Coupled with an end-to-end training strategy, DiPair is both highly scalable and offers improved quality-speed tradeoffs. Empirical studies conducted on both academic and real-world e-commerce benchmarks demonstrate the efficacy of the proposed approach with speedups of over 350x and minimal quality drop relative to the cross-attention teacher BERT model.",
    "citationCount": 29,
    "referenceCount": 40
}