{
    "paperId": "ef6c1b5d0a52855373f9eb41acabd758dbbd09dd",
    "title": "An Exact Algorithm for the Linear Tape Scheduling Problem",
    "year": 2021,
    "venue": "International Conference on Automated Planning and Scheduling",
    "authors": [
        "Valentin Honor'e",
        "B. Simon",
        "F. Suter"
    ],
    "doi": "10.1609/icaps.v32i1.19796",
    "arxivId": "2112.09384",
    "url": "https://www.semanticscholar.org/paper/ef6c1b5d0a52855373f9eb41acabd758dbbd09dd",
    "isOpenAccess": true,
    "openAccessPdf": "https://ojs.aaai.org/index.php/ICAPS/article/download/19796/19555",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Magnetic tapes are often considered as an outdated storage\ntechnology, yet they are still used to store huge amounts of\ndata. Their main interests are a large capacity and a low price\nper gigabyte, which come at the cost of a much larger file access time than on disks. With tapes, finding the right ordering\nof multiple file accesses is thus key to performance. Moving\nthe reading head back and forth along a kilometer long tape\nhas a non-negligible cost and unnecessary movements thus\nhave to be avoided. However, the optimization of tape request\nordering has rarely been studied in the scheduling literature,\nmuch less than I/O scheduling on disks. For instance, minimizing \nthe average service time for several read requests on a\nlinear tape remains an open question.\n\nTherefore, in this paper, we aim at improving the quality of\nservice experienced by users of tape storage systems, and not\nonly the peak performance of such systems. To this end, we\npropose a reasonable polynomial-time exact algorithm while\nthis problem and simpler variants have been conjectured NP-hard. We also refine the proposed model by considering U-turn penalty costs accounting for inherent mechanical accelerations. Then, we propose a low-cost variant of our optimal\nalgorithm by restricting the solution space, yet still yielding\nan accurate suboptimal solution. Finally, we compare our algorithms to existing solutions from the literature on logs of\nthe mass storage management system of a major datacenter.\nThis allows us to assess the quality of previous solutions and\nthe improvement achieved by our low-cost algorithm. Aiming\nfor reproducibility, we make available the complete implementation of the algorithms used in our evaluation, alongside\nthe dataset of tape requests that is, to the best of our knowledge, the first of its kind to be publicly released.",
    "citationCount": 1,
    "referenceCount": 31
}