{
    "paperId": "ef8ef8f12263d13f0307d6b816c3c26b5af5878d",
    "title": "A Survey of Conversational Search",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Fengran Mo",
        "Kelong Mao",
        "Ziliang Zhao",
        "Hongjin Qian",
        "Haonan Chen",
        "Yiruo Cheng",
        "Xiaoxi Li",
        "Yutao Zhu",
        "Zhicheng Dou",
        "Jian-Yun Nie"
    ],
    "doi": "10.1145/3759453",
    "arxivId": "2410.15576",
    "url": "https://www.semanticscholar.org/paper/ef8ef8f12263d13f0307d6b816c3c26b5af5878d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As a cornerstone of modern information access, search engines have become indispensable in everyday life. With the rapid advancements in AI and natural language processing (NLP) technologies, particularly large language models (LLMs), search engines have evolved to support more intuitive and intelligent interactions between users and systems. Conversational search, an emerging paradigm for next-generation search engines, leverages natural language dialogue to facilitate complex and precise information retrieval, thus attracting significant attention. Unlike traditional keyword-based search engines, conversational search systems enhance user experience by supporting intricate queries, maintaining context over multi-turn interactions, and providing robust information integration and processing capabilities. Key components such as query reformulation, search clarification, conversational retrieval, and response generation work in unison to enable these sophisticated interactions. In this survey, we explore the recent advancements and potential future directions in conversational search, examining the critical modules that constitute a conversational search system. We highlight the integration of LLMs in enhancing these systems and discuss the challenges and opportunities that lie ahead in this dynamic field. Additionally, we provide insights into real-world applications and robust evaluations of current conversational search systems, aiming to guide future research and development in conversational search.",
    "citationCount": 17,
    "referenceCount": 295
}