{
    "paperId": "efa200d3627f84a3ac7752efdedcbe0d34939a1f",
    "title": "Independent Range Sampling on Interval Data",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Daichi Amagata"
    ],
    "doi": "10.1109/ICDE60146.2024.00041",
    "arxivId": "2405.08315",
    "url": "https://www.semanticscholar.org/paper/efa200d3627f84a3ac7752efdedcbe0d34939a1f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many applications require efficient management of large sets of intervals because many objects are associated with intervals (e.g., time and price intervals). In such interval management systems, range search is a primitive operator for retrieving and analysis tasks. As dataset sizes are growing nowadays, range search results are also becoming larger, which may overwhelm users and incur long computation time. Because applications are usually satisfied with a subset of the result set, it is desirable to efficiently obtain only small samples from the result set. We therefore address the problem of independent range sampling on interval data, which outputs $s$ random samples that overlap a given query interval and are independent of the samples of all previous queries. To efficiently solve this problem theoretically and practically, we propose a variant of an interval tree, namely the augmented interval tree (or AIT), and we show that there exists an exact algorithm that needs $O(n\\log n)$ space and $O(\\log^{2}n+s)$ time, where $n$ is the dataset size. The simple structure of an AIT provides flexible extensions: (i) its time and space complexities respectively become $O(\\log^{2}n+s)$ expected and $O(n)$ by bucketing intervals and (ii) it can deal with weighted intervals and outputs $s$ weighted random samples in $O(\\log^{2}n+s\\log n)$ time. We conduct extensive experiments on real datasets, and the results demonstrate that our algorithms significantly outperform competitors.",
    "citationCount": 4,
    "referenceCount": 45
}