{
    "paperId": "efd2db536d9ef317563d38b140736b6b4feecc34",
    "title": "Enhancing Power Transmission Line Fault Detection with a Hybrid ANN-SVM Machine Learning Model: A Comparative Study",
    "year": 2024,
    "venue": "2024 International Conference on Advances in Computing, Communication, Electrical, and Smart Systems (iCACCESS)",
    "authors": [
        "Mohammad Ariful Islam Rafi",
        "Moshiur Rahman Sohan",
        "Muntasir Hossain Nadid",
        "Tammim Shahara Rafa",
        "Atik Jawad"
    ],
    "doi": "10.1109/iCACCESS61735.2024.10499518",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/efd2db536d9ef317563d38b140736b6b4feecc34",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Power transmission lines are vulnerable to various faults as they are usually lengthy and pass through different areas with distinctive characteristics. This study delves into the field of fault detection in power networks, specifically focusing on detecting short-circuit occurrences. In light of this, this study proposes a unique hybrid model that combines Artificial Neural Networks (ANN) and Support Vector Machines (SVM) to detect transmission line faults with accuracy and precision. To evaluate the proposed hybrid model, a dataset comprising 7,000 currents and line voltages was obtained from the data generated by MATLAB SimPowerSystem. These inputs were selected for fault detection, and the parameters were extracted for performance evaluation. A three-layer ANN model was used to extract features from the dataset, which were then used to train an SVM model. The SVM model is then used for outcome prediction. The proposed hybrid model is compared with other individual models, such as Logistic Regression (LR), ANN, SVM, and Random Forests (RF) for validation. The proposed hybrid model provides a well-balanced and precise classification of fault types, resulting in high precision, recall, F1-score, and accuracy with corresponding values of 98%, 99%, 98% and 98.43%, respectively. Moreover, the hybrid model performs better in comparison to other single methods assessments in terms of recall, accuracy, and precision, further validating the usage of hybrid model. The proposed method can work as a potential solution for more robust power system fault detection and provide a viable path for real-world applications.",
    "citationCount": 2,
    "referenceCount": 25
}