{
    "paperId": "eff2c9ad6e69a8cba59eb976c9c55026cdd1544d",
    "title": "Dynamic Color Transform for Wheat Head Detection",
    "year": 2021,
    "venue": "2021 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "authors": [
        "Chengxin Liu",
        "Kewei Wang",
        "Hao Lu",
        "Z. Cao"
    ],
    "doi": "10.1109/ICCVW54120.2021.00148",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/eff2c9ad6e69a8cba59eb976c9c55026cdd1544d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Developing accurate algorithms for wheat head detection is challenging due to the variability of observation circumstances and the uncertainty of wheat head appearances. In this work, we propose a simple but effective idea—dynamic color transform (DCT)—for accurate wheat head detection. This idea is based on an observation that modifying the color channel of an input image can significantly alleviate false negatives and therefore improve detection results. DCT follows a linear color transform and can be easily implemented as a dynamic network. A key property of DCT is that the transform parameters are data-dependent such that illumination variations can be corrected adaptively. The DCT network can be incorporated into any existing object detectors. For example, DCT plays an important role in our solution participating in the Global Wheat Head Detection (GWHD) Challenge 2021, where our solution ranks the first on the initial public leaderboard, with an Average Domain Accuracy (ADA) of 0.821, and obtains the runner-up reward on the final complete testing set, with an ADA of 0.695.",
    "citationCount": 9,
    "referenceCount": 16
}