{
    "paperId": "f000f18370e2c80980dedbda8f9d703f6c503c31",
    "title": "Online Budget-Feasible Mechanism Design with Predictions",
    "year": 2025,
    "venue": "Algorithmic Game Theory",
    "authors": [
        "Georgios Amanatidis",
        "E. Markakis",
        "Christodoulos Santorinaios",
        "Guido Schafer",
        "Panagiotis Tsamopoulos",
        "Artem Tsikiridis"
    ],
    "doi": "10.48550/arXiv.2505.24624",
    "arxivId": "2505.24624",
    "url": "https://www.semanticscholar.org/paper/f000f18370e2c80980dedbda8f9d703f6c503c31",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Augmenting the input of algorithms with predictions is an algorithm design paradigm that suggests leveraging a (possibly erroneous) prediction to improve worst-case performance guarantees when the prediction is perfect (consistency), while also providing a performance guarantee when the prediction fails (robustness). Recently, Xu and Lu [2022] and Agrawal et al. [2024] proposed to consider settings with strategic agents under this framework. In this paper, we initiate the study of budget-feasible mechanism design with predictions. These mechanisms model a procurement auction scenario in which an auctioneer (buyer) with a strict budget constraint seeks to purchase goods or services from a set of strategic agents, so as to maximize her own valuation function. We focus on the online version of the problem where the arrival order of agents is random. We design mechanisms that are truthful, budget-feasible, and achieve a significantly improved competitive ratio for both monotone and non-monotone submodular valuation functions compared to their state-of-the-art counterparts without predictions. Our results assume access to a prediction for the value of the optimal solution to the offline problem. We complement our positive results by showing that for the offline version of the problem, access to predictions is mostly ineffective in improving approximation guarantees.",
    "citationCount": 2,
    "referenceCount": 48
}