{
    "paperId": "f0961da86f34f90f9121346f8f04758579c17db0",
    "title": "An Evaluation of the Impact of End-to-End Query Optimization Strategies on Energy Consumption",
    "year": 2024,
    "venue": "International Conference on Evaluation of Novel Approaches to Software Engineering",
    "authors": [
        "Eros Cedeño",
        "A. Aguilera",
        "Denisse Muñante Arzapalo",
        "Jorge Correia",
        "Leonel Guerrero",
        "Carlos Sivira",
        "Yudith Cardinale"
    ],
    "doi": "10.5220/0012708000003687",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f0961da86f34f90f9121346f8f04758579c17db0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5220/0012708000003687",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Query optimization strategies is an important aspect in database systems that have been mainly studied only from the perspective of reducing the execution time, neglecting the analysis of their impact on energy consumption. We perform an empirical evaluation for understanding the impact of end-to-end query optimization strategies on the power consumption of database systems, from both client and server perspectives. We perform tests over a PostgreSQL database for two optimization strategies ( i.e., indexation and data compression) using the TPC-H benchmark, configured with 22 queries on a 1GB dataset. To measure the energy consumption of both client and server, we propose Juliet, a C++ agent for monitoring and estimating Linux processes energy consumption in Joules (J). Experimental results show that indexation is more effective than data compression to reduce the energy consumed by the execution of the majority of the 22 queries tested.",
    "citationCount": 0,
    "referenceCount": 14
}