{
    "paperId": "f0a98fd25164b5dfd66cb4c6415ce95a9003b5cf",
    "title": "Latent Neural PDE Solver: a reduced-order modelling framework for partial differential equations",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Zijie Li",
        "Saurabh Patil",
        "Francis Ogoke",
        "Dule Shu",
        "Wilson Zhen",
        "Michael Schneier",
        "John R. Buchanan",
        "A. Farimani"
    ],
    "doi": "10.48550/arXiv.2402.17853",
    "arxivId": "2402.17853",
    "url": "https://www.semanticscholar.org/paper/f0a98fd25164b5dfd66cb4c6415ce95a9003b5cf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural networks have shown promising potential in accelerating the numerical simulation of systems governed by partial differential equations (PDEs). Different from many existing neural network surrogates operating on high-dimensional discretized fields, we propose to learn the dynamics of the system in the latent space with much coarser discretizations. In our proposed framework - Latent Neural PDE Solver (LNS), a non-linear autoencoder is first trained to project the full-order representation of the system onto the mesh-reduced space, then a temporal model is trained to predict the future state in this mesh-reduced space. This reduction process simplifies the training of the temporal model by greatly reducing the computational cost accompanying a fine discretization. We study the capability of the proposed framework and several other popular neural PDE solvers on various types of systems including single-phase and multi-phase flows along with varying system parameters. We showcase that it has competitive accuracy and efficiency compared to the neural PDE solver that operates on full-order space.",
    "citationCount": 7,
    "referenceCount": 89
}