{
    "paperId": "f0a9ff1391bdefaf6d712e5c27e747d7d710bb40",
    "title": "AlgoLabel: A Large Dataset for Multi-Label Classification of Algorithmic Challenges",
    "year": 2020,
    "venue": "Mathematics",
    "authors": [
        "R. Iacob",
        "V. Monea",
        "D. Radulescu",
        "Andrei-Florin Ceapă",
        "Traian Rebedea",
        "Stefan Trausan-Matu"
    ],
    "doi": "10.3390/math8111995",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f0a9ff1391bdefaf6d712e5c27e747d7d710bb40",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2227-7390/8/11/1995/pdf?version=1606403095",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While semantic parsing has been an important problem in natural language processing for decades, recent years have seen a wide interest in automatic generation of code from text. We propose an alternative problem to code generation: labelling the algorithmic solution for programming challenges. While this may seem an easier task, we highlight that current deep learning techniques are still far from offering a reliable solution. The contributions of the paper are twofold. First, we propose a large multi-modal dataset of text and code pairs consisting of algorithmic challenges and their solutions, called AlgoLabel. Second, we show that vanilla deep learning solutions need to be greatly improved to solve this task and we propose a dual text-code neural model for detecting the algorithmic solution type for a programming challenge. While the proposed text-code model increases the performance of using the text or code alone, the improvement is rather small highlighting that we require better methods to combine text and code features.",
    "citationCount": 2,
    "referenceCount": 49
}