{
    "paperId": "f0e274c635e0c475d025b1404735f11e037fa635",
    "title": "Ch(e)atGPT? An Anecdotal Approach Addressing the Impact of ChatGPT on Teaching and Learning GIScience",
    "year": 2023,
    "venue": "GI_Forum",
    "authors": [
        "P. Stutz",
        "Maximilian Elixhauser",
        "Judith Grubinger-Preiner",
        "Vivienne Linner",
        "Eva Reibersdorfer-Adelsberger",
        "Christoph Traun",
        "G. Wallentin",
        "Katharina Wöhs",
        "Thomas Zuberbühler"
    ],
    "doi": "10.1553/giscience2023_01_s140",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f0e274c635e0c475d025b1404735f11e037fa635",
    "isOpenAccess": true,
    "openAccessPdf": "https://austriaca.at/0xc1aa5576_0x003e5568.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Natural language processing systems like ChatGPT have recently attracted enormous attention in the field of higher education. We aim to contribute to this discussion by scrutinizing the suitability of current testing methods and potentially necessary shifts in learning objectives in GIScience. This paper presents an anecdotal approach to the impact of ChatGPT on teaching and learning based on a real-world use case. It focuses on the results of a fictional student who used ChatGPT for the completion of application-development assignments, including coding. The solutions were submitted to the instructor, who assessed the results in a single-blind experiment. The instructor’s feedback and grading as well as the AI-plagiarism results were part of our evaluation of the testing methods applied. This triggered a discussion on the adequacy of current learning objectives in the development of GIS applications and the integration of AI into the learning process.",
    "citationCount": 13,
    "referenceCount": 11
}