{
    "paperId": "f10b18e2d89d797d23d2e2073bb850e0a76d07d0",
    "title": "Revolutionizing oncology: the role of Artificial Intelligence (AI) as an antibody design, and optimization tools",
    "year": 2025,
    "venue": "Biomarker Research",
    "authors": [
        "Varun Dewaker",
        "V. Morya",
        "Yoo-Hee Kim",
        "S. Park",
        "Hyeong Su Kim",
        "Y. Koh"
    ],
    "doi": "10.1186/s40364-025-00764-4",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f10b18e2d89d797d23d2e2073bb850e0a76d07d0",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1186/s40364-025-00764-4",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Antibodies play a crucial role in defending the human body against diseases, including life-threatening conditions like cancer. They mediate immune responses against foreign antigens and, in some cases, self-antigens. Over time, antibody-based technologies have evolved from monoclonal antibodies (mAbs) to chimeric antigen receptor T cells (CAR-T cells), significantly impacting biotechnology, diagnostics, and therapeutics. Although these advancements have enhanced therapeutic interventions, the integration of artificial intelligence (AI) is revolutionizing antibody design and optimization. This review explores recent AI advancements, including large language models (LLMs), diffusion models, and generative AI-based applications, which have transformed antibody discovery by accelerating de novo generation, enhancing immune response precision, and optimizing therapeutic efficacy. Through advanced data analysis, AI enables the prediction and design of antibody sequences, 3D structures, complementarity-determining regions (CDRs), paratopes, epitopes, and antigen–antibody interactions. These AI-powered innovations address longstanding challenges in antibody development, significantly improving speed, specificity, and accuracy in therapeutic design. By integrating computational advancements with biomedical applications, AI is driving next-generation cancer therapies, transforming precision medicine, and enhancing patient outcomes. Graphical Abstract",
    "citationCount": 16,
    "referenceCount": 239
}