{
    "paperId": "f12fe64fe811b1ebd18a35cd6928568e9fb82cea",
    "title": "Bridging Dense and Sparse Maximum Inner Product Search",
    "year": 2023,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "Sebastian Bruch",
        "F. M. Nardini",
        "Amir Ingber",
        "Edo Liberty"
    ],
    "doi": "10.1145/3665324",
    "arxivId": "2309.09013",
    "url": "https://www.semanticscholar.org/paper/f12fe64fe811b1ebd18a35cd6928568e9fb82cea",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3665324",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Maximum inner product search (MIPS) over dense and sparse vectors have progressed independently in a bifurcated literature for decades; the latter is better known as top- \\(k\\) retrieval in Information Retrieval. This duality exists because sparse and dense vectors serve different end goals. That is despite the fact that they are manifestations of the same mathematical problem. In this work, we ask if algorithms for dense vectors could be applied effectively to sparse vectors, particularly those that violate the assumptions underlying top- \\(k\\) retrieval methods. We study clustering-based approximate MIPS where vectors are partitioned into clusters and only a fraction of clusters are searched during retrieval. We conduct a comprehensive analysis of dimensionality reduction for sparse vectors, and examine standard and spherical k-means for partitioning. Our experiments demonstrate that clustering-based retrieval serves as an efficient solution for sparse MIPS. As byproducts, we identify two research opportunities and explore their potential. First, we cast the clustering-based paradigm as dynamic pruning and turn that insight into a novel organization of the inverted index for approximate MIPS over general sparse vectors. Second, we offer a unified regime for MIPS over vectors that have dense and sparse subspaces, that is robust to query distributions.",
    "citationCount": 12,
    "referenceCount": 88
}