{
    "paperId": "f13612cafb71f3617cb8d29a8b8363d2756e292d",
    "title": "An Empirical Performance Comparison between Matrix Multiplication Join and Hash Join on GPUs",
    "year": 2023,
    "venue": "2023 IEEE 39th International Conference on Data Engineering Workshops (ICDEW)",
    "authors": [
        "Wenbo Sun",
        "Asterios Katsifodimos",
        "Rihan Hai"
    ],
    "doi": "10.1109/ICDEW58674.2023.00034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f13612cafb71f3617cb8d29a8b8363d2756e292d",
    "isOpenAccess": true,
    "openAccessPdf": "https://repository.tudelft.nl/file/File_18b12624-1f5f-4642-8f77-0d4d96b15193",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent advances in Graphic Processing Units (GPUs) have facilitated a significant performance boost for database operators, in particular, joins. It has been intensively studied how conventional join implementations, such as hash joins, benefit from the massive parallelism of GPUs. With the proliferation of machine learning, more databases have started to provide native support for the basic building blocks of ML algorithms, i.e., linear algebra operators such as matrix multiplication (MM). Despite the recent increasing interest in processing relational joins using matrix multiplication (MM-join), two crucial questions still remain open: i) how efficient are current MM-join implementations compared to the GPU-based join algorithms; ii) how should practitioners choose among MM-join and conventional GPU-based joins given different data characteristics.In this paper, we compare the execution time, and memory I/O of MM-join against multiple GPU hash joins. An empirical analysis of our experimental results reveals that the state-of-the-art hash join implementation shows substantial scalability for various data characteristics. In contrast, MM-join outperforms the SOTA hash join in low join selectivity and low table cardinality but shows unsatisfactory scalability due to synchronous data movement and computation.",
    "citationCount": 5,
    "referenceCount": 22
}