{
    "paperId": "f13fc91362e9f0a6471de07e011681751a8370e9",
    "title": "Hypercompact adenine base editors based on a Cas12f variant guided by engineered RNA",
    "year": 2022,
    "venue": "Nature Chemical Biology",
    "authors": [
        "Do Yon Kim",
        "Yuhee Chung",
        "Yujin Lee",
        "Dong-Joo Jeong",
        "Kwang-Hyun Park",
        "H. Chin",
        "J. M. Lee",
        "Seyeon Park",
        "Sumin Ko",
        "J. Ko",
        "Yong-Sam Kim"
    ],
    "doi": "10.1038/s41589-022-01077-5",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f13fc91362e9f0a6471de07e011681751a8370e9",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.researchsquare.com/article/rs-1326630/latest.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Cas12f is a hypercompact type V, Cas12 family member. Previously, we reported a set of engineered guide RNAs supporting high indel efficiency for Cas12f1 in human cells. Here we suggest a new technology whereby the engineered guide RNAs also manifest high-efficiency programmable endonuclease activity for a Cas12f variant. We have termed this technology TaRGET (Tiny nuclease RNA-based Genome Editing Technology). Having this feature in mind, we established TaRGET-based adenine base editors (ABEs). A Tad–Tad mutant (V106W, D108Q) dimer fused to the C terminus of dCas12f (D354A) showed the highest levels of A-to-G conversion. The limited targetable sites for TaRGET-ABE were expanded with engineered variants of Cas12f or optimized deaminases. Delivery of TaRGET-ABE also ensured potent A-to-G conversion rates in mammalian genomes. Collectively, the TaRGET-ABE will contribute to improving precise genome-editing tools that can be delivered by adeno-associated viruses, thereby harnessing the development of clustered regularly interspaced short palindromic repeats (CRISPR)-based gene therapy. A hypercompact adenine base editor termed TaRGET-ABE was developed by fusing a catalytically inactive transposon-associated transposase B guided by an engineered RNA to deaminases, which achieves efficient A-to-G conversions via adeno-associated viral delivery in mammalian genomes.",
    "citationCount": 36,
    "referenceCount": 42
}