{
    "paperId": "f140e82c357f20aa9193211c29c2a1328eb42fd7",
    "title": "WSNEAP: An Efficient Authentication Protocol for IIoT-Oriented Wireless Sensor Networks",
    "year": 2022,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Fu Yi",
        "Lei Zhang",
        "Lijuan Xu",
        "Shumian Yang",
        "Yanrong Lu",
        "Dawei Zhao"
    ],
    "doi": "10.3390/s22197413",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f140e82c357f20aa9193211c29c2a1328eb42fd7",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/22/19/7413/pdf?version=1665192166",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "With the development of the Industrial Internet of Things (IIoT), industrial wireless sensors need to upload the collected private data to the cloud servers, resulting in a large amount of private data being exposed on the Internet. Private data are vulnerable to hacking. Many complex wireless-sensor-authentication protocols have been proposed. In this paper, we proposed an efficient authentication protocol for IIoT-oriented wireless sensor networks. The protocol introduces the PUF chip, and uses the Bloom filter to save and query the challenge–response pairs generated by the PUF chip. It ensures the security of the physical layer of the device and reduces the computing cost and communication cost of the wireless sensor side. The protocol introduces a pre-authentication mechanism to achieve continuous authentication between the gateway and the cloud server. The overall computational cost of the protocol is reduced. Formal security analysis and informal security analysis proved that our proposed protocol has more security features. We implemented various security primitives using the MIRACL cryptographic library and GMP large number library. Our proposed protocol was compared in-depth with related work. Detailed experiments show that our proposed protocol significantly reduces the computational cost and communication cost on the wireless sensor side and the overall computational cost of the protocol.",
    "citationCount": 9,
    "referenceCount": 51
}