{
    "paperId": "f1764fc971ef1535566e88f382415844e13385d0",
    "title": "OTCliM: Generating a Near-Surface Climatology of Optical Turbulence Strength (Cn2) Using Gradient Boosting",
    "year": 2024,
    "venue": "Artificial Intelligence for the Earth Systems",
    "authors": [
        "Maximilian Pierzyna",
        "Sukanta Basu",
        "Rudolf Saathof"
    ],
    "doi": "10.1175/AIES-D-24-0076.1",
    "arxivId": "2408.00520",
    "url": "https://www.semanticscholar.org/paper/f1764fc971ef1535566e88f382415844e13385d0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\nThis study introduces Optical Turbulence Climatology Using Machine Learning (OTCliM), a novel approach for deriving comprehensive climatologies of atmospheric optical turbulence strength () using gradient boosting machines. OTCliM addresses the challenge of efficiently obtaining reliable site-specific climatologies near the surface, crucial for ground-based astronomy and free-space optical communication. Using gradient boosting machines and global reanalysis data, OTCliM extrapolates 1 year of measured into a multiyear time series. We assess OTCliM’s performance using data from 17 diverse stations in New York State, evaluating temporal extrapolation capabilities and geographical generalization. Our results demonstrate accurate predictions of four held-out years of across various sites, including complex urban environments, outperforming traditional analytical models. Nonurban models also show good geographical generalization compared to urban models, which capture nongeneral site-specific dependencies. A feature importance analysis confirms the physical consistency of the trained models. It also indicates the potential to uncover new insights into the physical processes governing from data. OTCliM’s ability to derive reliable climatologies from just 1 year of observations can potentially reduce resources required for future site surveys or enable studies for additional sites with the same resources.",
    "citationCount": 1,
    "referenceCount": 70
}