{
    "paperId": "f17e8d137e4fa77e5441b75e9c15623511203588",
    "title": "Deep Learning-based Intrusion Detection Systems: A Survey",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zhiwei Xu",
        "Yujuan Wu",
        "Shiheng Wang",
        "Jiabao Gao",
        "Tian Qiu",
        "Ziqi Wang",
        "Hai Wan",
        "Xibin Zhao"
    ],
    "doi": "10.48550/arXiv.2504.07839",
    "arxivId": "2504.07839",
    "url": "https://www.semanticscholar.org/paper/f17e8d137e4fa77e5441b75e9c15623511203588",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Intrusion Detection Systems (IDS) have long been a hot topic in the cybersecurity community. In recent years, with the introduction of deep learning (DL) techniques, IDS have made great progress due to their increasing generalizability. The rationale behind this is that by learning the underlying patterns of known system behaviors, IDS detection can be generalized to intrusions that exploit zero-day vulnerabilities. In this survey, we refer to this type of IDS as DL-based IDS (DL-IDS). From the perspective of DL, this survey systematically reviews all the stages of DL-IDS, including data collection, log storage, log parsing, graph summarization, attack detection, and attack investigation. To accommodate current researchers, a section describing the publicly available benchmark datasets is included. This survey further discusses current challenges and potential future research directions, aiming to help researchers understand the basic ideas and visions of DL-IDS research, as well as to motivate their research interests.",
    "citationCount": 9,
    "referenceCount": 290
}