{
    "paperId": "f1e0d7d563988bf890e27dd520da7cee3662bff3",
    "title": "Machine learning approach towards explaining water quality dynamics in an urbanised river",
    "year": 2022,
    "venue": "Scientific Reports",
    "authors": [
        "B. Schäfer",
        "C. Beck",
        "H. Rhys",
        "Helena Soteriou",
        "Paul Jennings",
        "A. Beechey",
        "C. Heppell"
    ],
    "doi": "10.1038/s41598-022-16342-9",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f1e0d7d563988bf890e27dd520da7cee3662bff3",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.nature.com/articles/s41598-022-16342-9.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Human activities alter river water quality and quantity, with consequences for the ecosystems of urbanised rivers. Quantifying the role of human-induced drivers in controlling spatio-temporal patterns in water quality is critical to develop successful strategies for improving the ecological health of urban rivers. Here, we analyse high-frequency electrical conductivity and temperature data collected from the River Chess in South-East England during a Citizen Science project. Utilizing machine learning, we find that boosted trees outperform GAM and accurately describe water quality dynamics with less than 1% error. SHapley Additive exPlanations reveal the importance of and the (inter)dependencies between the individual variables, such as river level and Wastewater Treatment Works (WWTW) outflow. WWTW outflows give rise to diurnal variations in electrical conductivity, which are detectable throughout the year, and to an increase in average water temperature of 1 oC\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rm{^o}C$$\\end{document} in a 2 km reach downstream of the wastewater treatment works during low flows. Overall, we showcase how high-frequency water quality measurements initiated by a Citizen Science project, together with machine learning techniques, can help untangle key drivers of water quality dynamics in an urbanised chalk stream.",
    "citationCount": 25,
    "referenceCount": 74
}