{
    "paperId": "f21eeb946de57bd36d083fc0649b7492bbe84ce9",
    "title": "A Comparison between Term-Independence Retrieval Models for Ad Hoc Retrieval",
    "year": 2021,
    "venue": "ACM Trans. Inf. Syst.",
    "authors": [
        "E. K. F. Dang",
        "R. Luk",
        "James Allan"
    ],
    "doi": "10.1145/3483612",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f21eeb946de57bd36d083fc0649b7492bbe84ce9",
    "isOpenAccess": true,
    "openAccessPdf": "http://ira.lib.polyu.edu.hk/bitstream/10397/98870/1/Dang_Comparison_Term-independence_Retrieval%20.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In Information Retrieval, numerous retrieval models or document ranking functions have been developed in the quest for better retrieval effectiveness. Apart from some formal retrieval models formulated on a theoretical basis, various recent works have applied heuristic constraints to guide the derivation of document ranking functions. While many recent methods are shown to improve over established and successful models, comparison among these new methods under a common environment is often missing. To address this issue, we perform an extensive and up-to-date comparison of leading term-independence retrieval models implemented in our own retrieval system. Our study focuses on the following questions: (RQ1) Is there a retrieval model that consistently outperforms all other models across multiple collections; (RQ2) What are the important features of an effective document ranking function? Our retrieval experiments performed on several TREC test collections of a wide range of sizes (up to the terabyte-sized Clueweb09 Category B) enable us to answer these research questions. This work also serves as a reproducibility study for leading retrieval models. While our experiments show that no single retrieval model outperforms all others across all tested collections, some recent retrieval models, such as MATF and MVD, consistently perform better than the common baselines.",
    "citationCount": 2,
    "referenceCount": 96
}