{
    "paperId": "f22154438087a0c83c9511db9becefb72c002285",
    "title": "An Event-Driven Approach to the Recognition Problem in Video Surveillance System Development",
    "year": 2022,
    "venue": "Conference of the Open Innovations Association",
    "authors": [
        "Nikita A. Bazhenov",
        "Egor Rybin",
        "Dmitry G. Korzun"
    ],
    "doi": "10.23919/FRUCT56874.2022.9953883",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f22154438087a0c83c9511db9becefb72c002285",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many video surveillance systems (VSS) have been already developed for various application domains. Such systems are based on well-elaborated recognition algorithms of Artifi-cial Intelligence (AI) and implemented as Ambient Intelligence (AmI) services in Internet of Things (IoT) environments. In particular, algorithms support such smart VSS functions of video data processing as human detection, human identification, object location within an image, human activity recognition. Many software tools have been developed to implement various recognition algorithms for VSS development. In this paper, we consider the following VSS development problems: a) a generic model of events in video data for a given problem domain, b) a hardware-software architecture for data processing with existing recognition algorithms, and c) a model to construct a required smart VSS function using existing software tools. We introduce our event-oriented approach to solve the above VSS development problems. The approach is experienced in several use cases. Our experimental study shows the applicability of the proposed approach in terms of the accuracy and performance.",
    "citationCount": 2,
    "referenceCount": 39
}