{
    "paperId": "f22d429bce28092a72d162579aa95fb824675993",
    "title": "Taking the Shortcut: Actively Incorporating the Virtual Memory Index of the OS to Hardware-Accelerate Database Indexing",
    "year": 2023,
    "venue": "Conference on Innovative Data Systems Research",
    "authors": [
        "F. Schuhknecht"
    ],
    "doi": "10.48550/arXiv.2310.09124",
    "arxivId": "2310.09124",
    "url": "https://www.semanticscholar.org/paper/f22d429bce28092a72d162579aa95fb824675993",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2310.09124",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Index structures often materialize one or multiple levels of explicit indirections (aka pointers) to allow for a quick traversal to the data of interest. Unfortunately, dereferencing a pointer to go from one level to the other is costly since additionally to following the address, it involves two address translations from virtual memory to physical memory under the hood. In the worst case, such an address translation is resolved by an index access itself, namely by a lookup into the page table, a central hardware-accelerated index structure of the OS. However, if the page table is anyways constantly queried, it raises the question whether we can actively incorporate it into our database indexes and make it work for us. Precisely, instead of materializing indirections in form of pointers, we propose to express these indirections directly in the page table wherever possible. By introducing such shortcuts, we (a) effectively reduce the height of traversal during lookups and (b) exploit the hardware-acceleration of lookups in the page table. In this work, we analyze the strengths and considerations of this approach and showcase its effectiveness at the case of the real-world indexing scheme extendible hashing.",
    "citationCount": 1,
    "referenceCount": 19
}