{
    "paperId": "f24a60a8fa413fd18c9bcbc082a6b1205852ade4",
    "title": "Distilled Neural Networks for Efficient Learning to Rank: (Extended Abstract)",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "F. M. Nardini",
        "Cosimo Rulli",
        "Salvatore Trani",
        "Rossano Venturini"
    ],
    "doi": "10.1109/ICDE60146.2024.00478",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f24a60a8fa413fd18c9bcbc082a6b1205852ade4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent studies in Learning to Rank (LtR) have shown the possibility of effectively distilling a neural network from an ensemble of regression trees. This fully enables the use of neural-based ranking models in query processors of modern Web search engines. Nevertheless, ensembles of regression trees outperform neural models both in terms of efficiency and effectiveness on CPU. In this paper, we propose a framework to design and train neural networks outperforming ensembles of regression trees. After distilling the networks from tree-based models, we exploit an efficiency-oriented pruning technique that works by sparsifying the most computationally intensive layers of the model. Moreover, we develop inference time predictors, which help devise neural network architectures that match the desired efficiency requirements. Comprehensive experiments on two public learning-to-rank datasets show that the neural networks produced with our novel approach are competitive in terms of effectiveness-efficiency trade-off when compared with tree-based ensembles by providing up to 4x inference time speed-up without degradation of the ranking quality.",
    "citationCount": 0,
    "referenceCount": 5
}