{
    "paperId": "f28a4d2c6c68b402d283df01baf1072a40cfeb45",
    "title": "Escaping local minima with local derivative-free methods: a numerical investigation",
    "year": 2018,
    "venue": "Optimization",
    "authors": [
        "C. Cartis",
        "Lindon Roberts",
        "O. Sheridan-Methven"
    ],
    "doi": "10.1080/02331934.2021.1883015",
    "arxivId": "1812.11343",
    "url": "https://www.semanticscholar.org/paper/f28a4d2c6c68b402d283df01baf1072a40cfeb45",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1812.11343",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT We investigate the potential of applying a state-of-the-art, local derivative-free solver, Py-BOBYQA to global optimization problems. In particular, we demonstrate the potential of a restarts procedure – as distinct from multistart methods – to allow Py-BOBYQA to escape local minima (where ordinarily it would terminate at the first local minimum found). We also introduce an adaptive variant of restarts which yields improved performance on global optimization problems. As Py-BOBYQA is a model-based trust-region method, we compare largely with other global optimization methods for which (global) models are important, such as Bayesian optimization and response surface methods; we also consider state-of-the-art representative deterministic and stochastic codes, such as DIRECT and CMA-ES. We find numerically that the restarts procedures in Py-BOBYQA are effective at helping it to escape local minima, when compared to using no restarts in Py-BOBYQA. Additionally, we find that Py-BOBYQA with adaptive restarts has comparable performance with global optimization solvers for all accuracy/budget regimes, in both smooth and noisy settings. In particular, Py-BOBYQA variants are best performing for smooth and multiplicative noise problems in high-accuracy regimes. As a by-product, some preliminary conclusions can be drawn on the relative performance of the global solvers we have tested with default settings.",
    "citationCount": 81,
    "referenceCount": 82
}