{
    "paperId": "f296fe6e80e87cdd845ea7c1003beae5831e3400",
    "title": "Integrating Deep Learning and Statistical Model for Stock Market Prediction",
    "year": 2024,
    "venue": "2024 OITS International Conference on Information Technology (OCIT)",
    "authors": [
        "Samanwita Sahu",
        "Mayank Bhushan",
        "Jitendra Kumar Rout"
    ],
    "doi": "10.1109/OCIT65031.2024.00093",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f296fe6e80e87cdd845ea7c1003beae5831e3400",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Predicting the stock market is a difficult subject that has attracted a lot of attention lately. Accurate stock price prediction can offer insightful information to investors, empowering them to make well-informed decisions and optimize profits. This study uses deep learning and statistical models to give a thorough analysis of stock predictions. The research makes use of historical data on Repsol's stock prices, including volume, high, low, and open data. The pre-processed dataset is converted into a format that is appropriate for modelling. To forecast future stock prices, a variety of statistical and deep learning techniques are used, such as LSTM, PROPHET, SARIMAX, ARIMA. The performance of each model is evaluated using metrics such as root mean absolute error, mean squared error, and accuracy. The results demonstrate that the proposed models are capable of accurately predicting stock prices, with the best results being taken from Univariate LSTM (with rolling window of 1 year) and multivariate Prophet.",
    "citationCount": 0,
    "referenceCount": 21
}