{
    "paperId": "f2c00af705618a986e248de54725bfc8e68cd9e2",
    "title": "Workload Behavior Driven Memory Subsystem Design for Hyperscale",
    "year": 2023,
    "venue": "arXiv.org",
    "authors": [
        "Suyash Mahar",
        "Hao Wang",
        "W. Shu",
        "A. Dhanotia"
    ],
    "doi": "10.48550/arXiv.2303.08396",
    "arxivId": "2303.08396",
    "url": "https://www.semanticscholar.org/paper/f2c00af705618a986e248de54725bfc8e68cd9e2",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2303.08396",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hyperscalars run services across a large fleet of servers, serving billions of users worldwide. These services, however, behave differently than commonly available benchmark suites, resulting in server architectures that are not optimized for cloud workloads. With datacenters becoming a primary server processor market, optimizing server processors for cloud workloads by better understanding their behavior has become crucial. To address this, in this paper, we present MemProf, a memory profiler that profiles the three major reasons for stalls in cloud workloads: code-fetch, memory bandwidth, and memory latency. We use MemProf to understand the behavior of cloud workloads and propose and evaluate micro-architectural and memory system design improvements that help cloud workloads' performance. MemProf's code analysis shows that cloud workloads execute the same code across CPU cores. Using this, we propose shared micro-architectural structures--a shared L2 I-TLB and a shared L2 cache. Next, to help with memory bandwidth stalls, using workloads' memory bandwidth distribution, we find that only a few pages contribute to most of the system bandwidth. We use this finding to evaluate a new high-bandwidth, small-capacity memory tier and show that it performs 1.46x better than the current baseline configuration. Finally, we look into ways to improve memory latency for cloud workloads. Profiling using MemProf reveals that L2 hardware prefetchers, a common solution to reduce memory latency, have very low coverage and consume a significant amount of memory bandwidth. To help improve hardware prefetcher performance, we built a memory tracing tool to collect and validate production memory access traces.",
    "citationCount": 3,
    "referenceCount": 44
}