{
    "paperId": "f2c3142765a80befa3047c6ff2ecd0d0bc717e47",
    "title": "Rhizosphere-triggered viral lysogeny mediates microbial metabolic reprogramming to enhance arsenic oxidation",
    "year": 2025,
    "venue": "Nature Communications",
    "authors": [
        "Xinwei Song",
        "Yiling Wang",
        "Youjing Wang",
        "Kankan Zhao",
        "Di Tong",
        "Ruichuan Gao",
        "Xiaofei Lv",
        "Dedong Kong",
        "Yunjie Ruan",
        "Mengcen Wang",
        "Xianjin Tang",
        "Fangbai Li",
        "Yongming Luo",
        "Yongguan Zhu",
        "Jianming Xu",
        "Bin Ma"
    ],
    "doi": "10.1038/s41467-025-58695-5",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f2c3142765a80befa3047c6ff2ecd0d0bc717e47",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1038/s41467-025-58695-5",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rhizosphere is a critical hotspot for metabolic activities involving arsenic (As). While recent studies indicate many functions for soil viruses, much remains overlooked regarding their quantitative impact on rhizosphere processes. Here, we analyze time-series metagenomes of rice (Oryza sativa L.)rhizosphere and bulk soil to explore how viruses mediate rhizosphere As biogeochemistry. We observe the rhizosphere favors lysogeny in viruses associated with As-oxidizing microbes, with a positive correlation between As oxidation and the prevalence of these microbial hosts. Moreover, results demonstrate these lysogenic viruses enrich both As oxidation and phosphorus co-metabolism genes and mediated horizontal gene transfers (HGTs) of As oxidases. In silico simulation with genome-scale metabolic models (GEMs) and in vitro validation with experiments estimate that rhizosphere lysogenic viruses contribute up to 25% of microbial As oxidation. These findings enhance our comprehension of the plant-microbiome-virome interplay and highlight the potential of rhizosphere viruses for improving soil health in sustainable agriculture.",
    "citationCount": 4,
    "referenceCount": 127
}