{
    "paperId": "f2e5702330e52b730378ca1e7f1a041fc4f81c07",
    "title": "Vulnerability Prediction From Source Code Using Machine Learning",
    "year": 2020,
    "venue": "IEEE Access",
    "authors": [
        "Z. Bilgin",
        "M. Ersoy",
        "Elif Ustundag Soykan",
        "E. Tomur",
        "Pinar Çomak",
        "Leyli Karaçay"
    ],
    "doi": "10.1109/ACCESS.2020.3016774",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f2e5702330e52b730378ca1e7f1a041fc4f81c07",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/8948470/09167194.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the role of information and communication technologies gradually increases in our lives, software security becomes a major issue to provide protection against malicious attempts and to avoid ending up with noncompensable damages to the system. With the advent of data-driven techniques, there is now a growing interest in how to leverage machine learning (ML) as a software assurance method to build trustworthy software systems. In this study, we examine how to predict software vulnerabilities from source code by employing ML prior to their release. To this end, we develop a source code representation method that enables us to perform intelligent analysis on the Abstract Syntax Tree (AST) form of source code and then investigate whether ML can distinguish vulnerable and nonvulnerable code fragments. To make a comprehensive performance evaluation, we use a public dataset that contains a large amount of function-level real source code parts mined from open-source projects and carefully labeled according to the type of vulnerability if they have any.We show the effectiveness of our proposed method for vulnerability prediction from source code by carrying out exhaustive and realistic experiments under different regimes in comparison with state-of-art methods.",
    "citationCount": 76,
    "referenceCount": 41
}