{
    "paperId": "f2ef9bf705e419e5aeb42ab2b79c08f3bcdaee1c",
    "title": "AutoML: From Methodology to Application",
    "year": 2021,
    "venue": "International Conference on Information and Knowledge Management",
    "authors": [
        "Yaliang Li",
        "Zhen Wang",
        "Yuexiang Xie",
        "Bolin Ding",
        "K. Zeng",
        "Ce Zhang"
    ],
    "doi": "10.1145/3459637.3483279",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f2ef9bf705e419e5aeb42ab2b79c08f3bcdaee1c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine Learning methods have been adopted for a wide range of real-world applications, ranging from social networks, online image/video-sharing platforms, and e-commerce to education, healthcare, etc. However, in practice, a large amount of effort is required to tune several components of machine learning methods, including data representation, hyperparameter, and model architecture, in order to achieve a good performance. To alleviate the required tunning efforts, Automated Machine Learning (AutoML), which can automate the process of applying machine learning methods, has been studied in both academy and industry recently. In this tutorial, we will introduce the main research topics of AutoML, including Hyperparameter Optimization, Neural Architecture Search, and Meta-Learning. Two emerging topics of AutoML, Automatic Feature Generation and Machine Learning Guided Database, will also be discussed since they are important components for real-world applications. For each topic, we will motivate it with application examples from industry, illustrate the state-of-the-art methodologies, and discuss some future research directions based on our experience from industry and the trends in academy.",
    "citationCount": 23,
    "referenceCount": 49
}