{
    "paperId": "f328c49ae2e2245c235990f8dea988a2059043ac",
    "title": "Data Interoperability and Harmonization in Cardiovascular Genomic and Precision Medicine",
    "year": 2025,
    "venue": "Circulation Genomic and Precision Medicine",
    "authors": [
        "C. Anwar",
        "M. M. A. Chahal",
        "MBChB Mrcp Chahal",
        "PhD Fares Alahdab",
        "MSc Babken Asatryan Md",
        "PhD Daniel Addison",
        "MD Nay Aung",
        "PhD Mina K. Chung",
        "MD Spiros Denaxas",
        "PhD Jessilyn Dunn",
        "PhD Jennifer L. Hall",
        "PhD Nathalie Pamir",
        "PhD David J. Slotwiner",
        "PhD Jose D. Vargas",
        "PhD Antonis A. Armoundas"
    ],
    "doi": "10.1161/CIRCGEN.124.004624",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f328c49ae2e2245c235990f8dea988a2059043ac",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Despite advances in cardiovascular care and improved outcomes, fragmented healthcare systems, nonequitable access to health care, and nonuniform and unbiased collection and access to healthcare data have exacerbated disparities in healthcare provision and further delayed the technological-enabled implementation of precision medicine. Precision medicine relies on a foundation of accurate and valid omics and phenomics that can be harnessed at scale from electronic health records. Big data approaches in noncardiovascular healthcare domains have helped improve efficiency and expedite the development of novel therapeutics; therefore, applying such an approach to cardiovascular precision medicine is an opportunity to further advance the field. Several endeavors, including the American Heart Association Precision Medicine platform and public-private partnerships (such as BigData@Heart in Europe), as well as cloud-based platforms, such as Terra used for the National Institutes of Health All of Us, are attempting to temporally and ontologically harmonize data. This state-of-the-art review summarizes best practices used in cardiovascular genomic and precision medicine and provides recommendations for systems’ requirements that could enhance and accelerate the integration of these platforms.",
    "citationCount": 3,
    "referenceCount": 113
}