{
    "paperId": "f351f850e92b7ea71541d1047c2c3b8a3409cc3d",
    "title": "Joint Workload Forecasting and Configuration Tuning to Achieve Cloud Database Performance Adaptation",
    "year": 2023,
    "venue": "2023 International Conference on Frontiers of Robotics and Software Engineering (FRSE)",
    "authors": [
        "Hongkai Wang",
        "Ruohan Gao",
        "Chen Zhang",
        "Lichen Wang",
        "Heran Li"
    ],
    "doi": "10.1109/frse58934.2023.00033",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f351f850e92b7ea71541d1047c2c3b8a3409cc3d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database parameter tuning has always been a research hotspot. In recent years, there have been some efforts emerging to tune the runtime parameters of the cloud database by leveraging the high-dimensional space search ability of reinforcement learning. However, the previous solutions either train a tuning model for each database from scratch online, or use offline workloads that deviate greatly from the actual workload for model training, resulting in expensive training costs and poor tuning effect, which fails to meet the requirements of cloud database automatic tuning. In this paper, we propose a cloud database parameter tuning approach JWFCT. By providing a set of offline pre-training models instead of one, and combining with the workload classification and prediction technologies, the optimal configuration is determined with the tuning model that best matches the database workload characteristics, thus the tuning performance can be greatly improved. In addition, the models are also fine-tuned periodically based on online data that can further improve the performance. Experimental results show that JWFCT can significantly improve the throughput of the cloud database and reduce the recommendation time.",
    "citationCount": 0,
    "referenceCount": 11
}