{
    "paperId": "f352090f8335a2374657afa0fb74da083cae9530",
    "title": "Marshalling Model Inference in Video Streams",
    "year": 2023,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Daren Chao",
        "Nick Koudas",
        "Xiaohui Yu"
    ],
    "doi": "10.1109/ICDE55515.2023.00110",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f352090f8335a2374657afa0fb74da083cae9530",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Numerous cloud platforms are available to deploy and train deep models as well as process data, such as Amazon Rekognition and Azure custom Vision Service, which have made it easy for companies to adopt deep learning technologies in their operations. Commonly such services price usage per image or frame in typical applications that consume video streams and as a result the costs rapidly accumulate. In this paper we introduce a model, named EventHit, that is able to marshal model inference requests in such services by making predictions over the video stream about events of interest. As such only relevant video segments are sent for analysis to the cloud infrastructure and irrelevant parts are filtered from further processing. We introduce the architecture and fully describe its components. We present two novel optimizations in this context that aim to provide control over the trade-off between prediction accuracy (especially regarding the probability of missing an event of interest) and processing cost at the cloud infrastructure. We fully describe and analyze our proposals in the context of real datasets. We also present the results of a detailed experimental evaluation varying parameters of interest and demonstrate the practical utility of our proposals.",
    "citationCount": 8,
    "referenceCount": 62
}