{
    "paperId": "f35be60b13a82f700c69656575ab70b0d8dbe4a0",
    "title": "Charten:Online Reinforcement Learning for Multi-Objective Optimization Data Placement in Hybrid Storage Systems",
    "year": 2025,
    "venue": "2025 IEEE 6th International Seminar on Artificial Intelligence, Networking and Information Technology (AINIT)",
    "authors": [
        "Zhiguo Zeng",
        "Zhang Gen",
        "Wenhao Gu",
        "Jiawei Gao",
        "Zhenlong Song"
    ],
    "doi": "10.1109/AINIT65432.2025.11035765",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f35be60b13a82f700c69656575ab70b0d8dbe4a0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Modern storage systems mostly consist of hybrid storage architectures that integrate a variety of storage devices to provide storage solutions with both large capacity and high performance. Appropriate data placement strategies are essential for utilizing the performance potential of these systems. Existing data placement solutions, however, frequently focus on a single metric of performers, disregarding the need to establish a balance across several metrics and lacking the ability to adapt to changing workloads. Additionally, the placement of data granularity is a significant issue. Using either file-level or I/O request-level granularity is inappropriate. To address the above issue, this paper proposes a novel data placement technique, designated as Charten, based on online reinforcement learning. Charten achieves balanced optimisation of several metrics and dynamically adapts to load changes by optimising the neural network structure. Concurrently, the Cargo mechanism is introduced as a novel strategy for data partitioning in Charten, effectively addressing the limitations of conventional data management granularity. We conducted extensive evaluations on Charten, and the findings demonstrated that Charten yielded an performance improvement of up to 28 % at most compared to the previously most effective data placement strategies.",
    "citationCount": 0,
    "referenceCount": 32
}