{
    "paperId": "f35ee5a678177f21c940295d21ae2c84df4c3549",
    "title": "Hypertensive Nephrosclerosis: Pathological Changes and Overlap with Diabetic Nephropathy",
    "year": 2025,
    "venue": "Cureus",
    "authors": [
        "Hussein Qasim",
        "Mahfouz Ktaifan",
        "Ahmad Awawdeh",
        "Karis Khattab",
        "M. L. Leoni",
        "Giustino Varrassi"
    ],
    "doi": "10.7759/cureus.92949",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f35ee5a678177f21c940295d21ae2c84df4c3549",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hypertensive nephrosclerosis (HN) and diabetic nephropathy (DN) are the leading global causes of chronic kidney disease (CKD) and end-stage renal disease (ESRD). Both conditions share overlapping clinical and histopathological features, particularly in patients with concurrent hypertension and diabetes, making accurate differentiation challenging. This narrative review synthesizes current evidence on the pathophysiology, histopathology, diagnostic criteria, and therapeutic implications of HN and DN, with emphasis on areas of morphological and clinical overlap. HN is driven by chronic vascular injury from sustained hypertension, resulting in ischemic glomerulosclerosis, arteriolar hyalinosis, and interstitial fibrosis. DN, in contrast, is primarily mediated by hyperglycemia-induced metabolic and hemodynamic stressors, producing diffuse and nodular mesangial expansion, glomerular basement membrane thickening, and bilateral arteriolar hyalinosis. While certain histological features, such as Kimmelstiel-Wilson nodules and efferent arteriole involvement, favor DN, mixed lesions are common in long-standing type 2 diabetes with hypertension. Accurate differentiation is clinically significant, as it guides the application of disease-specific interventions such as intensive glycemic control and emerging pharmacotherapies for DN, versus targeted vascular risk reduction in HN. Future advances in biomarkers, imaging, and genomics hold promise for earlier, noninvasive diagnosis.",
    "citationCount": 0,
    "referenceCount": 144
}