{
    "paperId": "f367a1e11c5d3ecab9b897e10c8ca1c9efc0c7e0",
    "title": "The least-used key selection method for information retrieval in large-scale Cloud-based service repositories",
    "year": 2022,
    "venue": "Journal of Cloud Computing",
    "authors": [
        "Jiayan Gu",
        "A. Anjum",
        "Yan Wu",
        "Lu Liu",
        "John Panneerselvam",
        "Yao Lu",
        "Bo Yuan"
    ],
    "doi": "10.1186/s13677-022-00297-3",
    "arxivId": "2208.07955",
    "url": "https://www.semanticscholar.org/paper/f367a1e11c5d3ecab9b897e10c8ca1c9efc0c7e0",
    "isOpenAccess": true,
    "openAccessPdf": "https://journalofcloudcomputing.springeropen.com/counter/pdf/10.1186/s13677-022-00297-3",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As the number of devices connected to the Internet of Things (IoT) increases significantly, it leads to an exponential growth in the number of services that need to be processed and stored in the large-scale Cloud-based service repositories. An efficient service indexing model is critical for service retrieval and management of large-scale Cloud-based service repositories. The multilevel index model is the state-of-art service indexing model in recent years to improve service discovery and combination. This paper aims to optimize the model to consider the impact of unequal appearing probability of service retrieval request parameters and service input parameters on service retrieval and service addition operations. The least-used key selection method has been proposed to narrow the search scope of service retrieval and reduce its time. The experimental results show that the proposed least-used key selection method improves the service retrieval efficiency significantly compared with the designated key selection method in the case of the unequal appearing probability of parameters in service retrieval requests under three indexing models.",
    "citationCount": 1,
    "referenceCount": 29
}