{
    "paperId": "f37dd752be976341d6270d35638ddb4e7a59621b",
    "title": "Predicting largest expected aftershock ground motions using automated machine learning (AutoML)-based scheme",
    "year": 2025,
    "venue": "Scientific Reports",
    "authors": [
        "Xiaohui Yu",
        "Meng Wang",
        "Chaolie Ning",
        "Kun Ji"
    ],
    "doi": "10.1038/s41598-024-84668-7",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f37dd752be976341d6270d35638ddb4e7a59621b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Geology",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Aftershocks can cause additional damage or even lead to the collapse of structures already weakened by a mainshock. Scarcity of in-situ recorded aftershock accelerograms heightens the need to develop synthetic aftershock ground motions. These synthesized motions are crucial for assessing the cumulative seismic demand on structures subjected to mainshock-aftershock sequences. However, existing research consistently highlights the challenge of accurately representing the spectral differences and interdependencies between mainshock and aftershock ground motions. In this study, we propose an innovative approach utilizing automated machine learning (AutoML) to forecast the acceleration spectrum (Sa) at varying periods for the largest expected aftershock. The AutoML model integrates essential parameters derived from the mainshock, including its Sa, and rupture parameters (moment magnitude, source-to-site distance), and site information (average shear-wave velocity in the top 30 m). Subsequently, we employ a wavelet-based technique to generate synthetic aftershock accelerograms that align with the spectrum of the mainshock, using the mainshock ground motion as a reference input. In contrast to classical machine learning techniques, AutoML requires minimal human involvement in model design, selection, and algorithm tuning. We collected 2500 sets of mainshock and in-situ aftershock recordings from a global database to train the AutoML model. Notably, even without aftershock rupture parameters as inputs, our predicted Sa shows significant agreement with actual recorded aftershock ground motions. Our predictions achieved R2 scores ranging from 0.85 to 0.9 across various periods, affirming the model’s accuracy. Furthermore, the Pearson correlation between predicted Sa intensities across different periods closely mirror that derived from observed aftershock recordings. These findings validate our trained AutoML model’s capability to forecast the response spectrum of the largest expected aftershock ground motions. The peak ductility demand of SDOF systems, using artificial mainshock-aftershock ground motions as input, also shows good agreement with those under recorded seismic sequences. Given the fully automated nature of our approach, the AutoML framework could be extended to predict other relevant non-Sa intensity measures of aftershocks.",
    "citationCount": 2,
    "referenceCount": 45
}