{
    "paperId": "f41e59633bb34cbb92bfe0892a7e66bd3658097e",
    "title": "Optimizing Queries with Many-to-Many Joins",
    "year": 2024,
    "venue": "IEEE International Conference on Data Engineering",
    "authors": [
        "Hasara Kalumin",
        "Amol Deshpande"
    ],
    "doi": "10.1109/ICDE65448.2025.00274",
    "arxivId": "2412.16323",
    "url": "https://www.semanticscholar.org/paper/f41e59633bb34cbb92bfe0892a7e66bd3658097e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "As database query processing techniques are being used to handle diverse workloads, a key emerging challenge is how to efficiently handle multi-way join queries containing multiple many-to-many joins. While uncommon in traditional enterprise settings, such queries are seen frequently in other contexts such as graph workloads. This has led to much work on developing join algorithms for handling cyclic queries, on compressed (factorized) representations for more efficient storage of intermediate results, and on use of semi-joins or predicate transfer to avoid generating large redundant intermediate results. In this paper, we address a core query optimization problem in this context. Specifically, we introduce an improved cost model that more accurately captures the cost of a query plan in such scenarios, and we present several optimization algorithms for query optimization that incorporate these new cost functions. We present an extensive experimental evaluation, that compares the factorized representation approach with a full semi-join reduction approach as well as to an approach that uses bitvectors to eliminate tuples early through sideways information passing. We also present new analyses of robustness of these techniques to the choice of the join order, potentially eliminating the need for more complex query optimization and selectivity estimation techniques.",
    "citationCount": 2,
    "referenceCount": 69
}