{
    "paperId": "f4433ce2487b2118164b23fba0d4a5b007834409",
    "title": "SIEVE: Effective Filtered Vector Search with Collection of Indexes",
    "year": 2025,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Zhaoheng Li",
        "Silu Huang",
        "Wei Ding",
        "Yongjoo Park",
        "Jianjun Chen"
    ],
    "doi": "10.48550/arXiv.2507.11907",
    "arxivId": "2507.11907",
    "url": "https://www.semanticscholar.org/paper/f4433ce2487b2118164b23fba0d4a5b007834409",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Real-world tasks such as recommending videos tagged\n kids\n can be reduced to finding\n similar\n vectors associated with\n hard\n predicates. This task,\n filtered vector search\n , is challenging as prior state-of-the-art graph-based (unfiltered) similarity search techniques degenerate when hard constraints are considered: effective graph-based filtered similarity search relies on sufficient connectivity for reaching similar items within a few hops. To consider predicates, recent works propose modifying graph traversal to visit only items that satisfy predicates. However, they fail to offer the just-a-few-hops property for a wide range of predicates: they must restrict predicates significantly or lose efficiency if only few items satisfy predicates.\n \n We propose an opposite approach: instead of constraining traversal, we build many indexes each serving different predicate forms. For effective construction, we devise a three-dimensional analytical model capturing relationships among index size, search time, and recall, with which we follow a workload-aware approach to pack as many useful indexes as possible into a collection. At query time, the analytical model is employed yet again to discern the one that offers the fastest search at a given recall. We show superior performance and support on datasets with varying selectivities and forms: our approach achieves up to 8.06× speedup while having as low as 1% build time versus other indexes, with less than 2.15× memory of a standard HNSW graph and modest knowledge of past workloads.",
    "citationCount": 1,
    "referenceCount": 75
}