{
    "paperId": "f4877dc401867275ad357a85a4f86ffdc72eb5fc",
    "title": "Scaling Terrain-Aware Spatial Machine Learning for Flood Mapping on Large Scale Earth Imagery Data",
    "year": 2024,
    "venue": "ACM Trans. Spatial Algorithms Syst.",
    "authors": [
        "Saugat Adhikari",
        "Da Yan",
        "Zhe Jiang",
        "Jiao Han",
        "Zelin Xu",
        "Yupu Zhang",
        "A. Sainju",
        "Yang Zhou"
    ],
    "doi": "10.1145/3703157",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4877dc401867275ad357a85a4f86ffdc72eb5fc",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3703157",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The accurate and prompt mapping of flood-affected regions is important for effective disaster management, including damage assessment and relief efforts. While high-resolution optical imagery from satellites during disasters presents an opportunity for automated flood inundation mapping, existing segmentation models face challenges due to noises such as cloud cover and tree canopies. Thanks to the digital elevation model (DEM) data readily available from sources such as United States Geological Survey (USGS), terrain guidance was utilized by recent graphical models such as hidden Markov trees (HMTs) to improve segmentation quality. Unfortunately, these methods either can only handle a small area where water levels at different locations are assumed to be consistent or require restricted assumptions such as there is only one river channel. This article presents an algorithm for flood extent mapping on large-scale Earth imagery, applicable to a large geographic area with multiple river channels. Since water level can vary a lot from upstream to downstream, we propose to detect river pixels to partition the remaining pixels into localized zones, each with a unique water level. In each zone, water at all locations flows to the same river entry point. Pixels in each zone are organized by an HMT to capture water flow directions guided by elevations. Moreover, a novel regularization scheme is designed to enforce inter-zone consistency by penalizing pixel-pairs of adjacent zones that violate terrain guidance. Efficient parallelization is made possible by coloring the zone adjacency graph to identify zones and zone-pairs that have no dependency and hence can be processed in parallel, and incremental one-pass terrain-guided scanning is conducted wherever applicable to reuse computations. Experiments demonstrate that our solution is more accurate than existing solutions and can efficiently and accurately map out flooding pixels in a giant area of size 24,805 × 40,129. Despite the imbalanced workloads caused by a few large zonal HMTs dominating the serial computing time, our parallelization approach is effective and manages to achieve up to 14.3× speedup on a machine with Intel Xeon Gold 6126 CPU @ 2.60 GHz (24 cores, 48 threads) using 32 threads.",
    "citationCount": 0,
    "referenceCount": 54
}