{
    "paperId": "f4abcd3e503ed5527ce548b8c62299a8b7279098",
    "title": "TalkPlay-Tools: Conversational Music Recommendation with LLM Tool Calling",
    "year": 2025,
    "venue": "",
    "authors": [
        "Seungheon Doh",
        "Keunwoo Choi",
        "Juhan Nam"
    ],
    "doi": null,
    "arxivId": "2510.01698",
    "url": "https://www.semanticscholar.org/paper/f4abcd3e503ed5527ce548b8c62299a8b7279098",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While the recent developments in large language models (LLMs) have successfully enabled generative recommenders with natural language interactions, their recommendation behavior is limited, leaving other simpler yet crucial components such as metadata or attribute filtering underutilized in the system. We propose an LLM-based music recommendation system with tool calling to serve as a unified retrieval-reranking pipeline. Our system positions an LLM as an end-to-end recommendation system that interprets user intent, plans tool invocations, and orchestrates specialized components: boolean filters (SQL), sparse retrieval (BM25), dense retrieval (embedding similarity), and generative retrieval (semantic IDs). Through tool planning, the system predicts which types of tools to use, their execution order, and the arguments needed to find music matching user preferences, supporting diverse modalities while seamlessly integrating multiple database filtering methods. We demonstrate that this unified tool-calling framework achieves competitive performance across diverse recommendation scenarios by selectively employing appropriate retrieval methods based on user queries, envisioning a new paradigm for conversational music recommendation systems.",
    "citationCount": 1,
    "referenceCount": 28
}