{
    "paperId": "f4afb501ab1a002497108bac133d6aab3230562a",
    "title": "Kafka-machine learning based storage benchmark kit for estimation of large file storage performance",
    "year": 2025,
    "venue": "International Journal of Electrical and Computer Engineering (IJECE)",
    "authors": [
        "Sanjay Kumar Naazre Vittal Rao",
        "Anitha Chikkanayakanahalli Lokesh Kumar",
        "Subhash Kamble"
    ],
    "doi": "10.11591/ijece.v15i2.pp1990-1999",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4afb501ab1a002497108bac133d6aab3230562a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Efficient storage and maintenance of big data is important with respect to assuring accessibility and cost-friendliness to improve risk management and achieve an effective comprehension of the user requirements. Managing the extensive data volumes and optimizing storage performance poses a significant challenge. To address this challenge, this research proposes the Kafka-machine learning (ML) based storage benchmark kit (SBK) designed to evaluate the performance of the file storage system. The proposed method employs Kafka-ML and a drill-down feature to optimize storage performance and enhance throughput. Kafka-ML-based SBK has the capability to optimize storage efficiency and system performance through space requirements and enhance data handling. The drill-down search feature precisely contributes through reducing disk space usage, enabling faster data retrieval and more efficient real-time processing within the Kafka-ML framework. The SBK aims to provide transparency and ease of utilization for benchmarking purposes. The proposed method attains maximum throughput and minimum latency of 20 MBs and 70 ms, respectively on the number of data bytes is 10, as opposed to the existing method SBK Kafka.",
    "citationCount": 0,
    "referenceCount": 26
}