{
    "paperId": "f4ba894d996c8aeee8cbb5da34a1dcadd3d18f4e",
    "title": "Optimizing Test Data Management Strategies in Banking Domain Projects",
    "year": 2024,
    "venue": "Journal of Sustainable Solutions",
    "authors": [
        "Ashwini Shivarudra"
    ],
    "doi": "10.36676/j.sust.sol.v1.i4.37",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4ba894d996c8aeee8cbb5da34a1dcadd3d18f4e",
    "isOpenAccess": true,
    "openAccessPdf": "https://jss.thewriters.in/index.php/jss/article/download/37/34",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The steady rise in processing power over the past 20 years has resulted in an enormous volume of data. Furthermore, anybody may now easily create and consume material in any format thanks to recent advancements in Web technology. Large volumes of data are regularly gathered by banking systems, including trade finance data, SWIFT and telex communications, client information, details about transactions, risk profiles, credit card details, limit and collateral details, the compliance or Anti Money Laundering (AML)-related data, and limit and collateral details. Every day, thousands of choices are made at banks. These choices pertain to credit, default, beginning a relationship, investments, AML, and illicit funding, among other things. To make these crucial choices, one must rely on a variety of data and drill down capabilities offered by the banking systems. We created a set of specifications for the kinds of data that should be included in a product catalogue. We ascertained what data the departments need by using a survey and questionnaire of the retailer's staff. We ensured that there was no one standard for the information organisation and then put out our own plan. This enormous amount of data may be mined for information and intriguing patterns, which can then be used to the decision-making process. This article examines and summarises a number of data mining methods that have applications in the banking industry. An overview of data mining methods and procedures is given. It also sheds light on how these methods may be applied in the banking industry to facilitate and enhance decision-making.",
    "citationCount": 2,
    "referenceCount": 91
}