{
    "paperId": "f4cb35f30bf70ad20e4dc276cc012b71c3dfbab6",
    "title": "HXRL: Explainable DRL-Enhanced Reliable VR Video Streaming for Immersive Smart Healthcare",
    "year": 2025,
    "venue": "IEEE Internet of Things Journal",
    "authors": [
        "Ye Wang",
        "Siyuan Li",
        "Xi Lin",
        "Yang Bai",
        "Jianqi Yu",
        "Lixing Chen",
        "Bo Yang",
        "Xinping Guan"
    ],
    "doi": "10.1109/JIOT.2025.3578680",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4cb35f30bf70ad20e4dc276cc012b71c3dfbab6",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Edge computing-enabled virtual reality (VR) is increasingly explored in smart healthcare systems due to its potential to deliver immersive, real-time medical services. However, ensuring ultralow latency and interpretable decision-making in such systems remains a significant challenge. In this article, we propose an explainable deep reinforcement learning (XDRL)-enhanced VR video streaming framework for immersive healthcare systems to provide smooth and reliable VR services. Specifically, we first model the VR content analysis process at the edge sides and formulate a joint caching, communication, and computing (3C) resource optimization problem to maximize the VR Quality of Service (QoS) and minimize service latency. To address this complex 3C resource scheduling decision problem, we propose HXRL, a novel implementation of XDRL, specifically designed to optimize immersive healthcare VR services. Comprehensive experiments show that our HXRL method improves average tile bitrate by 18.3%, cache hit ratio by 24.7%, and reduces system latency by 32.5% compared to baselines on real-world VR healthcare datasets. Moreover, a class activation map (CAM)-based visual analysis is integrated to interpret the learned policies of our model, highlighting the spatial attention of decision-making and enhancing trustworthiness in medical contexts.",
    "citationCount": 0,
    "referenceCount": 48
}