{
    "paperId": "f4d72fca9592230b84f99257971704c4afffb7cd",
    "title": "Integrating Machine Learning with Blockchain to Ensure Data Privacy",
    "year": 2020,
    "venue": "International Conference on Computing Communication and Networking Technologies",
    "authors": [
        "Sunil Samanta Singhar",
        "Debasish Jena",
        "Suraj Sharma"
    ],
    "doi": "10.1109/ICCCNT49239.2020.9225342",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4d72fca9592230b84f99257971704c4afffb7cd",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Nowadays data is collected without any specific purpose, every activity of a machine or a human being is recorded, If needed in the future then the data will be analyzed. But here the question of trust arises as the data will go through many phases for the analysis by different parties. The data may contain some sensitive or private information that can be miss utilized by the organizations involved in the analysis stages. So it is needed for the hour to consider the data privacy issues very seriously. Data privacy refers to how to control the use of a piece of data by its relative importance. For example, someone will not hesitate to say his/her name to strangers but will not share mobile no. address until the stranger becomes familiar. In this digital age, the personal use of data privacy generally applied to critical personal information. From a business point of view, data privacy operates in a broader sense beyond the critical information of employees & customers. There is a general conclusion that AI & Machine Learning driven technologies are obstructed by data privacy issues as the ML uses large data sets to train & test. But can the obstacle block convert to a stepping stone? Yes, It can be. Imagine a scenario where no one is trust-able, so in that case, Blockchain enters the scene. Blockchain uses the data but in an anonymity way. So in this paper, we are proposing a way, how to combine Machine Learning & Blockchain to ensure data privacy.",
    "citationCount": 2,
    "referenceCount": 25
}