{
    "paperId": "f4fb4292ec48fa37c3fa6ca73d558a0a051c8f31",
    "title": "Transparent Learner Knowledge State Modeling using Personal Knowledge Graphs and Graph Neural Networks",
    "year": 2024,
    "venue": "User Modeling, Adaptation, and Personalization",
    "authors": [
        "R. Alatrash",
        "Mohamed Amine Chatti",
        "Qurat Ul Ain",
        "Shoeb Joarder"
    ],
    "doi": "10.1145/3631700.3665230",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4fb4292ec48fa37c3fa6ca73d558a0a051c8f31",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Book",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Learner modeling is pivotal in different applications of adaptive and personalized systems in the educational domain, such as recommender systems and intelligent tutoring systems. However, how learner models are inferred and used in the these systems are often not transparent to learners. In many cases, learner models are presented as a black-box, where learners have no means to control or modify their models. To address these issues, in this paper, we present an innovative approach to learner modeling, particularly focusing on modeling learners’ knowledge states. To this end, we combine Personal Knowledge Graphs (PKGs), Graph Convolutional Networks (GCNs), and transformer sentence encoders (SBERT) to construct a transparent learner model. Specifically, we explicitly involve learners in modeling their knowledge state by enabling them to mark concepts as ’Did Not Understand’ (DNU) in the MOOC platform CourseMapper. This results in the construction of a user-controllable and scrutable PKG for the learner, thus increasing the transparency of the learner modeling process. Furthermore, we leverage GCNs and SBERT to model the learner knowledge state based on an enhanced representation of their DNUs. In this way, we provide a simple yet effective method for learner modeling which can be used to improve performance in downstream tasks, such as adaptive systems, recommendation, and personalized search.",
    "citationCount": 2,
    "referenceCount": 48
}