{
    "paperId": "f4fd4a5a0901675e19bb4054d8861d2697194fd5",
    "title": "Deep Reinforcement Learning: A State-of-the-Art Walkthrough",
    "year": 2020,
    "venue": "Journal of Artificial Intelligence Research",
    "authors": [
        "A. Lazaridis",
        "A. Fachantidis",
        "I. Vlahavas"
    ],
    "doi": "10.1613/jair.1.12412",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f4fd4a5a0901675e19bb4054d8861d2697194fd5",
    "isOpenAccess": true,
    "openAccessPdf": "https://jair.org/index.php/jair/article/download/12412/26638",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Deep Reinforcement Learning is a topic that has gained a lot of attention recently, due to the unprecedented achievements and remarkable performance of such algorithms in various benchmark tests and environmental setups. The power of such methods comes from the combination of an already established and strong field of Deep Learning, with the unique nature of Reinforcement Learning methods. It is, however, deemed necessary to provide a compact, accurate and comparable view of these methods and their results for the means of gaining valuable technical and practical insights. In this work we gather the essential methods related to Deep Reinforcement Learning, extracting common property structures for three complementary core categories: a) Model-Free, b) Model-Based and c) Modular algorithms. For each category, we present, analyze and compare state-of-the-art Deep Reinforcement Learning algorithms that achieve high performance in various environments and tackle challenging problems in complex and demanding tasks. In order to give a compact and practical overview of their differences, we present comprehensive comparison figures and tables, produced by reported performances of the algorithms under two popular simulation platforms: the Atari Learning Environment and the MuJoCo physics simulation platform. We discuss the key differences of the various kinds of algorithms, indicate their potential and limitations, as well as provide insights to researchers regarding future directions of the field.",
    "citationCount": 56,
    "referenceCount": 198
}