{
    "paperId": "f5149b81d71baff4b2bf57ef13f82e15719675d9",
    "title": "ITG: Trace Generation via Iterative Interaction between LLM Query and Trace Checking",
    "year": 2024,
    "venue": "2024 IEEE/ACM 46th International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER)",
    "authors": [
        "Weilin Luo",
        "Weiyuan Fang",
        "Junming Qiu",
        "Hai Wan",
        "Yanan Liu",
        "Rongzhen Ye"
    ],
    "doi": "10.1145/3639476.3639779",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f5149b81d71baff4b2bf57ef13f82e15719675d9",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3639476.3639779",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Due to the complexity of linear temporal logic (LTL) trace generation (PSPACE-Complete), existing neural network-based approaches will fail as the formula sizes increase. Recently, large language models (LLMs) have demonstrated remarkable reasoning capabilities, benefiting from efficient training on hyper-scale data. Inspired by this, we propose an iterative interaction framework for applying LLMs, exemplified by ChatGPT, to generate a trace satisfying a given LTL formula. The key insight behind it is to transfer the powerful reasoning capabilities of LLM to LTL trace generation via iterative interaction between LLM reasoning and logical reasoning. Preliminary results show that compared with the state-of-the-art approach, the accuracy is relatively improved by 9.7%-23.4%. Besides, we show that our framework is able to produce heuristics for new tasks, which provides a reference for other reasoning-heavy tasks requiring heuristics.",
    "citationCount": 0,
    "referenceCount": 30
}