{
    "paperId": "f5207cea786e6a47c994c294af333ad64a99da65",
    "title": "How Can AI Augment Access to Justice? Public Defenders'Perspectives on AI Adoption",
    "year": 2025,
    "venue": "",
    "authors": [
        "Inyoung Cheong",
        "Patty Liu",
        "Dominik Stammbach",
        "Peter Henderson"
    ],
    "doi": null,
    "arxivId": "2510.22933",
    "url": "https://www.semanticscholar.org/paper/f5207cea786e6a47c994c294af333ad64a99da65",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Public defenders are asked to do more with less: representing clients deserving of adequate counsel while facing overwhelming caseloads and scarce resources. While artificial intelligence (AI) and large language models (LLMs) are promoted as tools to alleviate this burden, such proposals are detached from the lived realities of public defenders. This study addresses that gap through semi-structured interviews with fourteen practitioners across the United States to examine their experiences with AI, anticipated applications, and ethical concerns. We find that AI adoption is constrained by costs, restrictive office norms, confidentiality risks, and unsatisfactory tool quality. To clarify where AI can and cannot contribute, we propose a task-level map of public defense. Public defenders view AI as most useful for evidence investigation to analyze overwhelming amounts of digital records, with narrower roles in legal research&writing, and client communication. Courtroom representation and defense strategy are considered least compatible with AI assistance, as they depend on contextual judgment and trust. Public defenders emphasize safeguards for responsible use, including mandatory human verification, limits on overreliance, and the preservation of relational aspect of lawyering. Building on these findings, we outline a research agenda that promotes equitable access to justice by prioritizing open-source models, domain-specific datasets and evaluation, and participatory design that incorporates defenders'perspectives into system development.",
    "citationCount": 0,
    "referenceCount": 104
}