{
    "paperId": "f535f25f86a8cac0b1605ad8b6735589abcc3b7f",
    "title": "Characterizing and Efficiently Accelerating Multimodal Generation Model Inference",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Yejin Lee",
        "Anna Sun",
        "Basil Hosmer",
        "Bilge Acun",
        "Can Balioglu",
        "Changhan Wang",
        "Charles David Hernandez",
        "Christian Puhrsch",
        "Daniel Haziza",
        "Driss Guessous",
        "Francisco Massa",
        "Jacob Kahn",
        "Jeffrey Wan",
        "J. Reizenstein",
        "Jiaqi Zhai",
        "Joe Isaacson",
        "Joel Schlosser",
        "Juan Pino",
        "Kaushik Ram Sadagopan",
        "Leonid Shamis",
        "Linjian Ma",
        "Min-Jae Hwang",
        "Mingda Chen",
        "Mostafa Elhoushi",
        "Pedro Rodriguez",
        "Ramakanth Pasunuru",
        "Scott Yih",
        "Sravya Popuri",
        "Xing Liu",
        "Carole-Jean Wu"
    ],
    "doi": "10.48550/arXiv.2410.00215",
    "arxivId": "2410.00215",
    "url": "https://www.semanticscholar.org/paper/f535f25f86a8cac0b1605ad8b6735589abcc3b7f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Generative artificial intelligence (AI) technology is revolutionizing the computing industry. Not only its applications have broadened to various sectors but also poses new system design and optimization opportunities. The technology is capable of understanding and responding in multiple modalities. However, the advanced capability currently comes with significant system resource demands. To sustainably scale generative AI capabilities to billions of users in the world, inference must be fast and efficient. This paper pinpoints key system design and optimization opportunities by characterizing a family of emerging multi-modal generation models on real systems. Auto-regressive token generation is a critical latency performance bottleneck, typically dominated by GPU idle time. In addition to memory-intensive attention across the generative AI models, linear operations constitute significant inference latency due to the feed forward networks in Transformer-based models. We demonstrate that state-of-the-art optimization levers, spanning from applications to system software and hardware, set a 3.88x better baseline.",
    "citationCount": 4,
    "referenceCount": 55
}