{
    "paperId": "f59d502d045dafe50074cabc69cd05e5ee8e2ba2",
    "title": "Iterative Region-Based Probabilistic Forwarding Algorithm for Traffic Engineering in LEO Satellite Networks",
    "year": 2024,
    "venue": "IEEE International Conference on High Performance Computing and Communications",
    "authors": [
        "Yan Dong",
        "Biao Ouyang",
        "Rui Cai",
        "Benkuan Zhou",
        "Chenxin Wang",
        "Menglan Hu",
        "Kai Peng"
    ],
    "doi": "10.1109/HPCC64274.2024.00134",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f59d502d045dafe50074cabc69cd05e5ee8e2ba2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid development of satellite communication technologies has significantly enhanced global connectivity, with Low Earth Orbit (LEO) satellite networks playing a crucial role. However, the high-speed movement of LEO satellites introduces dynamic and unstable network topologies, presenting challenges in routing and traffic engineering. Traditional routing algorithms, such as Dijkstra’s, often struggle to adapt to these dynamic conditions, leading to inefficiencies in load balancing and resource utilization. In response, this paper proposes an Iterative Region-Based Probabilistic Forwarding (IRPF) strategy within a Software-Defined Satellite Networking (SDSN) framework. Our strategy dynamically assigns forwarding probabilities to satellite ports based on link traffic weights, optimizing routing paths through a feedback iteration process. To prevent the algorithm from converging to local optima, we introduce a local adjustment mechanism that fine-tunes forwarding probabilities. The experimental results show that when the scale of the satellite network is relatively small, the IRPF strategy incurs lower total link traffic costs compared to the Dijkstra algorithm. Additionally, it improves the Gini coefficient and packet loss rate by approximately 20% and 30%, respectively. These results demonstrate the effectiveness and stability of this method in routing and traffic engineering.",
    "citationCount": 0,
    "referenceCount": 41
}