{
    "paperId": "f5c7202df9fb40febc472baabd5cde04cd8b30d4",
    "title": "Scalable Exact Verification of Optimization Proxies for Large-Scale Optimal Power Flow",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Rahul Nellikkath",
        "Mathieu Tanneau",
        "P. V. Hentenryck",
        "Spyros Chatzivasileiadis"
    ],
    "doi": "10.48550/arXiv.2405.06109",
    "arxivId": "2405.06109",
    "url": "https://www.semanticscholar.org/paper/f5c7202df9fb40febc472baabd5cde04cd8b30d4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimal Power Flow (OPF) is a valuable tool for power system operators, but it is a difficult problem to solve for large systems. Machine Learning (ML) algorithms, especially Neural Networks-based (NN) optimization proxies, have emerged as a promising new tool for solving OPF, by estimating the OPF solution much faster than traditional methods. However, these ML algorithms act as black boxes, and it is hard to assess their worst-case performance across the entire range of possible inputs than an OPF can have. Previous work has proposed a mixed-integer programming-based methodology to quantify the worst-case violations caused by a NN trained to estimate the OPF solution, throughout the entire input domain. This approach, however, does not scale well to large power systems and more complex NN models. This paper addresses these issues by proposing a scalable algorithm to compute worst-case violations of NN proxies used for approximating large power systems within a reasonable time limit. This will help build trust in ML models to be deployed in large industry-scale power grids.",
    "citationCount": 1,
    "referenceCount": 26
}