{
    "paperId": "f5d9a0f8f3e25e0bbb8880c56b558a6de20287d5",
    "title": "Quantum-Inspired Genetic Evolutionary Framework for High-Dimensional Feature Optimization in Adaptive Malware Detection Systems",
    "year": 2025,
    "venue": "International Conference on Computing for Sustainable Global Development",
    "authors": [
        "D. S. Rani",
        "K. Kavitha",
        "K. R. Devi",
        "D. Rambabu",
        "G. B. Krishna",
        "K. Gnaneshwar"
    ],
    "doi": "10.23919/INDIACom66777.2025.11115817",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f5d9a0f8f3e25e0bbb8880c56b558a6de20287d5",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The complexity and sophistication of malware are continuously growing up towards these complexities traditional detection systems are inadequate and new advanced machine learning based solutions needs to be adopted. But current techniques do not always perform well on high dimensional setting and are computationally heavy as well as difficult to adapt to varying malware signatures. This work introduces a novel feature selection Quantum Inspired Genetic Algorithm (QIGA) for malware detection that uses mutual information-based feature evaluation, advanced evolutionary mechanisms and iterative refinement. By utilizing quantum inspired probabilistic transitions and entropy-based feature adjustment, QIGA effectively reduces feature dimensionality, accelerates convergence rate of the feature subset, and so along improves classification performance. We evaluate the accuracy and computational complexity of QIGA, and compare them to baseline methods like Logistic Regression, Decision Trees, and K-Nearest Neighbors on several benchmark datasets; experimental results show that QIGA achieves an accuracy of 96.7%, an AUC of 0.96, and outperforms baseline methods in both accuracy and computational efficiency. The proposed methodology enables the reduction of computational overhead while keeping the robustness of the system to adapt to the complex patterns seen in modern malware and is specifically suitable for real time and resources constrained environments. The resultant QIGA is shown to be a state-of-the-art solution in malware detection, offering a scalable, efficient, and adaptive framework to continue development of this previously under researched area.",
    "citationCount": 0,
    "referenceCount": 22
}