{
    "paperId": "f5e0695696feedbd9b3e6d62206ea3d745b368c1",
    "title": "Identifying Complicated Contagion Scenarios from Cascade Data",
    "year": 2023,
    "venue": "Knowledge Discovery and Data Mining",
    "authors": [
        "Galen Harrison",
        "Amro Alabsi Aljundi",
        "Jiangzhuo Chen",
        "Sujith Ravi",
        "A. Vullikanti",
        "M. Marathe",
        "Abhijin Adiga"
    ],
    "doi": "10.1145/3580305.3599841",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f5e0695696feedbd9b3e6d62206ea3d745b368c1",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3580305.3599841",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We consider the setting of cascades that result from contagion dynamics on large realistic contact networks. We address the question of whether the structural properties of a (partially) observed cascade can characterize the contagion scenario and identify the interventions that might be in effect. Using epidemic spread as a concrete example, we study how social interventions such as compliance in social distancing, extent (and efficacy) of vaccination, and the transmissibility of disease can be inferred. The techniques developed are more generally applicable to other contagions as well. Our approach involves the use of large realistic social contact networks of certain regions of USA and an agent-based model (ABM) to simulate spread under two interventions, namely vaccination and generic social distancing (GSD). Through a machine learning approach, coupled with parameter significance analysis, our experimental results show that subgraph counts of the graph induced by the cascade can be used effectively to characterize the contagion scenario even during the initial stages of the epidemic, when traditional information such as case counts alone are not adequate for this task. Further, we show that our approach performs well even for partially observed cascades. These results demonstrate that cascade data collected from digital tracing applications under poor digital penetration and privacy constraints can provide valuable information about the contagion scenario.",
    "citationCount": 3,
    "referenceCount": 58
}