{
    "paperId": "f6022c88fba7b16d8239220aeeb063c9056ee56e",
    "title": "Following the Compass: LLM-Empowered Intent Translation with Manual Guidance",
    "year": 2024,
    "venue": "IEEE International Conference on Network Protocols",
    "authors": [
        "Lingqi Guo",
        "Jingyu Wang",
        "Jianyu Wu",
        "Caijun Yan",
        "Haifeng Sun",
        "Zirui Zhuang",
        "Qi Qi",
        "Yi Dong",
        "Haibao Ren",
        "Jianxin Liao"
    ],
    "doi": "10.1109/ICNP61940.2024.10858507",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6022c88fba7b16d8239220aeeb063c9056ee56e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Intent-Based Networking (IBN) represents a novel paradigm of network automation and intelligence that has gradually been applied to network management. While the emergence of Large Language Models (LLMs) has improved the current state of IBN, hardware heterogeneity and high network dynamics remain significant challenges. Hardware heterogeneity requires that IBN effectively manage a diverse range of devices. The high network dynamics demands that IBN align service needs with rapidly changing network resources. We propose LIT, a framework of LLM-empowered Intent Translation with manual guidance. Given the outstanding language understanding and generation capabilities of LLM, LIT utilizes it in intent translation task. To further address two prevalent problems encountered in IBN, we introduce manual guidance and Mixture of Experts (MoE). Under the guidance of the manual, LLM improves its ability to generate high-quality policies that comply with syntax. After introducing MoE, it makes fine-grained adjustments to the parameters of policies based on network status and service requirements. The experimental outcomes demonstrate that LIT considerably alleviates numerous current challenges confronted by IBN and excels in intent translation, attaining an F1 score that is $\\mathbf{5 6. 7 \\%}$ higher than the baseline model.",
    "citationCount": 4,
    "referenceCount": 52
}