{
    "paperId": "f605d80fa109b24c96547cca515d4dd4cde0db19",
    "title": "Common Challenges of Deep Reinforcement Learning Applications Development: An Empirical Study",
    "year": 2023,
    "venue": "Empirical Software Engineering",
    "authors": [
        "Mohammad Mehdi Morovati",
        "Florian Tambon",
        "Mina Taraghi",
        "Amin Nikanjam",
        "Foutse Khomh"
    ],
    "doi": "10.48550/arXiv.2310.09575",
    "arxivId": "2310.09575",
    "url": "https://www.semanticscholar.org/paper/f605d80fa109b24c96547cca515d4dd4cde0db19",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine Learning (ML) is increasingly being adopted in different industries. Deep Reinforcement Learning (DRL) is a subdomain of ML used to produce intelligent agents. Despite recent developments in DRL technology, the main challenges that developers face in the development of DRL applications are still unknown. To fill this gap, in this paper, we conduct a large-scale empirical study of 927 DRL-related posts extracted from Stack Overflow, the most popular Q&A platform in the software community. Through the process of labeling and categorizing extracted posts, we created a taxonomy of common challenges encountered in the development of DRL applications, along with their corresponding popularity levels. This taxonomy has been validated through a survey involving 65 DRL developers. Results show that at least 45% of developers experienced 18 of the 21 challenges identified in the taxonomy. The most frequent source of difficulty during the development of DRL applications are Comprehension, API usage, and Design problems, while Parallel processing, and DRL libraries/frameworks are classified as the most difficult challenges to address, with respect to the time required to receive an accepted answer. We hope that the research community will leverage this taxonomy to develop efficient strategies to address the identified challenges and improve the quality of DRL applications.",
    "citationCount": 8,
    "referenceCount": 88
}