{
    "paperId": "f64e312d7d76fd4f919c3de240f117cde3353b4f",
    "title": "A Prediction-based Online Cost Optimization Algorithm for 5G Vertical",
    "year": 2021,
    "venue": "International Workshop on Ant Colony Optimization and Swarm Intelligence",
    "authors": [
        "Jyotindra Tiwari",
        "Shashwat Kumar",
        "A. A."
    ],
    "doi": "10.1109/ANTS52808.2021.9937033",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f64e312d7d76fd4f919c3de240f117cde3353b4f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "End-to-end network slicing in 5G enables new business models and use cases across all industry verticals. Network slicing is an efficient solution that fulfills the diverse business requirements, characterized by a Service Level Agreement (SLA). 5G service providers offer the network slices through various plans differing in leasing period, allocated resources, and price. With uncertain future demand, it is challenging for businesses to select a cost-effective plan that supports the traffic. In this work, we propose a prediction-based online algorithm that minimizes the cost through plan selection for different applications in industry verticals. First, the future traffic demand is predicted using the Recurrent Neural Network (RNN)-based Long Short-Term Memory (LSTM) model, which continuously learns and adapts to the dynamic requirements with higher prediction accuracy. The traffic prediction model estimates the future demand, and the proposed algorithm leverages it for plan selection. The problem is formulated as an Integer Linear Program (ILP), which provides an offline optimal solution of the problem. Results from extensive simulations, with real-world datasets, illustrate that the proposed algorithm reduces the best worst-case expected Competitive Ratio (CR) by 20% over randomized ski-rental algorithm and 37% over deterministic algorithm.",
    "citationCount": 1,
    "referenceCount": 12
}