{
    "paperId": "f6536a2236d13312fdbfa53bbef20dd14a4982ea",
    "title": "Hunting the pertinency of hash and bloom filter combinations on GPU for fast pattern matching",
    "year": 2022,
    "venue": "International journal of information technology",
    "authors": [
        "Radhakrishna Bhat",
        "Reddy Kanala Thilak",
        "Reddy Panyala Vaibhav"
    ],
    "doi": "10.1007/s41870-022-00964-3",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6536a2236d13312fdbfa53bbef20dd14a4982ea",
    "isOpenAccess": true,
    "openAccessPdf": "https://link.springer.com/content/pdf/10.1007/s41870-022-00964-3.pdf",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "There has been rapid growth in the field of graphical processing unit (GPU) programming due to the drastic increase in the computing hardware manufacturing. The technology used in these devices is now more affordable and accessible to the general public. With this growth, many serial programming applications that are now being transformed into more efficient parallel programming applications with significant improvement in the performance. The best example for this is parallel implementation of the probabilistic data structure Bloom filter in set membership queries. However, despite of it’s remarkable performance in speed and memory usage, there is a computational overhead in the calculation of hashes in Bloom filter. In this paper, the impact of the choice of hash functions on the qualitative properties of the Bloom filter has been experimentally recorded and the results show that there is a possibility of large performance gap among various hash functions. We have implemented the Bloom filter based pattern matching technique on GPU using compute unified device architecture (CUDA) and benchmark the performance of several cryptographic and non-cryptographic hash functions.",
    "citationCount": 4,
    "referenceCount": 37
}