{
    "paperId": "f65e8c176bc5324644a484edfb07a33fd37fc26a",
    "title": "Proyecto genoma veinte años después: el primer 'pangenoma humano'",
    "year": 2023,
    "venue": "Persona y Bioética",
    "authors": [
        "Gilberto A. Gamboa-Bernal"
    ],
    "doi": "10.5294/pebi.2023.27.2.1",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f65e8c176bc5324644a484edfb07a33fd37fc26a",
    "isOpenAccess": true,
    "openAccessPdf": "https://personaybioetica.unisabana.edu.co/index.php/personaybioetica/article/download/21953/7785",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [],
    "abstract": "La noticia de la conclusión del primer pangenoma humano ocurre veinte años después de que se haya podido contar con una versión de referencia, de la información genética completa, de la especie humana. Las limitaciones técnicas de ese tiempo permitieron que esa versión tuviera errores y varias lagunas de la información genética. Ahora, es posible contar con un nuevo atlas gigante con información que permite evidenciar la gran diversidad genética de la especie humana. Este trabajo está siendo realizado por el Consorcio Internacional de Referencia del Pangenoma Humano, del que hacen parte cerca de cien investigadores y está financiado por el Instituto Nacional de Investigación del Genoma Humano y por los Institutos Nacionales de Salud de Estados Unidos. Este escrito describe a grandes rasgos en qué consiste el proyecto, cuáles son sus aplicaciones posibles y las dificultades técnicas que tiene actualmente. Se repasan también algunos aspectos éticos y jurídicos y se dan pautas para su culminación: profundizar en la reflexión ética de los problemas que se generan; cuidar la formación en ética de la investigación, bioética e integridad científica en todos los actores del proceso; no perder de vista la Declaración Universal sobre el genoma humano y los Derechos Humanos de la UNESCO; orientar los desarrollos de la bioinformática, para que los datos obtenidos se manejen de una mejor manera; extremar la prudencia en el manejo de esos datos; revisar y reajustar las prioridades que se tienen en la investigación de estas temáticas, entre otros.",
    "citationCount": 0,
    "referenceCount": 41
}