{
    "paperId": "f665c31bafdf07ed85d4fe888bdf23040b871347",
    "title": "Tree-based Text-Vision BERT for Video Search in Baidu Video Advertising",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "Tan Yu",
        "Jie Liu",
        "Yi Yang",
        "Yi Li",
        "Hongliang Fei",
        "Ping Li"
    ],
    "doi": "10.1109/BigData55660.2022.10020922",
    "arxivId": "2209.08759",
    "url": "https://www.semanticscholar.org/paper/f665c31bafdf07ed85d4fe888bdf23040b871347",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2209.08759",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The advancement of the communication technology and the popularity of the smart phones foster the booming of video ads. Baidu, as one of the leading search engine companies in the world, receives billions of search queries per day. How to pair the video ads with the user search is the core task of Baidu video advertising. Due to the modality gap, the query-to-video retrieval is much more challenging than traditional query-to-document retrieval and image-to-image search. Traditionally, the query-to-video retrieval is tackled by the query-to-title retrieval, which is not reliable when the quality of tiles are not high. With the rapid progress achieved in computer vision and natural language processing in recent years, content-based search methods becomes promising for the query-to-video retrieval. Benefited f rom p retraining o n l arge-scale datasets, some visionBERT methods based on cross-modal attention have achieved excellent performance in many vision-language tasks not only in academia but also in industry. Nevertheless, the expensive computation cost of cross-modal attention makes it impractical for large-scale search in industrial applications. In this work, we present a tree-based combo-attention network (TCAN) which has been recently launched in Baidu’s dynamic video advertising platform. It provides a practical solution to deploy the heavy cross-modal attention for the large-scale query-to-video search. After the method was deployed, we observe that click-through rate gets improved by 2.29% and conversion rate by 2.63%.",
    "citationCount": 1,
    "referenceCount": 84
}