{
    "paperId": "f6680b3e4648a8841a0d670ea07c23d83848e23b",
    "title": "A Blockchain-Based Product Traceability System with Off-Chain EPCIS and IoT Device Authentication",
    "year": 2022,
    "venue": "Italian National Conference on Sensors",
    "authors": [
        "Lulu Li",
        "Huan Qu",
        "H. Wang",
        "Junyu Wang",
        "Bozhi Wang",
        "Wei Wang",
        "Jinfei Xu",
        "Zhihui Wang"
    ],
    "doi": "10.3390/s22228680",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6680b3e4648a8841a0d670ea07c23d83848e23b",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1424-8220/22/22/8680/pdf?version=1668075316",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Blockchain-based traceability systems are a promising approach because they are decentralized, transparent, and tamper proof; however, if all traceability data are uploaded to a blockchain platform, it may affect the efficiency or even lead to data explosion. Additionally, it is difficult to guarantee the reliability of the original data source of massive Internet of Things (IoT) devices. Furthermore, when different enterprise nodes adopt different data storage structures, the costs that are associated with data sharing will increase. In this paper, we have proposed a trustworthy product traceability system that is based on hyperledger fabric and Electronic Product Code Information Service (EPCIS), which is not only capable of making products traceable, but it can also authenticate and authorize the IoT devices that are used for data collection. First, we adopted the on-chain and off-chain collaborative management mechanism in order to alleviate data explosion on the chain. Second, we proposed a scheme to authenticate and authorize devices based on blockchain. Third, we complied with EPCIS and Core Business Vocabulary (CBV) standards and provided the EPCIS location discovery service in order to improve the interactivity. Finally, we implemented and tested the proposed traceability system and compared it with the existing research. The proposed solution provides product information traceability, data tamper proofing, data confidentiality, and data source reliability.",
    "citationCount": 18,
    "referenceCount": 51
}