{
    "paperId": "f66fbe5720a30ee81cb5f6e590db6539af62243a",
    "title": "An Automated Model of Software Requirement Engineering Using GPT-3.5",
    "year": 2024,
    "venue": "2024 ASU International Conference in Emerging Technologies for Sustainability and Intelligent Systems (ICETSIS)",
    "authors": [
        "Jie Sh'ng Yeow",
        "Muhammad Ehsan Rana",
        "Nur Amira Abdul Majid"
    ],
    "doi": "10.1109/ICETSIS61505.2024.10459458",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f66fbe5720a30ee81cb5f6e590db6539af62243a",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While the potential of AI in software development is undeniable, integrating advanced models like GPT-3.5 into its core processes like requirements engineering remains largely unexplored. This research investigates the effectiveness of GPT-3.5 in automating key tasks within software requirements engineering. The primary objective is to comprehensively explore the capabilities, limitations, and potential applications of GPT-3.5 in software requirements engineering. Subsequently, the research undergoes thorough analysis and evaluation to gather insights into the strengths and limitations of GPT-3.5 in the requirement-gathering process. The research concludes by identifying the limitations and putting forth recommendations for future research endeavours aimed at integrating GPT-3.5 into software requirement engineering processes. While GPT-3.5 demonstrates proficiency in aspects like creative prototyping and question generation, limitations in areas like domain understanding and context awareness become evident. By outlining these limitations, the authors offer concrete recommendations for future research focusing on the seamless integration of GPT-3.5 and similar models into the broader framework of software requirements engineering.",
    "citationCount": 5,
    "referenceCount": 36
}