{
    "paperId": "f68f33eafa34d1406f464caf573c0d30c3bb76b3",
    "title": "Optimal Resource Allocation for Serverless Queries",
    "year": 2021,
    "venue": "arXiv.org",
    "authors": [
        "Anish Pimpley",
        "Shuo Li",
        "Anubhav Srivastava",
        "Vishal Rohra",
        "Yi Zhu",
        "Soundararajan Srinivasan",
        "Alekh Jindal",
        "Hiren Patel",
        "S. Qiao",
        "Rathijit Sen"
    ],
    "doi": null,
    "arxivId": "2107.08594",
    "url": "https://www.semanticscholar.org/paper/f68f33eafa34d1406f464caf573c0d30c3bb76b3",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Optimizing resource allocation for analytical workloads is vital for reducing costs of cloud-data services. At the same time, it is incredibly hard for users to allocate resources per query in serverless processing systems, and they frequently misallocate by orders of magnitude. Unfortunately, prior work focused on predicting peak allocation while ignoring aggressive trade-offs between resource allocation and run-time. Additionally, these methods fail to predict allocation for queries that have not been observed in the past. In this paper, we tackle both these problems. We introduce a system for optimal resource allocation that can predict performance with aggressive trade-offs, for both new and past observed queries. We introduce the notion of a performance characteristic curve (PCC) as a parameterized representation that can compactly capture the relationship between resources and performance. To tackle training data sparsity, we introduce a novel data augmentation technique to efficiently synthesize the entire PCC using a single run of the query. Lastly, we demonstrate the advantages of a constrained loss function coupled with GNNs, over traditional ML methods, for capturing the domain specific behavior through an extensive experimental evaluation over SCOPE big data workloads at Microsoft.",
    "citationCount": 16,
    "referenceCount": 27
}