{
    "paperId": "f6a89857937b2fa8e1715b025f9f4f295e719a44",
    "title": "Improving Biomedical Image Pattern Identification by Deep B4-GraftingNet: Application to Pneumonia Detection",
    "year": 2025,
    "venue": "IET Image Processing",
    "authors": [
        "Syed Taimoor Hussain Shah",
        "Syed Taimoor Hussain Shah",
        "Abdul Muiz Fayyaz",
        "Syed Taimoor Hussain Shah",
        "Mussarat Yasmin",
        "Mudassar Raza",
        "Angelo di Terlizzi",
        "M. Deriu"
    ],
    "doi": "10.1049/ipr2.70064",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6a89857937b2fa8e1715b025f9f4f295e719a44",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "VGG‐16 and Inception are widely used CNN architectures for image classification, but they face challenges in target categorization. This study introduces B4‐GraftingNet, a novel deep learning model that integrates VGG‐16's hierarchical feature extraction with Inception's diversified receptive field strategy. The model is trained on the OCT‐CXR dataset and evaluated on the NIH‐CXR dataset to ensure robust generalization. Unlike conventional approaches, B4‐GraftingNet incorporates binary particle swarm optimization (BPSO) for feature selection and grad‐CAM for interpretability. Additionally, deep feature extraction is performed, and multiple machine learning classifiers (SVM, KNN, random forest, naïve Bayes) are evaluated to determine the optimal feature representation. The model achieves 94.01% accuracy, 94.22% sensitivity, 93.36% specificity, and 95.18% F1‐score on OCT‐CXR and maintains 87.34% accuracy on NIH‐CXR despite not being trained on it. These results highlight the model's superior classification performance, feature adaptability, and potential for real‐world deployment in both medical and general image classification tasks.",
    "citationCount": 0,
    "referenceCount": 43
}