{
    "paperId": "f6b587a64a0eedb65e2276b696863a5a98faa7a8",
    "title": "Enhancing pipeline integrity: a comprehensive review of deep learning-enabled finite element analysis for stress corrosion cracking prediction",
    "year": 2024,
    "venue": "Engineering Applications of Computational Fluid Mechanics",
    "authors": [
        "Umair Sarwar",
        "A. Mokhtar",
        "M. Muhammad",
        "Rano Khan Wassan",
        "Afzal Ahmed Soomro",
        "Majid Ali Wassan",
        "Shuaib Kaka"
    ],
    "doi": "10.1080/19942060.2024.2302906",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6b587a64a0eedb65e2276b696863a5a98faa7a8",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.tandfonline.com/doi/pdf/10.1080/19942060.2024.2302906?needAccess=true",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Materials Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Pipelines are crucial for transporting energy sources, yet corrosion especially stress corrosion cracking (SCC) poses a complex and potentially catastrophic form of material degradation. Traditional techniques like finite element analysis (FEA) have been utilized for SCC prediction, but it suffers from high computational cost and limited scalability. Deep learning (DL) with integration of FEA leverages large-scale data and learn complex nonlinear patterns for SCC prediction. Currently, literature on deep learning-enabled finite element analysis for pipelines SCC prediction is scarce, offering limited insights into this emerging approach and lack of comprehensive review. This paper reviews and investigates the current research directions and applications of DL-enabled FEA methodologies for simulation of SCC prediction. The importance of DL, technique type and network are also outlined in this review paper. This paper delves into integration of DL algorithms with FEA and their ability to grab complex interactions between mechanical stress, material properties, and environmental factors. Based on this comprehensive review, it was found that DL and FEA have proven to be strong prediction tools with high accuracy and lower training cost. DL-enabled FEA techniques are also being utilized to replace time-consuming methods and conventional codes. Furthermore, article discusses potential of this integrated approach for enhancing accuracy and efficiency of SCC prediction, leading to improved pipeline integrity management practices. Abbreviations: SCC: Stress corrosion cracking; FE: Finite element; FEA: Finite element analysis; FEM: Finite element method; ML: Machine learning; DL: Deep learning; EGIG: European gas pipeline incident data group; PHMSA: Pipeline and hazardous materials safety administration; DNNs: Deep neural networks; HpHSCC: High pH stress corrosion cracking; SMYS: Specified minimum yield strength; HE: Hydrogen embrittlement; NNpHSCC: Near-neutral pH stress corrosion cracking; ASME: American society of mechanical engineers; DNV: Det norske veritas; AI-FEM: Advanced iterative finite element method; CGR: Crack growth rate; ME: Mechanoelectrochemical; XGB: XGBoost; CAT: Catboost; CP: Cathodic Protection; AI: Artificial intelligence; ANNs: Artificial neural networks; CNNs: Convolutional neural networks; RNNs: Recurrent neural networks; ReLU: Rectified linear unit",
    "citationCount": 19,
    "referenceCount": 138
}