{
    "paperId": "f6c78aa6970142e13222e98cee9b335cef72ce1b",
    "title": "Bandwidth Efficient Cache Selection and Cache-Content Advertisement",
    "year": 2025,
    "venue": "IEEE Transactions on Network and Service Management",
    "authors": [
        "Itamar Cohen"
    ],
    "doi": "10.1109/TNSM.2025.3558835",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6c78aa6970142e13222e98cee9b335cef72ce1b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Caching is extensively used in various networking environments to optimize performance by reducing latency, bandwidth, and energy consumption. To optimize performance, caches often advertise their content using indicators, which are data structures that trade space efficiency for accuracy. However, this tradeoff introduces the risk of false indications. Existing solutions for cache content advertisement and cache selection often lead to inefficiencies, failing to adapt to dynamic network conditions. This paper introduces SALSA2, a Scalable Adaptive and Learning-based Selection and Advertisement Algorithm, which addresses these limitations through a dynamic and adaptive approach. SALSA2 accurately estimates mis-indication probabilities by considering inter-cache dependencies and dynamically adjusts the size and frequency of indicator advertisements to minimize transmission overhead while maintaining high accuracy. Our extensive simulation study, conducted using a variety of real-world cache traces, demonstrates that SALSA2 achieves up to 84% bandwidth savings compared to the state-of-the-art solution and close-to-optimal service cost in most scenarios. These results highlight SALSA2’s effectiveness in enhancing cache management, making it a robust and versatile solution for modern networking challenges.",
    "citationCount": 1,
    "referenceCount": 38
}