{
    "paperId": "f6ecc8b7b497b9bc0ed085b7d28409cbc8ac152d",
    "title": "Investigating the volume and diversity of data needed for generalizable antibody–antigen ΔΔG prediction",
    "year": 2025,
    "venue": "Nature Computational Science",
    "authors": [
        "Alissa M. Hummer",
        "Constantin Schneider",
        "Lewis Chinery",
        "Charlotte M. Deane"
    ],
    "doi": "10.1038/s43588-025-00823-8",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f6ecc8b7b497b9bc0ed085b7d28409cbc8ac152d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Antibody–antigen binding affinity lies at the heart of therapeutic antibody development: efficacy is guided by specific binding and control of affinity. Here we present Graphinity, an equivariant graph neural network architecture built directly from antibody–antigen structures that achieves test Pearson’s correlations of up to 0.87 on experimental change in binding affinity (ΔΔG) prediction. However, our model, like previous methods, appears to be overtraining on the few hundred experimental data points available and performance is not robust to train–test cut-offs. To investigate the amount and type of data required to generalizably predict ΔΔG, we built synthetic datasets of nearly 1 million FoldX-generated and >20,000 Rosetta Flex ddG-generated ΔΔG values. Our results indicate that there are currently insufficient experimental data to accurately and robustly predict ΔΔG, with orders of magnitude more likely needed. Dataset size is not the only consideration; diversity is also an important factor for model predictiveness. These findings provide a lower bound on data requirements to inform future method development and data collection efforts.",
    "citationCount": 3,
    "referenceCount": 58
}