{
    "paperId": "f71f9e8985b5abf50c807ff88d8c7201f0c6702c",
    "title": "LLINBO: Trustworthy LLM-in-the-Loop Bayesian Optimization",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Chih-Yu Chang",
        "Milad Azvar",
        "C. Okwudire",
        "R. Kontar"
    ],
    "doi": "10.48550/arXiv.2505.14756",
    "arxivId": "2505.14756",
    "url": "https://www.semanticscholar.org/paper/f71f9e8985b5abf50c807ff88d8c7201f0c6702c",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Bayesian optimization (BO) is a sequential decision-making tool widely used for optimizing expensive black-box functions. Recently, Large Language Models (LLMs) have shown remarkable adaptability in low-data regimes, making them promising tools for black-box optimization by leveraging contextual knowledge to propose high-quality query points. However, relying solely on LLMs as optimization agents introduces risks due to their lack of explicit surrogate modeling and calibrated uncertainty, as well as their inherently opaque internal mechanisms. This structural opacity makes it difficult to characterize or control the exploration-exploitation trade-off, ultimately undermining theoretical tractability and reliability. To address this, we propose LLINBO: LLM-in-the-Loop BO, a hybrid framework for BO that combines LLMs with statistical surrogate experts (e.g., Gaussian Processes (GP)). The core philosophy is to leverage contextual reasoning strengths of LLMs for early exploration, while relying on principled statistical models to guide efficient exploitation. Specifically, we introduce three mechanisms that enable this collaboration and establish their theoretical guarantees. We end the paper with a real-life proof-of-concept in the context of 3D printing. The code to reproduce the results can be found at https://github.com/UMDataScienceLab/LLM-in-the-Loop-BO.",
    "citationCount": 1,
    "referenceCount": 44
}