{
    "paperId": "f750ae9bbf11abd74f65ba577e1b318e9ef27c8d",
    "title": "Exploiting Nil-external Interfaces for Fast Replicated Storage",
    "year": 2022,
    "venue": "ACM Transactions on Storage",
    "authors": [
        "Aishwarya Ganesan",
        "Ramnatthan Alagappan",
        "Anthony Rebello",
        "Andrea C. Arpaci-Dusseau",
        "Remzi H. Arpaci-Dusseau"
    ],
    "doi": "10.1145/3542821",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f750ae9bbf11abd74f65ba577e1b318e9ef27c8d",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Do some storage interfaces enable higher performance than others? Can one identify and exploit such interfaces to realize high performance in storage systems? This article answers these questions in the affirmative by identifying nil-externality, a property of storage interfaces. A nil-externalizing (nilext) interface may modify state within a storage system but does not externalize its effects or system state immediately to the outside world. As a result, a storage system can apply nilext operations lazily, improving performance. In this article, we take advantage of nilext interfaces to build high-performance replicated storage. We implement Skyros, a nilext-aware replication protocol that offers high performance by deferring ordering and executing operations until their effects are externalized. We show that exploiting nil-externality offers significant benefit: For many workloads, Skyros provides higher performance than standard consensus-based replication. For example, Skyros offers 3× lower latency while providing the same high throughput offered by throughput-optimized Paxos.",
    "citationCount": 3,
    "referenceCount": 89
}