{
    "paperId": "f77cd3d1aa109675118fc43ec8bdc28b6be36c95",
    "title": "Mathematical Models for Named Data Networking Producer Mobility Techniques: A Review",
    "year": 2024,
    "venue": "Mathematics",
    "authors": [
        "Wan Muhd Hazwan Azamuddin",
        "Azana Hafizah Mohd Aman",
        "H. Sallehuddin",
        "Maznifah Salam",
        "Khalid Abualsaud"
    ],
    "doi": "10.3390/math12050649",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f77cd3d1aa109675118fc43ec8bdc28b6be36c95",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2227-7390/12/5/649/pdf?version=1708667810",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "One promising paradigm for content-centric communication is Named Data Networking (NDN), which revolutionizes data delivery and retrieval. A crucial component of NDN, producer mobility, presents new difficulties and opportunities for network optimization. This article reviews simulation strategies designed to improve NDN producer mobility. Producer mobility strategies have developed due to NDN data access needs, and these methods optimize data retrieval in dynamic networks. However, assessing their performance in different situations is difficult. Moreover, simulation approaches offer a cost-effective and controlled setting for experimentation, making them useful for testing these technologies. This review analyzes cutting-edge simulation methodologies for NDN producer mobility evaluation. These methodologies fall into three categories: simulation frameworks, mobility models, and performance metrics. Popular simulation platforms, including ns-3, OMNeT++, and ndnSIM, and mobility models that simulate producer movement are discussed. We also examine producer mobility performance indicators, such as handover data latency, signaling cost, and total packet loss. In conclusion, this comprehensive evaluation will help researchers, network engineers, and practitioners understand NDN producer mobility modeling approaches. By knowing these methodologies’ strengths and weaknesses, network stakeholders may make informed NDN solution development and deployment decisions, improving content-centric communication in dynamic network environments.",
    "citationCount": 3,
    "referenceCount": 82
}