{
    "paperId": "f78339e064febfe8823340b590313276ab86737b",
    "title": "CNN Modified Approach for Classifying Cardiomegaly Disease Based on CXR Image",
    "year": 2024,
    "venue": "Asia Pacific Symposium on Intelligent and Evolutionary Systems",
    "authors": [
        "Sri Heranurweni",
        "R. Mardiyanto",
        "E. M. Yuniarno",
        "Andi Kurniawan Nugroho",
        "M. Purnomo"
    ],
    "doi": "10.1109/IES63037.2024.10665768",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f78339e064febfe8823340b590313276ab86737b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This research focuses on the classification of cardiomegaly by developing and evaluating a CNN model based on CXR images. This research is motivated by the high number of people suffering from heart disease and one of them is the prevalence of cardiomegaly in Indonesia, which constitutes a serious public health problem. The aim of this study is to increase the accuracy of cardiomegaly classification and compare the results with other existing methods. The CNN modification method used is the addition of a convolution layer to add features to the cardiomegaly CXR which are almost the same as the normal heart CXR. The processed data set is then divided into training and testing sets, and data augmentation is performed for both sets. The proposed deep learning models, including Modified CNN, Xception, and Inception ResNetV2, are built and trained using the RMSprop optimizer observing its impact on model performance. The results show that the modified CNN model provides the best performance with an accuracy of 72.64%, higher than previous research using the Inception V3 and SVM models. Performance evaluation is done using metrics such as accuracy, precision, recall, and F1 value. The research results concluded that the modified CNN model could improve the accuracy of cardiomegaly classification, thus making a significant contribution to the development of better cardiomegaly detection methods. This study also highlights the importance of using deep learning models to analyze accurate disease diagnosis.",
    "citationCount": 1,
    "referenceCount": 12
}