{
    "paperId": "f78541034651fb6ee5fe2d3adb17a024cc7e582c",
    "title": "Elephant Flows Detection Using Deep Neural Network, Convolutional Neural Network, Long Short Term Memory and Autoencoder",
    "year": 2023,
    "venue": "J. Comput. Networks Commun.",
    "authors": [
        "Getahun Wassie Geremew",
        "Jianguo Ding"
    ],
    "doi": "10.1155/2023/1495642",
    "arxivId": "2306.03995",
    "url": "https://www.semanticscholar.org/paper/f78541034651fb6ee5fe2d3adb17a024cc7e582c",
    "isOpenAccess": true,
    "openAccessPdf": "https://downloads.hindawi.com/journals/jcnc/2023/1495642.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Currently, the widespread of real-time applications such as VoIP and videos-based applications require more data rates and reduced latency to ensure better quality of service (QoS). A well-designed traffic classification mechanism plays a major role for good QoS provision and network security verification. Port-based approaches and deep packet inspection (DPI) techniques have been used to classify and analyze network traffic flows. However, none of these methods can cope with the rapid growth of network traffic due to the increasing number of Internet users and the growth of real-time applications. As a result, these methods lead to network congestion, resulting in packet loss, delay, and inadequate QoS delivery. Recently, a deep learning approach has been explored to address the time-consumption and impracticality gaps of the abovementioned methods and maintain existing and future traffics of real-time applications. The aim of this research is then to design a dynamic traffic classifier that can detect elephant flows to prevent network congestion. Thus, we are motivated to provide efficient bandwidth and fast transmission requirements to many Internet users using SDN capability and the potential of deep learning. Specifically, DNN, CNN, LSTM, and Deep autoencoder are used to build elephant detection models that achieve an average accuracy of 99.12%, 98.17%, and 98.78%, respectively. Deep autoencoder is also one of the promising algorithms that do not require human class labeler. It achieves an accuracy of 97.95% with a loss of 0.13. Since the loss value is closer to zero, the performance of the model is good. Therefore, the study has a great importance to Internet service providers, Internet subscribers, as well as for future researchers in this area.",
    "citationCount": 9,
    "referenceCount": 92
}