{
    "paperId": "f7b6e3f6cfb05c8cc4ac04d65dc6cbe35cb599aa",
    "title": "ESReLU: A Dynamic Activation Function for Enhancing Deep Learning Performance in Recommendations",
    "year": 2025,
    "venue": "International Journal of Intelligent Engineering and Systems",
    "authors": [
        "Syed Irteza",
        "Hussain Jafri",
        "Ahmed Khalaf",
        "Zager Al Saedi",
        "Abubakar Elsafi",
        "Ghada Ahmed Abdelguiom",
        "Rozaida Ghazali",
        "Irfan Javid"
    ],
    "doi": "10.22266/ijies2025.0430.12",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f7b6e3f6cfb05c8cc4ac04d65dc6cbe35cb599aa",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": ": Deep learning has seen a tremendous increase in the recent past. A variety of deep learning architectures have been proposed for various kind of tasks. Activation functions (AF) play a critical role in a deep learning model with the ability to learn abstract properties through nonlinear transformations. This study proposes an adaptive AF, ExtendedSigmoidReLU (ESReLU), to improve model’s performance. The proposed AF combines the strengths of Sigmoid and ReLU AFs, dynamically adjusting to varying inputs using a tunable parameter, that allows ESReLU to transition between traditional sigmoid and ReLU functions seamlessly. To ensure continuous and smooth behaviour during training, sigmoid introduces strong gradient flow, whereas ReLU introduces nonlinearity and overcomes sparsity. Experiments conducted on various datasets using a collaborative filtering model demonstrate that ESReLU outperforms traditional functions, achieving faster convergence and performance improvements of up to ~3% on accuracy. These results indicate that ESReLU has significant potential to enhance recommendation performance, especially in data-intensive applications.",
    "citationCount": 0,
    "referenceCount": 23
}