{
    "paperId": "f7c7eb746affac5843751bb4dc4fdb0222f1d40b",
    "title": "Advancements of Artificial Intelligence Techniques in the Realm About Library and Information Subject—A Case Survey of Latent Dirichlet Allocation Method",
    "year": 2023,
    "venue": "IEEE Access",
    "authors": [
        "X. Pan",
        "Yu Xue"
    ],
    "doi": "10.1109/ACCESS.2023.3334619",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f7c7eb746affac5843751bb4dc4fdb0222f1d40b",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/6514899/10323275.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "To investigate the advancements of artificial intelligence techniques in the realm of library and information subject, we have chosen the Latent Dirichlet Allocation method as a case study to explore its current study status and implementations. Traditional theme mining analyses utilize methods such as word frequency statistics, co-occurrence analysis, community detection, and citation analysis to capture external quantitative features of words or documents. In contrast, the Latent Dirichlet Allocation theme modelling method employs a three-layer Bayesian structure of document-topic-word to describe the themes of documents and the semantic relationships among words, enabling a better exploration of latent semantic information in text. This method plays a pivotal role in fine-grained knowledge extraction and analysis. We systematically review more than a decade of relevant literature in the realm about library and information subject. Through content analysis, we construct an analytical architecture for the implementation of the Latent Dirichlet Allocation method. This architecture, viewed from the perspective of the implementation process of Latent Dirichlet Allocation, comprehensively summarizes the core stages and technical challenges, including text pre-processing, model construction (i.e., theme model selection and optimal theme number determination), and model solving. Additionally, we provide a comprehensive overview of the current study status of the Latent Dirichlet Allocation method across various implementation domains, such as theme exploration, knowledge organization, academic evaluation, sentiment analysis, and recommendation study. Our findings indicate that the Latent Dirichlet Allocation method has formed a mature analytical process in the realm of library and information subject, with ongoing growth in study interest.",
    "citationCount": 4,
    "referenceCount": 96
}