{
    "paperId": "f7e80febf4c5667a306d813963edfe8356cad77f",
    "title": "Adaptive Cost Model for Query Optimization",
    "year": 2024,
    "venue": "The Bulletin of Irkutsk State University. Series Mathematics",
    "authors": [
        "Nikita Vasilenko",
        "Alexander Demin",
        "Denis Ponomaryov"
    ],
    "doi": "10.48550/arXiv.2409.17136",
    "arxivId": "2409.17136",
    "url": "https://www.semanticscholar.org/paper/f7e80febf4c5667a306d813963edfe8356cad77f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The principal component of conventional database query optimizers is a cost model that is used to estimate expected performance of query plans. The accuracy of the cost model has direct impact on the optimality of execution plans selected by the optimizer and thus, on the resulting query latency. Several common parameters of cost models in modern DBMS are related to the performance of CPU and I/O and are typically set by a database administrator upon system tuning. However these performance characteristics are not stable and therefore, a single point estimation may not suffice for all DB load regimes. In this paper, we propose an Adaptive Cost Model (ACM) which dynamically optimizes CPU- and I/O-related plan cost parameters at DB runtime. By continuously monitoring query execution statistics and the state of DB buffer cache ACM adjusts cost parameters without the need for manual intervention from a database administrator. This allows for responding to changes in the workload and system performance ensuring more optimal query execution plans. We describe the main ideas in the implementation of ACM and report on a preliminary experimental evaluation showing 20% end-to-end latency improvement on TPC-H benchmark.",
    "citationCount": 3,
    "referenceCount": 16
}