{
    "paperId": "f7e81825937b46a9c28111ce9599c0379a78c677",
    "title": "Enhancing Sentiment Classification of Chinese Text with A Dynamic Weighted Voting Network",
    "year": 2024,
    "venue": "2024 5th International Conference on Big Data & Artificial Intelligence & Software Engineering (ICBASE)",
    "authors": [
        "Xuyi Lin",
        "Qiutong Shao",
        "Lei Kaung",
        "Hao Yang"
    ],
    "doi": "10.1109/ICBASE63199.2024.10762298",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f7e81825937b46a9c28111ce9599c0379a78c677",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "This paper presents a novel approach to sentiment analysis through the development of a dynamic weighted voting network, which integrates multiple advanced language models to enhance classification performance. Specifically, we combine the strengths of NEZHA, XLNet, and ERNIE, employing a dynamic weighting mechanism and a voting fusion strategy. The proposed network leverages the unique features of each model. We evaluate the effectiveness of our approach on two benchmark datasets: the SMP2020-EWECT for microblog sentiment analysis and the ChnSentiCorp dataset for sentiment classification of Chinese online reviews. Experimental results demonstrate significant improvements in accuracy and $F 1$ score compared to individual models and traditional methods. An ablation study further reveals the critical impact of dynamic weighting, voting fusion, and Bayesian optimization on model performance. The proposed method achieves state-of-the-art results in both datasets, showcasing its robustness and efficacy in handling complex sentiment classification tasks.",
    "citationCount": 1,
    "referenceCount": 21
}