{
    "paperId": "f844b967bf2a039fad4cbe5530747b05c201ef83",
    "title": "UQE: A Query Engine for Unstructured Databases",
    "year": 2024,
    "venue": "Neural Information Processing Systems",
    "authors": [
        "Hanjun Dai",
        "B. Wang",
        "Xingchen Wan",
        "Bo Dai",
        "Sherry Yang",
        "Azade Nova",
        "Pengcheng Yin",
        "P. Phothilimthana",
        "Charles Sutton",
        "D. Schuurmans"
    ],
    "doi": "10.48550/arXiv.2407.09522",
    "arxivId": "2407.09522",
    "url": "https://www.semanticscholar.org/paper/f844b967bf2a039fad4cbe5530747b05c201ef83",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Analytics on structured data is a mature field with many successful methods. However, most real world data exists in unstructured form, such as images and conversations. We investigate the potential of Large Language Models (LLMs) to enable unstructured data analytics. In particular, we propose a new Universal Query Engine (UQE) that directly interrogates and draws insights from unstructured data collections. This engine accepts queries in a Universal Query Language (UQL), a dialect of SQL that provides full natural language flexibility in specifying conditions and operators. The new engine leverages the ability of LLMs to conduct analysis of unstructured data, while also allowing us to exploit advances in sampling and optimization techniques to achieve efficient and accurate query execution. In addition, we borrow techniques from classical compiler theory to better orchestrate the workflow between sampling methods and foundation model calls. We demonstrate the efficiency of UQE on data analytics across different modalities, including images, dialogs and reviews, across a range of useful query types, including conditional aggregation, semantic retrieval and abstraction aggregation.",
    "citationCount": 13,
    "referenceCount": 49
}