{
    "paperId": "f8b5e79e0a5f4dc33b28930dace5166972dc694a",
    "title": "Inter-loop optimization in RAJA using loop chains",
    "year": 2021,
    "venue": "International Conference on Supercomputing",
    "authors": [
        "Brandon Neth",
        "T. Scogland",
        "B. Supinski",
        "M. Strout"
    ],
    "doi": "10.1145/3447818.3461665",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f8b5e79e0a5f4dc33b28930dace5166972dc694a",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1145/3447818.3461665",
    "publicationTypes": [
        "Book",
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Typical parallelization approaches such as OpenMP and CUDA provide constructs for parallelizing and blocking for data locality for individual loops. By focusing on each loop separately, these approaches fail to leverage sources of data locality possible due to inter-loop data reuse. The loop chain abstraction provides a framework for reasoning about and applying inter-loop optimizations. In this work, we incorporate the loop chain abstraction into RAJA, a performance portability layer for high-performance computing applications. Using the loop-chain-extended RAJA, or RAJALC, developers can have the RAJA library apply loop transformations like loop fusion and overlapped tiling while maintaining the original structure of their programs. By introducing targeted symbolic execution capabilities, we can collect and cache data access information required to verify loop transformations. We evaluate the performance improvement and refactoring costs of our extension. Overall, our results demonstrate 85-98\\% of the performance improvements of hand-optimized kernels with dramatically fewer code changes.",
    "citationCount": 2,
    "referenceCount": 62
}