{
    "paperId": "f8b95c16cc4d39ec60ff87ec1af9f3fa705d0a55",
    "title": "Hierarchical Multi-field Representations for Two-Stage E-commerce Retrieval",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Niklas Freymuth",
        "Dong Liu",
        "Thomas Ricatte",
        "Saab Mansour"
    ],
    "doi": "10.48550/arXiv.2501.18707",
    "arxivId": "2501.18707",
    "url": "https://www.semanticscholar.org/paper/f8b95c16cc4d39ec60ff87ec1af9f3fa705d0a55",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Dense retrieval methods typically target unstructured text data represented as flat strings. However, e-commerce catalogs often include structured information across multiple fields, such as brand, title, and description, which contain important information potential for retrieval systems. We present Cascading Hierarchical Attention Retrieval Model (CHARM), a novel framework designed to encode structured product data into hierarchical field-level representations with progressively finer detail. Utilizing a novel block-triangular attention mechanism, our method captures the interdependencies between product fields in a specified hierarchy, yielding field-level representations and aggregated vectors suitable for fast and efficient retrieval. Combining both representations enables a two-stage retrieval pipeline, in which the aggregated vectors support initial candidate selection, while more expressive field-level representations facilitate precise fine-tuning for downstream ranking. Experiments on publicly available large-scale e-commerce datasets demonstrate that CHARM matches or outperforms state-of-the-art baselines. Our analysis highlights the framework's ability to align different queries with appropriate product fields, enhancing retrieval accuracy and explainability.",
    "citationCount": 0,
    "referenceCount": 56
}