{
    "paperId": "f922841262b43507e8bfb224e3052aee3ca6c83e",
    "title": "Federated data analytics: A study on linear models",
    "year": 2022,
    "venue": "IISE Transactions",
    "authors": [
        "Xubo Yue",
        "R. Kontar",
        "Ana María Estrada Gómez"
    ],
    "doi": "10.1080/24725854.2022.2157912",
    "arxivId": "2206.07786",
    "url": "https://www.semanticscholar.org/paper/f922841262b43507e8bfb224e3052aee3ca6c83e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2206.07786",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract As edge devices become increasingly powerful, data analytics are gradually moving from a centralized to a decentralized regime where edge computing resources are exploited to process more of the data locally. This regime of analytics is coined as Federated Data Analytics (FDA). Despite the recent success stories of FDA, most literature focuses exclusively on deep neural networks. In this work, we take a step back to develop an FDA treatment for one of the most fundamental statistical models: linear regression. Our treatment is built upon hierarchical modeling that allows borrowing strength across multiple groups. To this end, we propose two federated hierarchical model structures that provide a shared representation across devices to facilitate information sharing. Notably, our proposed frameworks are capable of providing uncertainty quantification, variable selection, hypothesis testing, and fast adaptation to new unseen data. We validate our methods on a range of real-life applications, including condition monitoring for aircraft engines. The results show that our FDA treatment for linear models can serve as a competing benchmark model for the future development of federated algorithms.",
    "citationCount": 17,
    "referenceCount": 56
}