{
    "paperId": "f93ce66d2360e245bdb814abc7279f061c58446c",
    "title": "The Comparison of Word Embedding Techniques in RNNs for Vulnerability Detection",
    "year": 2021,
    "venue": "International Conference on Information Systems Security and Privacy",
    "authors": [
        "H. N. Nguyen",
        "Songpon Teerakanok",
        "A. Inomata",
        "T. Uehara"
    ],
    "doi": "10.5220/0010232301090120",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/f93ce66d2360e245bdb814abc7279f061c58446c",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.5220/0010232301090120",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Many studies have combined Deep Learning and Natural Language Processing (NLP) techniques in security systems in performing tasks such as bug detection, vulnerability prediction, or classification. Most of these works relied on NLP embedding methods to generate input vectors for the deep learning models. However, there are many existing embedding methods to encode software text files into vectors, and the structures of neural networks are immense and heuristic. This leads to a challenge for the researcher to choose the appropriate combination of embedding techniques and the model structure for training the vulnerability detection classifiers. For this task, we propose a system to investigate the use of four popular word embedding techniques combined with four different recurrent neural networks (RNNs), including both bidirectional RNNs (BRNNs) and unidirectional RNNs. We trained and evaluated the models by using two types of vulnerable function datasets written in C code. Our results showed that the FastText embedding technique combined with BRNNs produced the most efficient detection rate, compared to other combinations, on a real-world but not on an artificially-produced dataset. Further experiments on other datasets are necessary to confirm this result.",
    "citationCount": 9,
    "referenceCount": 29
}