{
    "paperId": "fa294a5ffabfdbf0017f0f7d40d901dd23c0b9c1",
    "title": "Strategies for Optimizing the Integration of Student Management and Curriculum Education Resources in Colleges and Universities Supported by Cloud Computing Platforms",
    "year": 2025,
    "venue": "Applied Mathematics and Nonlinear Sciences",
    "authors": [
        "Lei Lu"
    ],
    "doi": "10.2478/amns-2025-0298",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fa294a5ffabfdbf0017f0f7d40d901dd23c0b9c1",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Education",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Abstract Supported by cloud computing platform technology, this study proposes an optimization strategy for constructing a student management platform and a curriculum education resource management platform for colleges and universities. The decision tree algorithm construction in cloud computing technology has been improved to formulate functions related to student information management with the goal of minimizing support and confidence. Using encryption algorithms to design the secure storage function of educational resources, and designing the scheduling function of educational resources using cloud computing virtualization technology. With 50 students of the class of 2023 in the College of Physical Education and Health, University H, Zhejiang Province, China, as the research subjects, the practice of student management and course educational resources optimization was carried out. The total score of student management performance evaluation is 83.25, which is at a good evaluation level.The mean values of the four course objective achievement dimensions of knowledge integration, teaching ability, technology integration, and communication and cooperation of the 2023 class subjects are 7.83, 8.56, 8.86, and 9.01, respectively.Overall student management and course education resource optimization practice receives a high degree of recognition and satisfaction from the students.",
    "citationCount": 0,
    "referenceCount": 14
}