{
    "paperId": "fa3a953ec02e7e5ca4c23b63c85814727741d6b7",
    "title": "Making Strategic Choices in the Financial Markets: Including Deep Learning Models",
    "year": 2024,
    "venue": "2024 International Conference on Communication, Computer Sciences and Engineering (IC3SE)",
    "authors": [
        "Supriya Pathak",
        "Sri Hari V",
        "V. Divya Vani",
        "Manish Gupta",
        "Ajit Ashokrao Chandgude",
        "M. S. Vasu"
    ],
    "doi": "10.1109/IC3SE62002.2024.10593478",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fa3a953ec02e7e5ca4c23b63c85814727741d6b7",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The financial markets are highly competitive settings that are impacted by various factors and industries. Making the wrong choice can have a multiplicity of negative effects and set off a series of events that could destabilise the economy. Intelligent models have been employed as instruments to support financial market decision-making in recent years.The accessibility and availability of data has created new theoretical and computational hurdles as well as unseen changes in the finance systems. Financial markets have complex systems characteristics, making them hard to predict. While some recent research have attempted to predict financial markets using machine learning techniques, their performance in terms of financial returns has not been sufficient. We suggest using a 2 D- convolutional neural network (CNN) model to forecast the actions of financial markets. This strategy can eliminate biases induced by predetermined factors in technical indicators and the choosing of technical indications by constantly collecting features instead of utilising standard technical indicators that are predetermined. The results of the research show that CNN algorithm extracts more useful and flexible information than typical technical indicators and beats previous machine learning methods in regards to financial performance.",
    "citationCount": 1,
    "referenceCount": 23
}