{
    "paperId": "fa41eb7d4a882fec839475297af1c762e3900183",
    "title": "Optimizing Identification Time in Fingerprint Recognition Using Cuckoo Filter",
    "year": 2023,
    "venue": "2023 IEEE International Conference on Computer Vision and Machine Intelligence (CVMI)",
    "authors": [
        "Mayank Mishra",
        "Tanya Sahu",
        "Debanjan Sadhya"
    ],
    "doi": "10.1109/CVMI59935.2023.10465034",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fa41eb7d4a882fec839475297af1c762e3900183",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fingerprint recognition is a widely used method for biometric identification. However, matching fingerprints in large databases can be a slow and challenging process. This work proposes an indexing-based framework that uses the Cuckoo filter to overcome this issue. The approach involves initially generating a fixed-length feature vector using minutia cylinder code (MCC) from fingerprint images. These feature vectors are then hashed and stored in the Cuckoo filter, enabling efficient retrieval of query fingerprint templates and reducing the search space. The proposed method is evaluated and compared to the existing Bloom filter-based approach using the FVC-2002 fingerprint dataset. The results show that the proposed method achieves higher retrieval accuracy, lower equal error rate (EER) and faster query times compared to the existing Bloom filter-based approach. In the best case, we achieved a Genuine Match Rate (GMR) = 100% at a False match rate (FMR) = 0%, thus indicating a perfect model performance. Hence, our obtained results confirm the effectiveness of the proposed method for fingerprint identification.",
    "citationCount": 0,
    "referenceCount": 15
}