{
    "paperId": "fa4188bcc6728b580699f714a8a6fe5fc60d7dfe",
    "title": "Rethinking data-driven networking with foundation models: challenges and opportunities",
    "year": 2022,
    "venue": "ACM Workshop on Hot Topics in Networks",
    "authors": [
        "Franck Le",
        "M. Srivatsa",
        "R. Ganti",
        "Vyas Sekar"
    ],
    "doi": "10.1145/3563766.3564109",
    "arxivId": "2211.06494",
    "url": "https://www.semanticscholar.org/paper/fa4188bcc6728b580699f714a8a6fe5fc60d7dfe",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Foundational models have caused a paradigm shift in the way artificial intelligence (AI) systems are built. They have had a major impact in natural language processing (NLP), and several other domains, not only reducing the amount of required labeled data or even eliminating the need for it, but also significantly improving performance on a wide range of tasks. We argue foundation models can have a similar profound impact on network traffic analysis, and management. More specifically, we show that network data shares several of the properties that are behind the success of foundational models in linguistics. For example, network data contains rich semantic content, and several of the networking tasks (e.g., traffic classification, generation of protocol implementations from specification text, anomaly detection) can find similar counterparts in NLP (e.g., sentiment analysis, translation from natural language to code, out-of-distribution). However, network settings also present unique characteristics and challenges that must be overcome. Our contribution is in highlighting the opportunities and challenges at the intersection of foundation models and networking.",
    "citationCount": 18,
    "referenceCount": 109
}