{
    "paperId": "fac508493a79496062029b1d3458176acd72c6a8",
    "title": "Intent-Driven Storage Systems: From Low-Level Tuning to High-Level Understanding",
    "year": 2025,
    "venue": "",
    "authors": [
        "S. Bergman",
        "Won Wook Song",
        "Lukas Cavigelli",
        "Konstantin Berestizshevsky",
        "Ke Zhou",
        "Ji Zhang"
    ],
    "doi": null,
    "arxivId": "2510.15917",
    "url": "https://www.semanticscholar.org/paper/fac508493a79496062029b1d3458176acd72c6a8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Existing storage systems lack visibility into workload intent, limiting their ability to adapt to the semantics of modern, large-scale data-intensive applications. This disconnect leads to brittle heuristics and fragmented, siloed optimizations. To address these limitations, we propose Intent-Driven Storage Systems (IDSS), a vision for a new paradigm where large language models (LLMs) infer workload and system intent from unstructured signals to guide adaptive and cross-layer parameter reconfiguration. IDSS provides holistic reasoning for competing demands, synthesizing safe and efficient decisions within policy guardrails. We present four design principles for integrating LLMs into storage control loops and propose a corresponding system architecture. Initial results on FileBench workloads show that IDSS can improve IOPS by up to 2.45X by interpreting intent and generating actionable configurations for storage components such as caching and prefetching. These findings suggest that, when constrained by guardrails and embedded within structured workflows, LLMs can function as high-level semantic optimizers, bridging the gap between application goals and low-level system control. IDSS points toward a future in which storage systems are increasingly adaptive, autonomous, and aligned with dynamic workload demands.",
    "citationCount": 0,
    "referenceCount": 66
}