{
    "paperId": "fae76255d75d81cc46f5c2ad22d61413f77576e0",
    "title": "Competitive Algorithms for Block-Aware Caching",
    "year": 2022,
    "venue": "ACM Symposium on Parallelism in Algorithms and Architectures",
    "authors": [
        "Christian Coester",
        "Roie Levin",
        "J. Naor",
        "Ohad Talmon"
    ],
    "doi": "10.1145/3490148.3538567",
    "arxivId": "2205.12249",
    "url": "https://www.semanticscholar.org/paper/fae76255d75d81cc46f5c2ad22d61413f77576e0",
    "isOpenAccess": true,
    "openAccessPdf": "https://ora.ox.ac.uk/objects/uuid:9d8ffdd0-30de-4ce8-af20-5793cc750bb2/files/s2514nm91b",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Motivated by the design of real system storage hierarchies, we study the block-aware caching problem, a generalization of classic caching in which fetching (or evicting) pages from the same block incurs the same cost as fetching (or evicting) just one page from the block. Given a cache of size k, and a sequence of requests from n pages partitioned into given blocks of size β ≤ k, the goal is to minimize the total cost of fetching to (or evicting from) cache. This problem captures generalized caching as a special case, which is already NP-hard offline. We show the following suite of results: For the eviction cost model, we show an O(log k)-approximate offline algorithm, a k-competitive deterministic online algorithm, and an O(log2 k)-competitive randomized online algorithm. For the fetching cost model, we show an integrality gap of Ω(β) for the natural LP relaxation of the problem, and an Ω(β +log k) lower bound for randomized online algorithms. The strategy of ignoring the block-structure and running a classical paging algorithm trivially achieves an O(β) approximation and an O(β log k) competitive ratio respectively for the offline and online-randomized setting. For both fetching and eviction models, we show improved bounds for the (h, k)-bicriteria version of the problem. In particular, when k = 2h, we match the performance of classical caching algorithms up to constant factors. Our results establish a strong separation between the tractability of the fetching and eviction cost models, which is interesting since fetching/eviction costs are the same up to an additive term for the classic caching problem. Previous work of Beckmann et al. (SPAA 21) only studied online deterministic algorithms for the fetching cost model when k > h. Our insight is to relax the block-aware caching problem to a submodular covering linear program. The main technical challenge is to maintain a competitive fractional solution to this LP, and to round it with bounded loss, as the constraints of this LP are revealed online. We hope that this framework is useful going forward for other problems that can be captured as submodular cover.",
    "citationCount": 4,
    "referenceCount": 35
}