{
    "paperId": "faf836b6640f5e807e00332e108a216b5514628e",
    "title": "Efficient Data Trading and Storage in Internet of Vehicles using Consortium Blockchain",
    "year": 2020,
    "venue": "International Conference on Wireless Communications and Mobile Computing",
    "authors": [
        "A. Sadiq",
        "N. Javaid",
        "Samuel Omaji",
        "Adia Khalid",
        "Noman Haider",
        "M. Imran"
    ],
    "doi": "10.1109/IWCMC48107.2020.9148188",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/faf836b6640f5e807e00332e108a216b5514628e",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The radically increasing amount and enormous types of data generated by vehicles have brought in the innovated application of data trading in the Internet of Vehicles (IoV). However, the trustless environment in IoV enabled data trading faces conflicting interests and disputes of trading parties. To build trust, we exploit consortium blockchain for secure data trading with information transparency. In addition, a hash list of traded data is maintained by roadside units accompanied by bloom filters for fast lookup, to avoid data duplication. The reliability and integrity of trading data are ensured by using the digital signature scheme based on elliptic curve bilinear pairing. For long term availability of traded data, an external distributed storage, i.e., InterPlanetary File System (IPFS) can provide reliable, high capacity storage resources. The experimental results verified that our proposed solution is efficient for data trading in IoV and reliable for long term availability of data storage.",
    "citationCount": 10,
    "referenceCount": 30
}