{
    "paperId": "fb292a3b4e20cd52fc4355930499c763e159d288",
    "title": "Exploiting Hybrid Index Scheme for RDMA-based Key-Value Stores",
    "year": 2023,
    "venue": "Annual Haifa Experimental Systems Conference",
    "authors": [
        "Shukai Han",
        "Mi Zhang",
        "D. Jiang",
        "Jin Xiong"
    ],
    "doi": "10.1145/3579370.3594768",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fb292a3b4e20cd52fc4355930499c763e159d288",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3579370.3594768",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "RDMA (Remote Direct Memory Access) is widely studied in building key-value stores to achieve ultra-low latency. In RDMA-based key-value stores, the indexing time takes a large fraction of the overall operation latency as RDMA enables fast data access. However, the single index structure used in existing RDMA-based key-value stores, either hash-based or sorted index, fails to support range queries efficiently while achieving high performance for singlepoint operations. In this paper, we explore the adoption of a hybrid index in the key-value stores based on RDMA, especially under the memory disaggregation architecture, to combine the benefits of a hash table and a sorted index. We propose HStore, an RDMA-based key-value store that uses a hash table for single-point lookups and leverages a skiplist for range queries to index the values stored in the memory pool. Guided by previous work on using RDMA for key-value services, HStore dedicatedly chooses different RDMA verbs to optimize the read and write performance. To efficiently keep the index structures within a hybrid index consistent, HStore asynchronously applies the updates to the sorted index by shipping the update log via two-sided verbs. Compared to state-of-the-art Sherman and Clover, HStore improves the throughput by up to 54.5% and 38.5% respectively under the YCSB benchmark.",
    "citationCount": 3,
    "referenceCount": 42
}