{
    "paperId": "fb394a36af8d23a7b3116287ac343c9d3da5b6d0",
    "title": "A Cloud‐Based Geoprocessing Platform Based on Extended OGC API‐Processes Standard and PyQGIS",
    "year": 2025,
    "venue": "Trans. GIS",
    "authors": [
        "Mingda Zhang",
        "Zhihong Guo",
        "Panpan Li",
        "Lei Hu",
        "Yun Qiao",
        "Hong Wang",
        "Xin Mei",
        "Hanhui Yan",
        "Zeqiang Chen"
    ],
    "doi": "10.1111/tgis.70094",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fb394a36af8d23a7b3116287ac343c9d3da5b6d0",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid development of web technologies has enabled cloud‐based geospatial platforms to offer efficient and widely accessible geospatial data sharing and processing. While many open‐source GIS software provide rich geoprocessing operators, they are often limited to desktop environments. A gap exists in using various open‐source GIS software within a cloud‐based geospatial platform in a standardized way. To address this issue, we present an efficient approach to enhance geoprocessing capabilities in a cloud‐based geospatial platform using the OGC API‐Processes standard and the PyQGIS framework. PyQGIS can invoke various open‐source GIS software in a unified way, including QGIS, GRASS GIS, SAGA GIS, and Orfeo ToolBox. OGC API‐Processes Standard provides interfaces and descriptions for using these operators in a web environment. Our approach simplifies the deployment of open‐source GIS operators in cloud‐based platforms. Users can invoke heterogeneous geoprocessing operators synchronously or asynchronously and trace provenance information as needed. We also provide an open‐source graphical user interface (GUI) for interacting with cloud‐based platforms. The proposed approach adheres to FAIR (Findable, Accessible, Interoperable, Reusable) principles and effectively strengthens the analytical capabilities of cloud‐based geospatial platforms.",
    "citationCount": 0,
    "referenceCount": 52
}