{
    "paperId": "fb55962da73ceeaa99461f8896b6c970c66b4f72",
    "title": "Query Join Order Optimization Method Based on Dynamic Double Deep Q-Network",
    "year": 2023,
    "venue": "Electronics",
    "authors": [
        "Lixia Ji",
        "Runzhe Zhao",
        "Yiping Dang",
        "Junxiu Liu",
        "Han Zhang"
    ],
    "doi": "10.3390/electronics12061504",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fb55962da73ceeaa99461f8896b6c970c66b4f72",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/12/6/1504/pdf?version=1679489002",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A join order directly affects database query performance and computational overhead. Deep reinforcement learning (DRL) can explore efficient query plans while not exhausting the search space. However, the deep Q network (DQN) suffers from the overestimation of action values in query optimization, which can lead to limited query performance. In addition, ε-greedy exploration is not efficient enough and does not enable deep exploration. Accordingly, in this paper, we propose a dynamic double DQN (DDQN) order selection method(DDOS) for join order optimization. First, the method models the join query as a Markov decision process (MDP), then solves the DRL model by integrating the network model DQN and DDQN weighting into the DRL model’s estimation error problem in query joining, and finally improves the quality of developing query plans. And actions are selected using a dynamic progressive search strategy to improve the randomness and depth of exploration and accumulate a high information gain of exploration. The performance of the proposed method is compared with those of dynamic programming, heuristic algorithms, and DRL optimization methods based on the query set Join Order Benchmark (JOB). The experimental results show that the proposed method can effectively improve the query performance with a favorable generalization ability and robustness, and outperforms other baselines in multi-join query applications.",
    "citationCount": 4,
    "referenceCount": 36
}