{
    "paperId": "fb76b845f123297154f83b11f493f2ed78073bb4",
    "title": "Towards An Efficient and Effective En Route Travel Time Estimation Framework",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zekai Shen",
        "Haitao Yuan",
        "Xiaowei Mao",
        "Congkang Lv",
        "S. Guo",
        "Youfang Lin",
        "Huaiyu Wan"
    ],
    "doi": "10.48550/arXiv.2504.04086",
    "arxivId": "2504.04086",
    "url": "https://www.semanticscholar.org/paper/fb76b845f123297154f83b11f493f2ed78073bb4",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "En route travel time estimation (ER-TTE) focuses on predicting the travel time of the remaining route. Existing ER-TTE methods always make re-estimation which significantly hinders real-time performance, especially when faced with the computational demands of simultaneous user requests. This results in delays and reduced responsiveness in ER-TTE services. We propose a general efficient framework U-ERTTE combining an Uncertainty-Guided Decision mechanism (UGD) and Fine-Tuning with Meta-Learning (FTML) to address these challenges. UGD quantifies the uncertainty and provides confidence intervals for the entire route. It selectively re-estimates only when the actual travel time deviates from the predicted confidence intervals, thereby optimizing the efficiency of ER-TTE. To ensure the accuracy of confidence intervals and accurate predictions that need to re-estimate, FTML is employed to train the model, enabling it to learn general driving patterns and specific features to adapt to specific tasks. Extensive experiments on two large-scale real datasets demonstrate that the U-ERTTE framework significantly enhances inference speed and throughput while maintaining high effectiveness. Our code is available at https://github.com/shenzekai/U-ERTTE",
    "citationCount": 3,
    "referenceCount": 30
}