{
    "paperId": "fb793d1ebf690d93af2467cfe71be95a6c619e61",
    "title": "Self-Healing in Cyber-Physical Systems Using Machine Learning: A Critical Analysis of Theories and Tools",
    "year": 2023,
    "venue": "Future Internet",
    "authors": [
        "Obinna Johnphill",
        "A. Sadiq",
        "Feras N. Al-Obeidat",
        "Haider Al-Khateeb",
        "Mohammed Adam Taheir",
        "Omprakash Kaiwartya",
        "Mohammed Ali"
    ],
    "doi": "10.3390/fi15070244",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fb793d1ebf690d93af2467cfe71be95a6c619e61",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1999-5903/15/7/244/pdf?version=1689739374",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The rapid advancement of networking, computing, sensing, and control systems has introduced a wide range of cyber threats, including those from new devices deployed during the development of scenarios. With recent advancements in automobiles, medical devices, smart industrial systems, and other technologies, system failures resulting from external attacks or internal process malfunctions are increasingly common. Restoring the system’s stable state requires autonomous intervention through the self-healing process to maintain service quality. This paper, therefore, aims to analyse state of the art and identify where self-healing using machine learning can be applied to cyber–physical systems to enhance security and prevent failures within the system. The paper describes three key components of self-healing functionality in computer systems: anomaly detection, fault alert, and fault auto-remediation. The significance of these components is that self-healing functionality cannot be practical without considering all three. Understanding the self-healing theories that form the guiding principles for implementing these functionalities with real-life implications is crucial. There are strong indications that self-healing functionality in the cyber–physical system is an emerging area of research that holds great promise for the future of computing technology. It has the potential to provide seamless self-organising and self-restoration functionality to cyber–physical systems, leading to increased security of systems and improved user experience. For instance, a functional self-healing system implemented on a power grid will react autonomously when a threat or fault occurs, without requiring human intervention to restore power to communities and preserve critical services after power outages or defects. This paper presents the existing vulnerabilities, threats, and challenges and critically analyses the current self-healing theories and methods that use machine learning for cyber–physical systems.",
    "citationCount": 26,
    "referenceCount": 22
}