{
    "paperId": "fbaccad3726a81e87b230a1ab820980aca38dc2d",
    "title": "A Highly Functional Ensemble of Improved Chaos Sparrow Search Optimization Algorithm and Enhanced Sun Flower Optimization Algorithm for Query Optimization in Big Data",
    "year": 2025,
    "venue": "International Journal of Advanced Computer Science and Applications",
    "authors": [
        "Mursubai Sandhya",
        "Dr. N. Raghavendra Sai"
    ],
    "doi": "10.14569/ijacsa.2025.0160112",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fbaccad3726a81e87b230a1ab820980aca38dc2d",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.14569/ijacsa.2025.0160112",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "— Numerous systems have to provide the highest level of performance feasible to their users due to the present accessibility of enormous datasets and scalability needs. Efficiency in big data is measurable in terms of the speed at which queries are executed physically. It is too demanding on big data for queries to be executed on time to satisfy users' needs. The query optimizer, one of the critical parts of big data that selects the best query execution plan and subsequently influences the query execution duration, is the primary focus of this research. Therefore, a well-designed query enables the user to obtain results in the required time and enhances the credibility of the associated application. This research suggested an enhanced query optimizing method for big data (BD) utilizing the ICSSOA-ESFOA algorithm (Improved Chaos Sparrow Search Optimization Algorithm-Enhanced Sun Flower Optimization algorithm) with HDFS Map Reduce to avoid the challenges associated with the optimization of queries. The essential features are extracted by employing the ResNet50V2 approach. Effective data arrangement is necessary for making sense of large and complex datasets. For this purpose, we ensemble Density-Based Spatial Clustering of Applications with Noise (DBSCAN) and Improved Spectral Clustering (ISC). The experimental findings demonstrate a significant benefit of the proposed strategy over the present optimization of the queries paradigm, and the proposed approach obtains less execution time and memory consumption. The experimental results show that the proposed strategy significantly outperforms the current optimization paradigm, reaching 99.5% accuracy, 29.4 seconds of execution time, and 450 MB less memory use.",
    "citationCount": 0,
    "referenceCount": 25
}