{
    "paperId": "fbb87e32fd63ae980c0ff6cf6878fd5e4d7bda1d",
    "title": "Sequential Recommendation with Graph Neural Networks",
    "year": 2021,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Jianxin Chang",
        "Chen Gao",
        "Y. Zheng",
        "Yiqun Hui",
        "Yanan Niu",
        "Yang Song",
        "Depeng Jin",
        "Yong Li"
    ],
    "doi": "10.1145/3404835.3462968",
    "arxivId": "2106.14226",
    "url": "https://www.semanticscholar.org/paper/fbb87e32fd63ae980c0ff6cf6878fd5e4d7bda1d",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2106.14226",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Sequential recommendation aims to leverage users' historical behaviors to predict their next interaction. Existing works have not yet addressed two main challenges in sequential recommendation. First, user behaviors in their rich historical sequences are often implicit and noisy preference signals, they cannot sufficiently reflect users' actual preferences. In addition, users' dynamic preferences often change rapidly over time, and hence it is difficult to capture user patterns in their historical sequences. In this work, we propose a graph neural network model called SURGE (short forSeqUential Recommendation with Graph neural nEtworks) to address these two issues. Specifically, SURGE integrates different types of preferences in long-term user behaviors into clusters in the graph by re-constructing loose item sequences into tight item-item interest graphs based on metric learning. This helps explicitly distinguish users' core interests, by forming dense clusters in the interest graph. Then, we perform cluster-aware and query-aware graph convolutional propagation and graph pooling on the constructed graph. It dynamically fuses and extracts users' current activated core interests from noisy user behavior sequences. We conduct extensive experiments on both public and proprietary industrial datasets. Experimental results demonstrate significant performance gains of our proposed method compared to state-of-the-art methods. Further studies on sequence length confirm that our method can model long behavioral sequences effectively and efficiently.",
    "citationCount": 390,
    "referenceCount": 50
}