{
    "paperId": "fc5a3c3b1584aad275ff3d6c5dc2bcdcba4410e2",
    "title": "CHEMICAL INSIGHTS: QUANTUM TECHNOLOGY REDEFINES COMPUTATIONAL DRUG DEVELOPMENT",
    "year": 2025,
    "venue": "Indian drugs",
    "authors": [
        "Mihir Arora",
        "Roshan Tathed",
        "Preeti Kulkarni",
        "Minal R. Ghante",
        "Vasundhara N. Sawant"
    ],
    "doi": "10.53879/id.62.03.15106",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fc5a3c3b1584aad275ff3d6c5dc2bcdcba4410e2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Drug discovery and development an exclusively time and resources consuming technique. Computer aided drug discovery process minimizes the wet lab experiments and makes the process more economical. In this review, we outline the fundamental procedures involved in the drug discovery process and the role of quantum computing aids in the selection of promising therapeutic candidates. Quantum computing can simulate interactions between molecules more authentically, and during drug design stage, it enables to predict the activity and safety of drug molecules more precisely. Pharmaceutical business has potential to undergo a revolution with the help of quantum computing, which opens up new possibilities for computational methods that conventional computers could find difficult. However, ethical concerns in this regard are equally important while exploring the world of quantum computation in drug development. Managing potential toxicity of quantum dots, assuring fair access to quantum-driven treatments, navigating competitive contexts and protecting genetic privacy are essential considerations.",
    "citationCount": 0,
    "referenceCount": 74
}