{
    "paperId": "fc67746ae413c08bda03bc6ec330da150c2805ba",
    "title": "Spatial embedding: a generic machine learning model for spatial query optimization",
    "year": 2022,
    "venue": "SIGSPATIAL/GIS",
    "authors": [
        "A. Belussi",
        "S. Migliorini",
        "Ahmed Eldawy"
    ],
    "doi": "10.1145/3557915.3560960",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fc67746ae413c08bda03bc6ec330da150c2805ba",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine learning and deep learning techniques are increasingly applied to produce efficient query optimizers, in particular in regards to big data systems. The optimization of spatial operations is even more challenging due to the inherent complexity of such kind of operations, like spatial join, range queries, and the peculiarities of spatial data. Even though a few ML-based spatial query optimizers have been proposed in literature, their design limits their use, since each one is tailored for a specific collection of datasets, a specific operation, or specific a hardware. Changes to any of these will require building and training a completely new model which entails collecting a new very large training data to obtain a good model This paper proposes a new approach for ML-based query optimization which exploits the use of the novel notion of spatial embedding for overcoming these limitations. In particular, a preliminary model is defined which captures the relevant features of spatial datasets, independently from the operation to be optimized and in an unsupervised manner. Given that, a specialized model for the optimization of each spatial operation can be trained by using spatial embeddings as input, so the cost of building the first model can be amortized and a smaller training set is required for the specialized ones.",
    "citationCount": 5,
    "referenceCount": 21
}