{
    "paperId": "fc74fe92fb9e34d3ae1237bf9a6e718c723f4f3e",
    "title": "FiD-Light: Efficient and Effective Retrieval-Augmented Text Generation",
    "year": 2022,
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "authors": [
        "Sebastian Hofstätter",
        "Jiecao Chen",
        "K. Raman",
        "Hamed Zamani"
    ],
    "doi": "10.1145/3539618.3591687",
    "arxivId": "2209.14290",
    "url": "https://www.semanticscholar.org/paper/fc74fe92fb9e34d3ae1237bf9a6e718c723f4f3e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2209.14290",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Retrieval-augmented generation models offer many benefits over standalone language models: besides a textual answer to a given query they provide provenance items retrieved from an updateable knowledge base. However, they are also more complex systems and need to handle long inputs. In this work, we introduce FiD-Light to strongly increase the efficiency of the state-of-the-art retrieval-augmented FiD model, while maintaining the same level of effectiveness. Our FiD-Light model constrains the information flow from the encoder (which encodes passages separately) to the decoder (using concatenated encoded representations). Furthermore, we adapt FiD-Light with re-ranking capabilities through textual source pointers, to improve the top-ranked provenance precision. Our experiments on a diverse set of seven knowledge intensive tasks (KILT) show FiD-Light consistently improves the Pareto frontier between query latency and effectiveness. FiD-Light with source pointing sets substantial new state-of-the-art results on six KILT tasks for combined text generation and provenance retrieval evaluation, while maintaining high efficiency.",
    "citationCount": 100,
    "referenceCount": 57
}