{
    "paperId": "fc7ff0229c7d31506eef3f64f546b7b8a2544b8b",
    "title": "RobOpt: A Tool for Robust Workload Optimization Based on Uncertainty-Aware Machine Learning",
    "year": 2024,
    "venue": "SIGMOD Conference Companion",
    "authors": [
        "Amin Kamali",
        "Verena Kantere",
        "C. Zuzarte",
        "Vincent Corvinelli"
    ],
    "doi": "10.1145/3626246.3654755",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fc7ff0229c7d31506eef3f64f546b7b8a2544b8b",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Relational database management systems (RDBMSs) employ query optimizers to search for execution plans deemed optimal for specific queries. Classical optimizers rely on inaccurate parameter estimates and assumptions that may not hold true in real-world scenarios. Consequently, suboptimal execution plans may be chosen, leading to poor query execution performance. Recent proposals of learned query optimizers that leverage Machine Learning suffer also from the selection of suboptimal plans. In order to fill this gap, we have created Robust Workload Optimization (RobOpt), a prototype tool that facilitates robust execution of a query workload in RDBMSs. It implements a novel technique that takes workload logs as input, generates training samples, and trains a risk-aware learned cost model. It optimizes risk-aware plan selection strategies to achieve a desired level of runtime performance and robustness. In addition, it analyzes a workload according to its training samples and determines an optimal plan selection strategy either at the workload or query level. Ultimately, it enables the robust execution of any workload by determining an optimal plan selection strategy per query. RobOpt can work on top of any RDBMS.",
    "citationCount": 3,
    "referenceCount": 15
}