{
    "paperId": "fc8f99a070d80400349317c2571e32bc89229be2",
    "title": "LOOPer: A Learned Automatic Code Optimizer For Polyhedral Compilers",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Massinissa Merouani",
        "Khaled Afif Boudaoud",
        "Iheb Nassim Aouadj",
        "Nassim Tchoulak",
        "Islam Kara Bernou",
        "Hamza Benyamina",
        "F. B. Tayeb",
        "K. Benatchba",
        "Hugh Leather",
        "Riyadh Baghdadi"
    ],
    "doi": "10.48550/arXiv.2403.11522",
    "arxivId": "2403.11522",
    "url": "https://www.semanticscholar.org/paper/fc8f99a070d80400349317c2571e32bc89229be2",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "While polyhedral compilers have shown success in implementing advanced code transformations, they still face challenges in selecting the ones that lead to the most profitable speedups. This has motivated the use of machine learning based cost models to guide the search for polyhedral optimizations. State-of-the-art polyhedral compilers have demonstrated a viable proof-of-concept of such an approach. While promising, this approach still faces significant limitations. State-of-the-art polyhedral compilers that use a deep learning cost model only support a small subset of affine transformations, limiting their ability to explore complex code transformations. Furthermore, their applicability does not scale beyond simple programs, thus excluding many program classes from their scope, such as those with non-rectangular iteration domains or multiple loop nests. These limitations significantly impact the generality of such compilers and autoschedulers and put into question the whole approach. In this paper, we introduce LOOPer, the first polyhedral autoscheduler that uses a deep learning based cost model and covers a large space of affine transformations and programs. LOOPer allows the optimization of an extensive set of programs while being effective at applying complex sequences of polyhedral transformations. We implement and evaluate LOOPer and show that it achieves competitive speedups over the state-of-the-art. On the PolyBench benchmarks, LOOPer achieves a geometric mean speedup of 1.84x over Tiramisu and 1.42x over Pluto, two state-of-the-art polyhedral autoschedulers.",
    "citationCount": 4,
    "referenceCount": 39
}