{
    "paperId": "fd3c8bc274062fed9a6a43e61aeecbe33c2187ad",
    "title": "Machine Learning with Evolutionary Parameter Tuning for Singing Registers Classification",
    "year": 2025,
    "venue": "Signals",
    "authors": [
        "Tales H. A. Boratto",
        "Gabriel de Oliveira Costa",
        "Alexsandro Meireles",
        "Anna Klara Sá Teles Rocha Alves",
        "C. Saporetti",
        "Matteo Bodini",
        "A. Cury",
        "L. Goliatt"
    ],
    "doi": "10.3390/signals6010009",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fd3c8bc274062fed9a6a43e61aeecbe33c2187ad",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.3390/signals6010009",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Behind human voice production, a complex biological mechanism generates and modulates sound. Recent research has explored machine-learning (ML) techniques to analyze singing-voice characteristics. However, the classification efficiency reported in such research works suggests the possibility of improvement. In addition, there is also scope for further improvement through the application of still under-utilized optimization techniques. Thus, the present article proposes a novel approach that leverages the Differential Evolution (DE) algorithm to optimize hyperparameters within three selected ML models, with the aim of classifying singing-voice registers i.e., chest, mixed, and head registers). To develop the present study, a dataset of 350 audio files encompassing the three aforementioned registers was constructed. Then, the TSFEL Python library was employed to extract 14 pieces of temporal information from the audio signals for subsequent classification by the employed ML models. The obtained findings demonstrated that the Extreme Gradient Boosting model, optimized with DE, achieved an average classification accuracy of 97.60%, thus indicating the efficacy of the proposed approach for singing-voice register classification.",
    "citationCount": 1,
    "referenceCount": 48
}