{
    "paperId": "fd6315ee7a3568d00666ba19ad846eae1fcb4142",
    "title": "Leveraging Large Language Models for Activity Recognition in Smart Environments",
    "year": 2024,
    "venue": "International Conference on Activity and Behavior Computing",
    "authors": [
        "Ian Cleland",
        "Luke Nugent",
        "F. Cruciani",
        "Chris D. Nugent"
    ],
    "doi": "10.1109/ABC61795.2024.10651718",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fd6315ee7a3568d00666ba19ad846eae1fcb4142",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Techniques for sensor based human activity recognition (HAR) in smart environments are continuing to evolve. Current leading methods rely on data-driven strategies, notably traditional machine learning and deep learning. However, these approaches rely heavily on access to large, high quality labelled datasets. Furthermore, these approaches tend not to generalise well to new or changing environments and cannot be extended to new activities. This study proposes leveraging Large Language Models (LLMs) to bolster the generalisation of HAR systems. Our approach uses the contextual comprehension and language modelling capabilities of LLMs. Using cutting-edge LLMs like ChatGPT 3.5, Vicuna, and fine-tuned BERT, we process natural language strings, extracted from binary sensor data, describing activities undertaken in a smart environment. Experimental results on the Van Kasteren dataset showcase the efficacy of our method in classifying activities. The finetuned BERT model achieved an F1-Score of 74.6%, which is comparable to traditional ML approaches (79.4%). This research highlights the potential of LLMs in enhancing smart home activity recognition, with future research focusing on few-shot learning and generalisation across varied environments.",
    "citationCount": 13,
    "referenceCount": 21
}