{
    "paperId": "fd6a5fd4aa43d416ebd5ff85cfd10467c65cefd2",
    "title": "Vertical, Temporal, and Horizontal Scaling of Hierarchical Hypersparse GraphBLAS Matrices",
    "year": 2021,
    "venue": "IEEE Conference on High Performance Extreme Computing",
    "authors": [
        "J. Kepner",
        "Tim Davis",
        "C. Byun",
        "W. Arcand",
        "David Bestor",
        "William Bergeron",
        "V. Gadepally",
        "M. Hubbell",
        "Michael Houle",
        "Michael Jones",
        "Anna Klein",
        "Lauren Milechin",
        "J. Mullen",
        "Andrew Prout",
        "A. Reuther",
        "Antonio Rosa",
        "S. Samsi",
        "Charles Yee",
        "P. Michaleas"
    ],
    "doi": "10.1109/HPEC49654.2021.9622802",
    "arxivId": "2108.06650",
    "url": "https://www.semanticscholar.org/paper/fd6a5fd4aa43d416ebd5ff85cfd10467c65cefd2",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2108.06650",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Hypersparse matrices are a powerful enabler for a variety of network, health, finance, and social applications. Hierarchical hypersparse GraphBLAS matrices enable rapid streaming updates while preserving algebraic analytic power and convenience. In many contexts, the rate of these updates sets the bounds on performance. This paper explores hierarchical hypersparse update performance on a variety of hardware with identical software configurations. The high-level language bindings of the GraphBLAS readily enable performance experiments on simultaneous diverse hardware. The best single process performance measured was 4,000,000 updates per second. The best single node performance measured was 170,000,000 updates per second. The hardware used spans nearly a decade and allows a direct comparison of hardware improvements for this computation over this time range; showing a 2x increase in single-core performance, a 3x increase in single process performance, and a 5x increase in single node performance. Running on nearly 2,000 MIT SuperCloud nodes simultaneously achieved a sustained update rate of over 200,000,000,000 updates per second. Hierarchical hypersparse GraphBLAS allows the MIT SuperCloud to analyze extremely large streaming network data sets.",
    "citationCount": 4,
    "referenceCount": 32
}