{
    "paperId": "fd8b0294079eba50c628bf56041ffc5bb1338c1d",
    "title": "Direct Telemetry Access",
    "year": 2022,
    "venue": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication",
    "authors": [
        "Jonatan Langlet",
        "Ran Ben Basat",
        "Gabriele Oliaro",
        "M. Mitzenmacher",
        "Minlan Yu",
        "G. Antichi"
    ],
    "doi": "10.1145/3603269.3604827",
    "arxivId": "2202.02270",
    "url": "https://www.semanticscholar.org/paper/fd8b0294079eba50c628bf56041ffc5bb1338c1d",
    "isOpenAccess": true,
    "openAccessPdf": "https://re.public.polimi.it/bitstream/11311/1253584/1/direct-telemetry-access.pdf",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Fine-grained network telemetry is becoming a modern datacenter standard and is the basis of essential applications such as congestion control, load balancing, and advanced troubleshooting. As network size increases and telemetry gets more fine-grained, there is a tremendous growth in the amount of data needed to be reported from switches to collectors to enable network-wide view. As a consequence, it is progressively hard to scale data collection systems. We introduce Direct Telemetry Access (DTA), a solution optimized for aggregating and moving hundreds of millions of reports per second from switches into queryable data structures in collectors' memory. DTA is lightweight and it is able to greatly reduce overheads at collectors. DTA is built on top of RDMA, and we propose novel and expressive reporting primitives to allow easy integration with existing state-of-the-art telemetry mechanisms such as INT or Marple. We show that DTA significantly improves telemetry collection rates. For example, when used with INT, it can collect and aggregate over 400M reports per second with a single server, improving over the Atomic MultiLog by up to 16x.",
    "citationCount": 23,
    "referenceCount": 105
}