{
    "paperId": "fd938266cd5ec384fbf7f508264c460dbf418874",
    "title": "Research on Database Query Optimization using Deep Q Networks based Decision Tree",
    "year": 2025,
    "venue": "2025 3rd International Conference on Data Science and Information System (ICDSIS)",
    "authors": [
        "M. Habelalmateen",
        "Abdul Jabbar",
        "HN Manjunath",
        "T. Aditya",
        "Sai Srinivas",
        "th M . Ganesh Karthik"
    ],
    "doi": "10.1109/ICDSIS65355.2025.11070861",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fd938266cd5ec384fbf7f508264c460dbf418874",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In recent days, database management has been undergoing an unprecedented transformation which are driven by exponential growth of data. However, traditional approaches for database query management had faced challenges like stuck in local optima and curse of dimensionality. Therefore, this research proposes Deep Q Network based Decision Tree (DQN based DT) for enhancing database query optimization. Initially, data is collected from Transaction Processing Performance Council (TPCH) benchmark dataset which consists of 22 tables including customer, orders, lineitem, supplier. Then, the collected data is preprocessed by using one-hot encoding to transform data into a suitable format by reducing dimensionality and min-max normalization for scaling numeric features to a common range [0,1]. After that, query optimization is done by using DQN which learns to select optimal query plans by maximizing cumulative rewards and minimizing execution time as well as costs. Finally, DT is utilized for predicting query execution time and identifying potential performance constraints in query plan which enabled proactive optimization. The proposed DQN based DT achieved better results in terms of Pearson Corelation Coefficient (PCC) as 0.988 when compared with existing Query Cost Forecasting using Ensemble (QCFE)",
    "citationCount": 0,
    "referenceCount": 19
}