{
    "paperId": "fdb67e73d3dca54bf98c02624335ca91b76b8cbf",
    "title": "MgFNO: Multi-grid Architecture Fourier Neural Operator for Parametric Partial Differential Equations",
    "year": 2024,
    "venue": "arXiv.org",
    "authors": [
        "Zi-Hao Guo",
        "Hou-Biao Li"
    ],
    "doi": "10.48550/arXiv.2407.08615",
    "arxivId": "2407.08615",
    "url": "https://www.semanticscholar.org/paper/fdb67e73d3dca54bf98c02624335ca91b76b8cbf",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Neural operators are a new type of models that can map between function spaces, allowing trained models to emulate the solution operators of partial differential equations (PDEs). This paper proposes a multigrid Fourier neural operator (MgFNO) that accelerates the training of traditional Fourier neural operators through a novel three-level hierarchical architecture. The key innovation of MgFNO lies in its decoupled training strategy employing three distinct networks at different resolution levels: a coarse-level network first learns low-resolution approximations, an intermediate network refines the solution, and a fine-level network achieves high-resolution accuracy. By combining the frequency principle of deep neural networks with multigrid methodology, MgFNO effectively bridges the complementary learning patterns of neural networks (low-to-high frequency) and multigrid methods (high-to-low frequency error reduction).Experimental results demonstrate that MgFNO achieves relative errors of 0.17%, 0.28%, and 0.22% on the Burgers' equation, Darcy flow, and Navier-Stokes equations, respectively, representing reductions of 89%, 71%, and 83% compared to the conventional FNO. Furthermore, MgFNO supports zero-shot super-resolution prediction, enabling direct application to high-resolution scenarios after training on coarse grids. This study establishes an efficient and high-accuracy new paradigm for solving complex PDEs dominated by high-frequency dynamics. Code and data used are available on https://github.com/guozihao-hub/MgFNO/tree/master.",
    "citationCount": 2,
    "referenceCount": 30
}