{
    "paperId": "fe0350aa20866f22be8c5019fc1b156d6bfc1851",
    "title": "Harnessing Automl for Electricity Price Forecasting in Germany: A Comparative Analysis of Models",
    "year": 2025,
    "venue": "2025 21st International Conference on the European Energy Market (EEM)",
    "authors": [
        "Demetrios N. Papadopoulos",
        "Ramiz Qussous",
        "Anke Weidlich"
    ],
    "doi": "10.1109/EEM64765.2025.11050338",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fe0350aa20866f22be8c5019fc1b156d6bfc1851",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Electricity price forecasting is crucial for energy market stakeholders, facilitating informed decisions in trading, investment, and operational planning to optimize portfolios and ensure grid stability. Machine learning (ML) models have proven effective for this task, but their deployment often demands substantial computational resources and expertise in both energy markets and ML techniques. Automated Machine Learning (AutoML) addresses these challenges by automating key steps like feature engineering, preprocessing, model selection, and hyperparameter tuning. This study evaluates the performance of three leading AutoML frameworks-Auto-sklearn, TPOT, and FLAML-for day-ahead electricity price forecasting in Germany, focusing on the year 2024. The evaluation includes testing during two distinct periods characterized by high and low price volatility. By incorporating domain-specific features, these frameworks are benchmarked against a Multi-Layer Perceptron (MLP) to assess their viability in comparison to traditional neural networks. The findings aim to provide insights into the scalability and effectiveness of AutoML for complex, data-intensive forecasting tasks, offering practical solutions for navigating the challenges of Germany's dynamic electricity market.",
    "citationCount": 0,
    "referenceCount": 17
}