{
    "paperId": "fe15c41bcda5b754a6512bb3345aedec54f4e006",
    "title": "Metagenomic and metabolomic analyses reveal the role of gut microbiome-associated metabolites in diarrhea calves",
    "year": 2023,
    "venue": "mSystems",
    "authors": [
        "Zhihai Shi",
        "Yazhou Wang",
        "Xiangzhou Yan",
        "Xiao-ya Ma",
        "A. Duan",
        "F. Hassan",
        "Wenjia Wang",
        "T. Deng"
    ],
    "doi": "10.1128/msystems.00582-23",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fe15c41bcda5b754a6512bb3345aedec54f4e006",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1128/msystems.00582-23",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "ABSTRACT Calf diarrhea is a multifactorial disease that affects the cattle industry and accounts for more than 50% of calf mortality. Although there is evidence of an association between altered gut microbiota and diarrhea, remarkably little is known about the microbial and metabolic mechanisms underlying the link between gut microbiota dysbiosis and the occurrence of calf diarrhea. Here, we performed fecal metagenomic and metabolomic studies on fecal samples from diarrheic and healthy calves of Xia-nan cattle breed. Results revealed that composition of the gut microbiome and metabolome was remarkably altered in diarrheic calves, and gut microbial alterations were associated with diarrhea and linked to the changes in metabolites. Metabolite profiles showed that diarrheic calves exhibited a marked decrease in some purines (adenosine, adenine, 2'-deoxyguanosine, allantoate, deoxyinosine, and deoxyguanosine) and arachidonic acid (prostaglandin F2α and prostaglandin E2) compared to healthy calves. Purine-producing microbial species, including Lactiplantibacillus plantarum, Campylobacter coli, Treponema porcinum, Klebsiella pneumoniae, and Phocaeicola coprophilus, were significantly reduced in diarrheic calves compared to healthy calves, whereas the arachidonic acid-producing species such as Neisseria gonorrhoeae, Staphylococcus aureus, and Clostridiales bacterium exhibited a marked increase. These microbial signatures were closely associated with the metabolic dysbiosis of purine and arachidonic acid in diarrhea calves. Our study showed that gut microbiota-driven metabolic disorders of purine or arachidonic acid were associated with calf diarrhea. The findings prove that altered gut microbiota plays a role in diarrhea pathogenesis and indicate that gut microbiota-targeted therapies could be useful for both prevention and treatment of diarrhea. IMPORTANCE Calf diarrhea is of great concern to the global dairy industry as it results in significant economic losses due to lower conception rates, reduced milk production, and early culling. Although there is evidence of an association between altered gut microbiota and diarrhea, remarkably little is known about the microbial and metabolic mechanisms underlying the link between gut microbiota dysbiosis and the occurrence of calf diarrhea. Here, we used fecal metagenomic and metabolomic analyses to demonstrate that gut microbiota-driven metabolic disorders of purine or arachidonic acid were associated with calf diarrhea. These altered gut microbiotas play vital roles in diarrhea pathogenesis and indicate that gut microbiota-targeted therapies could be useful for both prevention and treatment of diarrhea. Calf diarrhea is of great concern to the global dairy industry as it results in significant economic losses due to lower conception rates, reduced milk production, and early culling. Although there is evidence of an association between altered gut microbiota and diarrhea, remarkably little is known about the microbial and metabolic mechanisms underlying the link between gut microbiota dysbiosis and the occurrence of calf diarrhea. Here, we used fecal metagenomic and metabolomic analyses to demonstrate that gut microbiota-driven metabolic disorders of purine or arachidonic acid were associated with calf diarrhea. These altered gut microbiotas play vital roles in diarrhea pathogenesis and indicate that gut microbiota-targeted therapies could be useful for both prevention and treatment of diarrhea.",
    "citationCount": 12,
    "referenceCount": 82
}