{
    "paperId": "fe3bf60c23e284d10aa48537bc9b402add45a18f",
    "title": "LatticeVision: Image to Image Networks for Modeling Non-Stationary Spatial Data",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Antony Sikorski",
        "Michael Ivanitskiy",
        "Nathan Lenssen",
        "Douglas Nychka",
        "Daniel McKenzie"
    ],
    "doi": "10.48550/arXiv.2505.09803",
    "arxivId": "2505.09803",
    "url": "https://www.semanticscholar.org/paper/fe3bf60c23e284d10aa48537bc9b402add45a18f",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In many scientific and industrial applications, we are given a handful of instances (a 'small ensemble') of a spatially distributed quantity (a 'field') but would like to acquire many more. For example, a large ensemble of global temperature sensitivity fields from a climate model can help farmers, insurers, and governments plan appropriately. When acquiring more data is prohibitively expensive -- as is the case with climate models -- statistical emulation offers an efficient alternative for simulating synthetic yet realistic fields. However, parameter inference using maximum likelihood estimation (MLE) is computationally prohibitive, especially for large, non-stationary fields. Thus, many recent works train neural networks to estimate parameters given spatial fields as input, sidestepping MLE completely. In this work we focus on a popular class of parametric, spatially autoregressive (SAR) models. We make a simple yet impactful observation; because the SAR parameters can be arranged on a regular grid, both inputs (spatial fields) and outputs (model parameters) can be viewed as images. Using this insight, we demonstrate that image-to-image (I2I) networks enable faster and more accurate parameter estimation for a class of non-stationary SAR models with unprecedented complexity.",
    "citationCount": 0,
    "referenceCount": 87
}