{
    "paperId": "fe72d8425a67f1d81520a284df906238af065a37",
    "title": "Bi-regional and bi-phasic automated machine learning radiomics for defining metastasis to lesser curvature lymph node stations in gastric cancer",
    "year": 2025,
    "venue": "Cancer Imaging",
    "authors": [
        "Huilin Huang",
        "Siwen Wang",
        "Jingyu Deng",
        "Zhaoxiang Ye",
        "Hailin Li",
        "Bingxi He",
        "M. Fang",
        "Nannan Zhang",
        "Jiaxin Liu",
        "Di Dong",
        "Han Liang",
        "Guoxin Li",
        "Jie Tian",
        "Yanfeng Hu"
    ],
    "doi": "10.1186/s40644-025-00891-z",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fe72d8425a67f1d81520a284df906238af065a37",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Lymph node metastasis (LNM) is the primary metastatic mode in gastric cancer (GC), with frequent occurrences in lesser curvature. This study aims to establish a radiomic model to predict the metastatic status of lymph nodes in the lesser curvature for GC. We retrospectively collected data from 939 gastric cancer patients who underwent gastrectomy and D2 lymphadenectomy across two centers. Both the primary lesion and the lesser curvature region were segmented as representative region of interests (ROIs). The combination of bi-regional and bi-phasic CT imaging features were used to build a hybrid radiomic model to predict LNM in the lesser curvature. And the model was validated internally and externally. Further, the potential generalization ability of the hybrid model was investigated in predicting the metastasis status in the supra-pancreatic area. The hybrid model yielded substantially higher performance with AUCs of 0.847 (95% CI, 0.770–0.924) and 0.833 (95% CI, 0.800-0.867) in the two independent test cohorts, compared to the single regional and phasic models. Additionally, the hybrid model achieved AUCs ranging from 0.678 to 0.761 in the prediction of LNM in supra-pancreatic area, showing the potential generalization performance. The CT imaging features of primary tumor and adjacent tissues are significantly associated with LNM. And our as-developed model showed great diagnostic performance and might be of great application in the individual treatment of GC.",
    "citationCount": 0,
    "referenceCount": 34
}