{
    "paperId": "fe8756ed055854b3a40be2bf5089139270e7ae73",
    "title": "MANTIS: Multiple Type and Attribute Index Selection using Deep Reinforcement Learning",
    "year": 2021,
    "venue": "International Database Engineering and Applications Symposium",
    "authors": [
        "V. Sharma",
        "Curtis E. Dyreson",
        "N. Flann"
    ],
    "doi": "10.1145/3472163.3472176",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fe8756ed055854b3a40be2bf5089139270e7ae73",
    "isOpenAccess": true,
    "openAccessPdf": "https://dl.acm.org/doi/pdf/10.1145/3472163.3472176",
    "publicationTypes": [
        "JournalArticle",
        "Book"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "DBMS performance is dependent on many parameters, such as index selection, cache size, physical layout, and data partitioning. Some combinations of these parameters can lead to optimal performance for a given workload but selecting an optimal or near-optimal combination is challenging, especially for large databases with complex workloads. Among the hundreds of parameters, index selection is arguably the most critical parameter for performance. We propose a self-administered framework, called the Multiple Type and Attribute Index Selector (MANTIS), that automatically selects near-optimal indexes. The framework advances the state-of-the-art index selection by considering both multi-attribute and multiple types of indexes within a bounded storage size constraint, a combination not previously addressed. MANTIS combines supervised and reinforcement learning, a Deep Neural Network recommends the type of index for a given workload while a Deep Q-Learning network recommends the multi-attribute aspect. MANTIS is sensitive to storage cost constraints and incorporates noisy rewards in its reward function for better performance. Our experimental evaluation shows that MANTIS outperforms the current state-of-art methods by an average of 9.53% QphH@size.",
    "citationCount": 10,
    "referenceCount": 39
}