{
    "paperId": "fed7c5611bbe1393224597e48b53350020ffb5cc",
    "title": "Continuously running genetic algorithm for real-time networking device optimization",
    "year": 2021,
    "venue": "Annual Conference on Genetic and Evolutionary Computation",
    "authors": [
        "Amit Mandelbaum",
        "Doron Haritan Kazakov",
        "Natali Shechtman"
    ],
    "doi": "10.1145/3449639.3459272",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fed7c5611bbe1393224597e48b53350020ffb5cc",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1145/3449639.3459272",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Networking devices deployed in ultra-scale data centers must run perfectly and in real-time. The networking device performance is tuned using the device configuration registers. The optimal configuration is derived from the network topology and traffic patterns. As a result, it is not possible to specify a single configuration that fits all scenarios, and manual tuning is required in order to optimize the devices' performance. Such tuning slows down data center deployments and consumes massive resources. Moreover, as traffic patterns change, the original tuning becomes obsolete and causes degraded performance. This necessitates expensive retuning, which in some cases is infeasible. In this work, we present ZTT: a continuously running Genetic Algorithm that can be used for online, automatic tuning of the networking device parameters. ZTT is adaptive, fast to respond and have low computational costs required for running on a networking device. We test ZTT in a diversity of real-world traffic scenarios and show that it is able to obtain a significant performance boost over static configurations suggested by experts. We also demonstrate that ZTT is able to outperform alternative search algorithms like Simulated Annealing and Recursive Random Search even when those are adapted to better match the task at hand.",
    "citationCount": 1,
    "referenceCount": 56
}