{
    "paperId": "fee1e861877b9abcc33d5cdf3a0fba6320cee6ae",
    "title": "KGIQ: Scalable Translation of User-Specified Examples into Knowledge-Graph Queries",
    "year": 2022,
    "venue": "2022 IEEE International Conference on Big Data (Big Data)",
    "authors": [
        "J. Ao",
        "Rada Y. Chirkova"
    ],
    "doi": "10.1109/BigData55660.2022.10021081",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fee1e861877b9abcc33d5cdf3a0fba6320cee6ae",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Querying large-scale knowledge graphs (KGs) can be difficult for users in real-life scenarios, in which formal graph query languages potentially present usability barriers. Query-By-Example (QBE) approaches, which allow users to specify their query intent with examples, have become an emerging trend to address this issue. However, existing QBE approaches either require user-specified examples to provide values of all the KG attributes, or may return incorrect formalizations of user query intent due to the lack of user interaction. In this paper we propose an approach called Knowledge Graph Intuitive Querier (KGIQ) that addresses both challenges on large-scale KGs by using novel scalable algorithms. Unlike existing approaches, KGIQ ensures correct translation of user-specified examples into formal executable graph queries by interacting with users in a lightweight manner. Our experimental results suggest that KGIQ can correctly formalize graph queries on large-scale KGs with the help of uncomplicated user interactions and a feedback loop to improve user experience, while consistently outperforming the state of the art in terms of efficiency and outcome quality.",
    "citationCount": 0,
    "referenceCount": 28
}