{
    "paperId": "fefd915c9ece98f31a5ca7e7474c17589cf84f33",
    "title": "The Application of Machine Learning in Doping Detection",
    "year": 2024,
    "venue": "Journal of Chemical Information and Modeling",
    "authors": [
        "Qingqing Yang",
        "Wennuo Xu",
        "Xiaodong Sun",
        "Qin Chen",
        "Bing Niu"
    ],
    "doi": "10.1021/acs.jcim.4c01234",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/fefd915c9ece98f31a5ca7e7474c17589cf84f33",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Review",
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Chemistry",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Detecting doping agents in sports poses a significant challenge due to the continuous emergence of new prohibited substances and methods. Traditional detection methods primarily rely on targeted analysis, which is often labor-intensive and is susceptible to errors. In response, machine learning offers a transformative approach to enhancing doping screening and detection. With its powerful data analysis capabilities, machine learning enables the rapid identification of patterns and features in complex compound data, increasing both the efficiency and the accuracy of detection. Moreover, when integrated with nontargeted metabolomics, machine learning can predict unknown metabolites, aiding the discovery of long-lasting biomarkers of doping. It also excels in classifying novel compounds, thereby reducing false-negative rates. As instrumental analysis and machine learning technologies continue to advance, the development of rapid, scalable, and highly efficient doping detection methods becomes increasingly feasible, supporting the pursuit of fairness and integrity in sports competitions.",
    "citationCount": 3,
    "referenceCount": 68
}