{
    "paperId": "ff0a15270687295ecde8ce64b42203ddb7f5abc6",
    "title": "Mining Architectural Information: A Systematic Mapping Study",
    "year": 2022,
    "venue": "Empirical Software Engineering",
    "authors": [
        "Musengamana Jean de Dieu",
        "Peng Liang",
        "Mojtaba Shahin",
        "Chen Yang",
        "Zengyang Li"
    ],
    "doi": "10.48550/arXiv.2212.13179",
    "arxivId": "2212.13179",
    "url": "https://www.semanticscholar.org/paper/ff0a15270687295ecde8ce64b42203ddb7f5abc6",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2212.13179",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Mining Software Repositories (MSR) has become an essential activity in software development. Mining architectural information to support architecting activities, such as architecture understanding, has received significant attention in recent years. However, there is a lack of clarity on what literature on mining architectural information is available. Consequently, this may create difficulty for practitioners to understand and adopt the state-of-the-art research results, such as what approaches should be adopted to mine what architectural information in order to support architecting activities. It also hinders researchers from being aware of the challenges and remedies for the identified research gaps. We aim to identify, analyze, and synthesize the literature on mining architectural information in terms of architectural information and sources mined, architecting activities supported, approaches and tools used, and challenges faced. An SMS has been conducted on the literature published between January 2006 and December 2022. Of the 104 primary studies selected, 7 categories of architectural information have been mined, among which architectural description is the most mined architectural information; 11 categories of sources have been leveraged for mining architectural information, among which version control system is the most popular source; 11 architecting activities can be supported by the mined architectural information, among which architecture understanding is the most supported activity; 95 approaches and 56 tools were proposed and employed in mining architectural information; and 4 types of challenges in mining architectural information were identified. This SMS provides researchers with future directions and help practitioners be aware of what approaches and tools can be used to mine what architectural information from what sources to support various architecting activities.",
    "citationCount": 4,
    "referenceCount": 178
}