{
    "paperId": "ff470fc244e2d6b7031296b4f3c2751849f12195",
    "title": "Towards an Automated Learning Control Architecture for Cyber-Physical Manufacturing Systems",
    "year": 2022,
    "venue": "IEEE Access",
    "authors": [
        "Ilya Kovalenko",
        "J. Moyne",
        "Mingjie Bi",
        "Efe C. Balta",
        "Wenyuan Ma",
        "Yassine Qamsane",
        "Xiao Zhu",
        "Z. Morley Mao",
        "D. Tilbury",
        "K. Barton"
    ],
    "doi": "10.1109/ACCESS.2022.3165551",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ff470fc244e2d6b7031296b4f3c2751849f12195",
    "isOpenAccess": true,
    "openAccessPdf": "https://ieeexplore.ieee.org/ielx7/6287639/9668973/09751037.pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Manufacturers are constantly looking to enhance the performance of their manufacturing systems by improving their ability to address disruptions and disturbances, while reducing cost and maximizing quantity and quality. Even though innovative mechanisms for adaptability and flexibility continuously contribute to the smart manufacturing evolutionary process, they generally stop short of providing a capability for coordinated on-line learning. This is especially true when that learning requires exploration outside of established operational boundaries or uses artificial intelligence (as opposed to purely human intelligence) as part of the dynamic implementation of learning. In this work, we provide a vision for the development of an automated learning control architecture to extend the adaptability and flexibility capabilities of manufacturing systems. As part of this vision, we describe a set of requirements and objectives that, if addressed, provide an environment to allow distributed and automated learning across the manufacturing ecosystem. We then provide an example communication and control architecture that meets these requirements and objectives by gathering information, building a dynamic knowledge base, distributing intelligence, making decisions, and adapting the control commands sent to the equipment and people across the manufacturing ecosystem. The example architecture leverages both centralized and distributed control strategies and the ability to switch between the strategies to gather and learn from information in the system. Example case studies are provided illustrating how this architecture can be used to improve manufacturing system performance.",
    "citationCount": 20,
    "referenceCount": 90
}