{
    "paperId": "ff8b1cd1c13129edc432620f00f06aa77ff1d239",
    "title": "Unsupervised Learning Approach for Network Traffic Classification",
    "year": 2024,
    "venue": "International Conference on Wireless Communications and Mobile Computing",
    "authors": [
        "Mario Bou Abboud",
        "Oumaya Baala",
        "Maroua Drissi",
        "S. Allio"
    ],
    "doi": "10.1109/IWCMC61514.2024.10592501",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ff8b1cd1c13129edc432620f00f06aa77ff1d239",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The landscape of network management has undergone significant transformation with the advent of diverse Internet applications, smart devices, and the shift towards software-defined networks (SDN). This evolution has amplified the complexities of managing and measuring network traffic, necessitating more sophisticated and dynamic traffic classification methods to maintain optimal network performance and ensure user Quality-of-Experience (QoE). This paper presents a novel approach to network traffic classification, leveraging the capabilities of Gaussian Mixture Models (GMM) to classify network traffic based on user behavior patterns and temporal data. Our methodology distinctly categorizes network traffic into business or pleasure-oriented activities by analyzing various features such as the number of connected users, traffic volume, the day of the week, and the time of day. This classification is crucial not only for traffic management but also for understanding evolving network usage patterns, which are vital for ensuring robust network operations and efficient resource allocation.",
    "citationCount": 0,
    "referenceCount": 20
}