{
    "paperId": "ff963927eb50d02d48100dde37cf28c92836f80d",
    "title": "Machine learning enhanced optimisation of crash box design for crashworthiness analysis",
    "year": 2023,
    "venue": "Pamm",
    "authors": [
        "Aditya Borse",
        "Rutwik Gulakala",
        "M. Stoffel"
    ],
    "doi": "10.1002/pamm.202300145",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/ff963927eb50d02d48100dde37cf28c92836f80d",
    "isOpenAccess": true,
    "openAccessPdf": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/pamm.202300145",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The primary goal of the current study is to optimise crash box designs for automobiles. Machine learning (ML) techniques are used to build an intelligent and reliable ML framework. With the help of this framework, the crash box design can be optimised for crashworthiness analysis. The optimisation of the crash box design is resource‐intensive due to its intricate geometric design, use of a variety of materials, and extensive use of dynamic simulations to determine the ideal structural parameters through simulations. A reinforcement learning‐based (RL) optimization technique is developed for this reason. The crash box is built with nonlinear first‐order shear deformation shell elements to provide the necessary simulation data, and nonlinear elastoplastic material is used to model the dynamic impact process. The RL agents are tuned using finite element (FE) simulations and synthetic data generated by a generative adversarial network (GAN) to optimise and select the optimal model parameters for vehicle crashworthiness analysis. To estimate the correct model parameter required to fulfil specified crashworthiness metrics, the RL agent learns and optimises automatically. This method is effective in terms of resources and could be helpful in the early stages of vehicle development.",
    "citationCount": 3,
    "referenceCount": 30
}