{
    "paperId": "ffc8f28dc83ef500d2d885d12d3d031a8b01a6f2",
    "title": "A multi-fidelity machine learning based semi-Lagrangian finite volume scheme for linear transport equations and the nonlinear Vlasov-Poisson system",
    "year": 2023,
    "venue": "Multiscale Modeling & simulation",
    "authors": [
        "Yongsheng Chen",
        "Wei Guo",
        "Xinghui Zhong"
    ],
    "doi": "10.48550/arXiv.2309.04943",
    "arxivId": "2309.04943",
    "url": "https://www.semanticscholar.org/paper/ffc8f28dc83ef500d2d885d12d3d031a8b01a6f2",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2309.04943",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Machine-learning (ML) based discretization has been developed to simulate complex partial differential equations (PDEs) with tremendous success across various fields. These learned PDE solvers can effectively resolve the underlying solution structures of interest and achieve a level of accuracy which often requires an order-of-magnitude finer grid for a conventional numerical method using polynomial-based approximations. In a previous work in [13], we introduced a learned finite volume discretization that further incorporates the semi-Lagrangian (SL) mechanism, enabling larger CFL numbers for stability. However, the efficiency and effectiveness of such methodology heavily rely on the availability of abundant high-resolution training data, which can be prohibitively expensive to obtain. To address this challenge, in this paper, we propose a novel multi-fidelity ML-based SL method for transport equations. This method leverages a combination of a small amount of high-fidelity data and sufficient but cheaper low-fidelity data. The approach is designed based on a composite convolutional neural network architecture that explore the inherent correlation between high-fidelity and low-fidelity data. The proposed method demonstrates the capability to achieve a reasonable level of accuracy, particularly in scenarios where a single-fidelity model fails to generalize effectively. We further extend the method to the nonlinear Vlasov-Poisson system by employing high order Runge-Kutta exponential integrators. A collection of numerical tests are provided to validate the efficiency and accuracy of the proposed method.",
    "citationCount": 1,
    "referenceCount": 64
}