{
    "paperId": "ffd6dba035a1974a83ba2669599f9062b2d96150",
    "title": "Practitioner Motives to Use Different Hyperparameter Optimization Methods",
    "year": 2022,
    "venue": "ACM Transactions on Computer-Human Interaction",
    "authors": [
        "Niclas Kannengiesser",
        "Niklas Hasebrook",
        "Felix Morsbach",
        "M. Zöller",
        "Jorg K. H. Franke",
        "M. Lindauer",
        "Frank Hutter",
        "A. Sunyaev"
    ],
    "doi": "10.1145/3745771",
    "arxivId": "2203.01717",
    "url": "https://www.semanticscholar.org/paper/ffd6dba035a1974a83ba2669599f9062b2d96150",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Programmatic hyperparameter optimization (HPO) methods, such as Bayesian optimization and evolutionary algorithms, are known for their sample efficiency in identifying optimal configurations for machine learning (ML) models. However, practitioners often use less efficient methods, such as grid search, potentially resulting in under-optimized models. This discrepancy suggests that HPO method selection may be influenced by practitioner-specific motives, which remain insufficiently understood—hindering the user-centered advancement of HPO tools. To uncover these motives, we conducted 20 semi-structured interviews and an online survey with 49 ML practitioners. We revealed six primary goals (e.g., increasing ML model understanding) and fourteen contextual factors (e.g., available computational resources) that influence practitioners’ choices of HPO methods. This study provides a conceptual foundation for understanding real-world HPO practices and informs the development of more user-centered and context-adaptive HPO tools in automated ML (AutoML).",
    "citationCount": 0,
    "referenceCount": 86
}