{
  "paperId": "1821b71c5889aa18cc72501a394eb57e352ca3f1",
  "title": "A Visual Analytics System for Profiling Urban Land Use Evolution",
  "pdfPath": "1821b71c5889aa18cc72501a394eb57e352ca3f1.pdf",
  "text": "A Visual Analytics System for Proﬁling Urban Land Use Evolution\nClaudio Santosa, Maryam Hosseinib,c, João Rulﬀb, Nivan Ferreirad, Luc Wilsone,\nFabio Mirandaf, Claudio Silvaband Marcos Lagea\naDepartment of Computer Science, Universidade Federal Fluminense, Niterói, RJ, Brazil\nbDepartment of Computer Science and Engineering, New York University, New York, NY, United States\ncUrban Systems, Rutgers University, Newark, NJ, United States\ndCentro de Informatica, Universidade Federal de Pernambuco, Recife, PE, Brazil\neKohn Pedersen Fox, New York, NY, United States\nfDepartment of Computer Science, University of Illinois at Chicago, Chicago, IL, United States\nARTICLE INFO\nKeywords :\nvisual analytics\nbig data\nurban planning\nGISABSTRACT\nThe growth of cities calls for regulations on how urban space is used and zoning resolutions\ndeﬁne how and for what purpose each piece of land is going to be used. Tracking land use and\nzoning evolution can reveal a wealth of information about urban development. For that matter,\ncities have been releasing data sets describing the historical evolution of both the shape and the\nattributes of land units. The complex nature of zoning code and land-use data, however, makes\nthe analysis of such data quite challenging and often time-consuming. We address these chal-\nlengesbyintroducingU RBANCHRONICLES ,anopen-sourceweb-basedvisualanalyticssystem\nthatenablesinteractiveexplorationofchangesinlandusepatterns. UsingNewYorkCity’s Pri-\nmaryLandUseTaxLotOutput(PLUTO) asanexample,weshowthecapabilitiesofthesystem\nby exploring the data over several years at diﬀerent scales. U RBANCHRONICLES supports on-\nthe-ﬂy aggregation and ﬁltering operations by using a tree-based data structure that leverages\nthe hierarchical nature of the data set to index the shape and attributes of geographical regions\nthatchangeovertime. Wedemonstratetheutilityofoursystemthroughasetofcasestudiesthat\nanalyzetheimpactofHurricaneSandyonlanduseattributes,aswellastheeﬀectsofproposed\nrezoning plans in Downtown Brooklyn.\n1. Introduction\nCitieshavelongbeenatthecenterofinnovationanddevelopment. Aspeopleconcentrateonthesehubsofculture,\ncommerce, and services, hamlets give way to towns and towns to metropolis. This growth, organized or not, calls for\nregulations and plans to best divide and utilize a precious resource: land. The wheel of time delivers new patterns:\ncarriagesevolvedtoelevatedtrainsreshapingtheformsofthecities[33];personalcarsemerged,redeﬁningtheuseof\nurban space by dividing streets between pedestrians and cars [59]; cabins transformed into skyscrapers, creating the\nnecessitytoregulatethesizeandformsofthebuildingsandthecreationofairrights[6,44]. Themodernsettlements\nwerefacedwithabigchallengetoadequatelymanagelands,theveryfoundationonwhichcitieswerebuilt. Sincethen,\ncities have been adopting and modifying regulations that govern land use and development. Zoning resolutions were\ndeﬁnedwiththegoaloffacilitatingthemanagementofurbanspacesandprescribingspeciﬁcsetsofrulesfordiﬀerent\npieces of land in the city. They control the shape and size of the buildings and public spaces, preserve urban fabrics,\nand determine how and for what purpose each piece of land can be used [5]. The zoning designation can change to\ncomply with the ever-growing demands of urban life and modern cities.\nTrackingthechangesinthezoningcodesandlandusecanhelpdrawingamoreprecisepictureofhowurbaneco-\nnomic,social,andpublicpolicieshaveevolved. Italsoprovidesawaytoevaluatetheperformanceoftheenactedplans\n[50]. Moreover,theanalysisofthezoningevolutionatdiﬀerentlevelscaninformstakeholdersofthedelayedimpacts\nofsomepolicychangesandmajoreventssuchasnaturaldisastersoreconomiccrises,markettrends,anddevelopment\nopportunities. The complex nature of zoning codes, land use regulations, and taxing system makes the analyses of\nc.souza0804@gmail.com (C. Santos); maryam.hosseini@nyu.edu (M. Hosseini); jlrulff@nyu.edu (J. Rulﬀ);\nnivan@cin.ufpe.br (N. Ferreira); lwilson@kpf.com (L. Wilson); fabiom@uic.edu (F. Miranda); csilva@nyu.edu (C. Silva);\nmlage@ic.uff.br (M. Lage)\nORCID(s):0000-0001-8218-754X (C. Santos); 0000-0001-8329-4638 (M. Hosseini); 0000-0003-3341-7059 (J. Rulﬀ);\n0000-0001-6631-4609 (N. Ferreira); 0000-0001-8612-5805 (F. Miranda); 0000-0003-2452-2295 (C. Silva); 0000-0003-3868-8886 (M.\nLage)\nC. Santos et al.: Preprint submitted to Elsevier Page 1 of 16arXiv:2112.06122v1  [cs.CY]  12 Dec 2021\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nsuch data quite challenging and often time-consuming. For instance, since such extensive data spans diﬀerent city\nagencies, each having their own data collection and recording methods, the uniﬁed data set is highly prone to errors\nand inconsistencies. On top of that, land use and zoning data are often large and complex. In New York City (NYC),\nthedatasetdescribingprimarylanduseismorethan18GB,hasover83attributesandmorethan320,000geographical\nunits only for the boroughs of Manhattan and Brooklyn. This data can be considered a spatiotemporal data set, but\nonewherethespatialattributeisnotmerelycomposedofpointsbutofcomplexgeometricprimitives. Moreover,new\ngeographical units are created and merged over time, resulting in attributes and geometries change. Tracking these\nchanges is, therefore essential. The majority of the existing land use and zoning visualization tools and systems are\neithermerelyexploratorytoolsoﬀeringverylimitedornoanalysiscapabilities[54],ordonottakethetemporalaspect\nof the data into account [64].\nTo address some of the challenges involved in the analysis of land use data, we introduce U RBANCHRONICLES ,\na new visual analytics system for proﬁling city land use evolution. U RBANCHRONICLES is developed through ongo-\ning collaborations with domain experts (urban planners and architects) that work with land use and zoning data as an\nintegralpartoftheirprojects. Thesystemcontainsadataprocessingpipelinetoremoveinconsistenciesandredundan-\ncies common to land use data; an in-memory tree-based data structure speciﬁcally designed to handle the geometries\ncommontogeographicalregionsofacityandtodriveinteractivevisualization;andavisualinterfacethatenablesthe\nvisualizationoflandusedataatdiﬀerentscales,fromthelandunitleveltoneighborhoodlevel,givingtheuseranalyt-\nical capabilities that would not be possible in a single scale analysis. Our system makes use of the Primary Land Use\nTax Lot Output (PLUTO) data, a recently released spatiotemporal data set that describes the land use information in\nNYC,forover15years. Weuseitasourrunningexampletointroducethesystem,althoughU RBANCHRONICLES can\nalsobeusedtoexploreotherparcel-basedlanduseinventories. Wedemonstratetheeﬀectivenessof U RBANCHRON-\nICLESthrough detailed case studies set in Manhattan and Brooklyn, two boroughs of NYC. The case studies analyze\nthe impact of the National Flood Insurance Program (NFIP) of 2013, a year after Hurricane Sandy, on residential de-\nvelopmentactivitiesinlower-incomeneighborhoods,aswellasevaluatingtheDowntownBrooklynrezoningplanthat\naimed at absorbing the oﬃce space demand generated by Financial District. To summarize, our contributions are:\n•We introduce U RBANCHRONICLES , an open-source web-based system that enables urban planners and ar-\nchitects to visually explore large data sets composed of geographical, political, and administrative land unit\ninformation.\n•We propose a data pipeline to automatically extract, clean and process raw land use data.\n•We adapt a general purpose tree-based data structure to leverage the hierarchical nature of land use data. We\nshow that this data structure allows U RBANCHRONICLES to perform in interactive time when querying large\nspatiotemporal land use data sets. We demonstrate its eﬀectiveness through a set of experiments, including\ncomparisons with industry-standard GIS database and tool.\n•WehighlighttheusefulnessofU RBANCHRONICLES throughtwodetailedcasestudiessetinNYCandperformed\nby urban planners and architects. An accompany video demonstrates the system.\n2. Related Work\nWe survey the literature from three categories: land use and zoning analysis, interactive visualization, and visual\nanalytics in the context of cities.\nLanduseandzoninganalysis. Recently,anincreasingnumberofnewdetaileddatasetsdescribingtaxation,landuse,\nand zoning information has become available by multiple city agencies [53, 10, 60] providing new research horizons\nacrossvariousdiﬀerentﬁelds. Landuseandlandcoverchangehavelongbeenstudiedbyscientistsfrommultipledif-\nferent perspectives. Environmental scientists looked at how such changes can impact ecosystem services [38], storm\nrun-oﬀ [7], climate change [35], among others [37, 9]. In urban planning, land use change can signal gentriﬁca-\ntion [39, 30], or threaten the urban fabric of a neighborhood and its historic landmarks [26]. Zoning change can also\nimpact various urban indicators such as urban growth [25], aﬀordable housing residential development [24] and land\nvalues [43]. Hence, predicting land use change has for long been a topic of interest [19]. Land use and zoning data\nsets,suchasPLUTO[51],Chicago’sLandUseInventory[10],andChicago’sZoningDistrict[17]wereusedinseveral\n1The open-source system can be found at https://github.com/Prograf-UFF/urban-chronicles\nC. Santos et al.: Preprint submitted to Elsevier Page 2 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\n2013BBL LANDUSE\n2014Geometry\nUpdateLot\nSplitAttribute\nChangeLots\nMergeBBL LANDUSE\n2015BBL LANDUSE\n2016LANDUSE BBL\n2017BBL LANDUSE\n1008350041 COMMERCIAL 1008350041 1008350041\n10083500421008350041\n10083500421008350041 COMMERCIAL COMMERCIAL\nRESIDENTIALMIXED USE MIXED USE\nRESIDENTIAL\nFigure 1: Lot changes in PLUTO: The geometry of the lot was updated to better represent its real geometry (2014); In\nthe following year it was split, creating a new lot (2015); In 2016, the larger lot became a mixed-use area; and in 2017 the\ntwo lots were merged.\nreviewed studies and published tools but most of them are limited in their exploratory analysis by using a handful of\nattributes,shorttimeperiods,andcoarsespatialgranularity[66,55,14,68]. Inthiswork,weproposeavisualanalytics\nsystem that enables the interactive exploration of large temporal land use and zoning data sets in its entirety.\nInteractivevisualization. Tobeeﬀective,visualanalyticssystemsshouldstrivefor interactivity ,withresponsetimes\nbelow500ms[41]. Thus,severaltechniquesanddatastructureshavebeenproposedinrecentyearstohandleinteractive\nqueriesoverlargedatasetsandminimizethelatencybetweenuserinputandvisualoutput. Examplesofsuchproposals\ninclude ones speciﬁcally designed to leverage the processing power of GPUs [42, 70], optimize I/O and network\nusage [48], use deep learning for learned indices [36, 67], and data cube models [40, 47]. These past works, while\nhandling simpler forms of data points, do not take into account more complex types, such as geometric shapes. We\nproposeanovelapproachspeciﬁcallydesignedforarbitraryshapes,targetedattheinteractivequeriesoflandunitsthat\nuses less memory and are faster than traditional databases.\nUrban visual analytics. In the past decade, various tools and systems have been proposed to analyze and explore\nurban data. These systems are often motivated by open data initiatives requiring city agencies to make their data\npubliclyavailablethroughopendataportals[12,11,63,27,4],whichplayedacentralroleinhelpingexpertstogaina\ndeeperunderstandingofcities,evaluatepolicies,andplandevelopments[71]. Examplesofsuchsystemsincludeones\ndesigned to explore human mobility [2, 22, 3, 61], public policy [13], air pollution [15, 29], urban traﬃc [28], public\ntransportation [57, 69], real-estate ownership [32], land use labelling [62], urban change [46], and shadow impact on\npublic spaces [45].\nSeveral tools have also been proposed to handle more complex urban data, such as city objects with an associated\ngeometry, like buildings. Their goal is to inform the decision-making process in the urban domain and are being\nused by researchers, architects, urban planners, developers, and the general public. Examples of such tools include\nPlaceILive[58],designedfortheassessmentofneighborhoodquality,Urbane[21,18]andVis-A-Ware[56],toanalyze\npotential development sites, and ArcGIS [34], a general GIS system. These systems, however, were developed as\ngeneral-purpose tools to cover the whole spectrum of geographical-based analysis. For more focused tasks, such as\nlanduseanalysis,thesesystemsdonotprovidethecapabilitytovisuallyandinteractivelyexploreandtrackthetemporal\nvariation of the data sets.\nTo the best of our knowledge, U RBANCHRONICLES is the ﬁrst visual analytics system designed to interactively\nexplore spatiotemporal land use data sets, motivated by the real-world needs of urban planners and architects.\n3. Background\nThe rules governing land use and building size, form, and function are called zoning laws. Zoning puts parcels of\nland in diﬀerent groups (or “zones\") and prescribes certain sets of regulations for each one of them [49]. There are\nmultiple standards to locate and identify each piece of land. The system used in the U.S. and Canada is called Lot\nand Block Survey System ; under which, blocks are deﬁned as \"A tract of land bounded on all sides by streets, or a\ncombination of streets, public parks, railroad rights-of-way, pierhead lines or airport boundaries\" . Blocks are then\nsubdividedintolots,thesmallestparceloflandthatcanbeowned,purchased,andsold. InNYC(therunningexample\nused in this paper), for property tax purposes, lots are identiﬁed with a unique code resulting from the concatenation\nofborough,blockandlotnumbercorrespondingtotheirlocation,calledBBLcode. Alotidentiﬁedwiththatnumber\nC. Santos et al.: Preprint submitted to Elsevier Page 3 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nis called a tax lot. See Figure 1 (left) for an example of a lot. A lot can be divided to create new lots (2014-2015), or\nmultiple lots can merge to create a larger lot (2016-2017).\nThezoningdesignationcanchangethroughaprocesscalled rezoning. Therezoningoftenseekstoeitherincrease\nthedensityandencouragemoredevelopmentbysetting lessrestrictive rulesontheheight,size,design,anduseofthe\nbuildings; or to prevent density increase, protect local businesses and historic fabric of the neighborhood by setting\nmorerestrictive zoningrules. Trackingtheevolutionofzoningandhowtheyhaveinﬂuenceddiﬀerentaspectsofurban\nlife can provide a wealth of information vital for crafting policies and planning better cities.\n4. Data Description and System Requirements\nPLUTO, the NYC’s data set that is our motivating example, is a spatiotemporal data whose spatial component of\ntheelementsaregeographicalregions,whereeachregionisdescribedbyitspolygonalboundaryandalistofattributes\nthat change over time. Next, we describe the main features of PLUTO.\n4.1. Primary Land Use Tax Lot Output Data\nPLUTO is an invaluable and extensive land use and geographic data set, describing almost every piece of land in\nNYC. Provided by the Department of City Planning, the data set contains 83 attributes pertaining to tax lot charac-\nteristics, building features, as well as geographic, political, and administrative districts. These attributes are collected\nand maintained by several city agencies [51].\nMapPLUTOisderivedfrommergingthePLUTOattributeswiththeTaxLotPolygonfeaturesfromtheDepartment\nofFinance. Thedataprovidesawealthofinformationaboutlanduseandzoning,forinstance,landusecodes,zoning\ndistricts, and maximum allowable ﬂoor-to-area ratio (FAR); property tax such as total assessed value, assessed land\nvalue, and tax exemptions; primary building features like building class, frontage and area, among others. It also\nassigns each lot to a Community District (CD) i.e., administrative districts unique to New York City. Both PLUTO\nand MapPLUTO are updated twice a year and are considered among the most prominent data sets publicly available\ninNYC.ThisworkisbasedontheMapPLUTOdatasetbut,forsimplicity,wewillrefertoitasPLUTOdatasetinthe\ntext.\n4.2. PLUTO Data Characteristics\nWe collected PLUTO data from 2002 to the ﬁrst semester of 2017. During this period, 22 versions of the data set\nwere released. The total amount of space required to store all the 22 releases is approximately 18 GB. Each PLUTO\ndata release is a collection of shapeﬁles, one for each of the ﬁve boroughs in NYC, containing the geometries and\nattributes of the lots.\nAlthoughtherawhistoricaldataislarge,itcontainsmanyredundanciesthatcanbeexploredforstorageoptimiza-\ntion. Forexample,thegeometryofmostofthelotsofNYCremainsunchangedforseveralyears. Weobservedthaton\naverage,only8%ofthelotgeometrieschangeintwoconsecutivereleasesofthedataset. Similarly,theaverageamount\nof changes in the lot attributes on subsequent versions is 40%. Figure 1 illustrates all changes that the geometry and\nattributesofalotcanundergo. Westressthattrackingandvisualizingthechangesofalllotsofacity,isachallenging\ntask that we aim to solve with U RBANCHRONICLES .\nInconsistencies. Like many public data sets, PLUTO contains multiple inconsistencies between diﬀerent versions\nof the data making longitudinal analysis cumbersome and time-consuming. For example, there were cases that the\ngeometry of a given lot did not actually change, while its geometric attributes were updated in the data due to data\nentry errors or changes in the data acquisition method (Figure 1 (2013-2014)). In some cases, the overlap between\ntwo versions of the geometry of the same lot was smaller than 50~. Moreover, the attributes of the lots have gone\nthrough several changes over the years. Examples of issues one observes when trying to consolidate the diﬀerent\nPLUTO releases are changes in attributes names, changes in attribute deﬁnition and inaccurate attribute information.\nIn Section 5.1 we describe our preprocessing strategy to alleviate these issues.\n4.3. System Requirements\nInourongoingcollaborationwithdomainexpertsfromurbanplanningandarchitecture,weidentiﬁedasetoftasks\nthattheyareinterestedinperforming: 1)Studythetemporalpatternsofchangeincertainattributes,suchasresidential\nandcommercialareasorassessedvalueattheneighborhood,block,orlotlevel. Thiscanhelpdetectinganomaliesand\nmajor events. 2) Evaluate the implementation of rezoning plans, whether and when the zoning has changed, if it has\nC. Santos et al.: Preprint submitted to Elsevier Page 4 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nTable 1\nThe PLUTO data set attributes selected by our partners urban planners and architects to be explored using our system.\nAttribute Class Variations Description\nBBL – The concatenation of the borough, block and lot codes.\nAREA Lot, Residential, etc. The area of the lot, the area allocated for residential use, and other area measurements.\nASSESS Land, (Normalized) Total The assessed land and total value for the lot.\nBLDGCLASS – A code describing the major use of structures on the lot.\nFAR Built, Residential, etc. The built or maximum allowed ﬂoor area divided by the area of the lot.\nLANDUSE – A code for the tax lot’s land use category.\nNUM Buildings, Floors Number of buildings and number of ﬂoors in the tallest building of the lot.\nSPDIST – The special purpose district which can impact the underlying zoning codes.\nTable 2\nPercentage of redundant lot geometries and attribute sets in the PLUTO releases and memory usage. The amount of\nredundant lot geometries is higher than 90%. The overhead of the Data Storage used by Urban Chronicles is, in the\nworse case, 3.5 times the amount of space required to store the data produced by the Preprocessing Pipeline . To evaluate\nthe storage eﬃciency of Urban Chronicles we loaded the prepossessed data into a relational database. The space\nrequired by the database is, in the best case, 5.11 times the data size.\nRedundancy (%) Memory Usage (GB) Overhead\nGeometry Unstable Stable Categorical RawPre (P) Storage (S) DB (D) S/PD/P\nManhattan 91 28 75 79 0.53 0.28 0.93 1.43 3.33 5.11\nBrooklyn 92 21 66 79 3.28 1.86 6.50 10.0 3.505.37\nbeenappliedtotheblocksinitiallytargetedintheplan,anditsimpacton adjacentneighborhoods. 3)Identifyregions\nbasedoncertainattributessuchasthelevelofunusedresidentialandcommercialFAR,speciﬁclanduse(e.g.,vacant\nlands), zoning district, building classes, and compare lot level data in a selected neighborhood or community district.\nBased on the tasks mentioned above, we deﬁned the following system requirements:\n[R1]Enabletheexplorationofdataatdiﬀerentcityscales. Enableexpertstoexplorelandusedataatdiﬀerentge-\nographicallevels(e.g.,borough,neighborhood,communitydistrict,block,lot). Anurbanplannermight,forinstance,\nusetheneighborhoodleveltoidentifyareasundergoingaprocessofgentriﬁcationandthenanalyzethephenomenaat\nthe block or lot level.\n[R2] Support the exploration of attribute changes over time. Allow users to explore the rate of change in the\nattributes over time, while enabling the identiﬁcation of outliers or temporal patterns.\n[R3] Support the exploration of lots of interest. Being able to ﬁlter lots based on tax, land use or zoning attributes\nallows experts to identify areas that follow certain criteria, such as unused FAR or rezoning status.\n[R4]Supporttheexplorationoftemporalchangesoflots. Throughouttheyears,lotsaredividedormerged. Keeping\ntrackofchangesinthenumberoflotsonneighborhood,communitydistrict,orblocklevelcanbeofspecialinterestto\nurbanplanners. Forexample,theincreaseoflotmergescanbeasignalofanincentivezoningprogramortransferable\ndevelopment rights, which can have a large impact on the community.\n[R5] Support interactive query times. All the previous tasks should be executed interactively since response time\ngreaterthan500mscansigniﬁcantlyimpactvisualanalysis,reducingtherateatwhichusersmakeobservations[41].\n5. URBANCHRONICLES System\nIn this paper we present the visual analytics system called U RBANCHRONICLES , developed to enable the ex-\nploration of land use data. The system is composed of three modules: the Data Storage (Section 5.2), the Query\nProcessor (Section 5.3) and the Visual Interface (Section 5.4). Figure 5 highlights the diﬀerent components of the\nvisual interface. An accompany video demonstrates the main features of the system. Before describing the system in\ndetail, we present the Data Preprocessing Pipeline , a set of steps that prepares the PLUTO data to be consumed.\n5.1. Data Preprocessing Pipeline\nDue to the inconsistencies described in Section 4, a preprocessing phase is needed to standardize the data and\nenable its consumption by our system. To achieve this goal, the Data Preprocessing Pipeline implements the three\nsteps indicated in Figure 2: data extraction, redundancy removal, and geographic level processing.\nC. Santos et al.: Preprint submitted to Elsevier Page 5 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nFigure 2: TheUrban Chronicles modules. The Preprocessing Pipeline prepares the raw PLUTO data to be stored by\ntheData Storage . As long as the user interacts with the Visual Interface the produced queries are handled by the Query\nProcessor .\nData extraction. This step of the pipeline is responsible for collecting, cleaning, and consolidating the information\ncontained in the raw collection of shapeﬁles. The cleaning task consists of discarding invalid lots (e.g., lots with\nmissing geometric components) from the data set and standardizing attribute names that changed over the years.\nThe collecting task is responsible for extracting from PLUTO the attributes that will be made available by U R-\nBANCHRONICLES forexploration. Theattributesusedinthispaperwereselectedbyoururbanplannersandarchitects\ncollaborators and are shown in Table 1. Finally, the consolidation task is responsible for merging the collected and\ncleaned data of all boroughs into a single CSV ﬁle that is the input of the next step of the pipeline.\nRedundancy removal. The goal of this step is to detect and discard redundant geometries and attributes contained\nin the releases of PLUTO. We observe that the shape of most lots doesn’t change over the years. When that happens,\nwe store the geometry of the ﬁrst occurrence of the lot and replace the geometry of the following occurrences with a\nreferencetothestoredone. However,asdiscussedinSection4,thegeometryofthelotsinthePLUTOdatasetmaybe\nupdatedevenwhentheyremainunchangedintherealworld,revealingadataqualityproblem. Tohandlethisissue,we\nusethefollowingstrategy: Let’ssaythat bidenotesalotwithBBL binagivenyear Yiandg.bi/denotesthegeometry\nofbi, whereiË [1;ðYð],Y= ^2002;:::;2017:1`. We say that g.bi+1/andg.bi/are the same when:\nArea .g.bi/ ãg.bi+1/ /\nmax.Area .g.bi/ /;Area .g.bi+1/ / /f\u000f\nInourimplementationweused \u000f= 0:9. AsweshowinTable2,theaveragegeometryredundancyoneachboroughis\nhigher than 90%.\nAsimilarideaisappliedtoremoveattributeredundancy. However,insteadofindividuallyhandlingeachattribute,\nwegroupthemintosetsofattributesandtrackunchangedsets. Wedeﬁnethreetypesofattributesetscalledcategorical,\nnumerical-stable,andnumerical-unstable. Asthenamesuggests,thecategoricalsetincludesthecategoricalattributes\nof the lots, such as the LANDUSE class. The numerical-stable set includes numerical attributes that change less\nfrequently over time, such as the LOTAREA value. The numerical-unstable set includes numerical attributes that are\nlikely to vary over the years, such as the ASSESSLAND value. Lets denote by a.bi/the values in a set of attributes\nof a lot with BBL bin year Yi. If all values of a.bi/anda.bi+1/are the same, we store the set a.bi/, and represent\na.bi+1/by a reference to a.bi/. On average, at least 79% of the categorical, 66% of the numerical-stable and 21% of\nthe numerical-unstable sets are redundant (see Table 2).\nGeographic level processing. Several diﬀerent geographical subdivisions are used by the public administration in\nthe deﬁnition of city policies, rezoning plans, etc. For this reason, U RBANCHRONICLES provide to users the ability\nto explore PLUTO data based on the borough, neighborhood, community district, block, and lot levels (see requisite\nR1). Thisrequisiterequiresthecomputationofthelotsthatbelongtothegeographicalregionsofeachlevel. PLUTO\ndata already stores to which borough and block belong every lot of the city (see Section 3). On the other hand, the\nneighborhood and community district that contains a given lot must be computed using geometric operations. More\nprecisely,givenageographicalsubdivision P= ^p1;:::;pðPð`,wecomputepairwiseintersectionsbetweenthepolygonal\nregions piand theblocks ofthe city onevery year. Todo so, werandomly select alot bjand testits intersectionwith\nallregions pi. Onceweﬁndaregion pithatcontainsthelot bj,wesaythatalllotsinthesameblockof bjalsobelong\ntopi.\nC. Santos et al.: Preprint submitted to Elsevier Page 6 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\n... ... ...\n...\n...... ...\n...\n...\nCity Boroughs Neighborhoods Blocks Lots2002 2003 2017. 1 ...\nGeometries ...\nInternal Node Data (Representing a Region with ID p)Years (Y)Geometries Container (G)... ... ... g(b )1 g(b )n g(p )m\nmg(p )1\nAttributes Container (A)... ... ... a(b )1 a(b )s a(b )'t a(b )'1\nYears (Y) 2002 2003 2017. 1 ...\nGeometries ...\nAttributes ...\nLeaf Node Data (Representing a Lot with BBL b)g(b )1g(b )1 g(b )n\na(b )1a(b )2 a(b )s\ng(p )1g(p )1 g(p )\nFigure 3: The data transformed by the Preprocessing Pipeline is stored in a custom data structure composed by the\nSpatio-temporal Index , theGeometries Container and theAttributes Container . The ﬁrst uses a tree data structure to\nlocate the lots at each geographical level. The second and third store the geometries and attribute sets extracted from\nthe PLUTO data set releases. The internal and leaf nodes of the tree, store references to the data associated with the\ngeographical regions and lots that they represent and are stored in containers.\n5.2. Data Storage\nAfterpreprocessingthePLUTOdataset,thetransformedinformationisstoredinacustomdatastructure,illustrated\ninFigure3. Thedatastructure,composedofin-memory datacontainers andaspatiotemporalindex ,wasdesignedto\nworktogetherwiththe QueryProcessor moduletohandletherequestsgeneratedbythe VisualInterface module(see\nSection 5.4). This data structure allows our system to process queries in interactive time, allowing us to tackle one of\nthe requisites [R5]listed in Section 4.\nThedatacontainers storethelots’andgeographicalregions’geometries,aswellasthelots’attributessetsthatwere\nextracted in the Preprocessing Pipeline . We call these data containers as Geometries Container andAttributes Con-\ntainer. TheSpatiotemporal Index stores the geographical level information computed in the Preprocessing Pipeline .\nIt is implemented using a tree data structure composed of ﬁve levels that represent the city, boroughs, neighborhoods\n/ districts, blocks, and lots’ geographical scales.We observe that either the neighborhoods or the community district\nregions are taken into account during the construction of the data structure. Since this option has no impact on the\nstructure’s design, from now on, we will assume the neighborhood regions are chosen. We also noticed that a geo-\ngraphicalregioninlevel l+ 1isalwayscontainedinasingleregionoflevel l. Thispropertyensuresthatthediﬀerent\nlevels can be properly represented using a tree. In this way, the city level is represented by the root node of the tree\nandcoverstheentireNYC.Analogously,the boroughlevelcontainsnodesthatrepresenteachoftheﬁveboroughsof\nthe city; the neighborhood level contains nodes that represent the neighborhoods of each borough; and so on. Each\nleaf node stores one reference to its Leaf Node Data , which contains the indexes of the Geometries Container and\nAttributes Container positions in a global list that store the lot’s geometry and attribute sets in each PLUTO release.\nSimilarly, the internal nodes of the tree store one reference to its Internal Node Data , which contains the index\nof theGeometries List positions that hold the region’s geometry in the year of each PLUTO release. The amount of\nmemory required by the Spatiotemporal Index and the data containers are presented in Table 2. As we observe, the\noverhead is, in the worse case, 3.5 times the amount of data occupied by the preprocessed data.\nTo verify the eﬃciency of our data structure, we compare it to a widely adopted standard solution to store and\nquerydatasets. Moreprecisely,wecompareboththeloadingtimeandmemoryusageofthepreprocesseddatausingthe\nobject-relationaldatabasePostgreSQL.WedeﬁnedarelationalschematoaccommodateourdatamodelinPostgreSQL\nthat comprises of 5 diﬀerent tables to ensure data normalization. We observed that our solution provides both better\nloadingtimesandstorageconsumption. Asanexample,forthedatasubsetrelatedtoManhattan,theloadingtimeforall\ngeometriestook17seconds,whileinPostgreSQLittook626seconds. Similarly,wecanalsoobserveanimprovement\nin storage consumption. While our solution only uses 992 MB of in-memory space, PostgreSQL uses 1429 MB of\nspace shared between memory and disk space.\nC. Santos et al.: Preprint submitted to Elsevier Page 7 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nc\nAuxiliary Components\nAnalytical Components\neab\nf\nc\nd\nFigure 4: The components of the Urban Chronicles ’Visual Interface can be separated into two groups. The image\non the left shows the Auxiliary Components group, composed by the Main Menu (a), theConﬁguration Panel (b) and the\nColor Maps Legend (c). The image on the right shows the Analytical Components group that contains the Data History\nView(d), theMap View (e) and the Lot Filtering (f).\n5.3. Query Processor\nThequeryprocessorusesthe DataStorage ’sspatiotemporalindexandcontainerstoprocessthequeriesproducedby\nthevisualinterface. Thequeriessupportedbythesystemcanbeclassiﬁedingeometryretrieval,attributeaggregation,\nand lot ﬁltering operations. The geometry retrieval queries return the shape of a set of geographic regions in a given\nyear. For example, if the user wants to retrieve the geometry of the lots that belong to the block with id 01036 in the\nBrooklyn neighborhood called Park Slope in 2006, the Visual Interface would send a request to the Query Processor\nwith the tuple (NYC, B ROOKLYN , PARKSLOPE, 01036, 2006) as a parameter. The Query Processor then parses the\ntuple, navigating through the spatiotemporal index to collect the data.\nThe attribute aggregation queries return an attribute of interest aggregated over a set of geographic regions. For\nexample,iftheuserwantstoseethesumoftheLOTAREAforthelotsineachblockofaManhattanneighborhoodcalled\nSoHoin2009,the VisualInterface wouldsendarequesttothe QueryProcessor withthetuple(NYC, M ANHATTAN ,\nSOHO, LOTAREA, SUM, 2009) as a parameter for the Query Processor to return the result. Our system supports\ndistributive (e.g., sum, count, min, max) and algebraic (e.g., average) aggregate functions.\nThe spatiotemporal index and aggregations are constructed in parallel in real-time, allowing users to deﬁne ﬁlters\non the PLUTO data and then analyze lots that satisfy certain constraints. For example, if the users are interested in\nstudyingresidentiallots,theycandeﬁneaﬁlterusingthe VisualInterface andaskthe QueryProcessor torebuildthe\nindex considering only lots that ﬁt the desired criteria. Users can compose ﬁlters using boolean operations. Using\na notebook equipped with a Core i7@2.2 GHz, 16 GB of RAM, SSD drive, and NVidia GeForce GTX 1060 GPU,\nthe time required to compute summaries and ﬁlter lots for an entire borough like Manhattan is on average 0.3s, while\nin PostgreSQL, using the schema cited in 5.2, it took 4.86s for the same query. We also calculated the time taken\nfor similar queries in neighborhood and block levels. Queries using our method took on average 0.03s and 0.01s,\nrespectively. Using PostgreSQL, the same queries took on average 0.85s and 0.86s. All times reported in this section\nwere calculated based on an average of 10 trials of the same query.\n5.4. Visual Interface\nBased on the requirements speciﬁed in collaboration with our urban planners and architects collaborators (Sec-\ntion 4) we designed a visual interface that allows users to interactively explore the history of PLUTO data at diﬀerent\nspatialscales. AcoarsergeographicallevelprovidestheuserwithanoverviewofthePLUTOattributes. Forexample,\nattheneighborhoodlevel,itispossibletoidentifywhatneighborhoodhasthehighestincreaseinthecommercialarea\nin a year of interest. Moreover, whenever more detail is required, the users can interactively drill down to the block\nand lot levels. Using the previous example, the user could explore the lots of the neighborhood and check if a new\ncommercial center was built. As shown in Figure 4, the visual interface is composed of several components. These\ncomponents can be separated into two groups, the auxiliary and the analytical ones, described in the following.\nAuxiliary components. This group contains the Main Menu , theConﬁguration Panel and theColor Maps Legend ,\nlabeledas(a),(b)and(c)respectivelyinFigure4. The MainMenu allowstheusertoshow/hidetheothercomponents.\nC. Santos et al.: Preprint submitted to Elsevier Page 8 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nTheConﬁguration Panel lets the user adjust the system options. More precisely, in this panel, it is possible to deﬁne\nwhat borough the user wants to explore; what set of geographical regions (neighborhoods or community districts)\nshould be used in the coarser scale of the analysis; whether the block levels should be skipped or not during the\nanalysis; and the color mapping strategy used in the Map View (see details below).\nAnalyticalcomponents. Thisgroupcontainsthe DataHistoryView ,theMapView andtheLotFiltering components,\nindicated respectively by the labels (d), (e) and (f) in Figure 4. The Data History View contains two linked visualiza-\ntions,alinechartandaheatmatrix. Usedtogether,theyenabletheusertoexplorethevalueoflotattributeofinterest\nand its change over the years (see requirement R2). The user can select the attribute that will be visualized in both\ncharts using the top toolbar. Each line of the heat matrix represents a geographical region of the current exploration\nlevel. For example, if the neighborhood level is active, each line of the matrix represents one neighborhood of NYC.\nAlso, each column of the matrix is associated with a release year of the PLUTO data. By default, the lines of the\nmatrix are sorted using the alphabetical order of the names of the regions, but they can also be sorted based on the\nvalues of a given year. In the example of Figure 4, the heat matrix is sorted by the values of 2011.1. Using the top\ntoolbar, the color assigned to each square of the heat matrix can be conﬁgured to encode the changes of the selected\nattribute yearly or over a ﬁxed interval of years. Whenever the value of a square is invalid or the lot doesn’t exist in\nthe associated year, it is colored in gray. In the example of Figure 4, the ﬁrst column of the matrix is colored in gray\nsincetheAREAattributewasnotavailablein2002. Theheatmatrixallowsuserstosimultaneouslyanalyzethechange\n(or the value) of the selected attribute in all regions/years and facilitates the identiﬁcation of prominent values. For\ninstance, in Figure 5 we observe a major drop in assessed land values of several Brooklyn neighborhoods, blocks and\nlots in 2013, a year after Hurricane Sandy.\nSimilarly,eachlineinthelinechartrepresentsaregionofthecurrentexplorationlevel. InFigure4,thelinechart\ncontainstwolinesrepresentingLincolnSquare(blue)andHudsonYards(orange)neighborhoods. Thehorizontalaxis\nofthechartspansthereleasedatesofthePLUTOdata,whiletheverticalaxiscanbeconﬁgured(usingthetoolbaron\nthetopofthecomponent)torepresenttheattributevaluesortheiryearlyvariation. Itshouldbeclearthatthelinechart\nandtheheatmatrixalwaysdisplaycomplementaryinformation. Forexample,iftheheatmatrixisconﬁguredtoshow\nthe attributes variation, the line chart is automatically set to show the attribute values and vice versa. The line chart\nallowstheusertoeasilycomparetheattributevalues(orvariation)ofregionsofinterestovertheyears. Thelinecharts\ninFigure5showthevariationontheassessedvalueforselectedregionsintheneighborhood,blockandlotlevels. We\nobserve that the value drop can be seen in all scales.\nTheMapView showsthesetofgeographicalregionsofthecurrentexplorationlevelinoneoftheavailableyears(see\nrequirements R3andR4). InFigure4the MapView showstheneighborhoodsofManhattancoloredusingthe2009.2\ndata. Similarly to the heat matrix, regions can be colored based on the attribute values or their variation between the\nselectedandthepreviousreleaseyears. InFigure4,theregionsarecoloredbytheattributevariation. Thevisualization\nofgeographicalregionsusingthemapallowstheusertoidentifyspatialpatternsthatwouldbeimpracticaltoidentify\nusing theheat matrix or theline chart. For instance, inFigure 5 if weinspect the Map View we discover thatthe drop\nin the assessed land values happens in the shoreline neighborhoods. On the block and lot levels, it becomes evident\nthat the change happened to blocks and lots located on the peripheral areas closer to the shoreline.\nThe last analytical component is the Lot Filtering panel. This component allows the user to deﬁne ﬁlters based\non the PLUTO data attributes. The ﬁlters are used to dynamically select lots that will be considered during the visual\nanalysis. The user is allowed to deﬁne multiple ﬁlters and combine them using boolean operations. It is important to\nstressthat,onceaﬁlterisdeﬁned,the SpatiotemporalIndex oftheDataStorage moduleisupdatedinreal-timebased\non lots that satisfy the constraints. For example, if the users are only interested in analyzing lots with the smallest\nconstructed areas, they can deﬁne a ﬁlter based on the BUILTFAR attribute. As we can see in Figure 4, to deﬁned a\nﬁlter,abarchartwiththedistributionofthevaluesoftheselectedattributeisshownandtheuserdeﬁnestheconstraint\nby brushing over the chart.\nGeographical level navigation. As we discussed before, one of the main characteristics of U RBANCHRONICLES is\nenabling the exploration of the PLUTO data at diﬀerent scales. By default the Visual Interface module starts in the\nneighborhood (or community districts level) exploration scale. However, the user can drill down to the block and\nlot level to explore details in a speciﬁc geographical region. To do so, the user must click on the label of one of the\ngeographical regions in the vertical axis of the heat matrix. Once a label is selected, the Data History View and the\nMapView areupdatedtodisplaythedatafromtheselectedregion. IntheexampleshowninFigure5,theuserstarted\nthe analysis exploring Brooklyn neighborhoods. After the assessed land value drop was detected, the user clicked in\nC. Santos et al.: Preprint submitted to Elsevier Page 9 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nNorth Side-South SideCarnasie2013. 2\nAssessed Land Value\nNormalized Assessed TotalAssessed Land Value(a) Neighborhood Level\nResidential  & Mixed Use(b) Block Level: Carnasie \n2013. 2Normalized Assessed Total Normalized Assessed Total\nNumber of Buidlings (Neighborhood Level)Normalized Assessed Total Normalized Assessed Total\n(c) Block Level: North Side-South Side\nNumber of Buidlings (Neighborhood Level)Residential  & Mixed Use2013. 2\n+327+41\n120k1.4M\nFigure 5: Example of interactive exploration of NYC’s historical land-use data at diﬀerent spatial resolutions using Ur-\nban Chronicles . (a) Neighborhood Level: Temporal evolution of the assessed land value of Brooklyn neighborhoods.\nThe heat matrix encodes value change in each neighborhood (rows) over the years (columns of the matrix). Red cells mark\nsigniﬁcant drop in assessed land value in the ﬂood zone areas in 2013, a year after Hurricane Sandy. The map depicts the\nspatial variation of the value decrease, where the neighborhoods with the highest drop are on the shoreline. (a-bottom left)\nThe line chart show a sharp diﬀerence between the normalized assessed total value of the two neighborhoods: Carnasie\n(Orange line) and North Side-South Side (Blue line). (b,c - top) Block level: North Side-South Side has some blocks with\nincreased normalized assessed total value while in Canarsie, we see severe value drop in most residential blocks. Line charts\ndepicts the new residential buildings constructed in 2013. 327 new buildings were constructed in Canarsie (b-bottom left)\nwhile North Side-South Side only had 41 new buildings (c-bottom left).\nthe label of the Canarsie neighborhood. During the inspection of the block level, it became clearer that the drop was\nconcentrated in the shoreline blocks. By clicking in the label of the blocks the user could observe the most aﬀected\nlots. Whenever the user starts to navigate through the diﬀerent scales, the bottom toolbar of the Data History View\ndisplays the analysis path that is being followed by the user (see the bottom of component (d) in Figure 4). This way,\nonce the block or lot level is active, the navigation path can be used to roll-up to the coarser levels.\n5.5. Implementation Details\nURBANCHRONICLES was implemented as a web-based system so that we could easily make it accessible to our\ncollaborators. Theback-endofthesystemwasimplementedinC++andconsistsofaweb-serverthatdeliverstheweb\napplication ﬁles and handles HTTP requests by calling the functionalities of the Data Storage andQuery Processor\nmodules. The VisualInterface wasimplementedusingJavaScript. Inordertoimplementthe MapView component,we\nusedWebGLanddatacollectedfromOpenStreetMap. Wedecidedtoimplementourcustommapsolutioninorderto\nenabletherenderingofalargenumberofpolygons. The DataHistoryView andLotFilteringPanel wereimplemented\nusing D3, and the Preprocessing Pipeline using Python.\n6. Case Studies\nTracingdatabackandheedingitstrendscantellmultiplestories,signalaturningpoint,orrevealhiddenpatterns.\nBesides, we can identify the immediate or deferred impacts of events as well as the trajectory of future trends. All of\nthis can be lost if we only look at cross-sectional data, without gaining any insights into the journey it had through\ntime. U RBANCHRONICLES enablesustoexploreintricatedatasetstodiscoverthesehiddenlinksandbuildnarratives.\nInthissection,wepresenttwocasestudiescarriedoutbyurbanplannersandarchitectsthatillustratetheutilityofthe\ntool.\n6.1. Post Sandy Redevelopment and Aﬀordability\nHurricane Sandy hit NYC in late 2012 and the impact was devastating; destroyed buildings, ﬂooded streets, and\nbillions of dollars in damage. In 2013, the National Flood Insurance Program (NFIP) released the Preliminary Flood\nInsurance Rate Maps (PFIRMs) requiring homeowners in the high-risk zones to pay insurance premiums based on\ntheirﬂoodrisk. Thenewprogramextendedthegeographicallocationofhigh-riskareas. Whilethiscanhelpmitigate\nthe adverse eﬀects in the future, such provisions can create signiﬁcant pressure for lower-income communities and\nworking-class homeowners living in high-risk ﬂood areas.\nC. Santos et al.: Preprint submitted to Elsevier Page 10 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\n(b) Oﬃce Area (Sum)\n (a) Downtown Brooklyn Region\n (c) Residential Area (Sum) (d) Downtown Brooklyn (e) Financial District (f) Midtown Business DistrictLot Area (Avg) Oﬃce Area (Avg)\n18.2M\n17M17.4M\n16.5M\n 4.3M7.5M8.7M14.7M\n8.4k\n7.8k26k\n21k13.1k\n11.6k\n225k\n170k340k\n316k77k\n69k\nOﬃce Building Class\nFigure 6: Using Urban Chronicles to select lots inside the Special Downtown Brooklyn District (SDBD) (a). Top:\nTotal area of oﬃces (b), and residential (c) buildings in SDBD from 2005 to 2017. Bottom: oﬃce (b) and residential lots\n(c) within SDBD, highlighted in white and shades of blue, darker color indicates larger total area. Line charts depicting\naverage lot area (top) and average oﬃce area (bottom) of SDBD, FD and Midtown Business District (d,e,f)\nBy looking at the data after Hurricane Sandy using U RBANCHRONICLES , we can identify patterns that provide\ninsightsintotheimpactsofsuchprovisionsonlower-incomeneighborhoods. Wetracedthelandandpropertyassessed\nvalues as well as residential development rates in both areas and discovered alarming trends.\nNeighborhoodlevel: Assessedlandvaluedrop. WeﬁrstfoundnoticeablechangeofassessedlandvalueinBrooklyn\nthrough the Data History View . A sharp decrease in the second half of 2013, one year after Sandy, can be easily\ndetected (Figure 5(a)). As the map shows, this decrease happened in shoreline neighborhoods impacted the most\nby the hurricane. The pattern also matches the PFIRMs. Next, we use U RBANCHRONICLES to explore two of the\nimpactedareasthathadsigniﬁcantlydiﬀerentratesofnormalizedassessedtotalvalueswhilebothlocatedinhigh-risk\nﬂoodzones. Thenormalizedassessedtotalvalue,calculatedbydividingtheassessedtotalvaluebythelotarea,gives\namoreaccuratemeasurewhenitcomestocross-comparisonbetweenregionsofdiﬀerentsizes. WechoseNorthSide-\nSouthSide,aneighborhoodwiththeassessedtotalvalueof1.45milliondollarspersq.ftandCanarsie,alower-income\nneighborhood with 148 thousand dollars assessed total value per sq. ft. as of 2013. Figure 5(a) shows their location\nand normalized assessed total values.\nBlock level: Tracing assessed total value change. Using U RBANCHRONICLES , we drill down to the block level to\nexplorethepatternofvaluedropinresidentialareaswithinbothneighborhoods. Asshownonthemap(Figure5(b,c)),\nwhileinCanarsie,weseeasigniﬁcantdecreaseinthenormalizedtotalassessedvalueofthemajorityoftheresidential\nblocks (highlighted in shades of red); in North Side-South Side, some blocks still had their values appreciated (high-\nlightedinshadesofblue). OnepotentialexplanationcanbethelargerextentofSandydamageinCanarsieduetolower\nﬂood resiliency measures in residential building construction and lack of coastal protection [16]. This indicates how\nnaturaldisasterscancreatemoreburdenforlower-incomeneighborhoodssuchasCanarsie,wherethemajorityofthe\nresidents are working-class homeowners already struggling with their mortgages [65].\nReportsshowthatonlyﬁvepercentoftheresidentialbuildingsinthewholeCanarsiehadﬂoodinsuranceatthetime\nof Sandy [16, 8]. The new provision would require all homeowners in the ﬂood zone areas to have ﬂood insurance,\nand the premium would rise 18% per year, phasing up to the full premium price. It can be challenging for many\nhouseholds with ﬁxed income to aﬀord the annual 18% increase and can lead to their displacement. The change in\nthe number of new buildings within the residential areas shows that in 2013, 327 new buildings were constructed in\nCanarsie Figure 5(b-bottom left) while in North Side-South Side only 41 new buildings were constructed Figure 5(c-\nbottom left). The large number of new constructions, speciﬁcally the addition of 224 new homes in 2016, the year\nthat PFIRMs took eﬀect, can signal a rise in foreclosure and short sales in Canarsie, possibly due to the inability of\nhomeowners to accommodate the rising mandatory ﬂood insurance together with the repair costs for the majority of\nuninsuredownersforwhomthetaxdecreaseisinsigniﬁcantincomparisontorisingtidesandcosts[8]. Furtherresearch\ncan uncover the reasons behind the heightened development activities and examine the role of diﬀerent factors such\nas ease of access and proximity to Manhattan or ﬂood resiliency and robust structural system in explaining diﬀerent\nrebuilding rates in the two neighborhoods.\nThroughanalysissuchasthisone,itbecomespossibletoevaluatetheinterplaybetweendiﬀerentelementssuchas\nland value, total assessed value per sq. ft and the number of new buildings. The unique features of U RBANCHRONI-\nCLESenableustointeractivelyswitchbetweengeographicallevelswhiletrackingalltheﬁnelevelactivitiesandreveal\nsome unexpected patterns. This leads to insights, and ultimately questions around equitable rebuilding, displacement\nand aﬀordability that might otherwise not be addressed.\nC. Santos et al.: Preprint submitted to Elsevier Page 11 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\n6.2. Downtown Brooklyn Rezoning\nIn2004,amidstthefallineconomicactivities,NYCfounditsregionalpositionindecline. After9/11,itwasthought\nthatworkerswouldnotbewillingtoreturntotheFinancialDistrict(FD),sothecityneededtocreateanewcommercial\ndistrict to keep jobs from moving to upcoming commercial districts in other areas, speciﬁcally New Jersey’s new and\nupcomingneighborhoodsinHobokenandJerseyCity. WhilethepricesinManhattanwerestillrisingandmanyofthe\navailableoﬃcebuildingsdidnotsatisfythe“ClassA”standards,Brooklyn’splantotransformtheSpecialDowntown\nBrooklyn District (SDBD) into a vibrant Business District, attracting headquarters from competing places, seemed\nvery plausible.\nThe goal of the Downtown Brooklyn rezoning was to absorb the oﬃce demand that resulted in the decline of the\nFDandaddresstheNYC’sshortageofClassAoﬃceinventoryby\"oﬀeringClassAspacewithoutClassArents\"[52].\nTheplanwasapprovedin2004,andtheﬁnalEnvironmentalImpactStatement(EIS)predictedthatby2013Downtown\nBrooklyn will 1) construct 4.6 million sq. ft. of oﬃce space, 2) construct 0.9 million sq. ft. of residential space, 3)\nincrease tax revenue, and 4) increase the public space and cultural amenities. In a report published by the Brooklyn\nBoroughPresidentin2016,theoutcomesoftherezoningplanafteradecadewasanalyzed,anditwasconcludedthatthe\nplantoalargeextenthaddivergedfromitsinitialgoals[1]. Theanticipatedadditionof0.9millionsq.ft. ofresidential\nspace was met way before the planned time and as the line chart shows (Figure 6(c)) and it grew unprecedentedly\nbeyond predictions. This implies that the city should establish regular reevaluations of their goals. The rezoned area\nof Downtown Brooklyn is part of the Community District 2 (CD2) (Figure 6(a)). U RBANCHRONICLES can help\ndiscoversomeoftheunderlyingcausesofmismatchesbetweentheEISpredictionandtheactualoutcomesoftheplan,\nlooking through the 13 years of land use and tax lot from 2004 to 2017.\nOﬃce and residential space. The main motivation of the rezoning plan was to promote the economic viability of\nthe area by providing ample high standard commercial and oﬃce space to capture the regional growth and attract\nprivate investment. As stated in the report, by 2016, only 1.3 million sq. ft of commercial space (including oﬃce\nspace) has been developed in the SDBD [1]. PLUTO dataset provides information on the oﬃce areas per lot, using\nURBANCHRONICLES we can take a closer look at the oﬃce space development trend. The line chart in Figure 6(b)\nshows that the total oﬃce area in Downtown Brooklyn increased in the ﬁrst four years of the program but after that,\ntheoveralltrendhasbeendeclining,tothepointthatin2017,itdeclinedtolessthanitsinitialvaluein2004,whichis\nin contrast with the main goals of the plan.\nBycomparingthecharacteristicsoftheoﬃcebuildingsinFDandMidtownBusinessDistrict(BD),whichabsorbed\na signiﬁcant portion of the demand from FD [31], we can have a better picture of the type of oﬃce space in demand.\nOne of the deﬁning characteristics of the FD oﬃce space was their large ﬂoor plate [23]. Looking through oﬃce\nbuildingclass,asFigure6(e)shows,inFDoﬃcebuildingswereconstructedonlotsthatareonaverage25,000sq.ft.,\nwhereasthisnumberisaround8,000forSDBD(d-top),morethanthreetimeslowerthantheaveragelotsizesthatFD\noﬃcesneeded. AlthoughMidtownBDalsohaveitsoﬃcesbuiltonsmallerlotsof12,500sq.ft. onaverage(e-top),it\nis still signiﬁcantly higher than SDBD. Moreover, the average oﬃce area shows that each lot in Midtown BD has on\naverage,around220,000sq.ft. ofoﬃceareaspreadacrossdiﬀerentﬂoors(e-bottom). InSDBD,however,theaverage\noﬃce area per lot is around 73,000 sq. ft. (d-bottom) which is signiﬁcantly smaller in comparison with Midtown BD\nand FD. Hence, we can say that lot size can be one of the main factors in explaining why SDBD was not successful\nin absorbing the oﬃce demand. To accommodate such demand, there is a need for merging of the lots. Besides, the\nrelatively small lot size is a perfect choice for private developers to place their next residential or mixed residential-\ncommercial buildings and the upward trend of residential buildings shown in Figure 6(c-bottom), conﬁrms this. By\nexaminingthemapofoﬃceandresidentialbuildingsinSDBD,Figure4(b-bottom),wecanseewhytherewasnomajor\nincreaseinthenumberofoﬃcesinDowntownBrooklyn,astheirlotsizesarelimitedandirregularshapescomplicates\nthemergingpossibility[20]. Hence,eitherthecityneedstolookthroughmechanismstoincentivizezoninglotmergers\nor they have to look for other locations that satisfy the requirements such as access transit, locality and density.\nTheanalysisoftheDowntownBrooklynrezoningplanusingU RBANCHRONICLES enabledustodrilldownoneof\nthemainreasonsbehindthedetouroftheplanfromitsinitialgoals, thelotsizeandshape . Thisresultwouldhavenot\nbeenreachedwithoutinteractivelyexploringthedatainﬁne-graintemporalintervals,trackingthechangesonmultiple\nspatial levels while transitioning between visualizing the change and values on the map to gain more insights. The\nresults signify the need for regular reevaluation of the employed strategies, which can open the possibility of making\nearly adjustments to ensure that the initial goals are realistic and attainable and the undertaken strategies are leading\nto the desired outcomes. As we showed, U RBANCHRONICLES can provide a solid basis to perform such study.\nC. Santos et al.: Preprint submitted to Elsevier Page 12 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nNeighborhood Level Block Level\n2012. 1 2012. 2\nFigure 7: The heat matrix of Brooklyn’s neighborhoods (left) shows an outlier (green square) in the variation of the\nnumber of open space and recreational lots in Park Slope-Gowanus in 2012. Checking the block level, we see that the\n2012.1 blocks were merged in 2012.2, during the construction of the Barclay’s Center arena.\n7. Discussion\nLot merges and splits. As we observed in Section 4, lot merges and splits information is not provided in PLUTO\ndata. Also, because of the inconsistencies in the lots’ geometries and the reuse of the BBL of a split or merged lot\nafter the operation, designing an algorithm to build the “genealogy graph” of the lots is a challenging task. However,\nURBANCHRONICLES can facilitate the exploration of lot merges and splits throughout the city. Figure 7 depicts the\nmergeofagroupoflotsdetectedusingtheheatmatrixcomponentofU RBANCHRONICLES . Infact,thevariationinthe\nnumber of lots classiﬁed as open space and recreational land use in the Park Slope-Gowanus neighborhood using the\nheatmatrixofthe DataHistory ,showsasigniﬁcantrisein2012.1(highlightedindarkblue)followedbyasharpdrop\nin 2012.2 (highlighted in dark red). Drilling down to the blocks level, we observe that the pattern is being caused by\nthereclassiﬁcationofthelotsofthreespeciﬁcblocks,thatweremergedintheprocessofBarclay’sCenterconstruction\nin 2012.\nArcGIS Pro comparison. ArcGIS Pro is a general, commercial GIS software designed for map making and spatial\nanalysis. However, being a general system means it cannot be very eﬃcient in handling all types of data, with higher\nthanoptimalexecutiontime. Forinstance,theoperationsofselectingtheManhattanandBrooklynboroughs,selecting\na set of attributes, aggregating to the community district level and saving the results for three diﬀerent MapPLUTO\nlayers took more than 2 minutes to complete.\nUnlike U RBANCHRONICLES , in ArcGIS Pro, the user cannot dynamically switch between diﬀerent geographi-\ncal levels of the map. They need to use aggregation functions for each layer to perform any type of analysis on that\ngeographical level. The execution time can vary depending on the size of data and the level of aggregation. For in-\nstance, aggregating on block level for the three layers of MapPLUTO took slightly more than one minute whereas\nURBANCHRONICLES does this task interactively on-the-ﬂy. Moreover, the process of measuring and visualizing the\nattributeandgeometrychangebetweentwoyearswhereeachyearcomesinaseparateshapeﬁleinvolvesseveralsteps\nin ArcGIS Pro such as Overlay Layers, Overlay Count, calculate year ﬁeld and Heat Chart and this process should\nbe repeated for any given pairs of years for which the changes should be computed. Doing the same task in U R-\nBANCHRONICLES is as easy as choosing the attribute of interest to see its change over a year or a selected interval of\nyears.\nExperts feedback. During the development of U RBANCHRONICLES we held semi-structured interviews with three\nurbanplannerpartners,wherewepresentedthediﬀerentiterationsofthesystem. Duringtheinterviews,weobserved\nhow easy it was for the participants to reach insights illustrated by our case studies and recorded their feedback about\nthe usability of U RBANCHRONICLES . It is important to point out that interviewees use the PLUTO data set as a part\noftheirdailyworkﬂow,exploringvariousurbanandenvironmentaldesign,publicpolicy,andplanningscenarios. Our\ncollaborators have extensive experience working for public agencies and large architectural ﬁrms (at least 6 years).\nBesides that, one of the coauthors of this paper is a specialist in urban systems and helped us with the assessment of\nthe tool by using it to gain new insights into problems she is currently tackling in her research.\nC. Santos et al.: Preprint submitted to Elsevier Page 13 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nUsershighlightedtheusefulnessandthevalueofthetool,especiallyitsfastresponsetimewhenqueryingPLUTO.\nOne of the domain experts that used our tool is an employee at NYC’s Department of City Planning, the agency\nresponsible for maintaining the PLUTO data set. She highlighted that U RBANCHRONICLES “merges PLUTO in a\nway that it’s diﬃcult to do, making visual exploration accessible beyond conventional tools\" . Common suggestions\nincludetheneedforamethodtoautomaticallyloadnewdatasetsastheyarebeingreleasedandproperdocumentation.\nWe are currently incorporating some of the suggestions made by the diﬀerent domain experts so that the tool can be\nwidely deployed to diﬀerent stakeholders, including city agencies. It is important to point out that the case studies\nwere performed independently by the domain experts, without supervision from the visualization experts.\n8. Conclusion and Future Work\nInthispaper,weproposedU RBANCHRONICLES ,asystemdesignedtoenabletheinteractivevisualexplorationof\nall versions of the PLUTO data set released from 2002 to 2017. The data set can be seen as a spatiotemporal one in\nwhich the spatial component is not merely composed of points but of complex geometries that evolve over time. To\nloadallPLUTOreleasesinmemory,wedesignedaredundancyremovalstrategythatallowsthereuseof90%ofthelots\ngeometriesandfrom18%to70%oftheattributesdependingontheirclassiﬁcation. Also,inordertoachieveon-the-ﬂy\naggregationofattributesandﬁlteringoflotsatmultipleresolutions,wedevelopedadatastorageandaqueryprocessor\nthat allow the processing of all lots of Manhattan in less than one second with a memory overhead of only 3.5 .\nWe intend to extend the use of the system to other cities that have similar data sets. Although the ideas presented\nin this paper can be used with any spatiotemporal data set with complex geometries, other challenges can emerge\nbased on the characteristics of the new data. Also, building a visualization system to interactively design and explore\ndiﬀerent rezoning plan scenarios can be an interesting future research topic. Having access to such a system, urban\nplanners would try to avoid unforeseen scenarios like the one described in Section 6. Finally, we plan to investigate\nother visualization designs for spatiotemporal data sets with complex geometries.\nAcknowledgment\nThis work was supported in part by: NSF awards CNS-1229185, CCF-1533564, CNS-1544753, CNS-1730396,\nCNS-1828576,CNS-1626098;CNPqgrant305974/2018-1;FAPERJgrantsE-26/202.915/2019,E-26/211.134/2019.\nC. Santos et al.: Preprint submitted to Elsevier Page 14 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\nReferences\n[1] Adams, E. L. (2016). A decade later in downtown brooklyn: A review of the 2004 rezoning. Available: https://brooklyn-usa.org/\nwp-content/uploads/2016/02/Downtown-Brooklyn-2004-Rezoning_Final.pdf .\n[2] Andrienko,G.,Andrienko,N.,Hurter,C.,Rinzivillo,S.,&Wrobel,S.(2013). Scalableanalysisofmovementdataforextractingandexploring\nsigniﬁcant places. IEEE Transactions on Visualization and Computer Graphics ,19, 1078–1094.\n[3] Andrienko,N.,Andrienko,G.,Patterson,F.,&Stange,H.(2019). Visualanalysisofplaceconnectednessbypublictransport. IEEETransac-\ntions on Intelligent Transportation Systems , .\n[4] Barbosa,L.,Pham,K.,Silva,C.T.,Vieira,M.R.,&Freire,J.(2014). Structuredopenurbandata: Understandingthelandscape. BigData,2.\n[5] Bassett, E. M. (1940). Zoning: The laws, administration, and court decisions during the ﬁrst twenty years . Russell Sage Foundation.\n[6] Black, D., & Henderson, V. (2003). Urban evolution in the usa. Journal of Economic Geography ,3, 343–372.\n[7] Bronstert, A., Niehoﬀ, D., & Bürger, G. (2002). Eﬀects of climate and land-use change on storm runoﬀ generation: present knowledge and\nmodelling capabilities. Hydrological processes ,16, 509–529.\n[8] Center for NYC Neighborhoods (2014). Rising Tides, Rising Costs:Flood Insurance and New York City’s Aﬀordability Crisis. Available:\nhttps://cnycn.org/wp-content/uploads/2014/09/Rising-Tides-Rising-Costs-2014_compressed.pdf .\n[9] Chen, Q., Conway, A., & Cheng, J. (2017). Parking for residential delivery in New York City: Regulations and behavior. Transport Policy ,\n54, 53 – 60.\n[10] Chicago Metropolitan Agency for Planning (CMAP) (2021). Land Use Data. Available: https://www.cmap.illinois.gov/data/\nland-use .\n[11] City and County of San Francisco (2021). DataSF. Available: https://data.sfgov.org .\n[12] City of New York (2021). NYC Open Data. Available: https://nycopendata.socrata.com .\n[13] Conejero, J. M., Preciado, J. C., Fernández-García, A. J., Prieto, A. E., & Rodríguez-Echeverría, R. (2021). Towards the use of data engi-\nneering, advanced visualization techniques and association rules to support knowledge discovery for public policies. Expert Systems with\nApplications ,170, 114509.\n[14] DataMade (2021). Second City Zoning. Available: https://secondcityzoning.org/ .\n[15] Deng, Z., Weng, D., Chen, J., Liu, R., Wang, Z., Bao, J., Zheng, Y., & Wu, Y. (2019). Airvis: Visual analytics of air pollution propagation.\nIEEE Transactions on Visualization and Computer Graphics ,26, 800–810.\n[16] Department of City Planning (2017). Resilient neighborhoods canarsie. Available: https://www1.nyc.gov/assets/planning/\ndownload/pdf/plans-studies/resilient-neighborhoods/canarsie/summary-report-canarsie.pdf?r=1 .\n[17] Department of Planning and Development, City of Chicago (2021). Zoning and Land Use Map. Available: https://gisapps.chicago.\ngov/ZoningMapWeb .\n[18] Doraiswamy, H., Tzirita Zacharatou, E., Miranda, F., Lage, M., Ailamaki, A., Silva, C. T., & Freire, J. (2018). Interactive visual exploration\nofspatio-temporalurbandatasetsusingurbane. In Proceedingsofthe2018InternationalConferenceonManagementofData SIGMOD’18\n(pp. 1693–1696). New York, NY, USA: ACM.\n[19] Du,Y.,Wen,W.,Cao,F.,&Ji,M.(2010). Acase-basedreasoningapproachforlandusechangeprediction. ExpertSystemswithApplications ,\n37, 5745–5750.\n[20] Ellickson, R. C. (2012). The law and economics of street layouts: How a grid pattern beneﬁts a downtown. Ala. L. Rev. ,64, 463.\n[21] Ferreira, N., Lage, M., Doraiswamy, H., Vo, H., Wilson, L., Werner, H., Park, M., & Silva, C. (2015). Urbane: A 3D framework to support\ndatadrivendecisionmakinginurbandevelopment. In 2015IEEEconferenceonvisualanalyticsscienceandtechnology(VAST) (pp.97–104).\n[22] Ferreira, N., Poco, J., Vo, H. T., Freire, J., & Silva, C. T. (2013). Visual exploration of big spatio-temporal urban data: A study of New York\nCity taxi trips. IEEE Transactions on Visualization and Computer Graphics ,19, 2149–2158.\n[23] Fürst, F. (2006). Empirical analysis of oﬃce markets: A spatio-temporal approach.\n[24] Getz,S.(2017). ExaminingtheExtenttowhichAﬀordableHousingDevelopmentActsasaCatalystforNeighborhoodEconomicDevelopment .\nPh.D. thesis Columbia University.\n[25] Goldberg, L. L. M. (2015). Game of zones: neighborhood rezonings and uneven urban growth in Bloomberg’s New York City . Ph.D. thesis\nMassachusetts Institute of Technology.\n[26] Goldman, E. A. (2017). Preserving the Social Fabric of Community: A Mixed-Methods Analysis of The Newly-Designated Historic Districts\nin Brooklyn, New York (2007-2015) . Ph.D. thesis Cornell University.\n[27] Goldstein, B., & Dyson, L. (2013). Beyond Transparency: Open Data and the Future of Civic Innovation . Code for America Press.\n[28] Gong, K., Zhang, L., Ni, D., Li, H., Xu, M., Wang, Y., & Dong, Y. (2020). An expert system to discover key congestion points for urban\ntraﬃc.Expert Systems with Applications ,158, 113544.\n[29] Halkos,G.,&Tsilika,K.(2019). Understandingtransboundaryairpollutionnetwork: Emissions,depositionsandspatio-temporaldistribution\nof pollution in european region. Resources, Conservation and Recycling ,145, 113–123.\n[30] Hamnett, C., & Whitelegg, D. (2007). Loft conversion and gentriﬁcation in london: from industrial to postindustrial land use. Environment\nand planning A ,39, 106–124.\n[31] Haughwout, A. F., Rabin, B. et al. (2005). Exogenous shocks and the dynamics of city growth: Evidence from new york. Federal Reserve\nBank of New York Economic Policy Review ,11, 61–73.\n[32] Hoang-Vu, T., Been, V., Ellen, I. G., Weselcouch, M., & Freire, J. (2014). Towards understanding real-estate ownership in New York City:\nOpportunities and challenges. In Proceedings of the International Workshop on Data Science for Macro-Modeling (pp. 1–2).\n[33] Huang, H. (1996). The land-use impacts of urban rail transit systems. Journal of Planning Literature ,11, 17–30.\n[34] Johnston, K., Ver Hoef, J. M., Krivoruchko, K., & Lucas, N. (2001). Using ArcGIS geostatistical analyst . ESRI.\n[35] Kalnay, E., & Cai, M. (2003). Impact of urbanization and land-use change on climate. Nature,423, 528–531.\n[36] Kraska, T., Beutel, A., Chi, E. H., Dean, J., & Polyzotis, N. (2018). The case for learned index structures. In Proceedings of the 2018\nInternationalConferenceonManagementofData SIGMOD’18(p.489–504). NewYork,NY,USA:AssociationforComputingMachinery.\nC. Santos et al.: Preprint submitted to Elsevier Page 15 of 16\n\nA Visual Analytics System for Proﬁling Urban Land Use Evolution\n[37] Kremer, P., Hamstead, Z. A., & McPhearson, T. (2013). A social–ecological assessment of vacant lots in New York City. Landscape and\nUrban Planning ,120, 218 – 233.\n[38] Lawler, J. J., Lewis, D. J., Nelson, E., Plantinga, A. J., Polasky, S., Withey, J. C., Helmers, D. P., Martinuzzi, S., Pennington, D., & Radeloﬀ,\nV.C.(2014). Projectedland-usechangeimpactsonecosystemservicesintheunitedstates. ProceedingsoftheNationalAcademyofSciences ,\n111, 7492–7497.\n[39] Lim, H., Kim, J., Potter, C., & Bae, W. (2013). Urban regeneration and gentriﬁcation: Land use impacts of the cheonggye stream restoration\nproject on the seoul’s central business district. Habitat International ,39, 192–200.\n[40] Lins, L., Klosowski, J. T., & Scheidegger, C. (2013). Nanocubes for real-time exploration of spatiotemporal datasets. IEEE Transactions on\nVisualization and Computer Graphics ,19, 2456–2465.\n[41] Liu,Z.,&Heer,J.(2014). Theeﬀectsofinteractivelatencyonexploratoryvisualanalysis. IEEETransactionsonVisualizationandComputer\nGraphics,20, 2122–2131.\n[42] Liu, Z., Jiang, B., & Heer, J. (2013). imMens: Real-time visual querying of big data. Computer Graphics Forum ,32, 421–430.\n[43] Ma, J., Cheng, J. C., Jiang, F., Chen, W., & Zhang, J. (2020). Analyzing driving factors of land values in urban scale based on big data and\nnon-linear machine learning techniques. Land Use Policy ,94, 104537.\n[44] Marcus, N. (1983). Air rights in New York City: Tdr, zoning lot merger and the well-considered plan. Brook. L. Rev. ,50, 867.\n[45] Miranda, F., Doraiswamy, H., Lage, M., Wilson, L., Hsieh, M., & Silva, C. T. (2019). Shadow Accrual Maps: Eﬃcient Accumulation of\nCity-Scale Shadows Over Time. IEEE Transactions on Visualization and Computer Graphics ,25, 1559–1574.\n[46] Miranda, F., Hosseini, M., Lage, M., Doraiswamy, H., Dove, G., & Silva, C. T. (2020). Urban mosaic: Visual exploration of streetscapes\nusing large-scale image data. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems CHI ’20 (p. 1–15).\n[47] Miranda, F., Lins, L., Klosowski, J. T., & Silva, C. T. (2018). Topkube: A rank-aware data cube for real-time exploration of spatiotemporal\ndata.IEEE Transactions on Visualization and Computer Graphics ,24, 1394–1407.\n[48] Mitra, S., Khandelwal, P., Pallickara, S., & Pallickara, S. L. (2019). STASH: Fast hierarchical aggregation queries for eﬀective visual spa-\ntiotemporal explorations. In 2019 IEEE International Conference on Cluster Computing (CLUSTER) (pp. 1–11).\n[49] Morris, S. A. (1989). Zoning and historic Preservation . National Park Service.\n[50] Munneke,H.J.(2005). Dynamicsoftheurbanzoningstructure: Anempiricalinvestigationofzoningchange. JournalofUrbanEconomics ,\n58, 455 – 473.\n[51] New York City Department of City Planning (2021). PLUTO README Document. Available: https://www1.nyc.gov/assets/\nplanning/download/pdf/data-maps/open-data/pluto-readme.pdf .\n[52] New York City Department of City Planning (2004). Downtown brooklyn. Available: https://www1.nyc.gov/assets/planning/\ndownload/pdf/plans/downtown-brooklyn2/dwnbklyn2.pdf .\n[53] New York City Department of City Planning (2021). PLUTO and MapPLUTO. Available: https://www1.nyc.gov/site/planning/\ndata-maps/open-data/dwn-pluto-mappluto.page .\n[54] New York City Department of City Planning (2021). ZoLa. Available: https://zola.planning.nyc.gov/ .\n[55] NYCommons (2021). Who owns NYC’s public spaces? Available: https://nycommons.org/ .\n[56] Ortner, T., Sorger, J., Steinlechner, H., Hesina, G., Piringer, H., & Gröller, E. (2017). Vis-A-Ware: Integrating spatial and non-spatial\nvisualization for visibility-aware urban planning. IEEE Transactions on Visualization and Computer Graphics ,23, 1139–1151.\n[57] Palomo, C., Guo, Z., Silva, C. T., & Freire, J. (2016). Visually exploring transportation schedules. IEEE Transactions on Visualization and\nComputer Graphics ,22, 170–179.\n[58] Practica Capital (2013). PlaceILive.com. Available: http://placeilive.com/ .\n[59] Schaeﬀer, K. H., & Sclar, E. (1980). Access for all: transportation and urban growth . Columbia University Press.\n[60] SenateDepartmentforUrbanDevelopmentandHousing(2021). LandUsePlanningBerlin. Available: https://www.stadtentwicklung.\nberlin.de/planen/fnp/en/fnp/index.shtml .\n[61] Sobral,T.,Galvão,T.,&Borges,J.(2020). Anontology-basedapproachtoknowledge-assistedintegrationandvisualizationofurbanmobility\ndata.Expert Systems with Applications ,150, 113260.\n[62] Terroso-Saenz, F., & Munoz, A. (2020). Land use discovery based on volunteer geographic information classiﬁcation. Expert Systems with\nApplications ,140, 112892.\n[63] The city of Chicago (2021). Chicago Data Portal. Available: https://data.cityofchicago.org .\n[64] The Municipal Art Society of New York (2018). Accidental Skyline: Air Rights. Available: https://www.mas.org/interactive_\nfeatures/accidental-skyline-air-rights/ .\n[65] Travers, S. (2013). Canarsie braces for foreclosure wave after sandy. Available: https://citylimits.org/2013/02/19/\ncanarsie-braces-for-foreclosure-wave-after-sandy .\n[66] UrbanReviewer (2021). Mapping master plans for New York City. Available: http://www.urbanreviewer.org/ .\n[67] Wang,Z.,Cashman,D.,Li,M.,Li,J.,Berger,M.,Levine,J.A.,Chang,R.,&Scheidegger,C.(2018). Neuralcubes: Deeprepresentationsfor\nvisual data exploration. arXiv:1808.08983 .\n[68] Witlox, F. (2005). Expert systems in land-use planning: An overview. Expert Systems with applications ,29, 437–445.\n[69] Yu, L., Wu, W., Li, X., Li, G., Ng, W. S., Ng, S.-K., Huang, Z., Arunan, A., & Watt, H. M. (2015). iVizTRANS: Interactive visual learning\nforhomeandworkplacedetectionfrommassivepublictransportationdata. In Proceedingsofthe2015IEEEConferenceonVisualAnalytics\nScience and Technology (VAST) (pp. 49–56).\n[70] Zacharatou, E. T., Doraiswamy, H., Ailamaki, A., Silva, C. T., & Freiref, J. (2017). GPU rasterization for real-time spatial aggregation over\narbitrary polygons. Proceedings of the VLDB Endowment ,11, 352–365.\n[71] Zheng, Y., Wu, W., Chen, Y., Qu, H., & Ni, L. M. (2016). Visual analytics in urban computing: An overview. IEEE Transactions on Big\nData,2, 276–296.\nC. Santos et al.: Preprint submitted to Elsevier Page 16 of 16",
  "textLength": 74707
}