{
  "paperId": "265f78f2682e8cff424ee98d0b24579cb5918811",
  "title": "A Survey on Big IoT Data Indexing: Potential Solutions, Recent Advancements, and Open Issues",
  "pdfPath": "265f78f2682e8cff424ee98d0b24579cb5918811.pdf",
  "text": "/gid00030/gid00035/gid00032/gid00030/gid00038/gid00001/gid00033/gid00042/gid00045 /gid00001\n/gid00048/gid00043/gid00031/gid00028/gid00047/gid00032/gid00046Citation: Kouahla, Z.; Benrazek, A.E.;\nFerrag, M.A.; Farou, B.; Seridi, H.;\nKurulay, M.; Anjum, A.; Asheralieva\nA. A Survey on Big IoT Data\nIndexing: Potential Solutions, Recent\nAdvancements, and Open Issues.\nFuture Internet 2022 ,14, 19.\nhttps://doi.org/10.3390/ﬁ14010019\nAcademic Editor: Xiumin Wang\nReceived: 25 November 2021\nAccepted: 27 December 2021\nPublished: 31 December 2021\nPublisher’s Note: MDPI stays neutral\nwith regard to jurisdictional claims in\npublished maps and institutional afﬁl-\niations.\nCopyright: © 2021 by the authors.\nLicensee MDPI, Basel, Switzerland.\nThis article is an open access article\ndistributed under the terms and\nconditions of the Creative Commons\nAttribution (CC BY) license (https://\ncreativecommons.org/licenses/by/\n4.0/).\nfuture internet\nReview\nA Survey on Big IoT Data Indexing: Potential Solutions, Recent\nAdvancements, and Open Issues\nZineddine Kouahla1\n, Ala-Eddine Benrazek1\n, Mohamed Amine Ferrag1,*\n, Brahim Farou1\n, Hamid Seridi1,\nMuhammet Kurulay2, Adeel Anjum3\nand Alia Asheralieva3\n1Labstic Laboratory, Department of Computer Science, Guelma University, Guelma 24000, Algeria;\nkouahla.zineddine@univ-guelma.dz (Z.K.); benrazek.alaeddine@univ-guelma.dz (A.-E.B.);\nfarou.brahim@univ-guelma.dz (B.F.); seridi.hamid@univ-guelma.dz (H.S.)\n2Department of Mathematics Engineering, University of Yildiz Technical, Istanbul 34349, Turkey;\nmkurulay@yildiz.edu.tr\n3Department of Computer Science and Engineering, Southern University of Science and Technology,\nShenzhen 518055, China; adeelanjum2001@hotmail.com (A.A.); asheralievaa@sustech.edu.cn (A.A.)\n*Correspondence: ferrag.mohamedamine@univ-guelma.dz\nAbstract: The past decade has been characterized by the growing volumes of data due to the\nwidespread use of the Internet of Things (IoT) applications, which introduced many challenges\nfor efﬁcient data storage and management. Thus, the efﬁcient indexing and searching of large\ndata collections is a very topical and urgent issue. Such solutions can provide users with valuable\ninformation about IoT data. However, efﬁcient retrieval and management of such information in\nterms of index size and search time require optimization of indexing schemes which is rather difﬁcult\nto implement. The purpose of this paper is to examine and review existing indexing techniques for\nlarge-scale data. A taxonomy of indexing techniques is proposed to enable researchers to understand\nand select the techniques that will serve as a basis for designing a new indexing scheme. The real-\nworld applications of the existing indexing techniques in different areas, such as health, business,\nscientiﬁc experiments, and social networks, are presented. Open problems and research challenges,\ne.g., privacy and large-scale data mining, are also discussed.\nKeywords: big data; Internet of Things; indexing; information retrieval; query\n1. Introduction\nWidespread utilization of Internet of Things (IoT) systems and applications has re-\nsulted in the massive data expansion promising greater beneﬁts for businesses and individ-\nuals, but also introducing signiﬁcant challenges for big data analytics. Such an expansion\nalso plays an important role in the dynamics of large data. In particular, large data can\nbe classiﬁed according to their volume, variety and velocity (“3V’s” for short). These\ncategories were ﬁrst introduced by Gartner, Inc. to highlight some elements of the chal-\nlenges associated with large volume data [ 1–5]. Afterwards, veracity and value have been\nincorporated as two additional categories (“5V’s”) [ 6,7]. Others have also expanded this\nbig data category to 6V’s and 7V’s [ 8]. The capacity to process and use large amounts of\nIoT data, e.g., smart-city, smart-grid, e-health, Internet of Vehicles (IoV), Internet of Video\nThings (IoVT), agriculture, etc., is a key factor in the success of a project [ 9–11]. The process\nof indexing large amounts of IoT data comprises many phases where a range of IoT data is\nanalyzed to highlight changes.\nThroughout the last decade, privacy violations have increased dramatically. Although\nprivate data is emerging as an extremely important resource for business development,\nthe activities of collecting, processing and personal trading data are leading to increasing\nprivacy disclosure risks, and numerous privacy disclosure incidents [12,13].\nThe use of data indexing and IoT in large datasets is extremely resource-intensive,\nand IoT may be an exceptional alternative. The process of merging technologies increases\nFuture Internet 2022 ,14, 19. https://doi.org/10.3390/ﬁ14010019 https://www.mdpi.com/journal/futureinternet\n\nFuture Internet 2022 ,14, 19 2 of 44\nthe possibilities of deploying IoT in more effective domains that attempt to extend the\nideas of social interconnectedness to IoT; consider the most common ones, namely, the\nSocial Internet of Things (SIoT) [ 14,15], the Multiple IoT Environment (MIE) [ 15,16], and\nthe Multiple Internets of Things (MIoT) [ 15,17,18]. Figure 1 represents the process of\ndiscovering and searching large IoT indexing data from different IoT devices under a three-\ntier fog computing architecture. Implementing large-scale IoT data integration solutions in\na fog computing architecture [19–21] can help overcome data and indexing issues.\nFigure 1. Discoverable and searchable of Big IoT Data indexing from different IoT devices under\nthree-tier fog computing architecture.\nIn addition, it can also contribute to improving collaboration and communication\nbetween different objects in a smart city. Hence, the management and indexing of large-\nscale data has been the subject of several large-scale data reviews. In this study, the authors\nfocus, however, on large IoT data in the context of indexing a massive amount of data.\n2. Motivation\nThe methods used to process IoT data must be efﬁcient. However, the increase in data\nsize with the appearance of new types of data (time series, ﬁngerprints, DNA sequences,\ndocuments, etc.) has changed the problem.\nDue to the diversity of IoT research, solutions developed in one application envi-\nronment may not be compatible with others. For this reason, various survey papers are\npresented on IoT and big data for multiple applications see Table 1. A number of inves-\ntigative papers related to different aspects of data IoT are published to date, covering\nvarious deﬁnitions of IoT, core technologies, architecture, and different applications IOT,\nfor example [22–25].\n\nFuture Internet 2022 ,14, 19 3 of 44\nTable 1. Comparison of past surveys.\nSurvey Year Architecture Data Type Dimension Complexity Application Data Structure Objectives\nS. Pattar et al. [26] 2018 Yes Yes Partial Partial No Partial• Present a review of leading research methods for IoT and classify them according to their design principle\nand research approaches such as IoT data.\nMohammadi et al. [27] 2018 Yes Yes No No Yes No• Identify the characteristics of the IoT data\n• Focus on the challenges of research for a successful fusion of Deep Learning and IoT applications.\n• Review current methods of advanced DL and their applicability in the ﬁeld of IoT, both for large datasets and\nfor continuous analysis.\nSaha et al. [28] 2018 No No No No Yes No• Propose a taxonomy of Big Data technologies in IoT ﬁelds.\n• Suggest large-scale data technologies applicable in the ﬁeld of IoT.\n• Discuss the advantages and disadvantages of large-scale data technologies in IoT.\nShabnam et al. [29] 2018 Yes Yes No No Yes No• Combine the systematic mapping and literature review\n• Propose a taxonomy of three categories : Architecture and platform, framework and application.\nR. Ettiyan et al. [30] 2020 Yes No No No Yes Yes• Examine a various kind of applications including the Healthcare Management System experimented and\nimplemented via IoT in recent years.\nEceiza et al. [31] 2021 Yes Partial Partiel No No Partial• Present a review of fuzzy techniques and proposals, and their applications to embedded IoT devices. Fur-\nthermore, propose future research directions, highlighting the gaps identiﬁed in the analysis.\nWei et al. [32] 2021 Yes No No No Yes No• Presents a comprehensive review of the application of ML techniques for the analysis of important IOT data\nin the healthcare sector.\n• Discuss the beneﬁts and challenges of existing techniques.\nBaofeng et al. [33] 2021 Yes No No No Yes No• Examine the beneﬁts, applications of critical infrastructure technologies-NIB-, typical use cases and IdE-based\ndevelopment trends.\nA.Shah et al. [34] 2021 Yes No No No Yes No• Investigate CME and network splitting for the provision of 5G service-orienteduse.\n• Discusses recent progress in the implementation of E2E network slicing, its core technologies, solutions, and\ncurrent standardization efforts\nS.Amin et al. [35] 2021 Yes No No No Yes No• Analyze the existing and evolving edge computing architectures and techniques for smart healthcare and\nrecognize the demands and challenges of different application scenarios.\n• Examine edge intelligence that targets health data classiﬁcation with the tracking and identiﬁcation of vital\nsigns using state-of-the-art deep learning techniques.\n• Presents a comprehensive analysis of the use of cutting-edge artiﬁcial intelligence-based classiﬁcation and\nprediction techniques employed for edge intelligence.\nChegini et al. [36] 2021 Yes No No No Yes No• Examine, studie and analyze automatic functions.\n• Demonstrate the automatic functions through these searches according to each challenge.\nOur survey / Yes Yes Yes Yes Yes Yes• Identify and evaluate the main data indexing techniques in the IoT system.\n• Classify the indexing techniques used in large data.\n• Design a taxonomy and analyze the indexing techniques according to the indexing needs of large data.\n• Provide a structural comparison based on the construction and search algorithms related to these techniques\n• Explore the opportunities and challenges for each of the reviewed methods and IoT environments.\n• Review the emerging areas that would intrinsically beneﬁt from Big data indexing and IoT.\n\nFuture Internet 2022 ,14, 19 4 of 44\nThe study of [ 22] reviews the state of art of different data mining techniques used in\nlarge and small-scale IoT applications. It provides the general context and reviews several\nrelated applications and technologies. However, it lacks the comparative study between\nthe structures used and their efﬁciencies.\nOther work [ 27,37] has studied the convergence of data mining with IoT. The study\nby [38] examined the power of large IoT data analysis in IoT applications. Along with the\ndiscussion on data analysis, method and techniques of IoT, they also presented a cloud\noriented data architecture.\nMost of this research is focused on technology, knowledge extraction or analysis. Some\nalso have applications, but are speciﬁc to a particular application. This study presents\na systematic and detailed review, oriented towards indexing structures, of various data\nconstruction and extraction algorithms that are well-used in an IoT environment. We have\nfocused this work towards the main contributions of our research work are the following:\n• Identify and evaluate the main data indexing techniques in the IoT system.\n• Classify the indexing techniques used in large data.\n• Provide a structural comparison based on the construction and search algorithms\nrelated to these techniques.\n• Design a taxonomy and analyze the indexing techniques according to the indexing\nneeds of large data.\n• Explore the opportunities and challenges for each of the reviewed methods and\nIoT environments.\n• Review the emerging areas that would intrinsically beneﬁt from Big data indexing\nand IoT.\nThe amount of information about IoT has multiplied considerably in recent years.\nTherefore, having an efﬁcient search system is currently one of the main challenges\nfor researchers.\nIn particular, based on the prior work in [ 39], an overview of the high requirements\nof massive IoT data indexing is presented and a new taxonomy of indexing techniques is\nproposed. In addition, a comprehensive review of existing research on indexing techniques\nis presented for a better understanding of the differences between the Big IoT data indexing\ntechniques. A thorough comparison of the existing research on indexing techniques is also\nprovided according to the datasets used, types, advantages, disadvantages and challenges.\nThe paper presents a comparative analysis of multidimensional indexing approaches and\nmetric access methods. Finally, an enumeration of existing research challenges and potential\nopportunities for future research directions in the area of data indexing for large-scale IoT\nprojects is presented.\n2.1. Methodology for Selecting the Research Papers\nThe identiﬁcation of literature for analysis in this paper was based on a keyword\nsearch, namely, “Indexing and searching”, “Big IoT data indexing”, “Indexing technique”,\nand “indexing framework”. Searching for these keywords in academic databases such as\nSCOPUS, Web of Science, and ACM Digital Library, an initial set of relevant sources were\nlocated. The search process produced a signiﬁcant number of results. Although a systematic\ncollection of literature has been performed, recent research has shown that relevant primary\nsources can be missed during searches and that multiple researchers working on the same\nmethodology may collect differing bodies of articles. However, only proposed indexing and\nsearching techniques for IoT applications were collected. Secondly, each collected source\nwas evaluated against the following criteria: (1) reputation, (2) relevance, (3) originality,\n(4) date of publication, and (5) most inﬂuential papers in the ﬁeld. The higher the overall\nscore, the higher the source was ranked on our list. Using this ranking system allowed the\nprioritization of sources. The ﬁnal pool of papers consists of the most important papers in\nthe ﬁeld of IoT data that focus on indexing and searching of large data collections as their\nobjective. Our search started on 1 January 2019 and continued until the submission date of\nthis paper.\n\nFuture Internet 2022 ,14, 19 5 of 44\n2.2. Survey Organization\nThis survey article is organized around several sections, as shown in Figure 2. It\nconsists of eight main sections:\n• Section 1\n– We present the reasons of the emergence of Big IoT Data and why indexing\ntechniques are required.\n– We illustrate the process of discovering and searching large IoT indexing data from\ndifferent modern IoT paradigms using a three-tier fog computing architecture.\n– We also provide a summary of existing literature surveys and what are the main\ngaps compared to our review.\n– We highlight the different contribution of the proposed survey and they are\norganized in the manuscript\n• Section 2\n– We present and describe the indexing requirements.\n– We explain the advantages of metric space and what is actually added to the\nindexing techniques with regard to the multidimensional space.\n– We highlight the critical importance of similarity queries in IoT applications\ninvolving large volumes of data and complex objects.\n• Section 3\n– We ﬁrst present our proposed taxonomy of existing indexing techniques in\nthe literature\n– We provide a detailed description of the majority of the indexing technique under\nthe proposed taxonomy.\n– We provide a comparative performance study of recent indexing techniques and\ntheir ability to solve Big IoT Data indexing problems\n– We summarize our analytical and comparative study for each indexing technique\ntype in the Tables 1–15\n• Section 4\n– We recall and study in depth several important techniques of multidimensional\nspace\n– We provide the main challenges for each indexing structure and its\npotential solutions\n• Section 5\n– We recall and study in depth several important techniques of metric space\n– We provide the main challenges for each indexing structure and its potential\nsolutions solutions\n• Section 6\n– We identify different directions for future research, which we believe are relevant\nto our work\n– We brieﬂy deﬁne each search direction and how indexing techniques can beneﬁt\nfrom it\n• Section 7\n– We provide a brief summary of our study and we highlight the most important\nissues that need to be addressed as soon as possible.\n• Section 8\n– We recall the main objective of our survey.\n– We provide a quick overview of the work provided by our manuscript\n\nFuture Internet 2022 ,14, 19 6 of 44\n1 2 3 4 5\nINTRODUCTION\nSection I\n(1) We present the reasons of the\nemergence of Big IoT Data and\nwhy indexing techniques are\nrequired.\n(2) We illustrate the process of\ndiscovering and searching large\nIoT indexing data from dif ferent\nmodern IoT paradigms using a\nthree-tier fog computing\narchitecture.\n(3) We also provide a summary of\nexisting literature surveys and\nwhat are the main gaps compared\nto our review .\n(4) We highlihgt the def ferent\ncontribution of the proposed\nsurvey and they are organized in\nthe manusciptBIG DA TA INDEXING\nREQUIREMENTS\nSection II\n(1) We present and describe the\nindexing requirements.\n(2) We explain the advantages of\nmetric space and what is\nactually added to the indexing\ntechniques with regard to the\nmultidimensional space.\n(3) We highlight the critical\nimportance of similarity queries\nin IoT applications involving\nlarge volumes of data and\ncomplex objects.\nEXISTING INDEXING\nTECHNIQUES\nSection III\n(1) We first present our proposed\ntaxonomy of existing indexing\ntechniques in the literature\n(2) We provide a detailed description\nof the majority of the indexing\ntechnique under the proposed\ntaxonomy .\n(3) We provide a comparative\nperformance study of recent\nindexing techniques and their ability\nto solve Big IoT Data indexing\nproblems\n(4) We summarize our analytical and\ncomparative study for each indexing\ntechnique type in the tables (1-15)A COMP ARA TIVE\nANAL YSIS OF\nMUL TIDIMENSIONAL\nINDEXING METHODS\nSection IV\n(1) We recall and study in\ndepth several important\ntechniques of multi-\ndimensional space\n(2) We provide the main\nchallenges for each indexing\nstructure and its potential\nsolutions\nA COMP ARA TIVE\nANAL YSIS OF METRIC\nACCESS METHODS\nSection V\n(1) We recall and study in\ndepth several important\ntechniques of metric space\n(2) We provide the main\nchallenges for each indexing\nstructure and its potential\nsolutions6OPEN RESEARCH\nCHALLENGES\nSection VI\n(1) We identify dif ferent\ndirections for future\nresearch, which we believe\nare relevant to our work\n(2) We briefly define each\nsearch direction and how\nindexing techniques can\nbenefit from it\n7 8\nSUMMAR Y\nSection VII\n(1) We provide a brief summary\nof our study and we highlight the\nmost important issues that need\nto be addressed as soon as\npossible.CONCLUSION\nSection VIII\n(1) We recall the main\nobjective of our survey\n(2) We provide a quick\noverview of the work\nprovided by our manuscript\nFigure 2. Organization of the survey.\nTo help readers navigate this paper, Figure 3 provides a detailed structure of\nthe survey.\nDetailed structure of\nthe manuscriptI. INTRODUCTION A. MOTIV ATION\nIII. EXISTING\nINDEXING\nTECHNIQUES\nB. METRIC INDEXING\nTECHNIQUESA. MUL TI-DIMENSIONAL\nINDEXING\nTECHNIQUESII. BIG DA TA\nINDEXING\nREQUIREMENTS\nIV. A COMP ARA TIVE\nANAL YSIS OF\nMUL TIDIMENSIONAL\nINDEXING METHODS1) Hashing-based\ntechniqueData Independent\nHashing\nData Dependent HashingUnsupervised Hashing\nSupervised Hashing\nSemi-supervised Hashing\nDeep hashing2) Tree-based techniqueNo partitioning of space\n(partitioning data)\nPartitioning of Space\n3) Bitmap-based\ntechnique\n1) No partitioning of space\n(partitioning data)2) Partitioning of Space\nHyper-plan partitioningHyper-sphere (or Ball)\npartitioningV. A COMP ARA TIVE\nANAL YSIS OF METRIC\nACCESS\nMETHODSVI. OPEN\nRESEARCH\nCHALLENGESA. IOT DA TA AGGREGA TION\nFOR 5G DA TA INDEXING\nB. BLOCKCHAIN DA TA\nINDEXING\nC. SECURITY AND PRIV ACY\nFOR 5G DA TA INDEXING\nD. IOT DA TA REPRESENT ATION\nIN THE EDGE\nCOMPUTINGVI. SUMMAR YVIII. CONCLUSION\nFigure 3. Detailed structure of the survey.\n\nFuture Internet 2022 ,14, 19 7 of 44\n3. Big IoT Data\nBig Data results from the signiﬁcant growth and data accumulation of Internet opera-\ntions and online applications such as social networks and video streaming [ 40,41]. However,\nin the context of IoT, different end-devices such as Personal Computers (PCs), smartphones,\nGlobal Positioning System (GPS) devices, sensors, and Radio Frequency Identiﬁcation\n(RFID) devices, monitoring devices, etc. used in different applications such as healthcare,\nmanufacturing, industry, smart homes, smart cities, etc. collect a large amount of data\ncontinuously, making IoT one of the main sources of Big data. Besides, it is also important\nto mention that crowd-sourcing and crowd-sensing mechanisms and tools play a more\nimportant role in Big IoT Data collection nowadays [42,43].\nThe merging of Big data and IoT data (or Big IoT data) created new features in addition\nto the Big data features discussed in [ 44–48]. These additional data characteristics provoke\nthe implementation of new data management techniques that consider the characteristics\nof Big IoT Data, presented in Figure 4. In other words, efﬁcient Big IoT Data indexing and\nsearching in large data collections is, therefore, a critical issue that requires choosing the\nappropriate structure.\nBig IoT Data\nBig Data\nVolume\nVelocity\nValue\nVariability\nVeracity\nVisualiza -\ntion\nVariety\nDistribution\nSpatio -\ntemporality\nDynamics\nPeriodicity\n Markovian\nInternet of Things\nFigure 4. Big IoT data’s characteristics.\n4. Big Data Indexing Requirements\nSome recent studies on indexing techniques have highlighted how to optimize the\nsearch performance in large datasets with greater efﬁciency. This section discusses and\ndescribes some of the indexing needs that are more challenging than traditional data. Then,\neach indexing technique is analyzed based on these constraints to determine its applicability\non a large scale.\nThe challenges of designing the indexing techniques are related to the need for gener-\nalization of multidimensional spaces to metric spaces and the additional constraints on the\nset of feasible solutions. The constraints in Figure 5 may include the constraints on data\nindependence, scalability, or efﬁciency [49].\nContraintsEfficiecy\nData \nindependence\nDynamicityScalability\nFigure 5. Big Data indexing requirements.\n\nFuture Internet 2022 ,14, 19 8 of 44\nIn general, the objects which require indexing are more complex than mere\nvectors [ 50–54]. This shifts the focus of indexing from multidimensional spaces to metric\nspaces. Formally, a metric space is deﬁned for quantifying similarities or different elements\nthrough a given distance in such a way that smaller distances may correspond to more\nsimilar elements. Metric spaces are therefore a very general concept and can be applied\nto vectors as well as objects such as strings and graphs that can not easily be represented\nas vectors [ 55]. Several similarity measures exist for various types of objects, such as\nMinkowski distances. Manhattan and Euclidean distances are best known and can be used\nfor any form of vector data, such as color histograms in multimedia databases.\nSimilarity queries are a very important operation in IoT applications involving large\ndata volumes and complex objects. They focus on finding objects in a dataset similar to a\nquery object, based on a similarity measure. In metric space, the similarity query refers to the\nselection of objects in a dataset Othat are at a certain distance d(\u0001,\u0001)from a given point oq.\nThe main factor that affects the efﬁciency of the indexing algorithm when the dimen-\nsion is increased is the dimensionality-curse problem [ 56,57]. The approaches available in\nthe literature have proven to be unreliable, making it difﬁcult to index, manage and analyze\nlarge volumes of data. This is due to the inherent deﬁciencies of spatial partitioning and\nalso to the factor of overlap between regions. This question therefore remains open for\nfuture research.\n5. Existing Indexing Techniques\nSection 2 outlines requirements based on the need to index and retrieve increasingly\nnumerous and complex data [ 58]. Thus, small data collections that include simple ob-\njects can be easily processed. However, managing large databases, like most databases\nused today, requires more sophisticated techniques, especially when they contain com-\nplex data types. The objects to be indexed are sometimes more complex than simple\nvectors (homogeneous—e.g., vector spaces; or heterogeneous—e.g., tuplets in a relational\ndatabase) [59–62].\nSeveral indexing techniques have been introduced to address the problems of indexing\nlarge data. This paper provides a comparative performance study of recent indexing\ntechniques and their ability to solve large data indexing problems. In addition, these\ntechniques are examined according to a proposed taxonomy (see Figure 6).\nIndexing T echniques\nIndexing structures in a\nMultidimensional Space\nIndexing structures in a Metric\nSpace\nHashing-based\ntechniques\nTree-based techniques\n Bitmap-based techniques\n Tree-based techniques\nFigure 6. Global taxonomy of indexing techniques.\nFigure 6 describes the classiﬁcation of indexing techniques according to space. Index-\ning techniques can be classiﬁed into two main categories: (i) multidimensional space and\n(ii) metric space.\n5.1. Multidimensional Indexing Techniques\nA multidimensional space is deﬁned when the elements of the set are considered as\nvectors (i.e., the data has a given number of dimensions), homogeneous or heterogeneous,\nwhose components are totally ordered. Thus, indexing techniques in multidimensional\nspaces can be classiﬁed into three main types according to the type of structure used:\n\nFuture Internet 2022 ,14, 19 9 of 44\n(1) hashing-based technique, (2) tree-based technique, and (3) bitmap-based technique. In\nthe following, we review the three types of multidimensional indexing techniques.\n5.1.1. Hashing-Based Technique\nThis is a more popular technique in the ﬁeld of multidimensional data indexing due\nto its ability to transform a data item into a low-dimensional representation (short code\ncomposed of a few bits) [ 63]. Hashing-based indexing structures are more efﬁcient in\nterms of time and storage space [ 64] and can detect duplicate data in a large dataset [ 65].\nThere are many methods based on the hashing technique applied to several real applica-\ntions, such as computer vision, information retrieval and analysis (e.g., images, videos,\ndocuments) [ 66]. According to Figure 7, hash-based indexing structures can be classiﬁed\ninto two main streams: data independent hashing and data dependent hashing (or learning-\nbased hashing) .\nData Independent Hashing: Among the data independent hashing methods, the\nLocality-Sensitive Hashing (LSH) developed by Gionis et al. [ 67] is the most popular in the\nliterature. It allows retrieving the sufﬁcient set of Approximate Nearest Neighbors (ANNs)\nin high dimensional space. One of the main criteria of the LSH techniques family is the\nhash function which returns with high probabilities, the same bit for close data points in the\noriginal space [ 68]. Since LSH’s proposal, several variants have been proposed to improve\nthe SLH method as: MultiProbe LSH [ 69,70], BayesLSH [ 71], Boosted LSH [ 72], Super-\nbit LSH [ 73], Non-metric LSH [ 74], Kernelized LSH (KLSH) [ 75] and Asymmetric LSH\n(ALSH) [ 76]. However, LSH-based techniques suffer from problems of increasing storage\ncosts and search time due to the long binary codes and high hash functions required\nwhen the recovery precision is improved [ 68]. In general, data-independent hash methods\nare well suited for small data, but they are not sufﬁcient to handle large data. Table 2\nshows a summary of the advantages and disadvantages of the above methods, as well as\ntheir challenges.\nData Dependent Hashing: In the hash stream depending on the data, several methods\nhave been proposed to overcome the problems and limitations of data independent hash\nmethods. These methods are classiﬁed into three categories according to the degree of su-\npervision, namely: (i) unsupervised hashing, (ii) supervised hashing, (iii) semi-supervised\nhashing, and (iiii) deep hashing.\nHashing-based T echniques\nData Independent Hashing\nData Dependent Hashing\n(or Learning-based Hashing)\nLocality-Sensitive Hashing (LSH)\n([18], 1999)\nSupervised Hashing\n Semi-supervised Hashing\n Unsupervised Hashing\nMultiProbe LSH ([20], 2007)\n&nbsp;([21], 2008 )\nBayesLSH ([22], 2012)\nBoosted LSH ([23], 2005)\nSuper-bit LSH ([24], 2012)\nNon-metric LSH ([25], 2010)\nKernelized LSH (KLSH) ([26], 2009)\nAsymmetric LSH (ALSH) ([27], 2014)\nSpectral Hashing (SH) ([29], 2009)\nSpherical Hashing ([34], 2012) ([33],\n2017)\nShared Hashing ([35], 2014)\nMultiple Hashing ([33], 2017)\nGraph Hashing (GH) ([30], 2015)\n([31], 2014) ([32], 2017)\nManifold Hashing ([36], 2013)\n([37], 2014)\nOnline Dynamic Multi-view Hashing\n(DMVH or ODMVH) ([38], 2017)\nRobust Discrete Spectral Hashing\n(RDSH) ([40], 2015)\nDistributed Indexing based on\nSparse-Hashing (DISH) ([41], 2019)\nKernel Based Supervised Hashing\n(KSH) ([47], 2012)\nMinimal Loss Hashing (MLH) ([50],\n2011)\nFast Supervised Discrete Hashing\n(FSDH) ([51], 2014)\nCOlumn Sampling based   DIscrete\nSupervised  Hashing  (COSDISH)\n([52], 2016)\nLinear Discriminant Analysis Hash\n(LDAHash) ([48], 201 1)\nSupervised Discrete Hashing (SDH)\n([49], 2015)\nSemi-supervised Discriminant\nHashing (SDH) ([56], 201 1)\nSemi-supervised Hashing (SSH)\n([53], 2012) ([54], 2010)\nBootstrap-NSPLH ([57], 2012)\nSemi-supervised multi-view discrete\nhashing (SSMDH) ([60], 2017)\nLabel-regularized Max-margin\nPartition (LAMP) ([55], 2010)\nSemi-supervised T opology-\nPreserving Hashing (STPH) ([58],\n2013) ([59], 2014)\nDeep hashing\nBit-Scalable Deep Hashing (DRSDH)\n([67], 2015)\nConvolutional Neural Networks for\nText Hashing (CNNTH) ([65], 2015)\n Asymmetric Deep Supervised\nHashing (ADSH) ([68], 2017)\nHashing with Mutual\nInformation ([71], 2019)\nHash coding with Deep Neural\nNetworks (HDNN) ([66], 2015)\nHashing as T ie-Aware Learning to\nRank ([69], 2018)\nFast Supervised Hashing (FSH)\n([42], 2017)\nFigure 7. Taxonomy of hashing-based indexing techniques.\n\nFuture Internet 2022 ,14, 19 10 of 44\nTable 2. Summary of advantage and disadvantage of data independent hashing techniques.\nProposition Refs Advantages Disadvantages and Challenges\nLHS [67]• Returns with high probabilities the same bit\nfor nearby data points in the original space by\nstoring similar data in the same bucket• High storage cost\n• High search time\n• Not sufﬁcient to processes high dimen-\nsional data.\nUnsuitable to process large dataMultiProbe LSH [69,70]• Reduce the number of hash table, there-\nfore, reduce space and time compared to LSH\nmethod• Insufﬁcient number of neighborhood\ncandidates to respond to KNN’s requests\nKernelized LSH [75]• Search for approximate similarity in sub-\nlinear time• High memory consumption\n• No data distribution or data entry assump-\ntions are required• The search for the nearest neighbor is\nvery difﬁcult for high dimensional data\nBayesLSH [71] • High quality of search results • Less effective performance\nSuper-bit LSH [73]• Signiﬁcant error reduction\n• More effective for approximate nearest\nneighbor recovery• Requires long hash codes and more\nhash tables\n• High cost of space and time\nAsymmetric LSH [76]• Simple and easy\n• Efﬁcient for maximum inner product re-\nsearch• Does not support exact search\nUnsupervised Hashing: For higher precision in the design of compact hash codes,\nunsupervised hashing methods aim to integrate data properties such as distributions\nand multiple structures [ 77]. Reference methods include spectral hashing [ 78], graph\nhashing [ 79–81], multiple hashing [ 82], spherical hashing [ 82,83], shared hashing [ 84],\nmanifold hashing [85,86], etc.\nRecently, a novel unsupervised online hashing method for online image retrieval was\nproposed by Liang et al. [ 87], called Online Dynamic Multi-View Hashing (ODMVH or\nDMVH) capable of adaptively increasing hash codes according to dynamic changes in the\nimage. These hashing techniques also use multi-view features to achieve more efﬁcient\nhashing performance. DMVH has limited performance because it is an unsupervised\nmethod and has not exploited any discriminative semantic information [88].\nYang et al. [ 89] developed a novel unsupervised hashing approach, named Robust\nDiscrete Spectral Hashing (RDSH) to facilitate large-scale semantic indexing of image data.\nRDSH can simultaneously learn discrete binary codes and robust hash functions in a uniﬁed\nmodel. Due to the difﬁculty of the latter, the authors included the ofﬂine process for the\nlearning binary codes as well as the coding functions and the online procedure for indexing\nimages with semantic annotations. Initially, the real value representation is learned from\nthe original space of the entities using methods such as Spectral Hashing (SH). Then,\nthe real representation is transformed into binary codes through binarization based on\nlearning. Several experiments have been performed on various real-world image datasets\nto demonstrate its effectiveness in large-scale semantic indexing approaches. Compared to\nlocality-sensitive hashing, the spectral hashing generates a very compact hash code, but it\nis not appropriate for a large and dynamic database. A new Distributed Indexing method\nbased on Sparse-Hashing (DISH) in cloud computing was developed by André et al. [ 90]\nto address the difﬁculties associated with distributing an index of high-dimensional feature\nvectors to multiple index nodes and search for large-scale distributed images. DISH allows\ndocuments and queries to be distributed in a balanced and redundant way between nodes.\nTable 3 provides a comparison of the technique discussed above.\nSupervised hashing: Supervised hashing methods are based on machine learning\ntechniques such as decision tree [ 91] and neural networks [ 92]. These methods aim to\ngenerate intelligent indexes that can predict the unknown behavior of the data [ 93,94]. The\nsupervised hashing methods allow to treat semantic similarities as well as the search for\nmedical images on a large scale [ 77,95]. Many representative methods have used some\nform of supervision to design more efﬁcient the hash functions: Kernel Based Supervised\nHashing (KSH) [ 96], Linear Discriminant Analysis Hash (LDAHash) [ 97], Supervised\nDiscrete Hashing (SDH) [ 98], Minimal Loss Hashing (MLH) [ 99], Fast Supervised Hashing\n(FSH) [91] and Fast Supervised Discrete Hashing (FSDH) [100].\n\nFuture Internet 2022 ,14, 19 11 of 44\nTable 3. Summary of advantage and disadvantage of unsupervised hashing techniques.\nProposition Refs Advantages Disadvantages\nSpectral Hashing [78]• Does not require any labeled data\n• Solve a difﬁcult non-linear optimization\nproblem with a global optimum• The assumption of a uniform distribu-\ntion of data is usually not applicable in\nmost cases of real-world data\n• Cannot directly applied in the kernel\nspace\n• Does not work very well for high-\ndimensional data• Less efﬁcient than a\n(semi-) supervised hashing\ntechnique\nSpherical Hashing [82,83]• Ensuring high accuracy and a highly\nscalable search for the nearest neighbor• Not sufﬁcient for high-dimensional\ndata\n• Limited performance.\n• Requires an expensive learning process\nto learn the hash functions• Unsuitable to process\nlarge data\nRobust Discrete Spectral\nHashing[89]• Robust hash functions\n• Very compact hash code compared to\nLSH• Not appropriate for a large and dy-\nnamic database\nGraph Hashing [79,80]• Suitable for large-scale applications\n• high search precision• Inefﬁcient in the search of nearest neigh-\nbors\n• High learning costs\nOnline Dynamic Multi-\nview Hashing[87] • More efﬁcient hashing performance • Limited performance\nDistributed Indexing based\non Sparse-Hashing[90]• Distribution of requests in a balanced\nway• High cost time\nLiu et al. [ 96] proposed a supervised hash method with kernels (KSH) in the Hamming\nspace, where the hash codes obtained for similar data are similar hash codes (minimizes\nsimilar pairs) and for different data, the hash codes obtained are different hash codes\n(maximizes dissimilar pairs). Kang et al. [ 101] proposed a discrete supervised hashing\nmethod, called Column Sampling based on Discrete Supervised Hashing (COSDISH).\nCOSDISH operates in an iterative way, and in each iteration, several columns are ﬁrst\nsampled from the semantic similarity matrix and then the hashing code is decomposed\ninto two parts and alternately optimize them in a discrete way. Compared to FSH [ 91],\nwhich cannot use all training points due to time complexity, COSDISH is capable to use all\ntraining data points. Table 4 compares several supervised hashing techniques.\nTable 4. Summary of advantage and disadvantage of supervised hashing techniques.\nProposition Refs Advantages Disadvantages\nMinimal Loss Hashing [99]• Efﬁcient and adapts well to long\ncode lengths• Training speed very slow• Difﬁculty of ﬁnding the label-\ning of all data in the database • Higher search precision Difﬁcult to optimize\nLinear Discriminant Anal-\nysis Hash[97]• Effective compact hashing• Slower because of the extraction of SIFT\ndescriptors• Less memory consumption and cal-\nculation cost• Much slower in terms of time\nand effort compared to unsuper-\nvised techniques Kernel Based Supervised\nHashing[96]• Efﬁcient hash functions • Not sufﬁcient for high-dimensional de-\nscriptors • Higher retrieval accuracy\nFast Supervised Hashing [91]• SuboptimalNot use all training points due to the com-\nplexity• Unsatisfactory performance\n• Fast ANN searchUnsatisfactory performance in real-world\napplications\nFast Supervised Discrete\nHashing[100]• Highly efﬁcient• Require a signiﬁcant degree of effort in\nlarge-scale applications• Very fast and high precision\n• Insufﬁcient for high-\ndimensional data• Low storage cost\nSupervised Discrete\nHashing[98] • Effective binary code learning• Expensive training time\n• Insufﬁcient precision rate\nColumn sampling based dis-\ncrete supervised hashing[101]• Capable to use all training data\npoints• Inefﬁcient binary codes\nSemi-Supervised hashing: Due to complexities of the exhaustive search of data la-\nbels in the database, semi-supervised hashing methods can use hash functions capable\nof training on two types of data, whether labeled or unlabeled data (partially labeled).\nIn other words, semi-supervised hashing is a combination of unsupervised and super-\nvised hashing [95] . The goal of the semi-supervised hashing method is to minimize the\n\nFuture Internet 2022 ,14, 19 12 of 44\nempirical error of labelled datasets and improve the binary encoding performance. Semi-\nsupervised hashing methods are able to handle semantic similarity and dissimilarity\nbetween data [102] based on non-weighted distance and simple linear mapping. Represen-\ntative methods include the Semi-Supervised Hashing (SSH) [ 102,103], which is considered\none of the most popular methods, along with Label-regularized Max-margin Partition\n(LAMP) [ 104], Semi-supervised Discriminant Hashing (SDH) [ 105], Bootstrap Sequential\nProjection Learning for Semi-supervised Nonlinear Hashing (Bootstrap-NSPLH) [ 106] and\nSemi-supervised Topology-Preserving Hashing (STPH) [ 107,108]. Lately, Zhang and Zheng\nin [109] presented a new semi-supervised hashing named Semi-Supervised Multi-view\nDiscrete Hashing (SSMDH). SSMDH minimizes the loss jointly when using relaxation on\nlearning hashing codes on multi-view data. SSMDH reduces the loss of regression on a\nportion of the labeled samples, which increases the discrimination ability of the learned\nhash codes. Table 5 compares several semi-supervised hashing techniques.\nTable 5. Summary of advantage and disadvantage of semi-supervised hashing techniques.\nProposition Refs Advantages Disadvantages\nSemi-supervised Hashing [102,103]• Empirical Error Minimization\n• Not suitable for high dimensional data• Much slower in terms of time\nand effort compared to unsuper-\nvised techniques• Variance and independence of binary\ncodes maximized\nLabel-regularized\nMax-margin Partition[104] • High-quality hash functions\nSemi-supervised\nDiscriminant Hashing[105]• Good separation between data labeled\nin different classes\nBootstrap-NSPLH [106]• Balanced partitioning of data points • Expensive training time\n• Impractical for high-dimensional\ndata• Higher performance• Require storage space and a large\namount of computation\nSemi-supervised\nmulti-view discrete\nhashing[109]• Minimizes the loss jointly on multi-\nview features when using relaxation on\nlearning hashing codes • Not suitable for high dimensional data\n• Increases the discrimination ability of\nthe learned hash codes\nDeep Hashing Methods: Several studies have used deep learning techniques such as\nin the image classiﬁcation [ 110,111] and object detection [ 112,113] methods. In addition,\nsome hashing methods available in the literature have focused on the adaptation of deep\nlearning techniques and in particular Deep Artiﬁcial neural Networks (DANS) to take\nadvantage of deep learning, such as Convolutional Neural Networks for Text Hashing\n(CNNTH) [114] , Simultaneous Feature Learning and Hash Coding with Deep Neural Net-\nworks [ 115], Bit-Scalable Deep Hashing With Regularized Similarity Learning for Image\nRetrieval and Person Re-Identiﬁcation (DRSDH) [ 116], Asymmetric Deep Supervised Hash-\ning(ADSH) [117] and hashing as tie-aware learning to rank [ 118]. Due to the automatic\nlearning ability of the deep learning methods, deep hashing methods have shown better\nperformance than traditional hashing methods [ 119]. Hash methods that adapt to in-depth\nlearning can be based on unsupervised or supervised learning, but most of these methods\nare supervised, with supervised information given with triplet labels [120] . Jiang and\nLi [117] proposed Asymmetric Deep Supervised Hashing (ADSH) for large-scale nearest\nneighbor search. ADSH learns a deep hash function only for query points, while the\nhash codes for database points are directly learned to reduce the training time complex-\nity.Table 6 below shows a comparison of some key advantages and drawbacks of deep\nhashing techniques.\n\nFuture Internet 2022 ,14, 19 13 of 44\nTable 6. Summary of advantage and disadvantage of deep hashing techniques.\nProposition Refs Advantages Disadvantages\nConvolutional Neural Net-\nworks for Text Hashing[114]• Better performance than traditional\nhashing methods• Unsuitable for all real-world domain\ndatabases\n• Performance decreases as\nthe dimensionality of the\ndata increases• Not sufﬁcient to processes high dimensional\ndata\nHash coding with Deep\nNeural Net[115]• Better performance • Demand pairwise similarity labels\n• Good search precision rate • Need a more complex conﬁguration\nBit-Scalable Deep Hashing [116]• Better performance than traditional\nhashing methods• Required labeled data and considerable hu-\nman efforts\nAsymmetric Deep Su-\npervised Hashing[117]• Reduce the complexity of training time• Learns the hash function only for query\npoints\n• High search precision rate • Higher complexity\nBetween unsupervised hashing and (semi-)supervised hashing, the most signiﬁcant\ndifference is the availability of label information for learning hash functions [ 121]. Com-\npared to unsupervised hash methods, supervised methods are much slower in terms of\ntime and effort due to the overload of the training process and due to the absence of\nlabel information. Thus, the unsupervised methods have a potential value for practical\napplications as they do not require any labeled information [ 122,123]. On the other hand,\nsupervised techniques take into account the advantage of explicit semantic labels of the\ndata, which provides a higher efﬁciency than unsupervised hashing techniques [64].\nIn general, to achieve satisfactory performance with data independent methods, many\nhash tables or long hash codes are required, which often makes them less effective in\npractice than data dependent methods. For data dependent, hashing methods (unsuper-\nvised, supervised and semi-supervised hashing) are needed to new solutions to address\nthe problem of optimization to learn hash functions and hash codes.\n5.1.2. Tree-Based Technique\nMultidimensional data has a number of dimensions. In metric spaces, this notion\ndisappears, not only does it disappear because the object is only considered as a whole\nand not as a set of components, but also because some objects are naturally without any\nperceptible dimension. This is the case of a sequence of characters, a set of elements of any\ndescription, a graph, etc.\nThis section presents some tree indexing techniques. Reference books or syntheses on\nthe subject have been proposed by several other authors. In addition, some authors have\nconsidered multidimensional indexing techniques as unsupervised classiﬁcation methods.\nIt is important to note that in a classiﬁcation, the classes are not of the same cardinal\nand that, in a hierarchical classiﬁcation, not all leaf classes are located at the same depth.\nIndexing techniques can be classiﬁed according to two main approaches:\nNo Partitioning of Space (Partitioning Data): The primary idea of data partitioning\nconsists of creating data packets or clusters, also called “inclusion forms”. In the litera-\nture, there three data-partitioning methods: those whose Minimum Bounding Regions\n(MBR) are hyper-cubes, those whose MBRs are hyper-spheres and those whose MBRs\narehyper-plane [124] . The main representative techniques of this approach include the\nB-tree [125] (and its and its variants: B+-tree [ 126], B*-tree, T-tree [ 127], UB-tree [ 128],\nBUB-tree [129], etc.), R-tree [130], the X-tree [131] and the SR-tree [132].\nR-tree is a hierarchical data structures based on B+-tree, where it is used to index\nspatio-temporal data of n-dimensions. R-tree generates several small minimum bounding\nrectangles (MBR) [ 130] to reduce dead spaces. R-tree is a balanced [ 133] and dynamic\nstructure [ 130] that is very efﬁcient for range requests [ 134]. The disadvantages of the R-tree\nstructure reside in the increase in space, time and complexity of the calculations because of\noverlapping multiple MBR regions [ 135]. Because of the overlapping, R-tree is inefﬁcient\nfor point location queries which can lead to a degradation of the performance of the search\nprocess [ 136]. Several extensions have been proposed based on the R-tree structure to\n\nFuture Internet 2022 ,14, 19 14 of 44\naddress the weaknesses of this structure mentioned above. Among these extensions, it can\nbe noted: R+-tree [137], R\u0003-tree [138], Hilbert R-tree [139] and SS-tree [140].\nX-tree (eXtended node-tree) [ 131] is an R-tree based structure developed to prevent\noverlap between MBRs through the new proposed node type. These nodes are extended\nnodes of variable size called Super-nodes (eXtended node). Due to this type of node,\nX-tree supports the indexing of large data with less overlap and less performance reduction\ncompared to the R-tree structure. X-tree is a hybrid index that consists of a hierarchical\npart (tree) and a linear part (list). X-tree is a variable structure where size and complexity\nis difﬁcult to calculate because of their sensitivity to size, distribution of data [ 141]. In\naddition, X-tree consumes a lot of memory space for storage and its performance is limited\nwith the data dimension.\nR-tree nodes and its variants reduce the number of partitions that occur in the construc-\ntion of the R-tree and increase the spatial utilization of the R-tree to solve the problem of\noverlapping, which inﬂuences the construction performance and requests efﬁciency. Yang\net al. [ 142] proposed a new lazy splitting strategy to optimize the R-tree generation process.\nBloom Filter Matrix (BFM) is a multidimensional data indexing structure developed by\nWang et al. [ 143] to solve the problem of decreasing index performance for high-dimension\ndata. BFM uses a multidimensional matrix based on the Cartesian product of bloom ﬁlters\nwhere each ﬁlter represents an attribute of the original data. Although the BFM structure\ndemonstrates a multi-attribute data indexing speed and search accuracy, it suffers from a\nvery high space consumption [ 144], which makes it inadequate for IoT applications where\ndata is massive. For an efﬁcient R-tree index, Wang et al. [ 145] proposed a new retrieval\nmethod, called the Dynamic Clustering Center (DCC) method, which allows choosing the\noptimal cluster center according to the distance indicator R during the construction of the\nR-tree spatial index. This technique aims to make R-tree structure more compact, reduce\nmultipath searches and improve search efﬁciency.\nThe requirement to classify data ﬂow records such as web trafﬁc ﬂow monitoring,\nspam detection and intrusion detection is addressed in [ 146]. A new E-tree indexing\nstructure with a time complexity less than O(logn)was proposed by Zhang et al. to\norganize all base classiﬁers in an ensemble for fast prediction. E-tree used a balanced height\nstructure like an R-tree to reduce the expected prediction time from linear complexity to\nsublinear complexity. On the other hand, E-tree is automatically updated by the repeated\naggregation of new classiﬁers and the elimination of those that are relevant or obsolete.\nIt therefore adapts well to discover new trends and patterns and undifferentiated data\nﬂows [146,147] . E-tree requires a high storage space and maintenance [ 148] despite the\nresults of the analysis showing the effectiveness of this approach. ER+-tree is a new\nmultidimensional data indexing.\nThe structure on the cloud-computing infrastructure was proposed by Balasubra-\nmanian in [ 149]. This structure is a hybrid tree structure that combines the beneﬁts of\nE-tree [146] and R+-tree [ 137]. The main objective of this structure is to reduce com-\nputation time and improve the quality of the similarity search in a cloud-computing\nenvironment [149] . The idea of combining these two structures is to create a more efﬁcient\nstructure in terms of balancing and similarity research. The E-tree structure is used to\npartition the data ﬂow to reduce overload, while the R+-tree structure is used to reduce\nsearch time and improve the quality of the similarity search through its Minimum Boundary\nRectangle (MBR).\nIn [150], Jin and Song introduced a tree indexing structure based on R*Q-tree. This\napproach improves query performance and reduces indexing costs. It is based on the\nk-means clustering algorithm to reorganize nodes between neighboring nodes in the tree.\nIn addition, a new indexing method (SUSHI) was proposed by Günnemann et al. [ 151].\nThis method is based on subspace clustering for indexing high dimensional objects, where\nthe construction of the index tree is done in a recursive way. The nodes of each level\nrepresent the groups resulting from the subspace clustering method. Wang et al. [ 152]\npresented a new method based on searching for the nearest neighborhood to accelerate the\n\nFuture Internet 2022 ,14, 19 15 of 44\nmatching of corresponding faces for large-scale facial recognition systems. This method\nuses the k-means algorithm for clustering data and the Kd-tree structure for cluster storage.\nHowever, this technique presents, in addition to all the advantages, a problem linked to\nthe complexity of the closing forms, which leads to an increase in the costs of insertion\nand search operations. Table 7 analyzes multidimensional indexing techniques based on\ndata partitioning, taking into account dataset type, data dimension, indexing nature, and\ncomplexity as comparison metrics and Table 8 shows the advantages and disadvantages of\nthese techniques, as well as their challenges.\nTable 7. Analysis of multidimensional indexing techniques based on data partitioning.\nProposition Refs Dataset Type Data Dimension Indexing NatureComplexity (BigO)\nInsertion/Deletion Search\nB-tree [125]\nTemporal One-dimensional\nDynamicO(nlog(n)) O(nlog(n))\nB+-tree [126] O(nlog(n))) O (nlog(n))\nB*-tree [127] O(nlog(n)) O(nlog(n))\nT-tree [127] O(2nlog(n)) O(nlog(n))\nUB-tree [128]\nSpatio temporal data\nMulti-dimensionalO(nlog(n)) O(nlog(n)))\nPaIndex [153] O(nlog(n)) O(nlog(n))\nMLB+-tree [154] Seismic data O(nlog(n)) O(nlog(n))\nSR-tree [132] Image feature vectors O(nlog3(n)) O(nlog3(n))\nE-tree [146] Spatial <O(nlog(n)) Not estimated\nER+-tree [149] OpinRank Review Not estimated Not estimated\nSUSHI [151]Color histogram and Synthetic\ndataO(n2log(n)) Not estimated\nR-tree [130] O(dnlog(n)) O(nlog(n))\nR+-tree [137] Geographical and\nMulti-mediaO(nlog(n)) O(nlog(n))\nR*-tree [138]O(nlog(n))+ Re-insertion\ncomplexityO(nlog(n))\nHilbert R-tree [139] Spatial O(log(n) +Mlog(n)) O(nlog(n))\nSS-tree [140] Multi-media dataO(nlog(n))+ Re-insertion\ncomplexityO(nlog(n))\nBFM & R-tree [143] Not mentioned Not estimated Not estimated\nDCC & R-tree [145] Medical data O(nkt) O(nlog(n))\nX-tree [131] Spatial data and Synthetic data Not estimated Not estimated\naX-tree [155] Spatial data Not estimated Not estimated\nX+-tree [156] Spatial data Not estimated Not estimated\nR*Q-tree [150] Special data O((kndt )(nlog(n))) Not estimated\nBB-tree [157]Synthetic data, Sensor data and\nGenomicNot estimatedO(hlog(k) + bmaxm)\nfor exact-match\nqueries\nPartitioning of Space: In this category , indexing techniques are based on space partition-\ning into sub-spaces (or cells) where each sub-space contains a subset of data. Unlike indexing\ntechniques based on data partitioning, this type of partitioning eliminates region intersections.\nMany existing approaches are proposed in the literature. Reference techniques include for\nexample: Kd-tree [158], Quadtree [159,160], Pyramid [161] and V A-file [162].\n\nFuture Internet 2022 ,14, 19 16 of 44\nTable 8. Summary of advantage and disadvantage of multidimensional indexing techniques based\non data partitioning.\nProposition Refs Advantages Disadvantages\nB-tree [125]• Simple structure • Consumes a lot of computing resources• Support only one-dimensional\ndata• Balanced in insertion and deletion • Requires large storage space\n• Efﬁcient for k-nn and range search • Costly maintenance\nB+-tree [126]• Storage at leaf nodes • High complexity• Requires a considerable\namount of computing resources • Storage cost reduced compared to B-tree• Wasted storage space\n• Non-optimal node splitting\nB*-tree [127]• Reduction of node splitting\n• High complexity • Limited performance • Less storage space compared to B-tree and\nB+-tree\nT-tree [127]• Balanced structure • Requires a considerable amount of space\n• Degradation on large scale • More efﬁcient memory management, search\nand update performance than B+-tree• Inefﬁcient search\n• The problem of balance is still unresolved\nUB-tree [128]• Efﬁcient processing of multidimensional re-\nquests• Unsatisfactory for queries covering dead\nspaces\n• Degradation on large scalePaIndex [153]• Effective and efﬁcient update and query per-\nformance• Not suitable for large data• Structure supports parallel insertions and\nqueries\nMLB+-tree [154]• Higher performance on multi-dimensional\nrange queries• High complexity\n• Sub-optimal partitioning\n• Irregular and unpredictable structure\nSR-tree [132]• Simple construction • Complexity of shapes\n• Reﬁnement : (intersection S ^R)• Costly insertion and search algorithm• Reduced overlap rate\nE-tree [146]• Reduce time from linear to sublinear com-\nplexity• High storage space\nER+-tree [149]• Reduce computation time • Costly maintenance\n• High quality of search results • K-nn research is not evaluated\n• More efﬁcient structure • Degradation on large scale\nR-tree [130]• Creation of ﬁlter cells REM • Overlap of REMs\n• Degradation of the perfor-\nmance on large scale• MBR allows you to reﬁne your search • Not effective for point queries\n• Balanced hierarchical breakdown • Require high space and time as well as com-\nputational complexities • Constraint of minimum coverage\nR+-tree [137] • Reduced overlap rate• Redundancy of objects in nodes\n• Clipping technique not optimized\n• More complex construction and mainte-\nnance\nR*-tree [138]• More efﬁcient variant than the R-tree• Complexity of the re-insertion algorithm\nand the split of nodes• Reduced overlap rate\n• Efﬁcient use of space\nHilbert R-tree [139]• Good performance results for both searches\nand updatesPerformance deteriorates for larger data\nSS-tree [140]• Outperforming the R-tree• High overlap in high-dimension space• Calculate the nearest and approximately\nnearest neighbors efﬁciently\nBFM & R-tree [143]• Solve the problem of decreasing index per-\nformance for high-dimensional data• High space consumption\nDCC & R-tree [145]• Enhance R-tree’s search efﬁciency• Require high space and computational complexities• Reduce multipath searches\nX-tree [131]• Overlap control (overlap-free) • Complexity of the max limit\n• Cannot function properly in\nhigher-dimensional data• No degeneration of the index • Consumes a lot of memory space\n• Reduced overlap rate• Performance is limited with the data dimen-\nsion\naX-tree [155]• Reduce the amount of empty space • Supports only static data\n• Reduced overlap rate• Require more calculation• Fast loading and better partitioning of space\nX+-tree [156]• Reduces the complexity of linear scanning of\nsuper nodes compared to X-tree• Suffers from data redundancy and replica-\ntion problems\nR*Q-tree [150]• Improve space utilization • High complexity\n• Reduce node overlap and the number of\nsplits• Not suitable for the situation of frequent up-\ndates\nBB-tree [157]• Quasi-balanced structure\n• Not support the k-nn search• Better performance compared to R*-tree, Kd-\ntree, PH-tree, and VA-ﬁle\n\nFuture Internet 2022 ,14, 19 17 of 44\nKd-tree (K-dimensional tree) is a binary tree structure for indexing multidimensional\ndata based on partitioning space to k dimension using hyper-planes [ 158]. The main disad-\nvantage of the Kd-tree is that it is unbalanced because the hyper-plane of space division do\nnot divide the planes in a better position. The latter creates overlaps between neighboring\nregions, which increases the cost of I/O operations [ 163,164]. The performance of the Kd-\ntree structure to meet range requests or Knn requests is limited by data dimensions, where,\nas the size of the data increases, most tree data is traversed [ 165,166]. Several extensions\nhave been proposed to address the challenges of the Kd-tree structure, the best known\nare: Adaptive Kd-tree [ 167], KdB-tree [ 168] and SKd-tree [ 169]. Similar to the Kd-tree,\nthe Quad-tree [ 159] is the simplest multidimensional index structure, which is mainly\nused to partition a two-dimensional space by recursively dividing it into quadrants, and it\nincludes several parts index space (each node has four leaf nodes). The Quad-tree is also\nnot balanced because it does not choose the best division of space (horizontal or vertical) as\nKd-tree. In addition, Quad-tree does not take into account the spatial distribution of data\nduring the space partitioning phase [170].\nPyramid tree is also a multidimensional data indexing structure. Pyramid tree is based\non the partitioning of the data space into 2D pyramids, each of them is cut in a parallel\nslice at the base of the pyramid forming the data ranges [ 161,171–173]. Pyramid tree suffers\nfrom the degradation of its performance with the increase in the size of the data because\nthe number of pyramids is insufﬁcient to discriminate the points of high dimension. In\naddition, Pyramid-tree creates non-discriminatory indices because the data that is located\nin the same pyramid slice has the same index value [174,175].\nRecently, Zäschke et al. [ 176] proposed the structure PATRICIA-Hypercube-tree (PH-\ntree) based on the binary representation of data objects as a bit string [ 177] and the Quadtree\nstructure [ 159], which uses hypercube for space partitioning in all dimensions at each node\nin the tree [ 178]. This partitioning allows to navigate more efﬁciently to the sub-node and\nstored entries more efﬁcient compared to the binary trees [ 176]. Other improvements have\nbeen proposed to improve the efﬁciency of the PH-tree structure [179–181] . In [ 181], Favre\nBully added new additional functions for data pre-processing and in [ 179], Bogdan Aurel\nproposed a new distributed architecture of the PH tree for parallel processing and cluster\ncomputing. However, consistency issues and the support of ACID properties (atomicity,\nconsistency, isolation and durability) of transactions are not investigated [ 182].Furthermore,\nCosta et al. [ 183] proposed the ND-tree structure (Norm Diagonal Tree) to create a mul-\ntidimensional indexing structure for high-dimensional data. It is based on a new data\ndimension reduction technique that uses the dual metric system, and the Euclidean stan-\ndard and distance to support high-dimensional data (>100 dimensions) such as multimedia\ndata. This technique reduces data dimension in two dimensions (2D) where they are\nindexed in the Quadtree tree which is considered a better dynamic indexing structure for\ntwo-dimensional data. In this approach, the reduction method applied to indexed data\ninevitably causes a loss of information on the original data, which reduces the precision of\nthe search.\nIn the ﬁeld of vehicle Internet (IoV), trafﬁc management applications require efﬁcient\nprocessing of requests with consideration of the massive trajectory data collected by the\nvehicles movement tracking process. For this purpose, Zhang et al. [ 153] proposed an online\nindex system for vehicle trajectory data called PaIndex. The structure of the proposed index\nis based on multi-level partitioning of the space. At ﬁrst the space is partitioned into regular\ngrid cells in which the spatial domain of longitude and latitude is uniformly divided, then\neach cell’s data is indexed in a hierarchical structure as B+-tree. This partitioning allows\nto parallelize the insertion operations and the search requests to reduce the time and cost.\nSeismic data processing applications use the requests of the multidimensional range and to\naccelerate the processing of these types of request, Wang et al. [ 154] proposed an extension\nof the B+-tree called MLB+-tree index (Multi-level B+-tree). MLB+-tree is organized in\nseveral levels where each level contains several independent B+-tree trees that allow the\ninsertion and request to be performed in parallel after the top level. B+-tree faces problems\n\nFuture Internet 2022 ,14, 19 18 of 44\nof complexity, loss of space and consumption of many computational resources in massive\ndata due to sub-optimal partitioning of nodes.\nJo et al. [ 184,185] proposed the Quadrant based Minimum Bounding Rectangle\n(QbMBR)-tree structure for processing large scale spatial data in HBase systems for an\nefﬁcient processing, to reduce storage space and false positives in spatial query processing.\nThe structure proposed in this work, partitions the space recursively into quadrants and\nfor each quadrant, an MBR is created to provide secondary indexes that are stored in the\nHBase table. The recursive partitioning is terminated until the number of objects in MBRs\nis less than the partition threshold. Skip-octree is a new multidimensional data index in\na cloud environment proposed by Dong et al. [ 186]. Skip-octree is based on two-level\narchitecture that adapts the skip-list to accelerate the search process and octree structure is\nused in each server to store and index multidimensional data in a hierarchical way. A new\nindexing technique was proposed by Malhotra et al. [ 187] called SkipNet-Octree based on\nthe combination of two structures SkipNet [ 188] and compressed Octree [ 186] to index and\nprocess queries on multidimensional data in Cloud Computing. SkipNet-Octree is a two-\nlayer structure where the top layer represents a global index created through the SkipNet\nstructure that contains metadata for local index nodes and the Octree index technique used\nto create a local index [ 187]. The experiments carried out show that the SkipNet-Octree\ntechnique works better than traditional Skiplist and Octree for complex queries.\nA new hybrid multidimensional data indexing structure was presented in [ 189]. The\nstructure is based on the concepts of grid, pyramid, and height to partition space and\ndesign the key to effectively access data. In this structure, the space is partitioned into\ngrids, and each subspace (grid cell) is identiﬁed by pyramids and heights [ 189,190]. The\nmain objective of this hybrid structure is to create a structure that supports ﬂoating-point\nnumbers and reduces the number of I/Os to ensure high system throughput and more\nefﬁcient execution of range requests [189].\nRecently , Samson et al. [ 155] proposed a new static spatial data indexing structure called\naX-tree (Packing X-tree) to avoid performance degradation for high-dimensional databases\nencountered by the X-tree [ 131] structure and their variances (X+-tree [ 156], V A-File [ 162] etc.).\naX-tree uses the Bulk-Loading technique to reduce the amount of empty space, fast loading\nand better partitioning of space based on MBR. With this technique, aX-tree has overcome the\nover expansion of the super-node where it became a structure characterized by: (i) minimum\ntree height (ii) high directory node quality (iii) minimum overlap and (iv) reduced area the\nMBR and most importantly , maximized space efficiency [155].\nSprenger et al. in [ 157,191] introduced BB-tree. It is a new multidimensional index\nstructure that combines the Kd-tree [ 158] and X-tree [ 131] structures. BB-tree is a quasi-\nbalanced tree, supports complete- and partial-match range queries, exact-match queries,\nand dynamic updates. The authors created this structure based on recursive partitioning of\nthe space into k partitions as for Kd-tree. BB-tree is based on the structure of elastic bubble\nbuckets in the leaf nodes of the tree like the X-tree. These buckets store data (subset) to\nbalance the structure. The leaf nodes (or regular BB) has a limited capacity ( b\u0000max). The\nlatter is transformed into super-nodes (super BB) similar to the structure of X-tree in case\nof saturation; the data from these nodes is scanned linearly. According to the results of\nthe experiments [ 86], BB-tree shows a better efﬁciency for range queries compared to R\u0003-\ntree [ 138], Kd-tree, PH-tree [ 176] and VA-ﬁle [ 162] but Knn similarity search queries are not\ntaken into account in this structure. Tables 9 and 10 present, respectively, an analytical and\ncomparative study of multidimensional indexing techniques based on space partitioning.\n\nFuture Internet 2022 ,14, 19 19 of 44\nTable 9. Analysis of multidimensional indexing techniques based on space partitioning.\nProposition Refs Dataset Type Data Dimension Indexing NatureComplexity (Estimation)\nInsertion and Deletion Search\nKd-tree [158] Geo-graphical\nMultidimensio-nal DynamicO(dnlog (n)) O(nlog(n))\nAdaptive Kd-tree [167] Files O(dnlog(n)) O(nlog(n))\nKdB-tree [168] Floating point numbers O(nlog(n)) O(n(k\u00001\nk))\nSKd-tree [169] Spatial Not estimated Not estimated\nQuad-tree [159,160] Spatial O((d+1)nlog(n)) O(nlog(n))\nPH-tree [176] Synthetic O(nlog(n)) O(nlog(n))\nND-tree [183] Synthetic Not estimated Not estimated\nQbMBR-tree [184,185] Synthetic, spatial Not estimated Not estimated\nVA-ﬁle [162] Synthetic data and images Not estimated Not estimated\nOctree [186] Spatial O((d+1)nlog(n)) O(nlog8(n))\nPyramid [161] Synthetic data Not estimated Not estimated\nTable 10. Summary of advantage and disadvantage of multidimensional indexing techniques based\non space partitioning.\nProposition Refs Advantages Disadvantages\nKd-tree [158]• Balanced hierarchical split • Costly and arbitrary\n• Degradation on\nlarge scale• Simple implementation• Low use of allocated space\n• Performance limited by data dimension\nAdaptive Kd-tree [167]• Lower-cost k-nn research• Not appropriate for frequent insertion and deletion• Storage at leaf nodes\nKdB-tree [168]• Height-balanced structure • Supports only point data\n• Efﬁcient search for point queries• Cannot guarantee minimum storage utilization\n• Insufﬁcient research performance\nSKd-tree [169]• Suitable for non-zero size spatial objects• Slow performance even in high dimensional spaces• Ensures good storage\nQuad-tree [159,160] • Efﬁcient storage and retrieval• Not balanced structure\n• Does not consider the spatial distribution of the data\nduring the partitioning phase\n• Not suitable for higher-dimensional data\nPH-tree [176]• Faster and more efﬁcient in terms of space\nefﬁciency, query and update performance• Supports point and range query only\n• High memory consumption\nND-tree [183] • Support high-dimensional data• Loss of information on the original data\n• Search performance limited by data dimensions\nQbMBR-tree [184,185]• Reduce the false positives in spatial query\n• Overlap of MBRs • Reduces the storage space\n• Reduce query execution times\nVA-ﬁle [162]• Simple implementation • Large dimension heavy coding\n• Sequential search improved • Degradation on large scale\nOctree [186] • Better spatial management and k-nn search • Support only 3-dimensional data\nPyramid [161]• Degradation on large scale • Poor request processing k-nn\n• Linear increase of cells • Degradation on large scale\n5.1.3. Bitmap-Based Technique\nBitmap index (also known as BitArray or vector-based index) is an efﬁcient indexing\nstructure for search and retrieval of large databases and data warehouses (DW) with less\ncomplexity and is very efﬁcient when attributes have a low number of distinct values. This\ntechnique is used by several popular commercial systems such as Oracle [ 192,193] and\nSybaseIQ [ 194,195]. Bitmap index technique is based on the representation of the existence\nor absence of a speciﬁc property by a sequence of bits where each bit (0/1) represents\nthe value of an attribute for a given tuple such that the bit sequence has a 1 in position i\nif the ithdata element meets the property, and 0 otherwise [ 196,197]. Bitmap index uses\nlogical operations, such as AND, OR, NOT and XOR to respond and accelerate responses\nto complex queries [198].\n\nFuture Internet 2022 ,14, 19 20 of 44\nTraditional bitmaps are suffering from a problem of space over-consumption, espe-\ncially for highly cardinal data. To address this challenge and for faster retrieval, compressed\nbitmap indexes are recommended. As a consequence, many efﬁcient bitmap compression\nalgorithms have been developed, including: BBC (Byte-aligned Bitmap Compression) [ 192],\nWAH ( Word-Aligned Hybrid ) [198,199], PLWAH ( Position ListWAH ) [200], EWAH ( Enhanced\nWord-Aligned Hybrid ) [201], CONCISE ( Compressed N Composable Integer Set ) [202], VALWAH\n(Variable-Aligned Length WAH ) [203], SECOMPAX ( Scope-Extended COMPressed Adaptive in-\ndeX) [204], SBH ( Super Byte-aligned Hybrid ) [205], Roaring [ 206], SPLWAH ( PLWAH algorithm\nfor sorted data ) [207], BAH ( Byte Aligned Hybrid compression coding ) [208], cSHB ( Compressed\nSpatial Hierarchical Bitmap ) [209] and CODIS ( COmpressing DIrty Snippet ) [210]. Through\nthese compression algorithms with logical operations, the execution time is reduced com-\npared to the basic bitmap index without compression, which is an essential property of\nbitmap indexing [211].\nRecently, Chenxing et al. [ 208] proposed a new compression algorithm more similar to\nWAH algorithm named BAH (Byte Aligned Hybrid compression coding) whose objective\nis to improve the performance in terms of space and the efﬁciency of the requests. BAH\nuses simple rules for raw bitmap encoding compared to other WAH variants that use a\nmore complicated code book. BAH uses SIMD operations to accelerate the efﬁciency of\nthe AND operation on multiple compressed bitmaps. Another compression algorithm has\nbeen proposed based on the WAH algorithm called CODIS which is proposed by Wenxun\net al. [ 210]. The basic idea of CODIS is the reduction of space through the representation of\nthe bit string in the bitmap index with fewer bits, without inﬂuencing the efﬁciency of the\nindex. The results obtained during the experimentation demonstrate that this technique is\nmore efﬁcient than the other algorithms in the literature, including WAH [199], COMPAX\n(COMPressed Adaptive indeX) [212] and PLWAH [207].\nBitmap index method is a very efﬁcient technique for answering complex queries for\nread-only systems and for data that is not frequently updated as a data warehouse, but it is\nless efﬁcient in other cases (i.e., for data that is frequently updated). This problem is caused\nby the compression process where the latter is used to reduce the storage space (as we said\nbefore), but at each update operation, it is necessary to decode and encode the bitmap, and\nthis operation is very expensive [ 213]. Manos et al. [ 213] proposed a new bitmap index\nnamed UpBit (Updatable Bitmap) to overcome this problem. This index offers efﬁcient\nupdates without affecting read performance. The UpBit index adds an additional update\nvector for each bitmap vector in which update processes will be performed on the update\nvector where the latter stores updates corresponding to its value bitmap only. Bitmap\nminimizes the cost of decoding as well as improves navigation through the use of closing\npointers on bit vectors. Chigullapally et al. [ 214] proposed an extension of this structure,\nwhere the authors parallelized the merging of bit vectors to improve the performance of\nthe UpBit index.\n5.2. Metric Indexing Techniques\nFormally, a metric space (O,d)is a set of points O(where,O6=?) to which we\nassociate a notion of distance d(O\u0002O )!R+between the elements that meets the\nfollowing properties:\n• Non-negativity :8(x,y)2O2,d(x,y)\u00150;\n• Identity :8x2O,d(x,x) =0;\n• Symmetry :8(x,y)2O2,d(x,y) =d(y,x);\n• Triangle inequality :8(x,y,z)2O3,d(x,y) +d(y,z)\u0014d(x,z).\nPartitioning of Space: In the literature, two partitioning techniques have been devel-\noped: the ﬁrst technique is based on hyper-sphere (or ball) partitioning as in: VP-tree [ 215],\nmVP-tree [ 216] and MM-tree [ 217], etc. while the second technique is based on hyper-plane\npartitioning as in: GH-tree [218], GNAT-tree [55] and EGNAT-tree [219], etc.\n\nFuture Internet 2022 ,14, 19 21 of 44\nHyper-sphere (or Ball) partitioning : VP-tree [ 215] is a hierarchical indexing structure\nsuch as Kd-tree, developed to improve the search for similarity in a metric space. VP-\ntree is a technique based on the partitioning of the space through the balls according to\ndistance. VP-tree uses the median distance between the vantage point (choose randomly)\nand the points of the space to partition the space in two balanced disjoint sub-spaces. The\ndisadvantage of the VP-tree is the highest cost in terms of calculated distance as well as\ntime, especially as the data space has a large dimension where the number of branches\nsearched for is high [ 220]. The mVP-tree is proposed to address the problem of reduced\nperformance in the search for similarity of the VP tree in high-dimensional metric spaces.\nmVP-tree (multiple Vantage Points tree) [ 216] is an extension of the VP-tree idea that uses\nseveral vantage points instead of one. The major advantage of mVP-tree over VP-tree is\nthat it also uses pre-computed distances (at the construction step) to improve search speed\nand reduce the number of distance calculations as well as the time required to execute\nqueries. The experiments presented in [ 215] show that mVP-tree improves the VP-tree\nslightly better but not in all cases, while a greater improvement is achieved when several\npivots per node are used [61].\nCheng et al. [ 221] proposed the DMVP-tree structure to accelerate the recovery process\nof similarity images in the airport’s video surveillance system. This approach is an improve-\nment of the metric indexing structure MVP-Tree [ 216] using the horizontal distribution of\nMVP-Tree structure in several machines to overcome massive high-dimensional spatial\nindexing problems. The DMVP-tree structure partitions the space horizontally where the\nupper area is called “main space” and the lower areas are called “secondary spaces”. The\nmain space is indexed in MVP-Tree that stored in the master machine and the secondary\nspace is partitioned in a static way on the slave machines.\nMM-tree [ 217] is another indexing structure for metric space that also uses the prin-\nciple of recursive partitioning of space through balls in two non-overlapping regions.\nMM-tree is an unbalanced structure due to the different size of sub-spaces (or regions), due\nto the external region of the balls. To solve this problem, MM-tree applies an additional a\nsemi-balanced algorithm that allows to re-organize the objects of the leaf nodes. According\nto the experiences presented by [ 222], MM-tree does not support high-dimensional data.\nSeveral structures have been proposed based on the MM-tree structure. All these struc-\ntures are developed to address the challenges of the MM-tree structure (Onion-tree [ 222],\nIM-tree [223] and XM-tree, the extended Metric tree [224]).\nOnion-tree [ 222] is an MM-tree improvement proposed to overcome the challenges or\nlimitations of the MM-tree structure. The Onion-tree is very fast to respond the similarity\nsearch requests thanks to the increase in the number of partitions of the space compared to\nthe MM-tree, but the problem with this structure remains in the very slow building because\nof the re-insertion of objects. IM-tree [ 223] is a proposed structure to address the problem of\nindex degeneration posed by the fourth region of MM-tree and onion-tree. IM-tree selects\nthe two most distant points as pivots and splits the fourth region in two using a plane. For\nmassive data, the external region of the balls of the IM-tree becomes very large, which can\nthen lead to the degeneration of the index.\nXM-tree [ 224] is an extension of the IM-tree [ 223] structure that is based on the suc-\ncessive division of space with spheres. XM-tree is proposed to address the problem of\ndegeneration of the index mentioned above by focusing on minimizing the size of the outer\nregions of the balls. To achieve this goal, XM-tree creates extended regions inspired by the\nX-tree [ 131]. The extended regions make the Knn search very fast thanks to the elimination\nof some objects that are not necessary to calculate the relative distances of a query object.\nWith the same principle of IM-tree, the NOBH-tree (Non-Overlaping Balls and Hyper-\nplanes tree) [ 225] partitions the metric space through the hyper-planes and hyper-spheres to\norganize the data into non-overlapping regions as well as to reduce the number of distance\ncalculations required to answer the questions. The NOBH tree recursively divides the space\ninto several regions using the pivots ( p1,p2), and separates the data such that the distance\nevaluation of an element Xiatp1and p2can only contain the region Xi. These regions\n\nFuture Internet 2022 ,14, 19 22 of 44\nare divided using a metric hyper-plane and two spheres, where the radius of the sphere\nrcorresponds to the distance between p1and p2. The main drawback of this technique\nis the complexity of the enclosing forms. This increases the cost of insertion and search\noperations [224].\nBall\u0003-tree [ 226] is a binary tree more balanced where each node deﬁnes a D-dimensional\nhyper-sphere, or a ball, that contains a subset of the points to be searched. Ball\u0003-tree is an\nimprovement of the original structure of Ball-tree [ 227,228] proposed by Dolatshah et al.\nin [226] . Ball\u0003-tree addresses the problem of data distribution and the unbalanced structure\nof Ball-tree by taking into account the data distribution when determining the splitting\nhyper-plane. In Ball\u0003-tree the splitting hyper-plane is perpendicular to the ﬁrst principal\ncomponent using principal component analysis (PCA). Using this splitting technique al-\nlows to create a more balanced and efﬁcient tree structure unlike the Ball-tree where the\nsplitting hyper-plane is determined by the line that connects the two furthest points which\ncreates unbalanced sub-partitions.\nA new indexing structure for indexing IoT data called BCCF-tree (Binary Container-\nbased Binary Tree in Cloud-Fog Computing) was introduced by Benrazek et al. [ 229]. BCCF-\ntree uses the k-means algorithm to partition the space into subspace without overlapping.\nThis structure is adapted to the cloud-fog computing architecture. The aim is to improve\nthe quality of the discovery and recovery process of large IoT data by sharing the system\nload among the elements of the cloud-fog computing architecture. According to the\nresults presented in this work, the BCCF-tree shows a good performance in terms of\nsimilarity search. However, the results also show that the construction of this structure is\nvery expensive in terms of complexity, where it reached O((n\u0001logn)\u00012(t\u0001n))[230,231].\nTables 11 and 12 present, respectively, an analytical and comparative review of metric\nindexing techniques based on ball partitioning.\nTable 11. Analysis of metric indexing techniques based on ball partitioning.\nProposition Refs Dataset Type Data Dimension Indexing NatureComplexity (Estimation)\nInsertion and Deletion Search\nVP-tree [215] Images Dynamic\nMultidimensionalO(nlog2(n)) O(n2log(n))\nmVP-tree [216] Images Static O(nlogm(n)) O(mnlog(n))\nMM-tree [217]Image and Geographic co-\nordinates\nDynamicO(n2log4(n)) O(n2log(n))\nOnion-tree [222]Image, Time-series and Ge-\nographic coordinatesO(n2log(n)) O(n2log(n))\nIM-tree [223] Image O(nlog(n)) O(cmaxlog(n))\nXM-tree [224]Geographic coordinates\nand ImageO(nmx log(n)) O(cmaxlog(n))\nBall-tree [227,228] Not mentioned O(nlog(n)) O(dlog(n))\nBall*-tree [226] Synthetic and Point data O(nlog(n)) O(n\ndlog(n))\nNOBH-tree [225] Image and Synthetic O(nlogm(n)) O(nlog(n))\nBCCF-tree [229]Synthetic, Geographic co-\nordinates and wearable ac-\ntion recognition databaseO((nlogn)\u00012(tn))O(1\n2pnlog2(k) +\n(log(n)/(1\n2pn))k)\n\nFuture Internet 2022 ,14, 19 23 of 44\nTable 12. Summary of advantage and disadvantage of metric indexing techniques based on ball\npartitioning.\nProposition Refs Advantages Disadvantages\nVP-tree [215] • Simple implementation• Highest distance and time\n•Degradation on large scale• Research costs increase in large dimensions\nmVP-tree [216]• Reduces research costs • Static structure\n• Little affected on a large e scale • Support only range research\nMM-tree [217]• Best space partitioning• Degeneration of the index (fourth region)• Non-overlapping regions\nOnion-tree [222] • Better partitioning of space • «Reinsertion» objects (semi-balancing)\nIM-tree [223] • Efﬁcient compared to MM-tree and Slim-tree • Index degeneration in massive data\nXM-tree [224]• Minimize the size of the search regions• Requires high memory space\n• The problem of overlap\nnot effectively addressed• Fast k-nn search\nBall-tree [227] • Efﬁcient brute force search in large dimensions• Unbalanced structure\n• Longer build times\nBall*-tree [226]• More balanced and efﬁcient structure compared\nto Ball-tree• Performance decreases as the dimensional-\nity of the data increases\nNOBH-tree [225] • Non-overlapping division of the data space • High cost of insertion and research\nBCCF-tree [229]• Non-overlapping division of the data space\n• Expensive construction • Fast k-nn search\n• Balanced data partitioning\nHyper-plane partitioning : The ﬁrst indexing structures that are based on the partition\nof space through hyper-planes are the oldest structure BS-tree (Bisector tree) [ 232] and the\nstructure GH-tree (Generalized Hyper-plane tree) [ 218] which is similar to BS-tree. GH-\ntree is a binary indexing structure that divides the space recursively into two sub-spaces\nthrough the hyper-plane which is deﬁned by the two representative points or pivots (the\ntwo farthest points as in [ 233–235]) the rest of the points are partitioned according to the\ndistance between these pivots. The drawbacks of this structure reside in the search process\nwhere at each node two distance operations are performed which increases the cost of the\nsearch, as well as the selected pivots does not guarantee the best partition of space, which\nmakes the problem of index degeneration possible. GNAT-tree (Geometric Near-neighbor\nAccess Tree) [55] is a static indexing structure. GNAT-tree is a generalization of the GH-tree\nwhich uses mpivots in each internal node instead of two (i.e., GNAT-tree is an m-ary tree).\nRegarding EGNAT-tree [219], it is the dynamic structure of GNAT-tree.\nRecently, GHB-tree (Generalised Hyper-plane Bucketed) [ 236] is proposed as an im-\nprovement of the GH-tree structure. The objective of the GHB-tree structure is created\na balanced indexing structure with less construction cost through the new type of node\nthat they called a bucket. These types of nodes found at the leaf level which has a limited\ncapacity to store a subset of the most similar data to improve the search process. The\nCD-Tree, cited in [ 237], is a type of index based on hyper-plane partitioning. This indexing\napproach has proven effective for a limited number of dimensions but remains ineffective\nfor large dimensions. The recursive partitioning of space into two regions is the principle\nof this technique. Two pivots are chosen each time, and each one is associated with the\nclosest objects. However, the problem with this technique is that the geometrical shapes of\nthe regions pose many problems in the search algorithm.\nA new metric indexing structure called SPB (Space ﬁlling curve and Pivot based B+-\ntree) tree was proposed by Chen et al. [ 238,239]. The method was proposed to improve\nthe efﬁciency of similarity search, support large number of complex objects and reduce\nthe cost in terms of storage, construction and search (i.e., reduces CPU and I/O cost). To\nachieve these objectives, SPB-tree uses geometric information not available in metric space\nthrough the mapping of objects in a metric space to data points in a vector space using\nwell-chosen pivots. The B+-tree with MBB (Minimum Bounding Boxes) is used to index the\none-dimensional data generated by the function of dimensionality reduction Space-Filling\nCurve (SFC) applied to the data points of the vector space. Although the structure is very\n\nFuture Internet 2022 ,14, 19 24 of 44\nsimple, but the construction steps such as space transformations and pre-treatment can be\nmade parallelism is very difﬁcult [240].\nCompared between the two partitioning strategies (hyper-sphere and hyper-plane), it\ncan be observed that the problem of node overlap is a problem that has not been effectively\naddressed by the techniques based on partitioning by hyper-sphere, but this problem does\nnot exist in hyper-plane techniques (such as: GH-tree and GNAT). On the other, structures\nbased on hyper plane partitioning are more difﬁcult to maintain their balance because of\nthe uncontrolled insertion positions of new elements [ 219]. A comparative and analytical\nstudy of metric indexing techniques based on hyper-plane partitioning is presented in\nTables 13 and 14, respectively.\nTable 13. Analysis of metric indexing techniques based on hyper-plane partitioning.\nProposition Refs Dataset Type Data Dimension Indexing NatureComplexity (Estimation)\nInsertion and Deletion Search\nBS-tree [232] Point data\nMultidimensionalStaticO(nlog2(n)) not estimated\nGH-tree [218] Not mentioned O(nlog2(n)) O(nlog(n))\nGNAT-tree [55] Image, text, Vectors O(nmlogm(n)) O(n\nmlog(n))\nEGNAT-tree [219] Words and coordinate space\nDynamicO(nmlogm(n)) O(n\nndlog(n))\nGHB-tree [236] Geographic coordinates and Image O(nlog(n)) O(2klog2(k))\nCD-tree [237] Image O(nlog(n)) O(nlog(n))\nSPB-tree [238,239]Words, Colors, DNA, Signature and\nSyntheticO(nlx+nmlogm(n)) not estimated\nTable 14. Summary of advantage and disadvantage of metric indexing techniques based on hyper-\nplane partitioning.\nProposition Refs Advantages Disadvantages\nBS-tree [232] • Fast k-nn search and orthogonal queries • Requiring linear space• Degradation on large scale\nGH-tree [218] • Simple partitioning Reduced overlap rate• Complicated form to manipulate\n• Degeneration of the index\n• High cost search\nGNAT-tree [55]• Non-overlapping • Static and complicated structure • More difﬁcult to maintain\nindex balance • Improve the search • High computational costs\nEGNAT-tree [219]• Non-overlapping • Degradation on large scale\n• Requires less CPU time than the GNAT-tree• More difﬁcult to maintain index balance\nGHB-tree [236] • Balanced structure\nCD-tree [237] • Efﬁcient re-construction time• Ineffective in large dimensions\n• Degradation on large scale• Ineffective search\nSPB-tree [238]• Simple structure\n• Difﬁcult to parallelize it• Reduce the cost in terms of storage, construction\nand search• More difﬁcult to maintain\nindex balance• Effective similarity search\nNo Partitioning of Space (Partitioning Data): This category does not require space\npartitioning. Among the families that use this type of partitioning (partitioning data), we\nﬁnd essentially the M-tree family. M-tree [ 241] is a metric tree structure height-balanced\nallowing incremental updates based on the grouping of dynamic data into balls (or hyper-\nspheres). M-tree stores some data in internal or inner nodes for routing purposes and\nthe remainder is stored in the leaf nodes. M-tree suffers from the problem of overlapping\nsub-spaces, which increases the number of distance calculations to answer a query [ 224,242].\nSeveral recent structures share the same principles of the M-tree and Slim-tree [ 243] is one\nof them. Slim-tree improves the structure of the M-tree with a new splitting technique\nbased on the minimum spanning tree (MST). Slim-tree also reduces the cost of construction\nin addition to this, it introduces a post-processing method which reduces overlap and,\nconsequently, the cost of research. The major disadvantage of this algorithm is the ability\nto generate nodes with few objects and/or empty nodes, which signiﬁcantly reduces the\nperformance of the index, especially in large spaces [244–246].\n\nFuture Internet 2022 ,14, 19 25 of 44\nThe work of Murgante et al. [ 247] aims to avoid unsatisfactory node partitioning\nand reduce regional overlap in the M-tree structure [ 241,248]. The authors proposed\na new metric indexing structure called MX-tree based on the original M-tree structure.\nMX-tree implements the concept of super-nodes inspired by the [ 131] structure of the\nX-tree. This structure avoids the unsatisfactory division of nodes, thus reducing the cost\nof computation and extends it completely to metric space where temporal complexity is\nreduced to O(n2)without setting any parameter. As for the M tree, the temporal complexity\nreaches O(n3). The authors also add another strategy to the MX-tree structure to improve\nthe management of free memory space that is represented in the indexing of tree leaf\nobjects in an internal index [ 249] through the vantage-point tree (VP-tree) [ 215]. Due to the\nsymmetry of the metric axioms of metric space, metric indexing techniques such as M-tree\nand their variances cannot answer to the approximate requests of sub-sequences or subsets.\nBachmann [ 250] propose an improvement on the M-tree structure called SuperM-tree to\ncreate a metric indexing structure capable of responding to the approximate requests of\nsub-sequences or subsets such as searching for a similar partial sequence of a gene, a\nsimilar scene in a ﬁlm, or a similar object in an image. The author introduces a new metric\nmeasurement subset space “Metric Subset Space (M; d; v)” to create this structure. It ignores\nthe symmetry of metric axioms and adds a new relationship on object size (for more details\non the demonstration of this new space, see article [250]).\nThe efﬁciency of the search in M-tree is reduced when the volume is high, thus,\nPivoting M-tree (PM-tree) is proposed [ 251,252] to resolve this problem. PM-tree is a\nhybrid structure, which combines the “local-pivoting strategies” of M-tree [ 241] with the\n“global-pivoting strategies” of LAESA [ 253]. Recently, Razent et al. [ 254] presented a new\nconstruction algorithm for the two indexing structures M-tree and PM-tree. The objective\nis to enhance the performance of Knn requests. The construction algorithm is based on\nstoring data once in the tree (M-tree or PM-tree) through the deletion of promoted elements\nthat are stored in the upper level of the leaf nodes during their partitioning. To achieve this\nidea, the authors use the aggregate nearest query to ﬁnd the most efﬁcient local pivots that\nwill be promoted during the partitioning of internal nodes. According to the report of the\nexperiments carried out in [ 254], this algorithm reduces node occupancy, reduces overlap\nbetween nodes and increases signiﬁcantly the performance of search operations in terms of\nspeed compared to the construction algorithm of the M-tree and PM-tree structure.\nNavarro et al. [ 255] proposed the DSC (Dynamic Set of Clusters) structure, a new\ndynamic metric index structure that reduces memory consumption. DSC is a combination\nof two new structures proposed in [ 255]. The ﬁrst structure is a hierarchical structure called\nDSAT (Dynamic Spatial Approximation Tree). This structure uses timestamps that indicate\nthe moment when elements were inserted to avoid the reconstruction of the structure after\nupdates as well as in the pruning process of similarity queries [ 256]. The second structure\nis a variant of the List of Clusters (LCs) structure called Dynamic List of Clusters (DLCs).\nDLC is a secondary memory-based structure in which it reduces memory consumption\ncompared to the original LC [ 257] where the M-tree structure is used as a partitioning\ntechnique. DSC is a structure divided into two parts. A part stored in the main memory\nas DSAT structure and the second part stored in the disk which represents by the DLC\nstructure [255].\nThrough the MapReduce framework, Chanet et al. [ 258] proposed two partitioning\ntechniques for joins of metric similarity to balance the load [ 259]. The ﬁrst method focuses\non the selection of centroids and clustering data in a one-dimensional space through\nthe Space-Filing-Curve (SFC) technique. This technique allows to partition the data in\nequal size thanks to the high quality of the selected centroids. The second partitioning\nmethod based on the Kd-tree structure [ 158,260], which divides the data after the pivot\nmapping [258].\nBecause of missing data generated by different application areas, indexing structures\nare distorted where the latter produces a bias in the response to the query. To solve this\nproblem, Brinis et al. [ 261] proposed the Hollow-tree structure, which enables missing\n\nFuture Internet 2022 ,14, 19 26 of 44\ndata to be managed without distracting from its structure. Hollow-tree is a metric access\nmethod that uses the CFMLI (Complete First and Missing Last Insert) technique to provide\na strategy for building metric indices. This strategy consists of indexing all complete data in\nthe ﬁrst steps to create a coherent structure then insert the elements with the missing values\n(with NULLS) at the nodes of the sheets. All this is achieved by the ObAD (Observed\nAttribute Distance) technique, which makes it possible to compare elements with missing\nvalues based on distance functions.\nYang et al. in [ 262] proposed an Asynchronous Metric Distributed System (AMDS) for\nmetric spaces to process metric similarity requests efﬁciently in a distributed environment.\nIn the proposed system, the authors adapt the technique of pivot mapping, which enables to\ndivide the data uniformly into non-joint fragments and provide load balancing. To reduce\ncomputation costs in the process of similarity research, the Minimum Bounding Box (MBB)\ntechnique is used. The AMDS system supports large-scale similarity requests in metric\nspaces simultaneously through synchronous processing based on publication/subscription\ncommunication mode. Tables 15 and 16 analyze and compare metric indexing techniques\nbased on data partitioning.\nTable 15. Analysis of metric indexing techniques based on data partitioning.\nProposition Refs Dataset Type Data Dimension Indexing NatureComplexity (Estimation)\nInsertion and Deletion Search\nM-tree [241] Synthetic data\nMultidimensional DynamicO(mnlogm(n)) O(mnlog(n))\nSlim-tree [243] Spatial, Face vectors and Text O(n2log(n)) O(n2log(n))\nSlim*-tree [263] Image and Spatial O(n2log(n)) O(n2\ndlog(n))\nMX-tree [247] Image, Text O(n2log(n)) + n2) O(n2log(n))\nSuperM-tree [250] Synthetic data not estimated not estimated\nPM-tree [251,252] Synthetic data O(n(m+l)logm(n)) O(n2log(n))\nDSC [255] Vectors, Text and Colors not estimated not estimated\nSFC & Kd-tree [258] Synthetic, Text, DNA and Color O(nlog(n)) O(knlog(n))\nHollow-tree [261] Synthetic not estimated not estimated\nTable 16. Summary of advantage and disadvantage of metric indexing techniques based on data\npartitioning.\nProposition Refs Advantages Disadvantages\nM-tree [241]• Balanced height structure • Problem of overlaps\n• Degradation on large scale• Reduction of distance calculations• High cost search\n• No adapted to highly grouped data\nSlim-tree [243]• Efﬁcient compared to M-tree• The overall computational complexity• Reduced overlap rate\nSlim*-tree [263]• Reduces the cost of calculation during reconstructing• Reinserting objects is largely costly• Avoids the unsatisfactory division\nMX-tree [247]• Reduces the cost of calculation during reconstructing• High cost search• Avoids the unsatisfactory division\nSuperM-tree [250]• Capable of responding to approximate re-\nquests for subsequences or subsets• Expensive construction\n• Evaluates only for research 1-nn\nPM-tree [251]• More efﬁcient similarity search compared to\nM-tree• Not support the k-nn search\n• Expensive construction compared to M-tree\nDSC [255] • Reduces memory consumption • High amount of distance calculations\nSFC & Kd-tree [258]• High quality of the selected centroids\n• Not support the k-nn search • Effective partitioning\n• Better query performance\nHollow-tree [261] • Capable of managing missing data • Lower accuracy in small data\nAt the end of this section, Table 17 presents the indexing techniques and related\napplications discussed earlier.\n\nFuture Internet 2022 ,14, 19 27 of 44\nTable 17. Application area of the indexing structures.\nIndexing Structure Application\nLSH • Pattern matching\n• Recommendation retrieval\n• Text processing\n• Natural language processing\n• Reducing the dimensionality of data\n• Image/Video retrieval\n• Content similarity deployment and discovery\nKernelized LSH • Content-based retrieval\n• Speaker search\n• Image classiﬁcation\nRobust Discrete Spectral Hashin • Image semantic indexing\n• Image retrieval\nSpectral Hashing • Image retrieval\n• Detection of region-duplication forgery in digital images\n• Fast approximate nearest neighbor\n• Classiﬁcation\nKernel Based Supervised Hashing • Person re-identiﬁcation\n• Similarity search\n• Image retrieval\nLabel-regularized Max-margin Partition • Classiﬁcation for large-scale datasets\nBit-Scalable Deep Hashin • Similarity learning for image retrieval and person re-identiﬁcation\nAsymmetric Deep Supervised Hashing • Image retrieval\nM-tree • Similarity search in multimedia Dataset\n• Accelerator for database query\n• Recommendation System\n• Indexing the music data\n• Classiﬁcation\nSlim-tree • Video indexing and similarity search\nSFC & Kd-tree • Data cleaning and data mining\nHollow-tree • Store and retrieve large volumes of complex data\nAMDS • Multimedia retrieval\n• Computational biology\n• Location-based services\nVP-tree • Pattern recognition and image processing\n• Image indexing and retrieval\n• Storing neuronal morphology data\n• Similarity search on cloud computing\n• Malware detection\n• Clustering\nmVP-tree • Images retrieval in airport video monitoring systems\nMM-tree • Image retrieval\nXM-tree • Web Information Retrieval\nBall-tree • Face sketch recognition\n• Classiﬁcation in high dimensions\n• Clustering and matching for object class recognition\nBCCF-tree • Image indexing and retrieval for person re-identiﬁcation\n• Indexing IoT sensor data\nGH-tree • Image Search by Content\nGNAT-tree • Indexing and similarity search of face-images data\nSPB-tree • Multimedia retrieval\n• Pattern recognition\n• Computational biology\nX-tree • Image coding\n• Classiﬁcation\nKd-tree • Search and synchronization of sensor nodes\nR-tree • Classiﬁcation\n• Spatial indexing for the IoT data management\n• Images search and retriever\n• Geographical search\nHilbert R-tree • Visualization of 3D massive data\n\nFuture Internet 2022 ,14, 19 28 of 44\n6. A Comparative Analysis of Multidimensional Indexing Methods\nThis section presents several algorithms that were initially proposed for spatial index-\ning structures. The similarity research applications usually use vectors to describe the data;\nvectors can be obtained by extracting (domain-speciﬁc) features. Using multi-dimensional\nindexing structures, these feature vectors are indexed, and since they apply a form of spatial\nindexing, a search tree can be deﬁned to perform similarity (or proximity) queries on all\nvectors. This section provides an overview of the different methods of multidimensional\naccess developed over the last two decades and compares their performance. The variety\nof data structures and their experimental performance give a fairly accurate idea of their\nadvantages and disadvantages. However, the performance of a particular data structure\ndepends on many factors such as the hardware used, operating system settings, buffer\nsizes, page sizes and datasets. Furthermore, performance is usually measured in terms of\nthe number of disk accesses, search time, etc.\nHowever, several researchers have argued that no single method of access has been\nfound to be far superior to all others [ 62,263–266]. While one experimental result declares a\nstructure to be the ﬁnal winner, a different experimental result may be the same or inferior.\nThe reason why these comparisons are so difﬁcult is the number of different criteria used to\ndeﬁne it as optimal. A summary of the interesting and missing elements of each proposal is\npresented at the end of the literature review. It includes a synthesis of all the properties of\nindexing techniques based on the non-division of multidimensional space. It also provides\nan overview of the use of encompassing geometric forms that allow for a more reﬁned\nﬁltering of regions in the search phase.\nIn the ﬁrst part, an approach based on the non-partitioning of space was presented.\nThe well-known R-tree technique begins the application of the principle of interlocking\nshapes with the creation of hierarchically interlocking hyper-rectangles. Unfortunately,\nthis method suffers from the problem of the curse of the dimension: inefﬁciency in large\ndimensions. In the same context, the R\u0003-tree is based on the principle of the reinsertion\nof objects to minimize the recovery rate between forms. Thus, the R\u0003-tree proposes to\nreinsert the saturated page (node) into the same level of the tree before splitting it. In most\ncases, this reintegration allows to avoid splitting and it ensures a continuous reorganization\nof the tree. Then, the -tree technique was introduced by creating super knots (refusing\nto create a hierarchy with too many overlaps and adopting a local strategy of extensive\nstorage). It manages collections much better. However, unfortunately, if the size increases,\nthis technique loses its value. Another approach, the SR-tree, is based on the intersection\nshape between rectangles and spheres. The problem with this technique is the complexity\nof the encompassing forms, which increases the cost of insertion operations and searches.\nFurthermore, another type of approach was introduced, based on the partitioning\nof multidimensional space, such as the kD-tree. The principle of spatial partitioning\neliminates the problem of overlapping shapes. In this type of strategy, a problem exists\nwhen a demand point is near the boundary between two regions. Therefore, it is necessary\nto visit all neighbouring regions. On the other hand, the procedure for splitting a saturated\npage does not depend on the spatial distribution of the data.\nFor more details, recall Figure 8 which presents a taxonomy, Tables 7–10 and 17\nwhich provide an in-depth analysis, summarize the advantages and disadvantages, and\napplication areas of multidimensional indexing techniques.\n\nFuture Internet 2022 ,14, 19 29 of 44\nTree-based T echniques\nNo partitioning of space\n(partitioning data)\nPartitioning of Space\nR-tree ([81],\n1984)\nX-tree ([82],\n1996)\nSR-tree ([83],\n1997)\nHilbert R-tree\n([90], 1993)\nSS-tree ([91],\n1996)\nR*-tree ([89],\n1990)\nR+-tree ([88],\n1987)\nBFM & R-\ntree([94], 2013)\nDCC & R-tree\n([95], 2017)\nER+-tree ([100],\n2019)\nE-tree ([97],\n2014)\nR*Q-tree ([101],\n2011)\nQuad-tree ([105],\n1974)\nPyramid ([107],\n1998)\nVA-file ([108],\n1998)\nKdB-tree ([1 14],\n1981)\nAdaptive Kd-tree\n([113], 1976)\nKd-tree ([104],\n1975)\nSKd-tree ([1 15],\n1987)\nND-tree ([129],\n2017)\nPaIndex ([130],\n2017)\nQbMBR-tree\n([132], 2018)\nSkip-Octree\n([134], 2015)\nOctree ([134])\nSkipNet-Octree\n([135], 2018)\naX-tree ([139],\n2018)\nSUSHI ([102],\n2011)\nPH-tree ([122],\n2014)\nBB-tree ([141],\n2019)\nB-tree ([76],\n1991)\nMLB+-tree ([131],\n2018)\nB+-tree ([77],\n1993)\nBUB+-tree ([80],\n2002)\nUB-tree ([79],\n1997)\nT-tree ([78],\n1985)\nX+-tree ([140],\n2012)\nIndexing structures in a Multidimensional\nSpace\nFigure 8. Taxonomy of tree-based indexing techniques.\n7. A Comparative Analysis of Metric Access Methods\nThis section presents an overview of the advantages and disadvantages of metric\naccess methods. Based on both approaches, partitioning and non-partitioning, a short\ntaxonomy can be introduced [222,267,268] divided in two categories.\nThe ﬁrst category does not use space partitioning, therefore, the family of the M-\ntree [ 53] generates a balanced incremental index. However, it suffers from the problem of\noverlap. An optimized version was proposed in [ 269]; this approach is the slim tree, which\nis based on the reorganization of the index to reduce overlap. Its disadvantage is the need\nto reinsert objects, which is costly.\nAs for the second category, it is based on the partitioning of space and two sub-\napproaches are provided: the ﬁrst uses ball partitioning, such as VP tree [ 2], MVP tree [263] ,\netc.; the other approach uses hyper plane partitioning, such as GH tree [ 219], GNAT [ 246],\netc. The VP tree is based on sharing using balls. The MVP tree is a generalization of the\nVP tree. The nodes of the MVP tree are divided into quantiles. The CD tree [ 237] is a type\nof index based on hyperplane partitioning. It has proven its effectiveness for a limited\nnumber of dimensions.\nRecently, a new technique has emerged MM tree [ 270,271], that also utilizes the\npartitioning by balls. An extension of this technique has been extended: the onion tree [ 3].\nThe objective is to separate the last region to generate successive enlargements, however,\nthe problem is not fully resolved.\nFor more details, recall Figure 9 which presents a taxonomy, Tables 11–17 which pro-\nvide an in-depth analysis, summarize the advantages and disadvantages, and application\nareas of metric indexing techniques.\n\nFuture Internet 2022 ,14, 19 30 of 44\nTree-based T echniques\nNo partitioning of space\n(partitioning data)\nPartitioning of Space\nM-tree ([6], 1997)\nHyper-plan partitioning\n Ball partitioning\nIndexing structures in a Metric Space\nSlim-tree ([192],\n2000)\nPM-tree ([202],\n2004)\nMX-tree ([198],\n2013)\nSuperM-tree\n([201], 2019)\nDSC ([206], 2016)\nSFC & Kd-tree\n([209], 2016)\nHollow-tree\n([212], 2019)\nAMDS ([213],\n2019)\nVP-tree ([166],\n1993)\nmVP-tree ([167],\n1997)\nDmVP-tree\n([174], 2015)\nMM-tree ([168],\n2007)\nOnion-tree\n([175], 201 1)\nIM-tree ([176],\n2012)\nXM-tree ([177],\n2019)\nBall-tree ([180],\n1989)\nBall*-tree ([179],\n2015)\nNOBH-tree\n([178], 2014)\nBS-tree ([183],\n1983)\nGH-tree ([169],\n1991)\nGNA T-tree ([170],\n1995)\nEGNA T-tree\n([171], 2009)\nGHB-tree ([187],\n2018)\nCD-tree ([7],\n2017)\nSPB-tree ([188],\n2015)\nIndexing structures in a Multidimensional Space\nTree-based T echniques\nNo partitioning of space\n(partitioning data)\nX-tree ([82],\n1996)\nBCCF-tree ([182],\n2020)\nFigure 9. Taxonomy of tree-based indexing techniques in metric space.\n8. Open Research Challenges\nThis review presented an overview of current indexing techniques and examined their\nadvantages and disadvantages with respect to the large-scale perspectives of IOT data.\nIn particular, the relevance of current indexing techniques for resolving deformities and\nresponding to requirements was studied in detail. However, current indexing techniques\nstill face some challenges. Therefore, in addition to the issues discussed above, several\nopen problems are summarized in the following. At the end of the section, we summarize\nthe most important future research directions for such challenges in Table 18.\nTable 18. Summaries of open challenges and future directions.\nOpen Research Challenges Future Research Directions\nIoT Data Aggregation for 5G Data Indexing • Reduced bandwidth • Energy-balanced solution for cluster-based solution\n• Increased energy consumption • Development of future/5G networks\n• Network congestion• Data networking solution based on emerging tech-\nnologies (NFV , SDN, etc.)\n• Network saturation\nBlockchain Data Indexing • Centralized data storage • Towards user-friendly Blockchain Data Indexing\n• Degradation of memory usage and block validation\nin IoT networks\nSecurity and Privacy for 5G Data Indexing • No effective and conﬁdential indexing of 5G data• Design an indexation protocol for achieving privacy-\npreserving priority classiﬁcation on 5G Data\n• Enhance trust management for 5G networks via data\nindexing\n• Secure the indexing approaches in 5G data indexing\nDistributed Indexing for large-scale data• The need for robustness, reliability, scalability, trans-\nferability and self-adaptation• Distribute and balance system load across emerging\nIoT paradigms\n• Reduce network bandwidth usage, overall cost and\nefﬁciency• Towards multi-level indexing\nIoT Data Representation in the\nEdge computing• The different representations of IoT data and their\ndamage in the processing and analysis of indexing\nstructures• Standard or uniﬁed architecture to provide connectiv-\nity to IoT devices, especially in the case of large-scale\nindexing\nIndexing Software Processes • Secure data during transmission • Store encrypted data\n• Analytical queries on encrypted Spatio-temporal data\n\nFuture Internet 2022 ,14, 19 31 of 44\n8.1. IoT Data Collection and Aggregation for 5G Data Indexing\nGood quality data may increase the efﬁciency of data indexing. Therefore, data aggre-\ngation and corresponding incentives to increase data quality should be established. In the\nliterature, several studies concentrate on data aggregation. In [ 272], Chen et al. introduce\nthe ﬁrst distributed aggregation technique for duty-cycle wireless sensor networks, and\nZhuo et al. [ 273] describe a tripartite architecture for Mobile Crowdsensing (MCS) with fast\ndata aggregation. Haiming et al. in [ 274] introduce a novel MCS system architecture that\nintegrates a data aggregation and perturbation mechanism, and in [ 275], the authors sug-\ngest a payment mechanism that dramatically enhances the data quality in the MCS system.\nHowever, data aggregation issues, on the other hand, get more difﬁcult as the number of\ndata sources grows, necessitating more storage and computing capacity [ 276]. In addition,\nthe expansion of the amount of digital data can result in reduced bandwidth, increased\npower consumption, and/or congestion imposed on the network, ultimately leading to\nnetwork saturation due to a large amount of data being transmitted simultaneously over\nthe network [49,277].\nThere are some new approaches such as cluster-based data aggregation algorithm for\nWSNs, but it’s still ineffective because of their weak points like the problem of unbalanced\nenergy dissipation [ 278]. With the development of future/5G networks and other emerging\ntechnologies such as Network Function Virtualization (NFV), the question that could be\nasked is, are these emerging technologies capable of developing improved and more energy-\nefﬁcient approaches and improving the efﬁciency of data aggregation on IoT networks?\n8.2. Blockchain Data Indexing\nAs cited in [ 279], blockchain technology can be applied effectively in almost all areas\nof IoT. Copies of the blockchain network ledger must be synchronized between all IoT\nentities, which could seriously affect memory usage and the effects of block validation,\nespecially with the use of IoT networks. Consequently, the indexing of data in the block\nchain that supports decentralized storage becomes a difﬁcult issue. In addition, indexing\nmanagement has a signiﬁcant role to play in improving the capabilities and efﬁciency of\nblock chains for IoT. Therefore, the indexing of block chain data should be as user-friendly\nas possible.\n8.3. Security and Privacy for 5G Data Indexing\nSeveral factors such as the hardware used, operating system settings, buffer sizes,\npage sizes, and datasets affect the performance of a particular data structure in indexing\n5G data. Therefore, since the real identity of the data could potentially be disclosed in 5G\ndata indexing, critical security questions can be identiﬁed as follows:\n• How to achieve efﬁcient and privacy-preserving 5G data indexing?\n• How to design an indexation protocol for achieving privacy-preserving priority classi-\nﬁcation on 5G Data?\n• How to enhance trust management for 5G networks via data indexing in the era of\nbig data?\n• How to secure the multidimensional approaches in 5G data indexing (e.g., Pyramid,\nVA-ﬁle, kD-tree, X-tree, SR-tree, R\u0003-tree, and R-tree)?\n8.4. Distributed Indexing for Large-Scale Data\nWith the rapid development of IoT sensors, the requirements for robustness, relia-\nbility, scalability, transferability, and self-adaptation are higher. With the new computing\nparadigms that have emerged in the IoT arena (Cloud, Fog, Edge, Mist computing), dis-\ntributed indexing systems offer a promising solution to solve the problem of search and\ndiscovery in Big IoT data. The latter consists of distributing the system load over the\ndifferent layers of the system (from the sensor to the data center) through the different\nemerging paradigms. For the latter solution, several issues must be taken into account to\ncreate an efﬁcient indexing structure:\n\nFuture Internet 2022 ,14, 19 32 of 44\n• Is it possible to implement the structure at multiple levels?\n• How to partition the indexing system load between these levels?\n• To reduce the use of network bandwidth, overall cost, and efﬁciency, how to select the\npartition and the steps to be performed?\n8.5. IoT Data Representation in the Edge Computing\nIt is important to note that the representation of the data in the IoT is different and\nthat it can be stored in different formats [ 280]. The characteristics of the data in the edge\ncomputing of data collected from various IoT resources could cause serious damage when\nprocessing and analyzing the different IoT data models and structures. Therefore, the\nprincipal question that could arise is how to propose a standard or uniﬁed architecture to\nprovide connectivity to IoT devices, especially in the case of large-scale indexing.\n8.6. Indexing Software Processes\nWith IoT, big data comes private data, such as user locations and business data. This\ndata must be encrypted on IoT devices before being sent to servers for storage and indexing.\nAlthough the data can be secured during transmission, it is usually stored after decryption.\nThis is because every system assumes that only non-malicious users access the system and\nobtain the IoT data. However, many systems are currently attacked in a way that their\nprivate data is accessible. To date, it is best to:\n1. Store encrypted data without decryption to maintain security.\n2. To perform queries on encrypted data.\nNo IoT data analytics system supports queries on encrypted data. We can use an-\nalytical queries on encrypted data using existing techniques [ 281]. Nevertheless, these\ntechniques are not optimal for Spatio-temporal data. The spread of IoT devices and appli-\ncations has caused the emergence of secure IoT data analysis systems, but they have not\nyet been studied. There are also research opportunities for analytical queries on encrypted\nSpatio-temporal data.\n9. Summary\nThe literature discussed in Section 5 presents an overview of the development of the\nindexing techniques proposed over the two decades. These techniques have been varied\naccording to the nature of the data, the space and the nature of the structure as shown in the\nproposed taxonomy presented in Figures 6–9. The Tables 2–6, 8, 10, 12, 14 and 16 show that\nmost of the structures studied have strong and weak sides.\nThe Tables 2–6, show that data independent hash methods are suffering from the\nhigh cost of space and time, making them effective for small data with low-dimensions\nand inefﬁcient for large data with high-dimensions. For satisfactory results with data\nindependent methods, many hash tables or long hash codes are required, which also makes\nthem less effective in practice. Concerning data dependent hash techniques, supervised\nand semi-supervised hash methods take into account labeling information for training\npurposes, making them more effective than unsupervised hash methods because of the\nadvantage of explicit semantic information in the data. On the other hand, they are\nmuch slower in terms of time/effort due to the higher cost of the training process, unlike\nunsupervised hash methods, which do not require any labelled data. Our study shows\nthat unsupervised, supervised and semi-supervised hashes need new solutions to solve\nthe problem of optimization to learn hash functions and hash codes mainly when data\ndimensionality increases. Due to the advantage of the higher power of the representation\nof the characteristics of the deep network, the deep hash achieves better performance than\nother hash methods. However, the non-optimal minimization of the quantization error is a\nmajor drawback that needs to redress [282,283].\nThe Bitmap index, in general, is intended for the optimization of search and retrieval\nof data with low variant, low cardinality and small distinct values (Family, Human, True,\n\nFuture Internet 2022 ,14, 19 33 of 44\nFalse, etc.) and not for complex data where no particular property related to the nature of\nthe data can be exploited.\nThe advantages and disadvantages/challenges of data indexing techniques in mul-\ntidimensional and metric space are summarized in Tables 8, 10, 12, 14 and 16, where all\napproaches are discussed in Section 5. During the analysis of these indexing techniques,\nmany factors inﬂuenced their operational and performance and proved their feasibility in\ncertain applications.\nOne of the most important of these factors is the degree of data overlap. When\ndistances tend to be very close to each other, objects become almost indistinguishable\nand cannot be clearly partitioned, which leads to a lot of overlap. A high degree of\noverlap leads to insufﬁcient research output in terms of time, resources and quality because\nof the complete analysis of all data. This is conﬁrmed by several researches, among\nthem [229] . A review of all the techniques, showing that the technique that addressed\nthe problem of partition overlap suffered from the overhead problem which inﬂuences\nreal-time applications and especially on big data and vice versa.\nThe second major factor is the hardware. Despite all the advantages offered by the\nnew high-performance computing such as cloud computing, fog computing and other\nemergence computations, there is not much work in the literature which adapts them.\nKnowing that It can provide many research opportunities to improve and develop more\nefﬁcient indexing techniques (hashing, bitmap or tree). Which can take full advantage of\nthe Graphics Processing Unit (GPU), Tensor Processing Unit (TPU) and Central Processing\nUnit (CPU) [ 64]. However, this does not mean that improving the performance of indexing\nstructures depends only on increasing storage space and computing power.\nAt the end of this analysis, it can be concluded that the universal indexing technique\nthat can manage arbitrary datasets has not yet been found and the realisation of this one\nwhich satisﬁes all the constraints and requirements of Big Data indexing mentioned in\nSection 4 is quasi-impossible.\n10. Conclusions\nA comprehensive review of the literature was presented in this paper, focusing on\nthe indexing of large IoT data. In addition, an overview of the high requirements for\ndata indexing was presented. The literature on indexing techniques for IoT data was also\nreviewed, analyzed, compared and classiﬁed in depth.\nThe authors also presented a comparative study of multidimensional indexing meth-\nods and a comparative study of metric access methods. Thus, several challenging areas of\nresearch can serve as a basis for possible future research directions for the indexing of large\nIoT data. We hope that this survey will be useful for researchers interested in indexing\nlarge IoT data.\nAuthor Contributions: Conceptualization, Z.K., A.-E.B., M.A.F., B.F. and H.S.; methodology, Z.K.,\nA.-E.B., M.A.F., B.F. and H.S.; software, Z.K., A.-E.B., M.A.F., B.F. and H.S.; validation, Z.K., A.-E.B.,\nM.A.F., B.F. and H.S.; formal analysis, Z.K., A.-E.B., M.A.F., B.F., and H.S.; investigation, Z.K., A.-E.B.,\nM.A.F., B.F. and H.S.; resources, Z.K., A.-E.B., M.A.F., B.F. and H.S.; data curation, Z.K., A.-E.B., M.A.F.,\nB.F. and H.S.; writing—original draft preparation, Z.K., A.-E.B., M.A.F., B.F. and H.S.; writing—review\nand editing, Z.K., A.-E.B., M.A.F., B.F., H.S., M.K., A.A. (Adeel Anjum) and A.A. (Alia Asheralieva);\nvisualization, Z.K., A.-E.B., M.A.F. and B.F.; supervision, Z.K., M.A.F., B.F., H.S., M.K., A.A. (Adeel\nAnjum) and A.A. (Alia Asheralieva). All authors have read and agreed to the published version of\nthe manuscript.\nFunding: This research received no external funding.\nInstitutional Review Board Statement: Not applicable.\nInformed Consent Statement: Not applicable.\nData Availability Statement: Not applicable.\nConﬂicts of Interest: All authors declare no conﬂict of interest.\n\nFuture Internet 2022 ,14, 19 34 of 44\nReferences\n1. Eltabakh, M.Y. Data Organization and Curation in Big Data. In Handbook of Big Data Technologies ; Springer: Cham, Switzer-\nland, 2017.\n2. Zierenberg, M.; Schmitt, I. Optimizing the Distance Computation Order of Multi-Feature Similarity Search Indexing. In Proceed-\nings of the Similarity Search and Applications—8th International Conference, SISAP 2015, Glasgow, UK, 12–14 October 2015.\n3. Gonzaga, A.S.; Cordeiro, R.L.F. The similarity-aware relational division database operator. In Proceedings of the Symposium on\nApplied Computing ; ACM: New York, NY, USA, 2017; pp. 913–914.\n4. Gonzaga, A.S.; Cordeiro, R.L.F. A New Division Operator to Handle Complex Objects in Very Large Relational Datasets. In\nProceedings of the 20th International Conference on Extending Database Technology (EDBT), Venice, Italy, 21–24 March 2017;\npp. 474–477.\n5. Karima, B.; Ouarda, Z. Hybrid Metaheuristic for Optimization Job-Shop Scheduling Problem. Int. J. Inform. Appl. Math. 2018 ,\n1, 1–9.\n6. Demchenko, Y.; Grosso, P .; De Laat, C.; Membrey, P . Addressing big data issues in scientiﬁc data infrastructure. In Proceedings\nof the 2013 International conference on collaboration technologies and systems (CTS), San Diego, CA, USA, 20–24 May 2013;\npp. 48–55.\n7. Chen, C.P .; Zhang, C.Y. Data-intensive applications, challenges, techniques and technologies: A survey on Big Data. Inf. Sci. 2014 ,\n275, 314–347. [CrossRef]\n8. Seddon, J.J.; Currie, W.L. A model for unpacking big data analytics in high-frequency trading. J. Bus. Res. 2017 ,70, 300–307.\n[CrossRef]\n9. Friha, O.; Ferrag, M.A.; Shu, L.; Nafa, M. A Robust Security Framework based on Blockchain and SDN for Fog Computing\nenabled Agricultural Internet of Things. In Proceedings of the 2020 International Conference on Internet of Things and Intelligent\nApplications (ITIA), Zhenjiang, China, 27–29 November 2020; pp. 1–5.\n10. Yang, X.; Shu, L.; Chen, J.; Ferrag, M.A.; Wu, J.; Nurellari, E.; Huang, K. A Survey on Smart Agriculture: Development Modes,\nTechnologies, and Security and Privacy Challenges. IEEE/CAA J. Autom. Sin. 2020 ,8, 273–302. [CrossRef]\n11. Ferrag, M.A.; Ahmim, A. Security Solutions and Applied Cryptography in Smart Grid Communications ; IGI Global: Pennsylvania, PA,\nUSA, 2016.\n12. Wagner, I.; Eckhoff, D. Technical Privacy Metrics: A Systematic Survey. ACM Comput. Surv. 2018 ,51, 1–38. [CrossRef]\n13. Fei Bua, N.W.B.J.H.L. “Privacy by Design” implementation: Information system engineers’ perspective. Int. J. Inf. Manag. 2020 ,\n53, 102124.\n14. Atzori, L.; Iera, A.; Morabito, G. Siot: Giving a social structure to the internet of things. IEEE Commun. Lett. 2011 ,15, 1193–1195.\n[CrossRef]\n15. Cauteruccio, F.; Cinelli, L.; Fortino, G.; Savaglio, C.; Terracina, G.; Ursino, D.; Virgili, L. An approach to compute the scope of a\nsocial object in a Multi-IoT scenario. Pervasive Mob. Comput. 2020 ,67, 101223. [CrossRef]\n16. Baldassarre, G.; Giudice, P .L.; Musarella, L.; Ursino, D. A paradigm for the cooperation of objects belonging to different IoTs. In\nProceedings of the 22nd International Database Engineering & Applications Symposium, Villa San Giovanni, Italy, 18–20 June\n2018; pp. 157–164.\n17. Ursino, D.; Virgili, L. Humanizing IoT: Deﬁning the proﬁle and the reliability of a thing in a multi-IoT scenario. In Toward\nSocial Internet of Things (SIoT): Enabling Technologies, Architectures and Applications ; Springer: Berlin/Heidelberg, Germany, 2020;\npp. 51–76.\n18. Baldassarre, G.; Giudice, P .L.; Musarella, L.; Ursino, D. The MIoT paradigm: Main features and an “ad hoc” crawler. Future Gener.\nComput. Syst. 2019 ,92, 29–42. [CrossRef]\n19. Mukherjee, M.; Matam, R.; Shu, L.; Maglaras, L.; Ferrag, M.A.; Choudhury, N.; Kumar, V . Security and privacy in fog computing:\nChallenges. IEEE Access 2017 ,5, 19293–19304. [CrossRef]\n20. Xie, J.; Qian, C.; Guo, D.; Wang, M.; Shi, S.; Chen, H. Efﬁcient indexing mechanism for unstructured data sharing systems in\nedge computing. In Proceedings of the IEEE INFOCOM 2019-IEEE Conference on Computer Communications, Paris, France,\n29 April–2 May 2019; pp. 820–828.\n21. Wang, C.; Xie, M.; Bhowmick, S.S.; Choi, B.; Xiao, X.; Zhou, S. An indexing framework for efﬁcient visual exploratory subgraph\nsearch in graph databases. In Proceedings of the 2019 IEEE 35th International Conference on Data Engineering (ICDE), Macao,\nChina, 8–11 April 2019; pp. 1666–1669.\n22. Sunhare, P .; Chowdhary, R.R.; Chattopadhyay, M.K. Internet of things and data mining: An application oriented survey. J. King\nSaud Univ. Comput. Inf. Sci. 2020 . [CrossRef]\n23. Busany, N.; van der Aa, H.; Senderovich, A.; Gal, A.; Weidlich, M. Interval-Based Queries over Lossy IoT Event Streams. ACM\nTrans. Data Sci. 2020 ,1, 1–27. [CrossRef]\n24. Lv, z.; Kumar Singh, A. Big Data Analysis of Internet of Things System. ACM Trans. Internet Technol. 2021 ,21, 1–15. [CrossRef]\n25. Schmeißer, S.; Schiele, G. CoSense: The Collaborative Sensing Middleware for the Internet-of-Things. ACM/IMS Trans. Data Sci.\n2021 ,1, 1–21. [CrossRef]\n26. Pattar, S.; Buyya, R.; Venugopal, K.R.; Iyengar, S.S.; Patnaik, L.M. Searching for the IoT Resources: Fundamentals, Requirements,\nComprehensive Review, and Future Directions. IEEE Commun. Surv. Tutor. 2018 ,20, 2101–2132. [CrossRef]\n\nFuture Internet 2022 ,14, 19 35 of 44\n27. Mohammadi, M.; Al-Fuqaha, A.; Sorour, S.; Guizani, M. Deep Learning for IoT Big Data and Streaming Analytics: A Survey.\nIEEE Commun. Surv. Tutor. 2018 ,20, 2923–2960. [CrossRef]\n28. Saha, A.K.; Kumar, A.; Tyagi, V .; Das, S. Big Data and Internet of Things: A Survey. In Proceedings of the 2018 International\nConference on Advances in Computing, Communication Control and Networking (ICACCCN), Greater Noida, India, 12–13\nOctober 2018; pp. 150–156. [CrossRef]\n29. Shadroo, S.; Rahmani, A.M. Systematic survey of big data and data mining in internet of things. Comput. Netw. 2018 ,139, 19–47.\n[CrossRef]\n30. Ettiyan, R.; Geetha, V . A Survey of Health Care Monitoring System for Maternity Women Using Internet-of-Things. In Proceedings\nof the 2020 3rd International Conference on Intelligent Sustainable Systems (ICISS), Coimbatore, India, 3–5 December 2020;\npp. 1290–1296. [CrossRef]\n31. Eceiza, M.; Flores, J.L.; Iturbe, M. Fuzzing the Internet of Things: A Review on the Techniques and Challenges for Efﬁcient\nVulnerability Discovery in Embedded Systems. IEEE Internet Things J. 2021 ,8, 10390–10411. [CrossRef]\n32. Li, W. A Comprehensive Survey on Machine Learning-Based Big Data Analytics for IoT-Enabled Smart Healthcare System. Mob.\nNetw. Appl. 2021 ,26, 234–252. [CrossRef]\n33. Ji, B.; Wang, Y.; Song, K.; Li, C.; Wen, H.; Menon, V .G.; Mumtaz, S. A Survey of Computational Intelligence for 6G: Key\nTechnologies, Applications and Trends. IEEE Trans. Ind. Inform. 2021 ,17, 7145–7154. [CrossRef]\n34. Shah, S.D.A.; Gregory, M.A.; Li, S. Cloud-Native Network Slicing Using Software Deﬁned Networking Based Multi-Access Edge\nComputing: A Survey. IEEE Access 2021 ,9, 10903–10924. [CrossRef]\n35. Amin, S.U.; Hossain, M.S. Edge Intelligence and Internet of Things in Healthcare: A Survey. IEEE Access 2021 ,9, 45–59. [CrossRef]\n36. Chegini, H.; Naha, R.K.; Mahanti, A.; Thulasiraman, P . Process Automation in an IoT–Fog–Cloud Ecosystem: A Survey and\nTaxonomy. IoT2021 ,2, 92–118. [CrossRef]\n37. Nahar, S.; Zhong, T.; Monday, H.N.; Mills, M.O.; Nneji, G.U.; Abubakar, H.S. A Survey on Data Stream Mining Towards\nthe Internet of Things Application. In Proceedings of the 4th Technology Innovation Management and Engineering Science\nInternational Conference (TIMES-iCON), Bangkok, Thailand, 11–13 December 2019.\n38. Marjani, M. Big IoT Data Analytics: Architecture, Opportunities, and Open Research Challenges. IEEE Access 2017 ,5, 5247–5261.\n39. Ferrag, M.A.; Kouahla, Z.; Seridi, H.; Kurulay, M. Big IoT Data Indexing: Architecture, Techniques and Open Research Challenges.\nIn Proceedings of the 2019 International Conference on Networking and Advanced Systems (ICNAS), Annaba, Algeria, 26–27\nJune 2019; pp. 1–6.\n40. Plageras, A.P .; Psannis, K.E.; Stergiou, C.; Wang, H.; Gupta, B.B. Efﬁcient IoT-based sensor BIG Data collection–processing and\nanalysis in smart buildings. Future Gener. Comput. Syst. 2018 ,82, 349–357. [CrossRef]\n41. Luong, N.C.; Hoang, D.T.; Wang, P .; Niyato, D.; Kim, D.I.; Han, Z. Data collection and wireless communication in Internet of\nThings (IoT) using economic analysis and pricing models: A survey. IEEE Commun. Surv. Tutor. 2016 ,18, 2546–2590. [CrossRef]\n42. Lu, Y.; Misra, A.; Wu, H. Smartphone sensing meets transport data: A collaborative framework for transportation service\nanalytics. IEEE Trans. Mob. Comput. 2017 ,17, 945–960. [CrossRef]\n43. Huang, D.Y.; Apthorpe, N.; Li, F.; Acar, G.; Feamster, N. IoT Inspector: Crowdsourcing Labeled Network Trafﬁc from Smart\nHome Devices at Scale. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2020 ,4, 1–21. [CrossRef]\n44. Dinh, L.T.N.; Karmakar, G.; Kamruzzaman, J. A survey on context awareness in big data analytics for business applications.\nKnowl. Inf. Syst. 2020 ,62, 3387–3415. [CrossRef]\n45. Abbasi, A.; Sarker, S.; Chiang, R.H. Big data research in information systems: Toward an inclusive research agenda. J. Assoc. Inf.\nSyst. 2016 ,17, 3. [CrossRef]\n46. Canbay, Y.; Sa˘ gıro˘ glu, S. Big data anonymization with spark. In Proceedings of the 2017 International Conference on Computer\nScience and Engineering (UBMK), Antalya, Turkey, 5–8 October 2017; pp. 833–838.\n47. Omollo, R.; Alago, S. Data modeling techniques used for big data in enterprise networks. Int. J. Adv. Technol. Eng. Explor. 2020 ,\n7, 79–92. [CrossRef]\n48. Niculescu, V . On the Impact of High Performance Computing in Big Data Analytics for Medicine. Appl. Med. Inform. 2020 ,\n42, 9–18.\n49. Benrazek, A.E.; Farou, B.; Kurulay, M. Efﬁcient Camera Clustering Method Based on Overlapping FoVs for WMSNs. Int. J.\nInform. Appl. Math. 2019 ,1, 10–23.\n50. Bolettieri, P .; Falchi, F.; Lucchese, C.; Mass, Y.; Perego, R.; Rabitti, F.; Shmueli-Scheuer, M. Searching 100M Images by Content\nSimilarity. In Proceedings of the 5th Italian Research Conference on Digital Library Systems (IRCD), Modena, Italy, 26–27 January\n2009; pp. 88–99.\n51. Batko, M.; Novak, D.; Falchi, F.; Zezula, P . On scalability of the similarity search in the world of peers. In Proceedings of the 1st\nInternational Conference on Scalable Information Systems (InfoScale) ; ACM Press: Hong Kong, China, 2006; pp. 20–31.\n52. Smeulders, A.; Worring, M.; Santini, S.; Gupta, A.; Jain, R. Content based image retrieval at the end of the early years. IEEE Trans.\nPattern Anal. Mach. Intell. 2000 ,22, 1349–1380. [CrossRef]\n53. Bozkaya, T.; Özsoyoglu, M. Indexing large metric spaces for similarity search queries. ACM Trans. Database Syst. 1999 ,24, 361–404.\n[CrossRef]\n54. Baral, C.; Gonzalez, G.; Son, T. Conceptual Modeling and Querying in Multimedia Databases. Multimed. Tools Appl. 1998 ,7, 37–66.\n[CrossRef]\n\nFuture Internet 2022 ,14, 19 36 of 44\n55. Brin, S. Near neighbor search in large metric spaces. In Proceedings of the 21th International Conference on Very Large Data\nBases (VLDB 1995), Zurich, Switzerland, 11–15 September 1995.\n56. Indyk, P .; Motwani, R. Approximate nearest neighbors: Towards removing the curse of dimensionality. In Proceedings of the\nThirtieth Annual ACM Symposium on Theory of Computing, Dallas, TX, USA, 24–26 May 1998; pp. 604–613.\n57. Har-Peled, S.; Indyk, P .; Motwani, R. Approximate nearest neighbor: Towards removing the curse of dimensionality. Theory\nComput. 2012 ,8, 321–350. [CrossRef]\n58. Zineddine, K.; Ferrag, M.A.; Anjum, A. Indexing multimedia data with an extension of binary tree–Image search by content. Int.\nJ. Inform. Appl. Math. 2021 ,1, 54–63.\n59. Özsu, M.T.; Valudriez, P . Principles of Distributed Database Systems ; Prentice-Hall: Hoboken, NJ, USA, 1991; 562p.\n60. Navarro, G. Searching in metric spaces by spatial approximation. VLDB J. 2002 ,11, 28–46. [CrossRef]\n61. Chavez, E.; Navarro, G.; Marroquin, J.L.; Baeza-Yates, R. Searching in Metric Spaces. ACM Comput. Surv. 2001 ,33, 273–321.\n[CrossRef]\n62. Pagh, R.; Silvestri, F.; Sivertsen, J.; Skala, M. Approximate Furthest Neighbor in High Dimensions. In Proceedings of the Similarity\nSearch and Applications–8th International Conference, SISAP 2015, Glasgow, UK, 12–14 October 2015.\n63. Wang, J.; Shen, H.T.; Song, J.; Ji, J. Hashing for similarity search: A survey. arXiv 2014 , arXiv:1408.2927.\n64. Desai, M.; Mehta, R.G.; Rana, D.P . A Survey on Techniques for Indexing and Hashing in Big Data. In Proceedings of the 2018 4th\nInternational Conference on Computing Communication and Automation (ICCCA), Greater Noida, India, 14–15 December 2018;\npp. 1–6.\n65. Nashipudimath, M.M.; Shinde, S.K. Indexing in Big Data. In Computing, Communication and Signal Processing ; Springer:\nBerlin/Heidelberg, Germany, 2019; pp. 133–142.\n66. Shang, L.; Yang, L.; Wang, F.; Chan, K.P .; Hua, X.S. Real-time large scale near-duplicate web video retrieval. In Proceedings of the\n18th ACM International Conference on Multimedia, Virtual, 25–29 October 2010; pp. 531–540.\n67. Gionis, A.; Indyk, P .; Motwani, R. Similarity search in high dimensions via hashing. In Proceedings of the 25th International\nConference on Very Large Data Bases (VLDB), Scotland, UK, 7–10 September 1999; Volume 99, pp. 518–529.\n68. Wang, J.; Liu, W.; Kumar, S.; Chang, S.F. Learning to hash for indexing big data—A survey. Proc. IEEE 2015 ,104, 34–57. [CrossRef]\n69. Lv, Q.; Josephson, W.; Wang, Z.; Charikar, M.; Li, K. Multi-probe LSH: Efﬁcient indexing for high-dimensional similarity search. In\nProceedings of the 33rd international conference on Very large data bases. VLDB Endowment, Vienna, Austria, 23–27 September\n2007; pp. 950–961.\n70. Dong, W.; Wang, Z.; Josephson, W.; Charikar, M.; Li, K. Modeling LSH for performance tuning. In Proceedings of the 17th ACM\nConference on Information and Knowledge Management, Napa Valley, CA, USA, 26–30 October 2008; pp. 669–678.\n71. Satuluri, V .; Parthasarathy, S. Bayesian locality sensitive hashing for fast similarity search. Proc. Vldb Endow. 2012 ,5, 430–441.\n[CrossRef]\n72. Shakhnarovich, G. Learning Task-Speciﬁc Similarity. Ph.D. Thesis, Massachusetts Institute of Technology, Cambridge, MA,\nUSA, 2005.\n73. Ji, J.; Li, J.; Yan, S.; Zhang, B.; Tian, Q. Super-bit locality-sensitive hashing. In Advances in Neural Information Processing Systems ;\nSpringer: Berlin/Heidelberg, Germany, 2012; pp. 108–116.\n74. Mu, Y.; Yan, S. Non-metric locality-sensitive hashing. In Proceedings of the Twenty-Fourth AAAI Conference on Artiﬁcial\nIntelligence, Atlanta, GE, USA, 11–15 July 2010.\n75. Kulis, B.; Grauman, K. Kernelized locality-sensitive hashing for scalable image search. In Proceedings of the 2009 IEEE 12th\nInternational Conference on Computer Vision, Kyoto, Japan, 29 September–2 October 2009; Volume 9, pp. 2130–2137.\n76. Shrivastava, A.; Li, P . Asymmetric LSH (ALSH) for sublinear time maximum inner product search (MIPS). In Advances in Neural\nInformation Processing Systems ; Spinger: Berlin/Heidelberg, Germany, 2014; pp. 2321–2329.\n77. Li, Z.; Zhang, X.; Müller, H.; Zhang, S. Large-scale retrieval for medical image analytics: A comprehensive review. Med. Image\nAnal. 2018 ,43, 66–84. [CrossRef]\n78. Weiss, Y.; Torralba, A.; Fergus, R. Spectral hashing. In Advances in Neural Information Processing Systems ; Spinger:\nBerlin/Heidelberg, Germany, 2009; pp. 1753–1760.\n79. Jiang, Q.Y.; Li, W.J. Scalable graph hashing with feature transformation. In Proceedings of the Twenty-Fourth International Joint\nConference on Artiﬁcial Intelligence, Buenos Aires, Argentina, 25–31 July 2015.\n80. Liu, W.; Mu, C.; Kumar, S.; Chang, S.F. Discrete graph hashing. In Advances in Neural Information Processing Systems ; Spinger:\nBerlin/Heidelberg, Germany, 2014; pp. 3419–3427.\n81. Shi, X.; Xing, F.; Xu, K.; Sapkota, M.; Yang, L. Asymmetric discrete graph hashing. In Proceedings of the Thirty-First AAAI\nConference on Artiﬁcial Intelligence, San Francisco, CA, USA, 4–9 February 2017.\n82. Tian, L.; Fan, C.; Ming, Y. Learning spherical hashing based binary codes for face recognition. Multimed. Tools Appl. 2017 ,\n76, 13271–13299. [CrossRef]\n83. Heo, J.P .; Lee, Y.; He, J.; Chang, S.F.; Yoon, S.E. Spherical hashing. In Proceedings of the 2012 IEEE Conference on Computer\nVision and Pattern Recognition, Washington, DC, USA, 16–21 June 2012; pp. 2957–2964.\n84. Liu, X.; Mu, Y.; Zhang, D.; Lang, B.; Li, X. Large-scale unsupervised hashing with shared structure learning. IEEE Trans. Cybern.\n2014 ,45, 1811–1822. [CrossRef]\n\nFuture Internet 2022 ,14, 19 37 of 44\n85. Shen, F.; Shen, C.; Shi, Q.; Van Den Hengel, A.; Tang, Z. Inductive hashing on manifolds. In Proceedings of the IEEE Conference\non Computer Vision and Pattern Recognition, Portland, OR, USA, 23–28 June 2013; pp. 1562–1569.\n86. Irie, G.; Li, Z.; Wu, X.M.; Chang, S.F. Locally linear hashing for extracting non-linear manifolds. In Proceedings of the IEEE\nConference on Computer Vision and Pattern Recognition, Columbus, OH, USA, 23–28 June 2014; pp. 2115–2122.\n87. Xie, L.; Shen, J.; Han, J.; Zhu, L.; Shao, L. Dynamic multi-view hashing for online image retrieval. In Proceedings of the\nInternational Joint Conference on Artiﬁcial Intelligence (IJCAI), Melbourne, Australia, 19–25 August 2017; Volume 437, pp. 3133–\n3139.\n88. Lu, X.; Zhu, L.; Cheng, Z.; Li, J.; Nie, X.; Zhang, H. Flexible Online Multi-modal Hashing for Large-scale Multimedia Retrieval. In\nProceedings of the 27th ACM International Conference on Multimedia, Nice, France, 21–25 October 2019; pp. 1129–1137.\n89. Yang, Y.; Shen, F.; Shen, H.T.; Li, H.; Li, X. Robust discrete spectral hashing for large-scale image semantic indexing. IEEE Trans.\nBig Data 2015 ,1, 162–171. [CrossRef]\n90. Mourão, A.; Magalhães, J. Towards Cloud Distributed Image Indexing by Sparse Hashing. In Proceedings of the 2019 on\nInternational Conference on Multimedia Retrieval, Ottawa, ON, Canada, 10–13 June 2019; pp. 288–296.\n91. Lin, G.; Shen, C.; Shi, Q.; Van den Hengel, A.; Suter, D. Fast supervised hashing with decision trees for high-dimensional data.\nIn Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, Columbus, OH, USA, 23–28 June 2014;\npp. 1963–1970.\n92. Xia, R.; Pan, Y.; Lai, H.; Liu, C.; Yan, S. Supervised hashing for image retrieval via image representation learning. In Proceedings\nof the Twenty-Eighth AAAI Conference on Artiﬁcial Intelligence, Québec City, QC, Canada, 27–31 July 2014.\n93. Kraska, T.; Beutel, A.; Chi, E.H.; Dean, J.; Polyzotis, N. The case for learned index structures. In Proceedings of the 2018\nInternational Conference on Management of Data, Houston, TX, USA, 10–15 June 2018; pp. 489–504.\n94. Beutel, A.; Kraska, T.; Chi, E.; Dean, J.; Polyzotis, N. A Machine Learning Approach to Databases Indexes. In Proceedings of the\nML Systems Workshop at NIPS 2017, Long Beach, CA, USA, 8 December 2017\n95. Patel, F.S.; Kasat, D. Hashing based indexing techniques for content based image retrieval: A survey. In Proceedings of the 2017\nInternational Conference on Innovative Mechanisms for Industry Applications (ICIMIA), Bengaluru, India, 21–23 February 2017;\npp. 279–283.\n96. Liu, W.; Wang, J.; Ji, R.; Jiang, Y.G.; Chang, S.F. Supervised hashing with kernels. In Proceedings of the 2012 IEEE Conference on\nComputer Vision and Pattern Recognition, Washington, DC, USA, 16–21 June 2012; pp. 2074–2081.\n97. Strecha, C.; Bronstein, A.; Bronstein, M.; Fua, P . LDAHash: Improved matching with smaller descriptors. IEEE Trans. Pattern\nAnal. Mach. Intell. 2011 ,34, 66–78. [CrossRef]\n98. Shen, F.; Shen, C.; Liu, W.; Tao Shen, H. Supervised discrete hashing. In Proceedings of the IEEE Conference on Computer Vision\nand Pattern Recognition, Boston, MA, USA, 7–12 June 2015; pp. 37–45.\n99. Norouzi, M.; Blei, D.M. Minimal loss hashing for compact binary codes. In Proceedings of the 28th International Conference on\nMachine Learning (ICML-11), Bellevue, WA, USA, 28 June–2 July 2011; pp. 353–360.\n100. Gui, J.; Liu, T.; Sun, Z.; Tao, D.; Tan, T. Fast supervised discrete hashing. IEEE Trans. Pattern Anal. Mach. Intell. 2017 ,40, 490–496.\n[CrossRef]\n101. Kang, W.C.; Li, W.J.; Zhou, Z.H. Column sampling based discrete supervised hashing. In Proceedings of the Thirtieth AAAI\nConference on Artiﬁcial Intelligence, Phoenix, AZ, USA, 12–17 February 2016.\n102. Wang, J.; Kumar, S.; Chang, S.F. Semi-supervised hashing for large-scale search. IEEE Trans. Pattern Anal. Mach. Intell. 2012 ,\n34, 2393–2406. [CrossRef]\n103. Wang, J.; Kumar, S.; Chang, S.F. Sequential projection learning for hashing with compact codes. In Proceedings of the 27th\nInternational Conference on Machine Learning, Haifa, Israel, 21–24 June 2010.\n104. Mu, Y.; Shen, J.; Yan, S. Weakly-supervised hashing in kernel space. In Proceedings of the 2010 IEEE Computer Society Conference\non Computer Vision and Pattern Recognition, San Francisco, CA, USA, 13–18 June 2010; pp. 3344–3351.\n105. Kim, S.; Choi, S. Semi-supervised discriminant hashing. In Proceedings of the 2011 IEEE 11th International Conference on Data\nMining, Vancouver, BC, Canada, 11 December 2011; pp. 1122–1127.\n106. Wu, C.; Zhu, J.; Cai, D.; Chen, C.; Bu, J. Semi-supervised nonlinear hashing using bootstrap sequential projection learning. IEEE\nTrans. Knowl. Data Eng. 2012 ,25, 1380–1393. [CrossRef]\n107. Zhang, L.; Zhang, Y.; Tang, J.; Gu, X.; Li, J.; Tian, Q. Topology preserving hashing for similarity search. In Proceedings of the 21st\nACM International Conference on Multimedia, Barcelona, Spain, 21–25 October 2013; pp. 123–132.\n108. Zhang, L.; Zhang, Y.; Gu, X.; Tang, J.; Tian, Q. Scalable similarity search with topology preserving hashing. IEEE Trans. Image\nProcess. 2014 ,23, 3025–3039. [CrossRef]\n109. Zhang, C.; Zheng, W.S. Semi-supervised multi-view discrete hashing for fast image search. IEEE Trans. Image Process. 2017 ,\n26, 2604–2617. [CrossRef]\n110. Hu, W.; Huang, Y.; Wei, L.; Zhang, F.; Li, H. Deep convolutional neural networks for hyperspectral image classiﬁcation. J. Sens.\n2015 ,2015 . [CrossRef]\n111. Lakshmanaprabu, S.; Mohanty, S.N.; Shankar, K.; Arunkumar, N.; Ramirez, G. Optimal deep learning model for classiﬁcation of\nlung cancer on CT images. Future Gener. Comput. Syst. 2019 ,92, 374–382.\n112. Liu, L.; Ouyang, W.; Wang, X.; Fieguth, P .; Chen, J.; Liu, X.; Pietikäinen, M. Deep learning for generic object detection: A survey.\narXiv 2018 , arXiv:1809.02165.\n\nFuture Internet 2022 ,14, 19 38 of 44\n113. Han, J.; Zhang, D.; Cheng, G.; Liu, N.; Xu, D. Advanced deep-learning techniques for salient and category-speciﬁc object\ndetection: A survey. IEEE Signal Process. Mag. 2018 ,35, 84–100. [CrossRef]\n114. Xu, J.; Wang, P .; Tian, G.; Xu, B.; Zhao, J.; Wang, F.; Hao, H. Convolutional neural networks for text hashing. In Proceedings of the\nTwenty-Fourth International Joint Conference on Artiﬁcial Intelligence, Buenos Aires, Argentina, 25–31 July 2015.\n115. Lai, H.; Pan, Y.; Liu, Y.; Yan, S. Simultaneous feature learning and hash coding with deep neural networks. In Proceedings of the\nIEEE Conference on Computer Vision and Pattern Recognition, Boston, MA, USA, 7–12 July 2015; pp. 3270–3278.\n116. Zhang, R.; Lin, L.; Zhang, R.; Zuo, W.; Zhang, L. Bit-scalable deep hashing with regularized similarity learning for image retrieval\nand person re-identiﬁcation. IEEE Trans. Image Process. 2015 ,24, 4766–4779. [CrossRef] [PubMed]\n117. Jiang, Q.Y.; Li, W.J. Asymmetric Deep Supervised Hashing. arXiv 2017 , arXiv:1707.08325.\n118. He, K.; Cakir, F.; Adel Bargal, S.; Sclaroff, S. Hashing as tie-aware learning to rank. In Proceedings of the IEEE Conference on\nComputer Vision and Pattern Recognition, Salt Lake City, UT, USA, 18–23 June 2018; pp. 4023–4032.\n119. Li, W.J.; Wang, S.; Kang, W.C. Feature learning based deep supervised hashing with pairwise labels. arXiv 2015 , arXiv:1511.03855.\n120. Cakir, F.; He, K.; Bargal, S.A.; Sclaroff, S. Hashing with mutual information. IEEE Trans. Pattern Anal. Mach. Intell. 2019 ,41,\n2424–2437. [CrossRef]\n121. Wang, S.; Li, C.; Shen, H. Equivalent Continuous Formulation of General Hashing Problem. IEEE Trans. Cybern. 2019 ,51,\n4089–4099. [CrossRef]\n122. Chi, L.; Zhu, X. Hashing techniques: A survey and taxonomy. ACM Comput. Surv. 2017 ,50, 11. [CrossRef]\n123. Li, P .; Zhu, X.; Zhang, X.; Ren, P .; Wang, L. Hash Code Reconstruction for Fast Similarity Search. IEEE Signal Process. Lett. 2019 ,\n26, 695–699. [CrossRef]\n124. Weber, R.; Blott, S. An Approximation Based Data Structure for Similarity Search ; Technical Report; Eidgenössische Technische\nHochschule Zürich: Zurich, Switzerland, 1997.\n125. Srinivasan, V .; Carey, M.J. Performance of B-tree concurrency control algorithms. In Proceedings of the 1991 ACM SIGMOD\nInternational Conference on management of Data, Denver, CO, USA, 29–31 May 1991; pp. 416–425.\n126. Srinivasan, V .; Carey, M.J. Performance of B+ tree concurrency control algorithms. VLDB J. 1993 ,2, 361–406. [CrossRef]\n127. Lehman, T.J.; Carey, M.J. A Study of Index Structures for Main Memory Database Management Systems ; Technical Report; University\nof Wisconsin-Madison Department of Computer Sciences: Madison, WI, USA, 1985.\n128. Bayer, R. The universal B-tree for multidimensional indexing: General concepts. In Proceedings of the International Conference\non Worldwide Computing and Its Applications, Tsukuba, Japan, 10–11 March 1997; pp. 198–209.\n129. Fenk, R. The BUB-tree. In Proceedings of the VLDB’02, 28th International Conference on Very Large Data Bases, Hong Kong,\nChina, 20–23 August 2002.\n130. Guttman, A. R-Trees: A Dynamic Index Structure for Spatial Searching ; ACM: New York, NY, USA, 1984.\n131. Berchtold, S.; Keim, D.A.; Kriegel, H.P . The X-tree: An Index Structure for High-Dimensional Data. In Proceedings of the 22th\nInternational Conference on Very Large Data Bases ; Morgan Kaufmann Publishers Inc.: San Francisco, CA, USA, 1996; pp. 28–39.\n132. Katayama, N.; Satoh, S. The SR-tree: An index structure for high-dimensional nearest neighbor queries. ACM Sigmod Rec. 1997 ,\n26, 369–380. [CrossRef]\n133. Abbasifard, M.R.; Ghahremani, B.; Naderi, H. A survey on nearest neighbor search methods. Int. J. Comput. Appl. 2014 ,95.\n134. Watve, A.; Pramanik, S.; Shahid, S.; Meiners, C.R.; Liu, A.X. Topological transformation approaches to database query processing.\nIEEE Trans. Knowl. Data Eng. 2014 ,27, 1438–1451. [CrossRef]\n135. Katayama, N.; Satoh, S.I. The SR-tree: An index structure for highdimensional nearest neighbor queries. In Proceedings of the\n1997 ACM SIGMOD International Conference on Management of Data, Tucson, AZ, USA, 13–15 May 1997.\n136. Manolopoulos, Y.; Nanopoulos, A.; Papadopoulos, A.N.; Theodoridis, Y. R-Trees: Theory and Applications ; Springer Science &\nBusiness Media: Berlin, Germany, 2010.\n137. Sellis, T.; Roussopoulos, N.; Faloutsos, C. The R+-Tree: A Dynamic Index for Multi-Dimensional Objects ; Technical Report; Springer:\nBerlin, Germany, 1987.\n138. Beckmann, N.; Kriegel, H.P .; Schneider, R.; Seeger, B. The R*-tree: An efﬁcient and robust access method for points and rectangles.\nACM Sigmod Rec. 1990 ,19, 322–331. [CrossRef]\n139. Kamel, I.; Faloutsos, C. Hilbert R-tree: An improved R-Tree Using Fractals ; Technical Report; Springer: Berlin, Germany, 1993.\n140. White, D.A.; Jain, R. Similarity indexing with the SS-tree. In Proceedings of the Twelfth International Conference on Data\nEngineering, New Orleans, LA, USA, 26 February–1 March 1996; pp. 516–523.\n141. Böhm, C.; Berchtold, S.; Keim, D.A. Searching in high-dimensional spaces: Index structures for improving the performance of\nmultimedia databases. ACM Comput. Surv. 2001 ,33, 322–373. [CrossRef]\n142. Yang, Y.; Bai, P .; Ge, N.; Gao, Z.; Qiu, X. LAZY R-tree: The R-tree with lazy splitting algorithm. J. Inf. Sci. 2019 ,46, 243–257.\n[CrossRef]\n143. Wang, Z.; Luo, T.; Xu, G.; Wang, X. A new indexing technique for supporting by-attribute membership query of multidimensional\ndata. In Proceedings of the International Conference on Web-Age Information Management, Beidaihe, China, 14–16 June 2013;\npp. 266–277.\n\nFuture Internet 2022 ,14, 19 39 of 44\n144. Wang, Y.; Yun, X.; Wang, X.; Wang, S.; Wu, Y. LBFM: Multi-Dimensional Membership Index for Block-Level Data Skipping. In\nProceedings of the 2017 IEEE International Symposium on Parallel and Distributed Processing with Applications and 2017 IEEE\nInternational Conference on Ubiquitous Computing and Communications (ISPA/IUCC), Orlando, FL, USA, 29 May–2 June 2017;\npp. 343–351.\n145. Wang, X.; Meng, W.; Zhang, M. A novel information retrieval method based on R-tree index for smart hospital information\nsystem. Int. J. Adv. Comput. Res. 2019 ,9, 133–145. [CrossRef]\n146. Zhang, P .; Zhou, C.; Wang, P .; Gao, B.J.; Zhu, X.; Guo, L. E-tree: An efﬁcient indexing structure for ensemble models on data\nstreams. IEEE Trans. Knowl. Data Eng. 2014 ,27, 461–474. [CrossRef]\n147. Tabassum, N.; Ahmed, T. A theoretical study on classiﬁer ensemble methods and its applications. In Proceedings of the 2016 3rd\nInternational Conference on Computing for Sustainable Global Development (INDIACom), New Delhi, India, 16–18 March 2016;\npp. 374–378.\n148. Nalavade, J.E.; Murugan, T.S. HRNeuro-fuzzy: Adapting neuro-fuzzy classiﬁer for recurring concept drift of evolving data\nstreams using rough set theory and holoentropy. J. King Saud Univ. Comput. Inf. Sci. 2018 ,30, 498–509. [CrossRef]\n149. Balasubramanian, B.; Durai, K.; Sathyanarayanan, J.; Muthukumarasamy, S. Tree Based Fast Similarity Query Search Indexing on\nOutsourced Cloud Data Streams. Int. Arab J. Inf. Technol. 2019 ,16, 871–878.\n150. Jin, P .; Song, Q. A novel index structure r* q-tree based on lazy splitting and clustering. In Proceedings of the 2011 IEEE\nInternational Conference on Computer Science and Automation Engineering, Shanghai, China, 10–12 June 2011; pp. 405–407.\n151. Günnemann, S.; Kremer, H.; Lenhard, D.; Seidl, T. Subspace clustering for indexing high dimensional data: A main memory\nindex based on local reductions and individual multi-representations. In Proceedings of the 14th International Conference on\nExtending Database Technology, Edinburgh, UK, 29 March–1 April 2011; pp. 237–248.\n152. Wang, Y.; Lin, Y.; Yang, J. KD-tree based clustering algorithm for fast face recognition on large-scale data. In Proceedings of the\nSeventh International Conference on Digital Image Processing (ICDIP 2015), Los Angeles, CA, USA, 9–10 April 2015; p. 96311I.\n153. Zhang, S.; Liu, X.; Zhang, M.; Wo, T. PaIndex: An online index system for vehicle trajectory data exploiting parallelism. In\nProceedings of the 2017 4th International Conference on Systems and Informatics (ICSAI), Hangzhou, China, 11–13 November\n2017; pp. 696–703.\n154. Wang, Y.; Zhao, C.; Wang, Z.; Du, J.; Liu, C.; Yan, H.; Wen, J.; Hou, H.; Zhou, K. MLB+-tree: A Multi-level B+-tree Index for\nMultidimensional Range Query on Seismic Data. In Proceedings of the 2018 5th International Conference on Systems and\nInformatics (ICSAI), Nanjing, China, 10–12 November 2018; pp. 1176–1181.\n155. Samson, G.; Joan, L.; Usman, M.M.; Showole, A.A.; Hadeel, H.J. Large Spatial Database Indexing with aX-tree. Int. J. Sci. Res.\nComput. Sci. Eng. Inf. Technol. 2018 ,3, 759–773.\n156. Doja, M.; Jain, S.; Alam, M.A. SAS: Implementation of scaled association rules on spatial multidimensional quantitative dataset.\nInt. J. Adv. Comput. Sci. Appl. 2012 ,3, 130–135.\n157. Sprenger, S.; Schäfer, P .; Leser, U. BB-Tree: A Main-Memory Index Structure for Multidimensional Range Queries. In Proceedings\nof the 2019 IEEE 35th International Conference on Data Engineering (ICDE), Macao, China, 8–11 April 2019; pp. 1566–1569.\n158. Bentley, J.L. Multidimensional binary search trees used for associative searching. Commun. ACM 1975 ,18, 509–517. [CrossRef]\n159. Finkel, R.A.; Bentley, J.L. Quad trees a data structure for retrieval on composite keys. Acta Inform. 1974 ,4, 1–9. [CrossRef]\n160. Samet, H. The quadtree and related hierarchical data structures. ACM Comput. Surv. 1984 ,16, 187–260. [CrossRef]\n161. Berchtold, S.; Böhm, C.; Kriegal, H.P . The pyramid-technique: Towards breaking the curse of dimensionality. ACM Sigmod Rec.\n1998 ,27, 142–153. [CrossRef]\n162. Weber, R.; Schek, H.J.; Blott, S. A quantitative analysis and performance study for similarity-search methods in high-dimensional\nspaces. In Proceedings of the 24rd International Conference on Very Large Data Bases (VLDB), New York, NY, USA, 24–27 August\n1998; Volume 98, pp. 194–205.\n163. Ahn, H.K.; Mamoulis, N.; Wong, H.M. A Survey on Multidimensional Access Methods. Available online: https://www.\nresearchgate.net/publication/2383731_A_Survey_on_Multidimensional_Access_Methods (accessed on 15 November 2021).\n164. Bentley, J.L. Multidimensional binary search trees in database applications. IEEE Trans. Softw. Eng. 1979 ,SE-5 , 333–340.\n[CrossRef]\n165. Berg, M.d.; Cheong, O.; Kreveld, M.v.; Overmars, M. Computational Geometry: Algorithms and Applications , 3rd ed.; Springer\nTELOS: Santa Clara, CA, USA, 2008.\n166. Otair, D. Approximate k-nearest neighbour based spatial clustering using kd tree. arXiv 2013 , arXiv:1303.1951.\n167. Friedman, J.H.; Bentley, J.L.; Finkel, R.A. An algorithm for ﬁnding best matches in logarithmic time. ACM Trans. Math. Softw.\n1976 ,3, 209–226. [CrossRef]\n168. Robinson, J.T. The KDB-tree: A search structure for large multidimensional dynamic indexes. In Proceedings of the 1981 ACM\nSIGMOD International Conference on Management of Data, Ann Arbor, MI, USA, 29 April–1 May 1981; pp. 10–18.\n169. Ooi, B.C. Spatial kd-tree: A data structure for geographic database. In Datenbanksysteme in Büro, Technik und Wissenschaft ; Springer:\nBerlin, Germany, 1987; pp. 247–258.\n170. Visheratin, A.A.; Mukhina, K.D.; Visheratina, A.K.; Nasonov, D.; Boukhanovsky, A.V . Multiscale event detection using convolu-\ntional quadtrees and adaptive geogrids. In Proceedings of the 2nd ACM SIGSPATIAL Workshop on Analytics for Local Events\nand News, Seattle, WA, USA, 6 November 2018; p. 1.\n\nFuture Internet 2022 ,14, 19 40 of 44\n171. Böhm, C.; Berchtold, S.; Kriegel, H.P .; Michel, U. Multidimensional index structures in relational databases. J. Intell. Inf. Syst.\n2000 ,15, 51–70. [CrossRef]\n172. Yu, D.; Zhang, A. ClusterTree: Integration of Cluster Representation and Nearest Neighbor Search for Large Datasets with High\nDimensionality. In Proceedings of the 2000 IEEE International Conference on Multimedia and Expo (ICME2000), New York, NY,\nUSA, 30 July–2 August 2000; Volume 15, pp. 1316–1337.\n173. Pillai, K.G.; Sturlaugson, L.; Banda, J.M.; Angryk, R.A. Extending high-dimensional indexing techniques pyramid and iminmax\n(q): Lessons learned. In British National Conference on Databases ; Springer: Berlin, Germany, 2013; pp. 253–267.\n174. Zhang, R.; Ooi, B.C.; Tan, K.L. Making the pyramid technique robust to query types and workloads. In Proceedings of the 20th\nInternational Conference on Data Engineering, Boston, MA, USA, 2 April 2004; pp. 313–324.\n175. An, J.; Chen, Y.P .P .; Xu, Q.; Zhou, X. A new indexing method for high dimensional dataset. In International Conference on Database\nSystems for Advanced Applications ; Springer: Berlin, Germany, 2005; pp. 385–397.\n176. Zäschke, T.; Zimmerli, C.; Norrie, M.C. The PH-tree: A space-efﬁcient storage structure and multi-dimensional index. In\nProceedings of the 2014 ACM SIGMOD International Conference on Management of Data, Snowbird, UT, USA, 22–27 June 2014;\npp. 397–408.\n177. Germann, U.; Joanis, E.; Larkin, S. Tightly packed tries: How to ﬁt large models into memory, and make them load fast, too.\nIn Proceedings of the NAACL HLT Workshop on Software Engineering, Testing, and Quality Assurance for Natural Language\nProcessing, Boulder, CO, USA, 5 June 2009; pp. 31–39.\n178. Mahmood, A.R.; Punni, S.; Aref, W.G. Spatio-temporal access methods: A survey (2010–2017). GeoInformatica 2019 ,23, 1–36.\n[CrossRef]\n179. Vancea, B.A. Cluster-Computing and Parallelization for the Multi-Dimensional PH-Index. Master’s Thesis, ETH Zurich, Zürich,\nSwitzerland, 2015.\n180. Zäschke, T. The PH-Tree Revisited. Available online: https://www.researchgate.net/publication/283305212_The_PH-Tree_\nRevisited (accessed on 15 November 2021) .\n181. Adrien, F.B. Data Preprocessing and Other Improvements for the Multi-Dimensional PH-Index. Master’s Thesis, ETH Zurich,\nZürich, Switzerland, 2014.\n182. Lejsek, H. NV-Tree: A Scalable Disk-Based high-Dimensional Index. Ph.D. Dissertation, Reykjavík University, Reykjavík, Iceland,\nMay 2015.\n183. Costa, F. ND-Tree: Multidimensional Indexing Structure ; Novas Edições Acadêmicas: Chisinau, Moldova, 2017.\n184. Jo, B.; Jung, S. Quadrant-Based Minimum Bounding Rectangle-Tree Indexing Method for Similarity Queries over Big Spatial Data\nin HBase. Sensors 2018 ,18, 3032. [CrossRef]\n185. Jang, H.J.; Kim, B.; Jung, S.Y. k-nearest reliable neighbor search in crowdsourced LBSs. Int. J. Commun. Syst. 2021 ,34, e4097.\n[CrossRef]\n186. Dong, Y.; He, J.; Yao, S.; Zhou, W. The skip-octree: A dynamic cloud storage index framework for multidimensional big data\nsystems. Int. J. Web Eng. Technol. 2015 ,10, 393–407. [CrossRef]\n187. Malhotra, S.; Doja, M.N.; Alam, B.; Alam, M. Skipnet-Octree Based Indexing Technique for Cloud Database Management System.\nInt. J. Inf. Technol. Web Eng. 2018 ,13, 1–13. [CrossRef]\n188. Harvey, N.J.; Dunagan, J.; Jones, M.; Saroiu, S.; Theimer, M.; Wolman, A. Skipnet: A scalable overlay network with practical\nlocality properties. In Proceedings of the USITS’03: 4th USENIX Symposium on Internet Technologies and Systems, Seattle, WA,\nUSA, 26–28 March 2003.\n189. Tang, X.; Han, B.; Chen, H. A hybrid index for multi-dimensional query in HBase. In Proceedings of the 2016 4th International\nConference on Cloud Computing and Intelligence Systems (CCIS), Beijing, China, 17–19 August 2016; pp. 332–336.\n190. Feng, C.; Li, C.D.; Li, R. Indexing techniques of distributed ordered tables: A survey and analysis. J. Comput. Sci. Technol. 2018 ,\n33, 169–189. [CrossRef]\n191. Sprenger, S.; Schäfer, P .; Leser, U. BB-Tree: A practical and efﬁcient main-memory index structure for multidimensional workloads.\nIn Proceedings of the 22nd International Conference on Extending Database Technology (EDBT), Lisbon, Portugal, 26–29 March\n2019; pp. 169–180.\n192. Antoshenkov, G. Byte-aligned bitmap compression. In Proceedings of the DCC’95 Data Compression Conference, Snowbird, UA,\nUSA, 28–30 March 1995; p. 476.\n193. Antoshenkov, G.; Ziauddin, M. Query processing and optimization in Oracle Rdb. VLDB J. 1996 ,5, 229–237. [CrossRef]\n194. O’Neil, P .; Quass, D. Improved query performance with variant indexes. ACM Sigmod Rec. 1997 ,26, 38–49. [CrossRef]\n195. MacNicol, R.; French, B. Sybase IQ multiplex-designed for analytics. In Proceedings of the Thirtieth international conference on\nVery large data bases-Volume 30. VLDB Endowment, Toronto, ON, Canada, 2–4 April 2004; pp. 1227–1230.\n196. Chan, C.Y.; Ioannidis, Y.E. Bitmap index design and evaluation. ACM Sigmod Rec. 1998 ,27, 355–366. [CrossRef]\n197. Wu, Y.; Chen, Z.; Wen, Y.; Zheng, W.; Cao, J. Combat: A new bitmap index coding algorithm for big data. Tsinghua Sci. Technol.\n2016 ,21, 136–145. [CrossRef]\n198. Wu, K.; Otoo, E.J.; Shoshani, A. Compressing bitmap indexes for faster search operations. In Proceedings of the 14th International\nConference on Scientiﬁc and Statistical Database Management, Scotland, UK, 24–26 July 2002; pp. 99–108.\n199. Wu, K.; Otoo, E.J.; Shoshani, A. Optimizing bitmap indices with efﬁcient compression. ACM Trans. Database Syst. 2006 ,31, 1–38.\n[CrossRef]\n\nFuture Internet 2022 ,14, 19 41 of 44\n200. Deliège, F.; Pedersen, T.B. Position list word aligned hybrid: Optimizing space and performance for compressed bitmaps. In\nProceedings of the 13th international conference on Extending Database Technology, Lausanne, Switzerland, 22–26 March 2010;\npp. 228–239.\n201. Lemire, D.; Kaser, O.; Aouiche, K. Sorting improves word-aligned bitmap indexes. Data Knowl. Eng. 2010 ,69, 3–28. [CrossRef]\n202. Colantonio, A.; Di Pietro, R. Concise: Compressed ‘n’composable integer set. Inf. Process. Lett. 2010 ,110, 644–650. [CrossRef]\n203. Guzun, G.; Canahuate, G.; Chiu, D.; Sawin, J. A tunable compression framework for bitmap indices. In Proceedings of the 2014\nIEEE 30th International Conference on Data Engineering, Chicago, IL, USA, 31 March–4 April 2014; pp. 484–495.\n204. Wen, Y.; Chen, Z.; Ma, G.; Cao, J.; Zheng, W.; Peng, G.; Li, S.; Huang, W.L. SECOMPAX: A bitmap index compression algorithm.\nIn Proceedings of the 2014 23rd International Conference on Computer Communication and Networks (ICCCN), Shanghai, China,\n4–7 August 2014; pp. 1–7.\n205. Kim, S.; Lee, J.; Satti, S.R.; Moon, B. SBH: Super byte-aligned hybrid bitmap compression. Inf. Syst. 2016 ,62, 155–168. [CrossRef]\n206. Chambi, S.; Lemire, D.; Kaser, O.; Godin, R. Better bitmap performance with roaring bitmaps. Softw. Pract. Exp. 2016 ,46, 709–719.\n[CrossRef]\n207. Chang, J.; Chen, Z.; Zheng, W.; Cao, J.; Wen, Y.; Peng, G.; Huang, W.L. SPLWAH: A bitmap index compression scheme for\nsearching in archival internet trafﬁc. In Proceedings of the 2015 IEEE International Conference on Communications (ICC),\nLondon, UK, 8–12 June 2015; pp. 7089–7094.\n208. Li, C.; Chen, Z.; Zheng, W.; Wu, Y.; Cao, J. BAH: A bitmap index compression algorithm for fast data retrieval. In Proceedings\nof the 2016 IEEE 41st Conference on Local Computer Networks (LCN), Dubai, United Arab Emirates, 7–10 November 2016;\npp. 697–705.\n209. Nagarkar, P .; Candan, K.S.; Bhat, A. Compressed spatial hierarchical bitmap (cSHB) indexes for efﬁciently processing spatial\nrange query workloads. Proc. Vldb Endow. 2015 ,8, 1382–1393. [CrossRef]\n210. Zheng, W.; Liu, Y.; Chen, Z.; Cao, J. CODIS: A New Compression Scheme for Bitmap Indexes. In Proceedings of the Symposium\non Architectures for Networking and Communications Systems, Beijing, China, 18–19 May 2017; IEEE Press: Piscataway, NJ,\nUSA, 2017; pp. 103–104.\n211. Keawpibal, N.; Preechaveerakul, L.; Vanichayobon, S. HyBiX: A novel encoding bitmap index for space-and time-efﬁcient query\nprocessing. Turk. J. Electr. Eng. Comput. Sci. 2019 ,27, 1504–1522. [CrossRef]\n212. Fusco, F.; Stoecklin, M.P .; Vlachos, M. Net-ﬂi: On-the-ﬂy compression, archiving and indexing of streaming network trafﬁc. Proc.\nVLDB Endow. 2010 ,3, 1382–1393. [CrossRef]\n213. Athanassoulis, M.; Yan, Z.; Idreos, S. Upbit: Scalable in-memory updatable bitmap indexing. In Proceedings of the 2016\nInternational Conference on Management of Data, San Francisco, CA, USA, 26 June–1 July 2016; pp. 1319–1332.\n214. Sriharsha, C.; Kumar, P .; Jindal, A. Upbit with Parallelized Merge. In Proceedings of the 2019 9th International Conference on\nCloud Computing, Data Science & Engineering (Conﬂuence), Noida, India, 10–11 January 2019; pp. 625–629.\n215. Yianilos, P .N. Data Structures and Algorithms for Nearest Neighbor Search in General Metric Spaces. Available online:\nhttp://algorithmics.lsi.upc.edu/docs/practicas/p311-yianilos.pdf (accessed on 15 November 2021).\n216. Bozkaya, T.; Ozsoyoglu, M. Distance-based indexing for high-dimensional metric spaces. ACM Sigmod Rec. 1997 ,26, 357–368.\n[CrossRef]\n217. Pola, I.R.V .; Traina, C., Jr.; Traina, A.J.M. The MM-Tree: A Memory-Based Metric Tree Without Overlap Between Nodes. In\nProceedings of the East European Conference on Advances in Databases and Information Systems (ADBIS), Varna, Bulgaria,\n29 September–3 October 2007; Volume 4690, pp. 157–171.\n218. Uhlmann, J.K. Satisfying general proximity/similarity queries with metric trees. Inf. Process. Lett. 1991 ,40, 175–179. [CrossRef]\n219. Paredes, R.U.; Navarro, G. EGNAT: A Fully Dynamic Metric Access Method for Secondary Memory. In Proceedings of the 2009\nSecond International Workshop on Similarity Search and Applications, Prague, Czech Republic, 28–30 August 2009. [CrossRef]\n220. Zhou, X.; Wang, G.; Yu, J.X.; Yu, G. M+-tree: A new dynamical multidimensional index for metric spaces. In Proceedings of the 14th\nAustralasian Database Conference-Volume 17, Adelaide, Australia, 1 February 2003 ; Australian Computer Society, Inc.: Darlinghurst,\nAustralia, 2003; pp. 161–168.\n221. Cheng, H.; Yang, W.; Tang, R.; Mao, J.; Luo, Q.; Li, C.; Wang, A. Distributed indexes design to accelerate similarity based images\nretrieval in airport video monitoring systems. In Proceedings of the 2015 12th International Conference on Fuzzy Systems and\nKnowledge Discovery (FSKD), Zhangjiajie, China, 15–17 August 2015; pp. 1908–1912.\n222. Carélo, C.C.M.; Pola, I.R.V .; Ciferri, R.R.; Traina, A.J.M.; Traina, C., Jr.; de Aguiar Ciferri, C.D. Slicing the metric space to provide\nquick indexing of complex data in the main memory. Inf. Syst 2011 ,36, 79–98. [CrossRef]\n223. Kouahla, Z.; Martinez, J. A new intersection tree for content-based image retrieval. In Proceedings of the 2012 10th International\nWorkshop on Content-Based Multimedia Indexing (CBMI), Annecy, France, 27–29 June 2012; pp. 1–6.\n224. Kouahla, Z.; Anjum, A.; Akram, S.; Saba, T.; Martinez, J. XM-tree: Data driven computational model by using metric extended\nnodes with non-overlapping in high-dimensional metric spaces. Comput. Math. Organ. Theory 2019 ,25, 196–223. [CrossRef]\n225. Pola, I.R.V .; Traina, C., Jr.; Traina, A.J.M. The NOBH-tree: Improving in-memory metric access methods by using metric\nhyperplanes with non-overlapping nodes. Data Knowl. Eng. 2014 ,94, 65–88. [CrossRef]\n226. Dolatshah, M.; Hadian, A.; Minaei-Bidgoli, B. Ball*-tree: Efﬁcient spatial indexing for constrained nearest-neighbor search in\nmetric spaces. arXiv 2015 , arXiv:1511.00628.\n\nFuture Internet 2022 ,14, 19 42 of 44\n227. Omohundro, S.M. Five Balltree Construction Algorithms ; International Computer Science Institute Berkeley: Berkeley, CA, USA,\n1989.\n228. Liu, T.; Moore, A.W.; Gray, A. New algorithms for efﬁcient high-dimensional nonparametric classiﬁcation. J. Mach. Learn. Res.\n2006 ,7, 1135–1158.\n229. Benrazek, A.E.; Kouahla, Z.; Farou, B.; Ferrag, M.A.; Seridi, H.; Kurulay, M. An efﬁcient indexing for Internet of Things massive\ndata based on cloud-fog computing. Trans. Emerg. Telecommun. Technol. 2020 . [CrossRef]\n230. Kemouguette, I.; Kouahla, Z.; Benrazek, A.E.; Farou, B.; Seridi, H. Cost-Effective Space Partitioning Approach for IoT Data\nIndexing and Retrieval. In Proceedings of the 2021 International Conference on Networking and Advanced Systems (ICNAS),\nAnnaba, Algeria, 26–27 June 2021; pp. 1–6.\n231. Khettabi, K.; Kouahla, Z.; Farou, B.; Seridi, H. QCCF-tree: A New Efﬁcient IoT Big Data Indexing Method at the Fog-Cloud\nComputing Level. In Proceedings of the 2021 IEEE International Smart Cities Conference (ISC2), Online, 7–10 September 2021;\npp. 1–7.\n232. Kalantari, I.; McDonald, G. A data structure and an algorithm for the nearest point problem. IEEE Trans. Softw. Eng. 1983 ,SE-9 ,\n631–634. [CrossRef]\n233. Faloutsos, C.; Lin, K.I. FastMap: A Fast Algorithm for Indexing, Data-Mining and Visualization of Traditional and Multimedia Datasets ;\nACM: New York, NY, USA, 1995.\n234. McNames, J. A nearest trajectory strategy for time series prediction. In Proceedings of the International Workshop on Advanced\nBlack-Box Techniques for Nonlinear Modeling, Leuven, Belgium, 8–10 July 1998; pp. 112–128.\n235. Merkwirth, C.; Parlitz, U.; Lauterborn, W. Fast nearest-neighbor searching for nonlinear signal processing. Phys. Rev. E 2000 ,\n62, 2089. [CrossRef]\n236. Kouahla, Z.; Anjum, A. A Parallel Implementation of GHB Tree. In IFIP International Conference on Computational Intelligence and\nIts Applications ; Springer: Berlin, Germany, 2018; pp. 47–55.\n237. Wan, Y.; Liu, X. CD-Tree: A clustering-based dynamic indexing and retrieval approach. Intell. Data Anal. 2017 ,21, 243–261.\n[CrossRef]\n238. Chen, L.; Gao, Y.; Li, X.; Jensen, C.S.; Chen, G. Efﬁcient metric indexing for similarity search. In Proceedings of the 2015 IEEE 31st\nInternational Conference on Data Engineering, Seoul, Korea, 13–17 April 2015; pp. 591–602.\n239. Chen, L.; Gao, Y.; Li, X.; Jensen, C.S.; Chen, G. Efﬁcient Metric Indexing for Similarity Search and Similarity Joins. IEEE Trans.\nKnowl. Data Eng. 2015 ,29, 556–571. [CrossRef]\n240. Perdacher, M.; Plant, C.; Böhm, C. Cache-oblivious high-performance similarity join. In Proceedings of the 2019 International\nConference on Management of Data, Amsterdam, The Netherlands, 30 June–5 July 2019; pp. 87–104.\n241. Ciaccia, P .; Patella, M.; Zezula, P . M-tree: An Efﬁcient Access Method for Similarity Search in Metric Spaces. In Proceedings of the\n23rd VLDB Conference, Athens, Greece, 25–29 August 1997; pp. 426–435.\n242. Zhou, X.; Wang, G.; Zhou, X.; Yu, G. BM+-tree: A hyperplane-based index method for high-dimensional metric spaces. In\nInternational Conference on Database Systems for Advanced Applications ; Springer: Berlin, Germany, 2005; pp. 398–409.\n243. Traina, C.; Traina, A.; Seeger, B.; Faloutsos, C. Slim-trees: High performance metric trees minimizing overlap between nodes. In\nInternational Conference on Extending Database Technology ; Springer: Berlin, Germany, 2000; pp. 51–65.\n244. Traina, C.; Traina, A.; Faloutsos, C.; Seeger, B. Fast indexing and visualization of metric data sets using slim-trees. IEEE Trans.\nKnowl. Data Eng. 2002 ,14, 244–260. [CrossRef]\n245. Skopal, T.; Pokorn `y, J.; Krátk `y, M.; Snášel, V . Revisiting M-tree building principles. In East European Conference on Advances in\nDatabases and Information Systems ; Springer: Berlin, Germany, 2003; pp. 148–162.\n246. Zezula, P .; Amato, G.; Dohnal, V .; Batko, M. Similarity Search: The Metric Space Approach ; Springer Science & Business Media:\nBerlin, Germany, 2006.\n247. Jin, S.; Kim, O.; Feng, W. MX-tree: A Double Hierarchical Metric Index with Overlap Reduction. In International Conference on\nComputational Science and Its Applications ; Springer: Berlin, Germany, 2013; pp. 574–589.\n248. Ciaccia, P .; Patella, M.; Rabitti, F.; Zezula, P . Indexing metric spaces with m-tree. In Proceedings of the Convegno Nazionale\nSistemi Evolluti per Basi di Dati (SEBD), Verona, Italy, 25–27 June 1997; Volume 97, pp. 67–86.\n249. Rachkovskij, D. Distance-based index structures for fast similarity search. Cybern. Syst. Anal. 2017 ,53, 636–658. [CrossRef]\n250. Bachmann, J.P . The SuperM-Tree: Indexing metric spaces with sized objects. arXiv 2019 , arXiv:1901.11453.\n251. Skopal, T.; Pokorn `y, J.; Snasel, V . PM-Tree: Pivoting Metric Tree for Similarity Search in Multimedia Databases. Avail-\nable online: https://www.researchgate.net/publication/221651625_PM-tree_Pivoting_Metric_Tree_for_Similarity_Search_in_\nMultimedia_Databases (accessed on 15 November 2021).\n252. Skopal, T. Pivoting M-tree: A Metric Access Method for Efﬁcient Similarity Search. In Proceedings of the 2004 Annual\nInternational Workshop on DAtabases, TExts, Speciﬁcations and Objects (DATESO), Desna, Czech Republic, 14–16 April 2004;\nVolume 4, pp. 27–37.\n253. Micó, M.L.; Oncina, J.; Vidal, E. A new version of the nearest-neighbour approximating and eliminating search algorithm (AESA)\nwith linear preprocessing time and memory requirements. Pattern Recognit. Lett. 1994 ,15, 9–17. [CrossRef]\n254. Razente, H.; Barioni, M.C.N. Storing Data Once in M-tree and PM-tree. In International Conference on Similarity Search and\nApplications ; Springer: Berlin, Germany, 2019; pp. 18–31.\n255. Navarro, G.; Reyes, N. New dynamic metric indices for secondary memory. Inf. Syst. 2016 ,59, 48–78. [CrossRef]\n\nFuture Internet 2022 ,14, 19 43 of 44\n256. Oliveira, P .H.; Traina, C., Jr.; Kaster, D.S. CLAP , ACIR and SCOOP: Novel techniques for improving the performance of dynamic\nMetric Access Methods. Inf. Syst. 2017 ,72, 117–135. [CrossRef]\n257. Hanyf, Y.; Silkan, H. A queries-based structure for similarity searching in static and dynamic metric spaces. J. King Saud Univ.\nComput. Inf. Sci. 2018 ,32. [CrossRef]\n258. Chen, G.; Yang, K.; Chen, L.; Gao, Y.; Zheng, B.; Chen, C. Metric similarity joins using MapReduce. IEEE Trans. Knowl. Data Eng.\n2016 ,29, 656–669. [CrossRef]\n259. Barhoush, M.M.; AlSobeh, A.M.; Al Rawashdeh, A. A Survey on Parallel Join Algorithms Using MapReduce on Hadoop. In\nProceedings of the 2019 IEEE Jordan International Joint Conference on Electrical Engineering and Information Technology (JEEIT),\nAmman, Jordan, 9–11 April 2019; pp. 381–388.\n260. Wu, J.; Zhang, Y.; Wang, J.; Lin, C.; Fu, Y.; Xing, C. Improving Distributed Similarity Join in Metric Space with Error-bounded\nSampling. arXiv 2019 , arXiv:1905.05981.\n261. Brinis, S.; Traina, C.; Traina, A.J. Hollow-tree: A metric access method for data with missing values. J. Intell. Inf. Syst. 2019 ,53,\n481–508. [CrossRef]\n262. Yang, K.; Ding, X.; Zhang, Y.; Chen, L.; Zheng, B.; Gao, Y. Distributed Similarity Queries in Metric Spaces. Data Sci. Eng. 2019 ,\n4, 93–108. [CrossRef]\n263. Pola, I.R.; Traina, A.J.; Traina, C.; Kaster, D.S. Improving metric access methods with bucket ﬁles. In International Conference on\nSimilarity Search and Applications ; Springer: Berlin, Germany, 2015; pp. 65–76.\n264. Berchtold, S.; Böhm, C.; Jagadish, H.V .; Kriegel, H.P .; Sander, J. Independent quantization: An index compression technique for\nhigh-dimensional data spaces. In Proceedings of the 16th International Conference on Data Engineering, San Diego, CA, USA, 28\nFebruary–3 March 2000; pp. 577–588.\n265. Bok, K.S.; Song, S.I.; Yoo, J.S. Efﬁcient k-Nearest Neighbor Searches for Parallel Multidimensional Index Structures. Database Syst.\nAdv. Appl. 2006 ,3882 , 870–879.\n266. Beyer, K.; Goldstein, J.; Ramakrishnan, R.; Shaft, U. When Is “Nearest Neighbor” Meaningful? In Proceedings of the International\nConference on Database Theory (ICDT), Jerusalem, Israel, 10–12 January 1999 ; Beeri, C., Buneman, P ., Eds.; Springer: Berlin, Germany,\n1999; pp. 217–235.\n267. Fu, A.W.; Chan, P .M.-s.; Cheung, Y.-l.; Moon, Y.S. Dynamic vp-tree indexing for n-nearest neighbor search given pair-wise\ndistances. VLDB J. 2002 ,9, 154–173. [CrossRef]\n268. Agius, H.W.; Angelides, M.C. Spatial Color Indexing Using Rotation, Translation, and Scale Invariant Anglograms. Multimed.\nTools Appl. 2001 ,15, 5–37. [CrossRef]\n269. Almeida, J.; Valle, E.; Torres, R.D.S.; Leite, N.J. DAHC-tree: An Effective Index for Approximate Search in High-Dimensional\nMetric Spaces. J. Inf. Data Manag. 2010 ,1, 375–390.\n270. Chen, L.; Gao, Y.; Li, X.; Jensen, C.S.; Chen, G. Efﬁcient Metric Indexing for Similarity Search and Similarity Joins. In Proceedings\nof the IEEE Transactions on Knowledge and Data Engineering, Sydney, Australia, 4–6 June 2017; pp. 556–571.\n271. Gimenes, G.; Cordeiro, R.L.; Rodrigues, J.F., Jr. ORFEL: Efﬁcient detection of defamation or illegitimate promotion in online\nrecommendation. Inf. Sci. 2017 ,379, 274–287. [CrossRef]\n272. Chen, Q.; Gao, H.; Cheng, S.; Li, J.; Cai, Z. Distributed non-structure based data aggregation for duty-cycle wireless sensor\nnetworks. In Proceedings of the IEEE INFOCOM 2017-IEEE Conference on Computer Communications, Atlanta, GE, USA, 1–4\nMay 2017; pp. 1–9.\n273. Zhuo, G.; Jia, Q.; Guo, L.; Li, M.; Li, P . Privacy-preserving veriﬁable data aggregation and analysis for cloud-assisted mobile\ncrowdsourcing. In Proceedings of the IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on Computer\nCommunications, San Francisco, CA, USA, 10–14 April 2016; pp. 1–9.\n274. Jin, H.; Su, L.; Xiao, H.; Nahrstedt, K. Incentive mechanism for privacy-aware data aggregation in mobile crowd sensing systems.\nIEEE/ACM Trans. Netw. 2018 ,26, 2019–2032. [CrossRef]\n275. Jin, H.; He, B.; Su, L.; Nahrstedt, K.; Wang, X. Data-driven pricing for sensing effort elicitation in mobile crowd sensing systems.\nIEEE/ACM Trans. Netw. 2019 ,27, 2208–2221. [CrossRef]\n276. Shah, S.A.; Seker, D.Z.; Hameed, S.; Draheim, D. The rising role of big data analytics and IoT in disaster management: Recent\nadvances, taxonomy and prospects. IEEE Access 2019 ,7, 54595–54614. [CrossRef]\n277. Benrazek, A.E.; Farou, B.; Seridi, H.; Kouahla, Z.; Kurulay, M. Ascending hierarchical classiﬁcation for camera clustering based\non FoV overlaps for WMSN. IET Wirel. Sens. Syst. 2019 ,9, 382–388. [CrossRef]\n278. Yuea, J.; Zhang, W.; Xiao, W.; Tang, D.; Tang, J. Energy efﬁcient and balanced cluster-based data aggregation algorithm for\nwireless sensor networks. Procedia Eng. 2012 ,29, 2009–2015. [CrossRef]\n279. Ferrag, M.A.; Derdour, M.; Mukherjee, M.; Derhab, A.; Maglaras, L.; Janicke, H. Blockchain Technologies for the Internet of\nThings: Research Issues and Challenges. IEEE Internet Things J. 2019 ,6, 2188–2204. [CrossRef]\n280. Fathy, Y.; Barnaghi, P .; Tafazolli, R. Large-scale indexing, discovery, and ranking for the internet of things (IoT). ACM Comput.\nSurv. 2018 ,51, 29. [CrossRef]\n281. Bursell, M. Trust in Computer Systems and the Cloud ; John Wiley & Sons Inc.: Hoboken, NJ, USA, 2021; p. 352.\n\nFuture Internet 2022 ,14, 19 44 of 44\n282. Wu, L.; Ling, H.; Li, P .; Chen, J.; Fang, Y.; Zhou, F. Deep supervised hashing based on stable distribution. IEEE Access 2019 ,\n7, 36489–36499. [CrossRef]\n283. Zhang, J.; Peng, Y. SSDH: Semi-supervised deep hashing for large scale image retrieval. IEEE Trans. Circuits Syst. Video Technol.\n2017 ,29, 212–225. [CrossRef]",
  "textLength": 179520
}