{
  "paperId": "5a4266ce2cea7b9ed14ee2a703d754f83c30d9f0",
  "title": "Queues with Small Advice",
  "pdfPath": "5a4266ce2cea7b9ed14ee2a703d754f83c30d9f0.pdf",
  "text": "Queues with Small Advice\nMichael Mitzenmacher\u0003\nJune 30, 2020\nAbstract\nMotivated by recent work on scheduling with predicted job sizes, we consider the performance of\nscheduling algorithms with minimal advice, namely a single bit. Besides demonstrating the power of\nvery limited advice, such schemes are quite natural. In the prediction setting, one bit of advice can be\nused to model a simple prediction as to whether a job is “large” or “small”; that is, whether a job is\nabove or below a given threshold. Further, one-bit advice schemes can correspond to mechanisms that\ntell whether to put a job at the front or the back for the queue, a limitation which may be useful in many\nimplementation settings. Finally, queues with a single bit of advice have a simple enough state that\nthey can be analyzed in the limiting mean-ﬁeld analysis framework for the power of two choices. Our\nwork follows in the path of recent work by showing that even small amounts of even possibly inaccurate\ninformation can greatly improve scheduling performance.\n1 Introduction\n1.1 Motivation\nIn queueing settings where the required service time for a job is known, strategies that take advantage of\nthat information, such as Shortest Job First (SJF) or Shortest Remaining Processing Time (SRPT) can yield\nsigniﬁcant performance improvements over blind strategies such as First In First Out (FIFO). However,\nexact knowledge of the service times is a great deal to ask for in practice. Here we consider the setting\nwhere one is given much more limited information. Speciﬁcally, we consider the case where, for each job,\na queue gets only one bit of information, or advice, regarding the job size.\nWhile a one bit limitation may seem unusual, there are both theoretical and practical motivations for\nsuch a study. Online algorithms with small amounts of optimal advice has been a subject of study in the\ntheoretical literature (see, e.g., the survey [3]); such work highlights the potential for additional information\nto improve performance. Considering the case of just one bit of information is an interesting limiting case.\nFurther, one-bit advice can naturally correspond to informing whether a job should be placed at the front\nor the back of the queue; for some queue implementations, such as in hardware or other highly constrained\nsettings, one may desire this simplicity over more complicated data structures for managing job placement\nin the queue.\nHowever, as a more concrete practical motivation, recently researchers have studied queues with pre-\ndicted service times, rather than exact service times, where such predictions might naturally be provided by\na machine learning algorithm [4, 13, 14, 15, 17, 19]. Indeed, the queueing setting is one natural example of\nan expanding line of work where predictions can be used to improve algorithms, particularly in scheduling\n\u0003School of Engineering and Applied Sciences, Harvard University. Supported in part by NSF grants CCF-1563710 and CCF-\n1535795. This is an arxiv draft, to be submitted and subject to changes.arXiv:2006.15463v1  [cs.PF]  27 Jun 2020\n\n(e.g., [8, 9, 11, 15, 17]). Our setting here of one-bit predictions can model a natural setting where the pre-\ndiction corresponds to whether a job’s service time is believed to be above or below a ﬁxed threshold. Such\npredictions may be simpler to implement or more accurate than schemes that attempt to provide a prediction\nof the exact service time.\nFor single-queue settings, our work uses standard queueing theoretic analysis techniques. Here we\ngenerally follow the (folklore) approach of using Kleinrock’s Conservation Law to derive formulae for the\nconditional waiting time of a job according to its service time; this approach dates back to at least the work\nof O’Donovan [16], from whose framework and notation we borrow. The derivations can also be readily\nobtained using the analysis of priority systems, following the framework presented in for example [6]. The\ngoal here is not to suggest new methods of analysis, but instead:\n\u000fshow how the problem of scheduling with limited predicted information can naturally be analyzed;\n\u000fdemonstrate how even limited advice and predictions can provide large performance gains; and\n\u000fshow some interesting derivations for the special case we refer to as exponential predictions.\nWe also examine one-bit predictions schemes with large numbers of queues using the power of two\nchoices. Here each arrival chooses the better of two randomly selected queues (or more generally from d\nrandomly selected queues) from a large system of (homogenous) queues. This study shares many of the\nsame motivations as for single queues; moreover, it may offer a ﬁrst step to some open questions in the area,\nsuch as analyzing the power of two choices when using Shortest Remaining Processing Time or related\nschemes (see e.g. [14]).\nFinally, more generally, we believe this work also highlights some aspects of using machine learning\npredictions that may provide guidance for the design of machine learning prediction settings. For example,\nwe see that some predictions may be much more important than others; in queueing settings, it seems\ngenerally much more important to identify long jobs correctly than short jobs, as long jobs will block many\nother jobs from service.\n2 Single Queues and One-Bit Threshold Schemes\n2.1 Notation and Model\nWe consider M/G/1 queueing systems, with arrival rate \u0015and where the processing times are independently\nsampled according to the cumulative distribution F(x)with corresponding density f(x). We follow some\nof the notation from [16]. We assume the expected service time has been scaled so the mean service time is\n1 (that is, E[F] = 1 ). Note E[F2]is the second moment for the service time. We further let\nV=\u0015E[F2]\n2\nbe the expected remaining service time of the job being served at the time of a random arrival. We also let\n\u001a(t) =\u0015Zt\n0xf(x)dx\nbe the rate at which load is added to the queue from jobs with service time at most t, and correspondingly\n\u001a(t) =\u0015Zt\n1xf(x)dx=\u0015:\n\n2.2 The Conservation Law\nAs described in [16], Kleinrock’s Conservation Law says that for a queue with Poisson arrivals satisfying\nbasic assumptions (such as the queue is busy whenever there are jobs in the system), the expected load Lon\nthe system at a random time point (e.g., in the stationary distribution), satisﬁes\nL(1\u0000\u001a) =V;\nwhere again Vis the expected load due to the job in service and \u001ais the total rate at which load is added to the\nsystem. The law allows simple derivations of conditional expected waiting times, by looking at appropriate\nsubsystems of jobs.\n2.3 Analysis of One-Bit Threshold Schemes\nWe consider the case of an advisor that provides a single bit of advice per job. Speciﬁcally we consider the\nstrategy where the advice bit is 0 if the job’s service time is less than some threshold T, and 1 otherwise.\nThe job is placed at the front of the queue if the advice bit is 0, and at the back of the queue otherwise. We\nconsider preemptive and non-preemptive queues, where in the preemptive case a job placed at the front will\npreempt the job currently receiving service. We later generalize the one bit of advice to prediction-based\nsystems, where the prediction is whether the service time for the job is larger or smaller than the threshold.\n2.4 The non-preemptive system\nWe ﬁrst consider jobs arriving jobs with service time at most T. Here we do not require the conservation\nrule; such a job is placed at the front of the queue, although it has to wait for the job, if any, in service to\ncomplete. Further, any additional jobs of service time at most Tthat arrive before this job starts service\nis placed ahead of the arriving job being considered. We denote the expected waiting time for a job with\nservice time t, by which we mean the time spent by an incoming job in the stationary distribution waiting\nbefore starting to obtain service, by W1(t). We denote the expected sojourn time, by which we mean the\nentire time spent by an incoming job in the system, by S1(t).\nThe expected time an arriving job has to wait for an existing job being processed is V. It follows from\nstandard busy period analysis that additional incoming jobs increase the expected waiting time by a factor\nof\u001a(T), and so\nW1(t) =V\n1\u0000\u001a(T):\nThe expected sojourn time for such jobs is thus\nS1(t) =V\n1\u0000\u001a(T)+t:\nFor jobs with service time tlarger thanT, we consider the subsystem of all jobs, and use the notation\nW2(t)andS2(t)for the corresponding quantities. In this setting we have\nL=V\n1\u0000\u001a\nfrom the conservation law. For any job with service time larger than T, any new job with service time at\nmostTthat arrives will be placed ahead of of this job until it is served. Hence\nW2(t) =L\n1\u0000\u001a(T)\n=V\n(1\u0000\u001a)(1\u0000\u001a(T));\n\nand\nS2(t) =V\n(1\u0000\u001a)(1\u0000\u001a(T))+t:\nFor a given service distribution Fand threshold T, we have the total expected waiting time Win the\nsystem is\nW=VF(T)\n1\u0000\u001a(T)+V(1\u0000F(T))\n(1\u0000\u001a)(1\u0000\u001a(T))\n=V(1\u0000F(T)\u001a)\n(1\u0000\u001a)(1\u0000\u001a(T)):\nThe expected sojourn time SsatisﬁesS=W+ 1. Minimizing W(orS) can be accomplished numeri-\ncally.\nAs an example we discuss through this work, for exponentially distributed service times, V=\u0015,\nF(T) = 1\u0000e\u0000T,\u001a=\u0015, and\u001a(T) = (\u0015)(1\u0000(T+ 1)e\u0000T). We ﬁnd the expected sojourn time for\nthis case, which we refer to as Se;n, is then\nSe;n=\u0015(1\u0000\u0015+\u0015e\u0000T)\n(1\u0000\u0015)(1\u0000(\u0015(1\u0000(T+ 1)e\u0000T)))+ 1\n=1\u0000\u0015+\u0015(T+ 1)e\u0000T\u0000\u00152Te\u0000T\n(1\u0000\u0015)(1\u0000(\u0015(1\u0000(T+ 1)e\u0000T)))+ 1:\nTaking the derivative, we ﬁnd the optimal Tvalue occurs when\n1\n\u0015\u00001 =e\u0000T\nT\u00001;\nor equivalently we seek Tthat satisﬁes\n\u0015=T\u00001\ne\u0000T+T\u00001;\nIn particular, as \u0015goes to 1, the optimal Tincreases to inﬁnity, and as \u0015goes to 0, the optimal Tgoes to 1.\nIt is perhaps worth noting that a threshold Tof 4 corresponds to a \u0015larger than 0:99; that is, in this case, we\ndo not see very large thresholds even under high load.\nAs another example, we consider service distributions following the Weibull distribution with cumula-\ntive distribution F(x) = 1\u0000e\u0000p\n2x. The Weibull distribution is heavy-tailed; while the average service\ntime of this distribution remains 1, the second moment is 6, so there are many more very long jobs as com-\npared to the exponential distribution. Weibull distributions are commonly used for queueing simulations, as\nheavy-tailed service time distributions are more realistic for many scenarios.\nFor this Weibull distribution, V= 3\u0015and\u001a(T) =\u0015(1\u0000e\u0000p\n2T(T+p\n2T+ 1)) are computed easily.\nThe expected sojourn time in this case, which we denote by Sw;n, is then given by\nSw;n=3\u0015(1\u0000\u0015+\u0015e\u0000p\n2T)\n(1\u0000\u0015)(1\u0000(\u0015(1\u0000e\u0000p\n2T(T+p\n2T+ 1))))+ 1:\n\n2.5 The preemptive system\nWe ﬁrst consider jobs arriving jobs with service time at most T. Again, here we do not require the conser-\nvation rule; such a job is placed at the front of the queue, and any additional job of service time at most T\nthat arrive before this job starts service is placed ahead of the arriving job being considered. We use W1(t)\nandS1(t)as before.\nClearlyW1(t) = 0 . However, we also consider the effect of preemptions. Since any job of size at most\nTwill preempt the job, the expected sojourn time is\nS1(t) =t\n1\u0000\u001a(T):\nFor jobs with service times larger than T, we consider the subsystem of all jobs, and again use the\nnotationW2(t)andS2(t)for the corresponding quantities.\nIn this setting we have\nL=V\n1\u0000\u001a\nfrom the conservation law. While waiting any job of service time at most Tis placed ahead of any job of\nsize greater than T, so again\nW2(t) =L\n1\u0000\u001a(T)\n=V\n(1\u0000\u001a)(1\u0000\u001a(T)):\nBecause of the preemption, the expected time from the start of service until ﬁnishing service increases to\nt=(1\u0000\u001a(T)), and so\nS2(t) =V\n(1\u0000\u001a)(1\u0000\u001a(T))+t\n1\u0000\u001a(T):\nIn this case the total expected waiting time is\nW=V(1\u0000F(T))\n(1\u0000\u001a)(1\u0000\u001a(T));\nand the total expected sojourn time is\nS=V(1\u0000F(T)) + 1\u0000\u001a\n(1\u0000\u001a)(1\u0000\u001a(T)):\nFor exponentially distributed service times, we ﬁnd the expected sojourn time in this case, which we\nrefer to asSe;pis then\nSe;p=1\u0000\u0015+\u0015e\u0000T\n(1\u0000\u0015)(1\u0000(\u0015(1\u0000(T+ 1)e\u0000T))):\nOne can readily that Se;p<Se;nfor any value of T; indeed,\n\u0015Se;p=Se;n\u00001;\n\nso\nSe;n\u0000Se;p= 1\u0000(1\u0000\u0015)Se;p>0:\nAlso, the optimal value of Tis again given by\n1\n\u0015\u00001 =e\u0000T\nT\u00001:\nFor the Weibull distribution, we have the corresponding expression\nSw;p=1\u0000\u0015+ 3\u0015e\u0000p\n2T\n(1\u0000\u0015)(1\u0000(\u0015(1\u0000e\u0000p\n2T(T+p\n2T+ 1)))):\n3 Adding Predictions\nWe consider a simple model where the probability of a misprediction for a given item depends only on its\nservice time, independent of other jobs and other considerations. Speciﬁcally, we suppose we have a desired\nthresholdT, and our prediction is simply our best guess as to whether a job’s service time is larger or less\nthanT. We deﬁne gT(x)be the probability that a job of size xis predicted to be less than T. While one\ncan imagine more complex prediction models, this model is quite natural, and is useful for examining the\npotential power of predictions.\n3.1 The non-preemptive system\nTo deal with the predictions, we now let\nQ(T) =Z1\n0f(x)gT(x)dx;\nand\n\u001a0(T) =\u0015Z1\n0xf(x)gT(x)dx:\nHere\u001a0(T)can be interpreted as the rate load arrives to the system from jobs with predicted service time at\nmostT, and similarly Q(T)is the fraction of jobbs predicted to have service time at most T.\nWe ﬁrst consider arriving jobs with predicted service time at most Tand actual service time t. Following\nthe same reasoning we have previously used, the waiting time W0tfor such jobs is given by\nW01(t) =V\n1\u0000\u001a0(T):\nFor jobs with predicted service time greater than T,\nW02(t) =V\n(1\u0000\u001a)(1\u0000\u001a0(T)):\nThe total expected waiting time per job is therfore given by\nW0=VR1\n0f(x)gT(x)dx\n1\u0000\u001a0(T)+VR1\n0f(x)(1\u0000gT(x))dx\n(1\u0000\u001a)(1\u0000\u001a0(T))\n=V(1\u0000\u001aR1\n0f(x)gT(x)dx)\n(1\u0000\u001a)(1\u0000\u001a0(T))\n=V(1\u0000\u001aQ(T))\n(1\u0000\u001a)(1\u0000\u001a0(T)):\n\nIn particular, we see that the only changes from the setting without the prediction is that in the 1\u0000F(T)\u001a\nterm in the numerator, the F(T)has been replaced by the more complex integral expression Q(T), and\nsimilarly the 1\u0000\u001a(T)term in the denominator has become 1\u0000\u001a0(T).\nA model suggested in [13, 14] considers the setting where a prediction for a job with service time zis\nitself exponentially distributed with mean z; we refer to this as the exponential prediction model. While\nnot necessarily realistic, this model often allows for mathematical derivations, and provides a useful starting\npoint for considering the effects of predictions. With this model,\ngT(x) = 1\u0000e\u0000(T=x );\nand hence\nQ(T) =Z1\n0f(x)gT(x)dx\n= 1\u0000Z1\n0e\u0000x\u0000(T=x )dx\n= 1\u00002p\nTK 1(2p\nT);\nwhereK1is a modiﬁed Bessel function of the second kind. Also\n\u001a0(T) =\u0015Z1\n0(xe\u0000x\u0000xe\u0000x\u0000(T=x ))dx\n=\u0015(1\u00002TK 2(2p\nT));\nwhereK2is a modiﬁed Bessel function of the second kind (with a different parameter).\nThe expected sojourn time for this case, which we refer to as Se\u0003;n, is then\nSe\u0003;n=\u0015(1\u0000\u0015(1\u00002p\nTK 1(2p\nT)))\n(1\u0000\u0015)(1\u0000\u0015(1\u00002TK 2(2p\nT)))+ 1:\nThere does not appear to be a simple form for the derivative of this expression that allows us to write a\nsimple form for the optimal value fo T, although it can be found numerically.\nWe can perform similar calculations for our Weibull distribution. Here we have\nQ(T) = 1\u0000Z1\n01\nsqrt2xe\u0000p\n2x\u0000(T=x )dx\n= 1\u0000r\nT\n2\u0019G3;0\n0;3\u0012T\n2j\u00001\n2;0;1\n2\u0013\n;\nwhere hereGis the Meijer G-function.\nSimilarly\n\u001a0(T) =\u0015Z1\n0rx\n2\u0010\ne\u0000p\n2x\u0000e\u0000p\n2x\u0000(T=x )\u0011\ndx\n=\u0015 \n1\u0000r\nT3\n2\u0019G3;0\n0;3\u0012T\n2j\u00003\n2;0;1\n2\u0013!\n;\nwhere again Gis the Meijer G-function.\nThe expected sojourn time for this case, which we refer to as Sw\u0003;n, is then\nSw\u0003;n=3\u0015\u0012\n1\u0000\u0015\u0012\n1\u0000q\nT\n2\u0019G3;0\n0;3\u0000T\n2j\u00001\n2;0;1\n2\u0001\u0013\u0013\n(1\u0000\u0015)\u0012\n1\u0000\u0015\u0012\n1\u0000q\nT3\n2\u0019G3;0\n0;3\u0000T\n2j\u00003\n2;0;1\n2\u0001\u0013\u0013+ 1:\n\n3.2 The preemptive system\nFor the preemptive system, again let\nQ(T) =Z1\n0f(x)gT(x)dx;\nand\n\u001a0(T) =\u0015Z1\n0xf(x)gT(x)dx:\nWe ﬁrst consider jobs arriving jobs with predicted service time at most Tand actual service time tSuch jobs\nwill have no waiting time, but their expected sojourn time is\nS1(t) =t\n1\u0000\u001a0(T):\nFor jobs with predicted service time greater than or equal to T, following the same reasoning as in the\ncase without predictions, we have\nW2(t) =V\n(1\u0000\u001a)(1\u0000\u001a0(T));\nand\nS2(t) =V\n(1\u0000\u001a)(1\u0000\u001a0(T))+t\n1\u0000\u001a0(T):\nWe therefore ﬁnd the total expected waiting time is\nW=V(1\u0000Q(T))\n(1\u0000\u001a)(1\u0000\u001a0(T));\nand the total expected sojourn time is\nS=V(1\u0000Q(T))\n(1\u0000\u001a)(1\u0000\u001a0(T))+1\n1\u0000\u001a0(T)\n=V(1\u0000Q(T)) + 1\u0000\u001a\n(1\u0000\u001a)(1\u0000\u001a0(T)):\nFor the exponential prediction model, the expected sojourn time, which we refer to as Se\u0003;n, is then\nSe\u0003;p=\u00152p\nTK 1(2p\nT) + 1\u0000\u0015\n(1\u0000\u0015)(1\u0000\u0015(1\u00002TK 2(2p\nT))):\nWe again here have the relation\n\u0015S\u0003\ne;p=S\u0003\ne;n\u00001;\nshowing that preemption is always helpful in this setting.\nFor the Weibull model,\nSw\u0003;p=1\u0000\u0015+ 3\u0015q\nT\n2\u0019G3;0\n0;3\u0000T\n2j\u00001\n2;0;1\n2\u0001\n(1\u0000\u0015)\u0012\n1\u0000\u0015\u0012\n1\u0000q\nT3\n2\u0019G3;0\n0;3\u0000T\n2j\u00003\n2;0;1\n2\u0001\u0013\u0013:\n\n4 One-Bit Advice with Multiple Queues\nIn this section, we consider one-bit threshold schemes for setting with multiple queues. In particular, we\nconsider the “power of dchoices” (also known as the “balanced allocations”) setting, where we consider\nthe number of queues growing to inﬁnity, and each arrival chooses the best queue from a small constant-\nsized subset of randomly selected queues [2, 12, 18]. An advantage here of queues based on one bit of\nadvice is their state can easily represented, allowing the type of mean-ﬁeld analysis that is typical for such\nsystems. We note that analysis of the power of dchoices with for example exact job sizes using queueing\nschemes such as Shortest Remaining Processing Time remains an intriguing open question (see e.g. [14] for\nmore discussion), although simply using FIFO queues and choosing the least loaded queue from a constant\nnumber of choices has been analyzed [7].\nAs our purpose here is primarily to demonstrate how schemes utilizing one bit can be analyzed in this\nframework, we choose a relatively simple example, based on the anecdotal 80-20 rule, that 20% of the jobs\ncause 80% of the work. We assume that there are two types of jobs: long jobs have exponentially distributed\nservice times with mean \u00161, and short jobs have exponentially distributed service times with mean \u00162<\u0016 1.\nLong jobs arrive with rate \u00151nand short jobs arrive with rate \u00152n, wherenis the number of queues in the\nsystem. While this model is general, it can encompass the 80-20 rule, where long jobs are less frequent but\nrequire much more work; for example, if \u00151\u00161= 4\u00152\u00162, then long jobs are relatively rare but contribute\n80% of the work.\nIn the prediction setting, we assume long jobs are misclassiﬁed as short jobs independently with prob-\nabilityq1, and short jobs are misclassiﬁed as long jobs independently with probability q2. (We may view\nthe case without predictions, where the one bit of advice is accurate, as corresponding to q1=q2= 0,\nwith the resulting equations.) A more useful interpretation for our analysis is that a job that is classiﬁed\nas a long job, or labeled long, is actually long with probability pL=\u00151(1\u0000q1)=(\u00151(1\u0000q1) +\u00152q2),\nand similarly a job that is classiﬁed as a short job, or labeled short, is actually short with probability pS=\n\u00152(1\u0000q2)=(\u00152(1\u0000q2)+\u00151q1). Similarly, the arrival rate for jobs that labeled long is \u0015L=\u00151(1\u0000q1)+\u00152q2\nand the arrival rate for jobs that are labeled short is \u0015S=\u00152(1\u0000q2) +\u00151q1.\nFor serving jobs, we give labeled short jobs priority, and serve them in FIFO fashion; similarly, labeled\nlongs jobs are served using FIFO. We suggest a simple, convenient method for choosing queues, although\nmany variations are possible and can be studied similarly. We choose the “best” of dqueues chosen inde-\npendently and uniformly at random for a constant d, where we determine the best as follows. First, an empty\nqueue has highest priority; an empty queue will always be selected if it is one of the dchosen. Otherwise,\nwe ignore the label and the time already spent being served of the job being served. Jobs that are predicted\nto be short shall choose the queue with the fewest queued labeled short jobs, breaking ties in favor of the\nqueue with the fewest labeled long jobs (and then randomly if two queues match), and similarly jobs that are\npredicted to be long shall choose the queue with the smallest number of queued labeled long jobs, breaking\nties in favor of the queue with fewer short jobs (and then randomly if two queues match). Again, one could\nimagine more complex policies based on minimizing the expected time until service; such policies can be\nstudied using the same framework.\nWe derive equations describing the system state in the mean ﬁeld limit, where the number of queues goes\nto inﬁnity. (This approach can be formalized using the theory of density dependent jump Markov chains,\nfollowing the work of Kurtz; see [5, 10, 20] for examples.) The state of a single queue can be represented by\na triple (s;`;c ), wheresis the number of jobs that are labeled short, `is the number of jobs that are labeled\nlong, andcis 1 if the current running job is long and 2 if it is short. The state (0;0;0)is used for an empty\nqueue; this is the only state where c6= 1;2. Letx(s;`;c )(t)represent the fraction of queues in state (s;`;c )\nat timet; we drop the twhere the meaning is clear. We use ^x(s;`;c )to refer to the equilibrium values for\nthese quantities.\nNote that our setting allows a relatively simple analysis by having service times be exponentially dis-\n\ntributed and predictions depend only on the type of the job, instead of its running time. Because of this, to\nkeep the state of a queue it sufﬁces to keep the type of the running job, as this gives the distribution of the\nremaining time it is in service. This approach can be extended to more general service times and predictions;\nsee e.g. [1, 7], for example, for the appropriate framework. At a high level, for such generalizations, the\nstate of the queue must track how long the current running job has been in the system; the distributions\nfunction for remaining time in service, which is derived by taking the proper weighted average over types,\nthen determines whether the service will complete over the next time interval dt.\nTo write the equations describing the limiting behavior of these systems, we use some additional nota-\ntion. Letz(2;s;`)be the fraction of queues with lower priority over a queue with squeued labeled short jobs\nand`queue labeled large jobs when a job labeled short arrives (in terms of being chosen by our algorithm),\nand similarly deﬁne z(1;s;`)for when a job labeled long arrives. Here again we drop the implicit dependence\nont. Thesezvalues can be readily computed by dynamic programming or even brute force given the x(s;`;c ).\nForc= 1;2andc0= 1;2, let\nw(c0;s;`;c )=\u0010\u0000\nz(c0;s;`)+x(s;`;1)+x(s;`;2)\u0001d\u0000\u0000\nz(c0;s;`)\u0001d\u0011x(s;`;c )\nx(s;`;1)+x(s;`;2):\nThenw(c0;s;`;c )gives the probability that an incoming job labeled c0chooses a queue in state (s;`;c ). For\nthe empty queue, we have the special case\nw(c0;0;0;0)= 1\u0000\u0000\n1\u0000x(0;0;0)\u0001d;\nand is it convenient to let w(c0;s;`;c )= 0ifs<0or`<0.\nThe limiting mean ﬁeld equations when s>0are then\ndx(s;`;1)\ndt=\u0015Sw(2;s\u00001;`;1)+\u0015Lw(1;s;`\u00001;1)+\u00161x(s+1;`;1)(1\u0000pS) +\u00162x(s+1;`;2)(1\u0000pS)\n\u0000\u0000\n\u00161x(s;`;1)+\u0015Sw(2;s;`;1)+\u0015Lw(1;s;`;1)\u0001\n;\nand\ndx(s;`;2)\ndt=\u0015Sw(2;s\u00001;`;2)+\u0015Lw(1;s;`\u00001;2)+\u00161x(s+1;`;1)pS+\u00162x(s+1;`;2)pS\n\u0000\u0000\n\u00162x(s;`;2)+\u0015Sw(2;s;`;2)+\u0015Lw(1;s;`;2)\u0001\n:\nThe cases where s= 0and`>0are given by\ndx(0;`;1)\ndt=\u0015Lw(1;0;`\u00001;1)+\u00161x(1;`;1)(1\u0000pS) +\u00162x(1;`;2)(1\u0000pS) +\u00161x(0;`+1;1)pL+\u00162x(0;`+1;2)pL\n\u0000\u0000\n\u00161x(0;`;1)+ +\u0015Sw(2;0;`;1)+\u0015Lw(1;0;`;1)\u0001\n;\nand\ndx(0;`;2)\ndt=\u0015Lw(1;0;l\u00001;2+\u00161x(1;`;1)pS+\u00162x(1;`;2)pS+\u00161x(0;`+1;1)(1\u0000pL) +\u00162x(0;`+1;2)(1\u0000pL)\n\u0000\u0000\n\u00162x(0;`;2)+ +\u0015Sw(2;0;`;2)+\u0015Lw(1;0;`;2)\u0001\n;\nAnd ﬁnally, for queues without any waiting jobs, we have\ndx(0;0;1)\ndt=\u0015LpLw(1;0;0;0)+\u0015S(1\u0000pS)w(1;0;0;0)\n+\u00161x(0;1;1)pL+\u00162x(0;1;2)pL+\u00161x(1;0;1)(1\u0000pS) +\u00162x(1;0;2)(1\u0000pS)\n\u0000\u0000\n\u00161x0;0;1+\u0015Sw(2;0;0;1)+\u0015Lw(1;0;0;1)\u0001\n;\n\ndx(0;0;2)\ndt=\u0015SpSw(2;0;0;0)+\u0015L(1\u0000pL)w(2;0;0;0)\n+\u00161x(0;1;1)(1\u0000pL) +\u00162x(0;1;2)(1\u0000pL) +\u00161x(1;0;1)pS+\u00162x(1;0;2)pS\n\u0000\u0000\n\u00161x0;0;2+\u0015Sw(2;0;0;2)+\u0015Lw(1;0;0;2)\u0001\n;\ndx(0;0;0)\ndt=\u00161x(0;0;1)+\u00162x(0;0;2)\u0000\u0000\n\u0015Sw(2;0;0;0)+\u0015Lw(1;0;0;0)\u0001\n:\nIn section 5 below, we compare the results from calculating the differential equations results numerically\nwith simulations.\n5 Simulations and Numerical Results\n5.1 Single Queues\nIn the simulations for single queues, each data point is obtained by simulating initially empty queues over\n1000000 units of time, and taking the average response time for all jobs that terminate after time 100000. We\nthen take the average of over 100 simulations. Waiting for the ﬁrst 10% allows the system to approach the\nstationary distribution, and we run for sufﬁcient time that recording only completed jobs has small inﬂuence.\nBefore presenting results, we emphasize that we have checked the experimental results for single queues\nagainst the equations we have derived in sections 2 and 3. They match very closely; in general terms,\nnearly all the averaged simulation results presented are within 1% of the values derived from the equations.\n(Individual simulation runs can vary more signiﬁcantly; the maximum and minimum times over our trials\nvary by 5-10% for exponentially distributed service times, and by 10-20% for Weibull service times.) As\nsuch, we do not present further results comparing equations to simulations here.1\nOur ﬁrst simulations are for exponentially distributed service times. While we have done more sim-\nulations at various arrival rates, we present results for \u0015= 0:8;0:9;and0:95. This focuses on the more\ninteresting case of reasonably high arrival rates, while keeping the values within a reasonable range for\npresentation. As a baseline, when the arrival rate is \u0015, the expected time a job spends in such a system in\nequilibrium with a FIFO queue is 1=(1\u0000\u0015).\nWe ﬁrst show the results of the experiments, comparing the results with and without preemption, and\nwith and without prediction. Figure 1 shows the results as the threshold varies given correct one-bit advice,\nand Figure 2 shows the results under the exponential prediction model. The ﬁgures are at the same scale\nso results can be compared. We see here that preemption, as expected, provides some gains, and the cost\nfor using prediction is not too large. In particular, one bit of even sometimes incorrect advice substantially\nreduces the average time in system over simple FIFO queueing. The results show that in this setting choosing\na threshold near the optimal rather than the optimal does not substantially affect the results.\nWe also do experiments for the Weibull distribution with cumulative distribution 1\u0000e\u0000p\n2x. As a\nbaseline, when the arrival rate is \u0015, the expected time a job spends in such a system in equilibrium with a\nFIFO queue under this Weibull distribution is (1 +\u0015)=(1\u0000\u0015).\nSimilar to before, Figure 3 shows the results as the threshold varies given correct one-bit advice, and\nFigure 4 shows the results under the exponential prediction model. Note that the range of thresholds is much\nlarger. One would expect larger thresholds would be optimal for a heavy-tailed distribution, as the downside\n1While arguably we could have simply trusted the equations, we ﬁnd verifying results via simulation worthwhile.\n\n 0 2 4 6 8 10 12 14\n 1  1.5  2  2.5  3  3.5  4Average time in system\nT: Thresholdλ = 0.80, PE\nλ = 0.80, Non-PEλ = 0.90, PE\nλ = 0.90, Non-PEλ = 0.95, PE\nλ = 0.95, Non-PEFigure 1: Performance under threshold schemes\nwith exact information, exponentially distributed\nservice times.\n 0 2 4 6 8 10 12 14\n 1  1.5  2  2.5  3  3.5  4Average time in system\nT: Thresholdλ = 0.80, PE\nλ = 0.80, Non-PEλ = 0.90, PE\nλ = 0.90, Non-PEλ = 0.95, PE\nλ = 0.95, Non-PEFigure 2: Performance under threshold schemes\nwith predicted information, exponentially dis-\ntributed service times, exponential predictions.\n 0 4 8 12 16 20\n 1  2  3  4  5  6  7Average time in system\nT: Thresholdλ = 0.80, PE\nλ = 0.80, Non-PEλ = 0.90, PE\nλ = 0.90, Non-PEλ = 0.95, PE\nλ = 0.95, Non-PE\nFigure 3: Performance under threshold schemes\nwith exact information, Weibull distributed ser-\nvice times.\n 0 4 8 12 16 20\n 1  2  3  4  5  6  7Average time in system\nT: Thresholdλ = 0.80, PE\nλ = 0.80, Non-PEλ = 0.90, PE\nλ = 0.90, Non-PEλ = 0.95, PE\nλ = 0.95, Non-PEFigure 4: Performance under threshold schemes\nwith predicted information, Weibull distributed\nservice times, exponential predictions.\n\nFIFO THRESHOLD THRESHOLD SRPT PREDICTION PREDICTION SPRPT\n\u0015 NO PREEMPT PREEMPT NO PREEMPT PREEMPT\n0.50 2.000 1.783 1.564 1.425 1.850 1.698 1.659\n0.60 2.500 2.089 1.814 1.604 2.209 2.013 1.940\n0.70 3.333 2.542 2.203 1.875 2.761 2.517 2.369\n0.80 5.000 3.329 2.910 2.355 3.757 3.451 3.143\n0.90 10.00 5.278 4.755 3.552 6.366 5.960 5.097\n0.95 20.00 8.535 7.914 5.532 10.848 10.372 8.424\n0.98 50.00 16.495 15.735 10.436 22.418 21.909 16.696\nTable 1: Results for exponentially distributed service times. Prediction results are using exponential predic-\ntions.\nFIFO THRESHOLD THRESHOLD SRPT PREDICTION PREDICTION SPRPT\nNO PREEMPT PREEMPT NO PREEMPT PREEMPT\n0.50 4.000 3.012 1.608 1.411 3.155 1.736 1.940\n0.60 5.500 3.676 1.867 1.574 3.918 2.062 2.280\n0.70 8.000 4.565 2.258 1.813 4.983 2.568 2.750\n0.80 13.00 5.955 2.951 2.217 6.721 3.481 3.519\n0.90 29.00 8.940 4.649 3.154 10.630 5.790 5.224\n0.95 58.00 13.223 7.448 4.517 16.546 9.846 7.788\n0.98 148.0 22.451 15.194 7.666 29.346 20.918 13.404\nTable 2: Results for Weibull distributed service times. Prediction results are using exponential predictions.\nof having a very large job at the front of the queue is more substantial. Further, in this setting, preemp-\ntion offers more substantial gains, and clearly pushes the optimal threshold to larger values, as preemption\nsigniﬁcantly reduces the impact of a long job holding the queue. While the cost of using predicted advice\nover optimal advice is larger, the potential (and actual) gains from using predicted advice are even more\nsubstantial.\nTo shed additional light, we compare one-bit advice to no advice, in which case the queue uses FIFO, and\nfull knowledge of the processing times, in which case the queue uses Shortest Remaining Processing Time\n(SRPT). In the case of predictions, we consider the exponential prediction model, comparing our schemes\nagainst FIFO and Shortest Predicted Remaining Processing Time [13], which uses SRPT scheduling on the\npredicted times. For FIFO results we simply use the standard formula for expected time in the system; we\ncould similarly use formulae for the other results, but present results from simulations. In particular, for our\none-bit schemes, we choose the best threshold from simulation result, and allow preemptions. As we can see\nin Tables 1 and 2, one-bit schemes greatly improve on FIFO across the board, with a greater improvement\nfor Weibull distributions, as one would expect. Indeed, one-bit threshold schemes achieve a large fraction\nof the beneﬁt that would arise from full knowledge of processing times, and one-bit predictions achieve a\nlarge fraction of the beneﬁt that would arise from more detailed predictions. We also ﬁnd that preemption is\nhelpful, and moreso for the heavier tailed distributions, as one would expect. Perhaps most important, using\npredictions provides large gains, nearly as good as with exact information, showing the large potential for\neven simple predictions to provide large value in scheduling.\n\nSimulations Diff. Eqns.\n1 Choice 24.208\u0000\u0000\u0000\nSRPT 2.366\u0000\u0000\u0000\nShorter Queue, FIFO 4.967\u0000\u0000\u0000\nPred 0.0, 0.0 3.394 3.392\nPred 0.1, 0.1 3.690 3.688\nPred 0.2, 0.2 4.010 4.007\nPred 0.3, 0.3 4.353 4.347\nPred 0.4, 0.4 4.717 4.711\nPred 0.5, 0.5 5.105 5.098\nPred 0.2, 0.4 4.280 4.276\nPred 0.4, 0.2 4.402 4.395\nPred 0.11, 0.61 4.617 4.611\nTable 3: Results for queueing systems with 1000 queues, 2 choices and baseline comparisons.\n5.2 Multiple Queues\nWe present results here for an example using the power of two choices, to demonstrate the results from\ndifferential equations match simulations, and to show the effectiveness of working with predictions. In\nour example we follow the 80-20 rule; we choose parameters \u00151= 0:225,\u00161= 3:2,\u00152= 0:90, and\n\u00162= 0:20. The overall load on the system is therefore 0:9. For simulations, each data point is obtained\nby simulating systems of 1000 (initially empty) queues over 100000 units of time, and taking the average\nresponse time for all jobs that terminate after time 10000. We then take the average of over 100 simulations.\nFor the differential equations, we simply used Euler’s method over times steps of 10\u00005over time 104. (This\nprovides an accurate calculation for the “ﬁxed point”, or stationary distribution corresponding to the solution\nof these equations.) All experiments use two choices. We provide simulation results for randomly choosing\na single queue and using FIFO, choosing a queue based on the least loaded and using SRPT within the\nqueue, and choosing the shorter of two queues and FIFO processing for comparison. We provide simulation\nresults for various predictions, where the two values after “Pred” in the table are q1(misprediction for long\njobs) andq2(short jobs), respectively.\nThe main takeaways from Table 3, beyond the fact that the differential equations are quite accurate (less\nthan 0.2% difference in these examples), are that one-bit predictions can provide beneﬁts over the already\nexcellent performance of choosing the shorter queue; even when all predictions are only 60% accurate, we\nseem some gain in performance. Considering q1= 0:2andq2= 0:4along withq1= 0:4andq2= 0:2\nshows that predictions for long jobs are more important, even though there are much fewer long jobs. The\neffect of giving a long job higher priority, where it can block short jobs, has a more prominent effect than\nmisclassifying a short job. This demonstrates that the goal of a machine learning algorithm in this setting\nshould not be simply to maximize the number of correct predictions; a machine learning algorithm can do\nbetter by predicting the long jobs well. (See [14] for a similar discussion.)\nAs an extreme example of this, choosing q1= 0:11andq2= 0:61leads to a total error rate of 51% over\nall jobs, as short jobs have a much higher arrival rate than long jobs. But even though more than half the jobs\ntypes are predicted incorrectly, because long jobs are predicted correctly most of the time, such predictions\nstill perform notably better than not using predictions and just choosing the shorter queue.\n\n6 Conclusions\nWe have looked at the setting of queueing systems with one bit of advice, where a primary motivation is the\npotential for machine learning algorithms to provide simple but useful predictions to improve scheduling.\nIn the case of single queues, we see that a natural probabilistic model for predictions leads to relatively\nstraightforward equations that can be used to determine where one would ideally choose a threshold to\nseparate long and short jobs. For large-scale queueing systems, where the power of two choices can be used,\nwe have shown that one-bit prediction can allow for ﬂuid limit analysis. We view this as a potential step\nforward for the interesting open problem of determining the behavior of systems using the power of two\nchoices with scheduling via shortest remaining processing time or other scheduling schemes based on the\nservice time.\nWe believe there remain several interesting directions to explore in this space. The use of predictions\nin more complex settings, such as call centers, may provide signiﬁcant value. A challenging underlying\nquestions, when “jobs” may correspond to people, is how to deﬁne appropriate notions of fairness, so tht jobs\nthat are mispredicted by a machine learning algorithm do not suffer overly from the algorithm’s behavior.\nReferences\n[1] Reza Aghajani, Xingjie Li, and Kavita Ramanan. Mean-ﬁeld dynamics of load-balancing networks\nwith general service distributions. arXiv preprint arXiv:1512.05056 , 2015.\n[2] Yossi Azar, Andrei Z. Broder, Anna R. Karlin, and Eli Upfal. Balanced allocations. SIAM J. Comput. ,\n29(1):180–200, 1999.\n[3] Joan Boyar, Lene M Favrholdt, Christian Kudahl, Kim S Larsen, and Jesper W Mikkelsen. Online\nalgorithms with advice: a survey. ACM SIGACT News , 47(3):93–129, 2016.\n[4] Matteo Dell’Amico, Damiano Carra, and Pietro Michiardi. PSBS: Practical size-based scheduling.\nIEEE Transactions on Computers , 65(7):2199-2212, 2015.\n[5] S. N. Ethier and T. G. Kurtz. Markov Processes: Characterization and Convergence . John Wiley and\nSons, 1986.\n[6] Mor Harchol-Balter. Performance modeling and design of computer systems: queueing theory in\naction . Cambridge University Press, 2013.\n[7] Tim Hellemans and Benny Van Houdt. On the power-of- d-choices with least loaded server selection.\nPOMACS , 2(2):27:1–27:22, 2018.\n[8] Chen-Yu Hsu, Piotr Indyk, Dina Katabi, and Ali Vakilian. Learning-Based Frequency Estimation\nAlgorithms. In 7th International Conference on Learning Representations , 2019.\n[9] Tim Kraska, Alex Beutel, Ed H Chi, Jeffrey Dean, and Neoklis Polyzotis. The case for learned index\nstructures. In Proceedings of the 2018 International Conference on Management of Data , pages 489–\n504, 2018.\n[10] T. G. Kurtz. Solutions of Ordinary Differential Equations as Limits of Pure Jump Markov Processes.\nJournal of Applied Probability , V ol. 7, 1970, pp. 49-58.\n[11] Thodoris Lykouris and Sergei Vassilvitskii. Competitive caching with machine learned advice. In\nProceedings of the 35th International Conference on Machine Learning , pp. 3302–3311, 2018.\n\n[12] Michael Mitzenmacher. The power of two choices in randomized load balancing. IEEE Trans. Parallel\nDistrib. Syst. , 12(10):1094–1104, 2001.\n[13] Michael Mitzenmacher. Scheduling with predictions and the price of misprediction. 11th Innovations\nin Theoretical Computer Science Conference, ITCS 2020, 14:1-14:18, 2020.\n[14] Michael Mitzenmacher. The Supermarket Model with Known and Predicted Service Times. arXiv\npreprint arXiv:1905.12155 , 2019.\n[15] Michael Mitzenmacher and Sergei Vassilvitskii. Algorithms with Predictions. In Beyond the Worst-\nCase Analysis of Algorithms , edited by Tim Roughgarden, Cambridge University Press, 2020.\n[16] T.M. O’Donovan. Direct solutions of M/G/1 priority queueing models. Revue franaise d’automatique,\ninformatique, recherche oprationnelle , 10.V1, 107-111, 1976.\n[17] Manish Purohit, Zoya Svitkina, and Ravi Kumar. Improving online algorithms via ML predictions. In\nAdvances in Neural Information Processing Systems , pages 9684–9693, 2018.\n[18] Nikita Dmitrievna Vvedenskaya, Roland L’vovich Dobrushin, and Fridrikh Izrailevich Karpelevich.\nQueueing system with selection of the shortest of two queues: An asymptotic approach. Problemy\nPeredachi Informatsii , 32(1):20–34, 1996.\n[19] Adam Wierman and Misja Nuyens. Scheduling despite inexact job-size information. Performance\nEvaluation Review , 36(1):25-36, 2008.\n[20] N.C. Wormald. Differential equations for random processes and random graphs. The Annals of Applied\nProbability , 5(1995), pp. 1217–1235.",
  "textLength": 38472
}