{
  "paperId": "7789809e875f5fca94bfc254245dc4339c892c02",
  "title": "A trustable and interoperable decentralized solution for citizen-centric and cross-border eGovernance: A conceptual approach",
  "pdfPath": "7789809e875f5fca94bfc254245dc4339c892c02.pdf",
  "text": "A trustable and interoperable decentralized\nsolution for citizen-centric and cross-border\neGovernance: A conceptual approach\nGeorge Domalis1;3, Nikos Karacapilidis2, Dimitris Tsakalidis1, and Anastasios\nGiannaros3\n1Novelcore, Greece\n2IMIS Lab, MEAD, University of Patras, Greece\n3Computer Engineering and Informatics Department, University of Patras, Greece\nfdomalis,tsakalidis g@novelcore.eu, fkaracap,up1070374 g@upatras.gr\nAbstract. Aiming to support a cross-sector and cross-border eGover-\nnance paradigm for sharing common public services, this paper intro-\nduces an AI-enhanced solution that enables bene\fciaries to participate\nin a decentralized network for e\u000bective big data exchange and service\ndelivery that promotes the once-only priority and is by design digital, ef-\n\fcient, cost-e\u000bective, interoperable and secure. The solution comprises (i)\na reliable and e\u000ecient decentralized mechanism for data sharing, capable\nof addressing the complexity of the processes and their high demand of\nresources; (ii) an ecosystem for delivering mobile services tailored to the\nneeds of stakeholders; (iii) a single sign-on Wallet mechanism to man-\nage transactions with multiple services; and (iv) an intercommunication\nlayer, responsible for the secure exchange of information among existing\neGovernment systems with newly developed ones. An indicative appli-\ncation scenario showcases the potential of our approach.\nKeywords: Disruptive services in public sector ·AI-enabled digital trans-\nformation ·Distributed applications.\n1 Introduction\nThe rapid growth of Internet technologies, mobile communications, cloud infras-\ntructures and distributed applications have brought an unprecedented impact\nto all spheres of the society and a great potential towards the establishment of\nnovel eGovernance models [28]. These models should deploy core values such as\nimproved public services and administrative e\u000eciency, open government capa-\nbilities, improved ethical behavior and professionalism, improved trust and con-\n\fdence in governmental transactions [25]. Towards the modernization of their\nservices and the reduction of the associated bureaucracy, public administrations\nneed to transform their back-o\u000eces, upgrade their existing internal processes and\nservices, and provide privacy-preserving and secure solutions. It is necessary to\nleverage key digital enablers, such as open services and technical building blocksarXiv:2103.15458v2  [cs.CY]  1 Jun 2021\n\n2 Domalis et al.\n(eID, eSignature, eProcurement, eDelivery and eInvoice), shared and reusable so-\nlutions based on agreed standards and speci\fcations (Single Digital Gateway), as\nwell as common interoperability practices (e.g. European Interoperability Frame-\nwork). This leads to the upgrade of services that enable cross-border data sharing\namong public administrations, businesses and citizens.\nGovernance models, in general, do not adopt a citizen-centric paradigm [6];\nthey do not take into account citizens' needs and expectations of new services,\noften excluding them from operational and decision making processes. More-\nover, documentation exchanges, processes and contact points do not function as\na whole; they are rather dispersed and not su\u000eciently inter-connected among\ncountries and organizations. Transparency and accountability are additional as-\npects of major importance towards building a good and fair governance model\n[2]. Admittedly, governments that employ models to make information sharing\nand decision-making processes transparent improve the principle of accountabil-\nity and augment the participation of citizens and other stakeholders in related\nactions [7]. The corresponding digital transformation of public services can re-\nduce administrative burdens, enhance productivity of governments, minimizing\nat the same time all the extra cost of traditional means to increase capacity, and\nultimately improve the overall quality of interactions with and within public\nadministrations [1].\nTaking into account the above issues, this paper introduces a transparent,\ncross-border and citizen-centric eGovernance model for public administration\nservices, which automates the processes and safeguards the integrity of interac-\ntions among citizens, businesses and public authorities. By taking advantage of\nemerging ICT technologies, such as Peer-to-Peer (P2P) networks, Distributed\nLedger Technologies (DLTs) and smart data structures, we deploy a public dis-\ntributed infrastructure, based on the InterPlanetary File System (IPFS) and\na distributed ledger. This solution is based on a single sign-on Wallet mecha-\nnism that interconnects distinct decentralized applications (dApps) responsible\nfor ID authentication, document sharing, information exchange and transactions\nvalidation, enabling a single point of access to information. The proposed solu-\ntion is fully in line with the Government 3.0 paradigm, in that it meaningfully\nintegrates a diverse set of disruptive and established ICTs [24].\nThe remainder of this paper is organized as follows: Section 2 is devoted to\nthe presentation of the underlying technologies employed in our approach. The\nproposed digital transformation model, enabled through an architecture incor-\nporating a series of prominent technologies, is presented in Section 3. Particular\nemphasis is given to the inclusion of data governance and knowledge manage-\nment services to best facilitate and eventually reduce lengthy, cumbersome and\nrepetitive bureaucratic eGovernment transactions. Section 4 validates the po-\ntential of our approach through a representative application scenario. Finally,\nSection 5 outlines concluding remarks and future research directions.\n\nA decentralized solution for citizen-centric eGovernance 3\n2 Underlying Technologies\nInterplanetary File System. It is a P2P distributed \fle sharing system that\nseeks to connect all computing devices with the same \fle system by providing a\nhigh throughput content-addressing block storage model. IPFS distributes \fles\nacross the network. Each \fle is addressed by its cryptographic hash based on\nits content, rather than its location as in traditional centralized systems where\na single server hosts many \fles and information has to be fetched by accessing\nthis server. This characteristic renders IPFS an ideal data storage solution for\neGovernment services, where security and transparency are of utmost impor-\ntance, since there is no single point of failure. One of the main content routing\nsystems of the IPFS architecture is the Distributed Hash Table (DHT), which\nallows key-based lookup in a fully decentralized manner. IPFS leverages a DHT\nsystem, in that all IPFS nodes \"advertise\" content items stored in the DHT\nand this results in a distributed dictionary used for looking up content. Various\napplications integrating IPFS with ledger and blockchain technologies have al-\nready been reported in the literature for transactions recording [9] and secure\n\fle sharing with decentralized user authentication, access control and group key\nmanagement mechanisms [16,21]. In the approach described in the next section,\nwe leverage IPFS to provide increased capacity for managing large datasets in a\ndecentralized manner and complement the throughput limitations of distributed\nledger technologies.\nDistributed Ledger. It is a distributed database architecture that records\ntransactions on a P2P network and enables multiple members to maintain their\nown identical copy of a shared ledger without the need for validation from a\ncentral entity. Transaction data are scattered among multiple nodes using the\nP2P protocol principles, and are synchronized at the same time in all nodes. A\npublic distributed ledger is characterized by an open unprotected environment\nwith millions of participants, most of which have limited computational power\nand bandwidth, while most of the power is in the hands of a small fraction of\nthe participating nodes. Thus, there is a signi\fcant risk of a \"majority attack\",\nin which a few nodes can dictate the choice of transactions. For eGovernance\npurposes, the design of a distributed ledger requires a comprehensive approach\ntaking into account diverse aspects such as intermediate scale, high processing\nrate and low completion time with moderate energy consumption, unique attack\nmodel, and utilization of the underlying data structures.\nSmart contracts. They are decentralized, trusted computer programs stored\non a blockchain that are automatically executed when predetermined terms and\nconditions are met. They facilitate, verify, or enforce documents and actions\naccording to the terms of a contract or an agreement between two parties (i.e.\nagreements between eGovernance operators of two countries and end-users) that\nconsist of a set of rules dictating a reaction when speci\fc actions occur [27]. This\nset of rules is deployed on blockchain to ensure decentralized, transparent and\nsecure characteristics. Upon meeting prede\fned conditions, a smart contract is\n\n4 Domalis et al.\nexecuted automatically, making it independent of any central entity. Shields et\nal. [17] discuss the use of smart contracts for legal agreements and conclude\nthat smart contracts will bene\ft from the legal precedent established in the\nelectronic marketplace. In our approach, smart contracts are employed to manage\nthe automatic execution of policies for the proposed services.\nDecentralized Applications. They are composed of distributed entities that\ndirectly interact with each other and make local autonomous decisions in the\nabsence of a centralized coordinating authority. According to Raval [20], a dApp\nis characterized by four features: (i) open source, (ii) internal currency, (iii)\ndecentralized consensus, and (iv) no central point of failure. Bittorrent [3] was\nthe initial dApp, enabling users to connect and exchange \fles. Soon afterwards,\nblockchain technology was introduced to manage the decentralization and enable\nthe immutability of data. In the context of eGovernment 3.0, dApps can be\nleveraged to deliver diverse services such as ID authentication, document sharing,\ninformation exchange and transactions validation.\nSmart data structures. The incorporation of Machine Learning techniques\nto explore causal relations among Big Data [22] in eGovernment systems is of-\nten deterred by interoperability ine\u000eciencies [12]. Smart data structures [5] are\na new class of parallel data structures that leverage online Machine Learning\nand self-aware computing principles to tune themselves automatically. They can\nreplace existing index structures with other types of models, including deep\nlearning models, referred to as learned indexes [4,15,23]. Recent works present\npreliminary outcomes of the conceptual and methodological aspects of semantic\nannotation of data and models, which enable a high standard of interoperabil-\nity of information [26] and showcase how multi-input deep neural networks can\ndetect semantic types [10]. We utilize smart data structures to identify and ef-\nfectively transform data schemas and interconnect existing centralized systems\nwith our decentralized solution.\nSingle sign-on. It is an authentication mechanism that enables the use of a\nunitary security credential to access related, but independent, software systems\nor applications [14]. It enables simple username and password management, im-\nproved identity protection, increased speed and reduction of security risks. It also\nincludes functionalities such as password grant (sign-in directly on the web), au-\nthorization code grant (user authorizes third-party), implicit grant (third-party\nweb app sign-in), web services API that can e\u000bectively authenticate requests,\nand seamless user authorization experience on client-side technology. Various\ntypes of schemas exist based on (i) the type of infrastructure, (ii) the system\narchitecture, (iii) the credential forms (token, certi\fcate), and (iv) the proto-\ncols used. It is a critical part of complex environments, where multiple services\nfrom various providers are hosted. While single sign-on has been mainly used in\nmobile and Internet of Things applications, its integration with distributed \fle\nsystems still remains a challenge.\n\nA decentralized solution for citizen-centric eGovernance 5\n3 The proposed solution\n3.1 Research methodology\nFor the development of the proposed open and cross-border eGovernance model,\nwe have adopted the design science paradigm [8], which aims to extend the\nboundaries of human and organizational capabilities by creating new and in-\nnovative artifacts, especially for the information technologies domain. For our\npurposes, we have used the speci\fc design science research methodology pro-\nposed by Pe\u000bers et al. [18] for the domain of Information Systems (IS) research,\nwhich includes the following stages: identify problem and motivation, de\fne ob-\njectives of a solution, design and development, demonstration, evaluation and\ncommunication.\nFurthermore, we have combined the above paradigm with that of action re-\nsearch , which aims to contribute both to the practical concerns of people in\nan immediate problematic situation and to the goals of social science by joint\ncollaboration within a mutually acceptable ethical framework. It has been rec-\nognized that action research can be quite important in the IS domain, as it can\ncontribute to improving its practical relevance [11]. In particular, it enables the\ndesign, implementation and evaluation of ICT-based actions/changes in organi-\nzations, which address speci\fc problems and needs that are of high interest for\npractitioners, and at the same time create scienti\fc knowledge that is of high\ninterest for the researchers. The complementarity between these two research\nparadigms, as well as the great potential of integrating them, have been exten-\nsively discussed in the literature; both paradigms aim to directly intervene in\nreal-world domains and introduce meaningful changes in them.\nIn particular, to address the issues elaborated in this work, we cooperated\nwith two Greek government agencies (the Ministry of Digital Governance and\na big local municipality) and two organisations with long experience in the de-\nvelopment of novel software solutions for eGovernment. Involving their most\nexperienced sta\u000b, we organized three workshops of 2 hours duration each. In\nthese workshops, we followed a qualitative approach (in-depth discussions) to\ncollect relevant information and accordingly shape the foreseen services. Based\non the information collected, we designed the solution presented below.\n3.2 Our approach\nWe propose a novel eGovernance model that creates new digital governance\npathways through the integration of emerging technologies and breakthrough\ncross-sector services. We deploy decentralized applications (dApps) to deliver\ne\u000ecient, reliable and secure data sharing, auditing mechanisms and communi-\ncation channels for the eGovernment sector. Our overall approach is digital by\ndefault, transparent and interoperable by design, and fully adheres to the once\nonly priority. All the individual modules are designed to be built on top of the\nIPFS and a distributed ledger, as illustrated in Fig. 1. This extended combi-\nnation of distributed technologies and infrastructures constitutes the backbone\n\n6 Domalis et al.\nof our solution, which is capable of e\u000eciently addressing the complexity of the\nprocesses, providing at the same time the security, trustworthiness, immutability\nand auditability required by contemporary public services.\nBy combining functionalities enabled by DLTs and IPFS , our approach al-\nlows users to control their data without compromising security or limiting third-\nparties to provide personalized services. IPFS has speci\fc features that remedy\nthe performance issues of dApps, improving their performance through an ad-\nhoc engagement of existing computational and storage resources. These features\ninclude: (i) content indexing, (ii) hash lookup, (iii) distributed naming system\n(IPNS, similar to DNS), (iv) persistence and clustering of data that reduce la-\ntency, (v) decentralized archiving, and (vi) compliance with privacy regulations.\nFig. 1. The architecture of the proposed solution.\nThe public ledger stores the users' digital identities, access consent logs, and\nselected authentication transactions. It co-supports the public sharing resource\ninfrastructure, providing the IPFS with advanced operational and technological\ncapabilities, starting from security and privacy, up to immutability of transac-\ntions. It is located at the heart of the network to monitor and continuously record\nevery approved interaction among the users' nodes. One of the major challenges\nis how to overcome the public nature of the ledger to ensure the security, privacy\nand anonymity of information. Towards this direction, we propose a combina-\ntion of private and public keys to exchange information among end-users and\nservices. In this way, a service does not observe raw data, but instead it runs its\ncomputations directly on the network and obtains the \fnal results only after the\nconsent of the user. We use DLTs since, from the data safety, authenticity and\nnon-repudiation point of view, they provide an easily accessible and immutable\nhistory of all contract-related data, adequate for building applications with trust,\naccountability, and transparency.\n\nA decentralized solution for citizen-centric eGovernance 7\nThe dApps are used to deliver dedicated services to users. They comprise\nsmart contracts and are hosted in the nodes of the distributed network. The\noverall performance and storage capacity are increased through the participation\nof new nodes joining the network. Our approach renders legal and regulatory\ndecisions simple, since law and regulations are programmed by smart contracts\nin the network and are enforced automatically, while the ledger acts as a legal\nevidence for storing such data.\nAsingle sign-on Wallet is responsible for managing - with a common person\nregistry - multiple services provided by various dApps, such as document shar-\ning and information exchange, enabling a single sign-on user-centric document\nrepository. This tool allows stakeholders to manage and share their personal and\nsensitive documents among di\u000berent application environments in a single man-\nagement kit, which can function in a fully distributed way, without a single point\nof failure. Hence, providing resilience and a continuum of service.\nIn addition, a middleware layer includes the following modules: (i) a Secure\nGateway Channel on-the-\ry to assure a secure intercommunication among sys-\ntems, databases, apps, etc; (ii) an AI Data Schema Transformer , which is based\non well-de\fned libraries and AI models (i.e. GPT2 [19]) and encompasses the\nEU interoperability standards to e\u000bectively identify and transform data schemas,\nmodels and structures, and enable machine-to-machine communication among\ndi\u000berent types of systems across the EU. Synthetic data collections that map\nand simulate real data types (i.e. citizens ID, passport, birth certi\fcate, crimi-\nnal record, etc.) for di\u000berent EU countries provide the backbone of this module's\nperception; (iii) a Transactions-based Analytics Module that runs as a back-end\nservice on the network, gathering transaction histories and provide insights to\nusers through a user interface developed and delivered as a dApp; and (iv)\naBrowser Service Module that acts as a search engine and facilitator of the\nnetwork and other modules (i.e. the dApp ecosystem), providing users with di-\nverse functionalities (locate \fles, documentation, services, entities, etc.) through\nuser-friendly interfaces. This extended digital service availability enables any\nphysical and/or legal entity (such as public administration, business and citi-\nzens) to integrate their own external centralized system in the network, enabling\ninteroperability between users, cross-border and cross-sector organizations.\nTo e\u000bectively satisfy the desired interoperability by design principle, we de-\nploy a machine learning based environment that automatically recognizes data\nstructures in existing centralized systems. Speci\fcally, we apply the notion of\nsmart data structures by employing deep learning techniques to recognize and\ntransform data schemas, data structures and data types. We apply data fusion\ntechniques to meaningfully integrate heterogeneous information from multiple\ndata sources that would otherwise remain uncorrelated and unexploited. To build\na highly tuned system tailored to the speci\fc needs of eGovernment services, we\nidentify the data distributions and examine possible optimizations in the index\nstructures to identify data patterns. The key idea is that a model can learn the\nsort order or structure of lookup keys and use this signal to e\u000bectively predict\nthe position or existence of the associated records.\n\n8 Domalis et al.\nThis holistic framework creates a novel eGovernance mechanism for commu-\nnication, data sharing and information retrieval among centralized systems and\ndecentralized/distributed applications. Stakeholders are able to use the single\nsign-on Wallet and the individual modules running on the network, while also\nhaving unrestricted access to the dApp ecosystem. This ecosystem hosts di\u000ber-\nent dApps for each distinct service supported by the network, which are custom\ndesigned and deployed to meet the needs of the end users. The functionalities\nand the interdependencies of the dApps are formulated and de\fned with the use\nof dedicated smart contracts and user interfaces, hosted under the ecosystem.\nThe dApp ecosystem includes libraries of common deployed smart contracts, en-\nabling their reuse and activating users/developers to build and deploy their own\napplications. Finally, the distributed \fle storage architecture gives the opportu-\nnity to stakeholders to host their own custom applications in the network, thus\ncontributing to its expansion and scalability.\n4 An application scenario\nAccording to the Treaty on European Union and Community law, EU citizens\nhave the right to work and live in any EU Member State. However, the process\nof moving abroad to a foreign country is quite complex in terms of bureaucratic\nprocesses. For instance, a Social Security Number (SSN) is required in many\nEU countries before signing a rental contract. In most cases, the burden of such\nactions rests solely with the citizens, not in terms of legislation but in terms of\ncomplexity of the processes that need to be carried out, let alone the multiple\nvisits people have to make to the relevant public authorities. The following sce-\nnario showcases the application of our user-centric solution, which simpli\fes the\nbureaucratic processes for citizens, businesses and public administrations.\nOverview. Alice, a Greek citizen, \fnds a vacant job position in a private com-\npany in Portugal. She applies for the job and thankfully gets hired. In Portugal,\nshe has to deal with a series of bureaucratic processes (issue an ID card and\na SSN, open a bank account, provide evidence of her educational certi\fcates\netc.). To obtain a residence title, rent an apartment and open a bank account,\nshe needs to present at least a validated ID documentation, a birth certi\fcate,\na nationality certi\fcation validated by a Greek Authority and a proof that she\nworks in Portugal, along with the additional information that may be required\nby the employer. Adopting our solution, Alice is able to request from the Greek\nAuthorities (Ministry of Digital Governance - MoDG) the proof of ID and the\nrequired data, validated. At the same time, Alice can remotely request from\nher formal educational institution (University of Patras - UoP) all the required\ncerti\fcates (diploma etc.).\nIn turn, MoDG issues the document and Alice gives permission (using a\ndistributed application) to forward it to the respective public authorities in Por-\ntugal (Ministry of Justice - MoJ). As soon as this transaction is completed, Alice\nobtains, has access and is able to securely share her Portuguese SSN through her\n\nA decentralized solution for citizen-centric eGovernance 9\nWallet. Now, her employer in Portugal can directly get the validated SSN from\nthe Portuguese MoJ, after her approval to register her credentials to their inter-\nnal payroll system. Furthermore, the HR representative of the company needs a\nseries of legal documents to proceed with the hiring process, including the per-\nmanent visa permit. Through her Wallet, Alice is able to provide and/or revise\nall the required personal documents.\nAdded value. The contribution of this approach stands on the simpli\fcation\nof the processes and the signi\fcant reduction of bureaucracy. According to the\ncurrent legislation and o\u000ecial procedures, the process to move to a foreign coun-\ntry for a new job is complex. Opening a bank account, renting an apartment or\nproving educational certi\fcation and achievements can be highly demanding\nin terms of paperwork, since in many cases there are requests that necessitate\ncross-border exchange of information and associated documents. Through the\nproposed eGovernance solution, inconsistencies in bureaucratic procedures will\nbe avoided, such as requiring a local bank account before being able to rent an\napartment, while at the same time requiring a local address before being able to\nopen a bank account.\nFig. 2. Current practice compared to the proposed solution.\nThrough a set of dApps from the distributed application ecosystem, which\nadopt a single sign-on Wallet approach and exploit the IPFS and distributed\nledger infrastructure, Alice can use her validated digital identity to remotely re-\nquest, obtain and share the required legal documents and certi\fcations. Upon her\npermission, all these can be moved directly from the issuing authorities (MoDG,\nMoJ and UoP) to her new employer and any other potential entity (bank, utili-\nties, etc.). These authorities digitally issue and validate the documentation and\ninstantly push encrypted data into the distributed network, while the transac-\ntions among the users are being recorded. Any type of transactions, including\nrequests, noti\fcations and permissions, are monitored and safely stored to pro-\ntect Alice's privacy. All transactions are stored in a public ledger to enhance the\n\n10 Domalis et al.\nsecurity of information and eliminate any forgery attempts. Hence, enabling a\nsecure-by-design eGovernment solution. This approach brings forward multiple\nadvantages such as minimizing the chance of forged documentation, enhancing\nthe transparency and security of information exchange in adherence with the\nrelevant legislation, decreasing the overall e\u000bort of citizens and reducing signif-\nicantly the waiting time to carry out the necessary transactions and issue the\ncorresponding documents.\n5 Conclusions\nThis paper has described a novel eGovernance model that aims to make public\nadministrations and public institutions open, e\u000ecient and inclusive, providing\nborder-less, digital, personalised and citizen-driven public services. This solution\no\u000bers citizens and businesses e\u000ecient and secure mobile public services and co-\ncreation mechanisms, enabling governments to be extroverted and to preserve\ntrust among public and private entities. The services delivered to citizens con-\ntribute to the digital by default principle for government and local authorities.\nIn addition, our approach enables bene\fciaries to participate and operate in a\nby design e\u000ecient, cost-e\u000bective, secure and cross-border distributed network for\ndata exchange and service delivery.\nThe main contribution of this work is the meaningful integration and orches-\ntration of a set of prominent tools and services, which build on state-of-the-art\ntechnologies from the areas of distributed computing and arti\fcial intelligence,\nto address requirements concerning simpli\fcation of processes and reduction\nof bureaucracy in diverse eGovernment transactions. Our approach has been\nvalidated and elaborated in close co-operation with three government agencies\n(Portuguese Ministry of Justice, Greek Ministry of Digital Governance, and Is-\ntanbul Metropolitan Municipality), through which a series of rich application\nscenarios have been sketched and analyzed. While the feedback received from\nsuch a \frst-level validation was positive, and the proposed solution is open and\ninclusive by design, its application has to carefully consider the information ca-\npacity and available resources of each public sector organisation. Moreover, it\nhas to be evaluated through diverse usefulness and ease-of-use indicators.\nThe proposed approach has interesting research and practical implications.\nWith respect to research, it leverages the existing knowledge in the utilization\nof distributed computing and AI technologies in the public sector, and advances\nthe digital transformation of eGovernment transactions. With respect to prac-\ntice, our solution deploys a novel digital channel of communication and collab-\noration between citizens, businesses and governments. It addresses fundamental\nweaknesses of the existing eGovernment transactions in terms of bureaucracy,\ncomplexity, and unnecessary data entry, while also leveraging existing resources\nand infrastructures. As a last note, we mention that our approach can be applied\nin several real-life scenarios, such as the identi\fcation control in airports, where\npassengers need to be checked before departing and after reaching their desti-\nnation. This application can also incorporate the management of the currently\n\nA decentralized solution for citizen-centric eGovernance 11\nelaborated COVID-19 vaccination certi\fcates [13]; the proposed decentralized\nblockchain ledger enable an immutable and transparent solution, according to\nwhich entries can be publicly audited and anonymity is protected.\nAcknowledgements: This publication has been produced in the context of the\nEU H2020 Project \\GLASS - SinGLe Sign-on eGovernAnce paradigm based on\na distributed \fle exchange network for Security, transparency, cost e\u000bectiveness\nand truSt\", which is co-funded by the European Commission under the Grant\nagreement ID: 959879. This publication re\rects only the authors' views and\nthe Community is not liable for any use that may be made of the information\ncontained therein.\nReferences\n1. Androutsopoulou, A., Karacapilidis, N., Loukis, E., Charalabidis, Y.: Transforming\nthe communication between citizens and government through ai-guided chatbots.\nGovernment Information Quarterly 36(10 2018)\n2. Bertot, J., Jaeger, P., Grimes, J.: Using icts to create a culture of transparency:\nE-government and social media as openness and anti-corruption tools for societies.\nGovernment Information Quarterly 27, 264{271 (07 2010)\n3. Cohen, B.: Incentives build robustness in bittorrent. Workshop on Economics of\nPeertoPeer systems 6(06 2003)\n4. Ding, J., Minhas, U.F., Yu, J., Wang, C., Do, J., Li, Y., Zhang, H., Chandramouli,\nB., Gehrke, J., Kossmann, D., Lomet, D., Kraska, T.: Alex: An updatable adaptive\nlearned index. In: Proceedings of the 2020 ACM SIGMOD International Conference\non Management of Data. p. 969{984. SIGMOD '20, Association for Computing\nMachinery, New York, NY, USA (2020)\n5. Eastep, J., Wingate, D., Agarwal, A.: Smart data structures: An online learning ap-\nproach to multicore data structures. In: Proceedings of the 8th ACM International\nConference on Autonomic Computing, ICAC 2011 and Co-located Workshops. pp.\n11{20 (01 2011)\n6. Ghareeb, A., Ramadan, N., Hefny, H.: E-government adoption: A literature review\nand a proposed citizen-centric model. Electronic Government, an International\nJournal 15, 1 (01 2019)\n7. Harrison, T.M., Sayogo, D.S.: Transparency, participation, and accountability prac-\ntices in open government: A comparative study. Government Information Quarterly\n31(4), 513{525 (2014)\n8. Hevner, A., Chatterjee, S.: Design Research in Information Systems: Theory and\nPractice. Springer Publishing Company, Incorporated, 1st edn. (2010)\n9. Huang, H.S., Chang, T.S., Wu, J.Y.: A secure \fle sharing system based on ipfs and\nblockchain. In: Proceedings of the 2020 2nd International Electronics Communi-\ncation Conference. p. 96{100. IECC 2020, Association for Computing Machinery,\nNew York, NY, USA (2020)\n10. Hulsebos, M., Hu, K., Bakker, M., Zgraggen, E., Satyanarayan, A., Kraska, T.,\nDemiralp, c., Hidalgo, C.: Sherlock: A deep learning approach to semantic data type\ndetection. In: Proceedings of the 25th ACM SIGKDD International Conference on\nKnowledge Discovery and Data Mining. p. 1500{1508. KDD '19, Association for\nComputing Machinery, New York, NY, USA (2019)\n\n12 Domalis et al.\n11. Iivari, J., Venable, J.: Action research and design science research - seemingly\nsimilar but decisively dissimilar. In: ECIS (2009)\n12. Kalogirou, V., Stasis, A., Charalabidis, Y.: Adapting national interoperability\nframeworks beyond eif 3.0: The case of greece. In: Proceedings of the 13th Interna-\ntional Conference on Theory and Practice of Electronic Governance. p. 234{243.\nICEGOV 2020, Association for Computing Machinery, New York, NY, USA (2020)\n13. Ko\rer, N., Baylis, F.: Ten reasons why immunity passports are a bad idea. Nature\n581(7809), 379{381 (2020)\n14. Koundinya, V., Baliga, S.: A review on single sign on as an authentication. System\n7(06) (2020)\n15. Kraska, T., Beutel, A., Chi, E.H., Dean, J., Polyzotis, N.: The case for learned index\nstructures. In: Proceedings of the 2018 International Conference on Management\nof Data. p. 489{504. SIGMOD '18, Association for Computing Machinery, New\nYork, NY, USA (2018)\n16. Li, M., Weng, J., Yang, A., Lu, W., Zhang, Y., Hou, L., Liu, J., Xiang, Y., Deng,\nR.H.: Crowdbc: A blockchain-based decentralized framework for crowdsourcing.\nIEEE Transactions on Parallel and Distributed Systems 30(6), 1251{1266 (2019)\n17. O'Shields, R.: Smart contracts: Legal agreements for the blockchain. North Car-\nolina Banking Institute 21, 177 (2017)\n18. Pe\u000bers, K., Tuunanen, T., Rothenberger, M.A., Chatterjee, S.: A Design Science\nResearch Methodology for Information Systems Research. Journal of Management\nInformation Systems 24(3), 45{77 (2008)\n19. Radford, A., Wu, J., Child, R., Luan, D., Amodei, D., Sutskever, I.: Language\nModels are Unsupervised Multitask Learners (2019), https://openai.com/blog/\nbetter-language-models/\n20. Raval, S.: Decentralized Applications: Harnessing Bitcoin's Blockchain Technology.\nO'Reilly Media, Inc., 1st edn. (2016)\n21. Sari, L., Sipos, M.: Filetribe: Blockchain-based secure \fle sharing on ipfs. In: Eu-\nropean Wireless 2019; 25th European Wireless Conference. pp. 1{6 (2019)\n22. Somani, A., Deka, G.: Big Data Analytics: Tools and Technology for E\u000bective\nPlanning. Routledge, 1st edn. (2017)\n23. Tang, C., Wang, Y., Dong, Z., Hu, G., Wang, Z., Wang, M., Chen, H.: Xindex:\nA scalable learned index for multicore data storage. In: Proceedings of the 25th\nACM SIGPLAN Symposium on Principles and Practice of Parallel Programming.\np. 308{320. PPoPP '20, Association for Computing Machinery, New York, NY,\nUSA (2020)\n24. Terzi, S., Votis, K., Tzovaras, D., Stamelos, I., Cooper, K.: Blockchain 3.0 smart\ncontracts in e-government 3.0 applications (10 2019)\n25. Twizeyimana, J.D., Andersson, A.: The public value of e-government { a literature\nreview. Government Information Quarterly 36(2), 167{178 (2019)\n26. Villa, F., Balbi, S., Athanasiadis, I., Caracciolo, C.: Semantics for interoperabil-\nity of distributed data and models: Foundations for better-connected information.\nF1000Research 6, 686 (2017)\n27. Wang, S., Yuan, Y., Wang, X., Li, J., Qin, R., Wang, F.: An overview of smart\ncontract: Architecture, applications, and future trends. In: 2018 IEEE Intelligent\nVehicles Symposium (IV). pp. 108{113 (2018)\n28. Wimmer, M.A., Viale Pereira, G., Ronzhyn, A., Spitzer, V.: Transforming govern-\nment by leveraging disruptive technologies: Identi\fcation of research and training\nneeds. JeDEM - eJournal of eDemocracy and Open Government 12(1), 87{113\n(Jul 2020)",
  "textLength": 36024
}