{
  "paperId": "90f4d52b94ff7b62e800c283bd292d59dfdd3ab3",
  "title": "Advances in Databases and Information Systems: 24th European Conference, ADBIS 2020, Lyon, France, August 25–27, 2020, Proceedings",
  "pdfPath": "90f4d52b94ff7b62e800c283bd292d59dfdd3ab3.pdf",
  "text": "Lecture Notes in Computer Science 12245\nFounding Editors\nGerhard Goos\nKarlsruhe Institute of Technology, Karlsruhe, Germany\nJuris Hartmanis\nCornell University, Ithaca, NY, USA\nEditorial Board Members\nElisa Bertino\nPurdue University, West Lafayette, IN, USA\nWen Gao\nPeking University, Beijing, China\nBernhard Steffen\nTU Dortmund University, Dortmund, Germany\nGerhard Woeginger\nRWTH Aachen, Aachen, Germany\nMoti Yung\nColumbia University, New York, NY, USA\n\nMore information about this series at http://www.springer.com/series/7409\n\nJérôme Darmont Boris Novikov \nRobert Wrembel (Eds.)\nAdvances in Databases\nand Information Systems\n24th European Conference, ADBIS 2020\nLyon, France, August 25 –27, 2020\nProceedings\n123\n\nEditors\nJérôme Darmont\nERIC (Research Unit 3083)\nUniversit éLumi ère Lyon 2\nLyon, FranceBoris Novikov\nNational Research University, Higher\nSchool of Economics\nSt. Petersburg, Russia\nRobert Wrembel\nPoznan University of Technology\nPozna ń, Poland\nISSN 0302-9743 ISSN 1611-3349 (electronic)\nLecture Notes in Computer ScienceISBN 978-3-030-54831-5 ISBN 978-3-030-54832-2 (eBook)\nhttps://doi.org/10.1007/978-3-030-54832-2\nLNCS Sublibrary: SL3 –Information Systems and Applications, incl. Internet/Web, and HCI\n©Springer Nature Switzerland AG 2020, corrected publication 2020\nChapter “An Ef ﬁcient Index for Reachability Queries in Public Transport Networks ”is licensed under the\nterms of the Creative Commons Attribution 4.0 International License ( http://creativecommons.org/licenses/\nby/4.0/ ). For further details see license information in the chapter.\nThis work is subject to copyright. All rights are reserved by the Publisher, whether the whole or part of thematerial is concerned, speci ﬁcally the rights of translation, reprinting, reuse of illustrations, recitation,\nbroadcasting, reproduction on micro ﬁlms or in any other physical way, and transmission or information\nstorage and retrieval, electronic adaptation, computer software, or by similar or dissimilar methodology nowknown or hereafter developed.The use of general descriptive names, registered names, trademarks, service marks, etc. in this publication\ndoes not imply, even in the absence of a speci ﬁc statement, that such names are exempt from the relevant\nprotective laws and regulations and therefore free for general use.The publisher, the authors and the editors are safe to assume that the advice and information in this book arebelieved to be true and accurate at the date of publication. Neither the publisher nor the authors or the editorsgive a warranty, expressed or implied, with respect to the material contained herein or for any errors oromissions that may have been made. The publisher remains neutral with regard to jurisdictional claims in\npublished maps and institutional af ﬁliations.\nThis Springer imprint is published by the registered company Springer Nature Switzerland AG\nThe registered company address is: Gewerbestrasse 11, 6330 Cham, Switzerland\n\nObituary\nIn Memoriam: Sherif Sakr\nSherif Sakr was a rising star in the constellation of database researchers. After\nobtaining a BSc and MSc degrees in Computer Science from the Faculty of Computersand Information at Cairo University in 2001 and 2003, respectively, he joined the ranksof the Computer and Information Science of Konstanz University, where he obtained adoctorate in 2007 for his research on XQuery Processing on top of relational databases.\nHe then joined NICTA Research Centre (now CSIRO Data61 Lab) and University of\nNew South Wales, where he developed a research agenda in the ﬁeld of graph indexing\nand querying.\nFollowing these appointments, he joined the ranks of the Department of Health\nInformatics at King Saud bin Abdulaziz University for Health Sciences (KSAU-HS),Saudi Arabia, where he pursued various applications of graph processing and big datatechnologies in the medical ﬁeld. Along the way, he held visiting researcher and\nscholar appointments at Microsoft Research, Redmond, USA (2011), Nokia Bell Labs,\nIreland –Formerly Alcatel-Lucent Bell Labs (2012), Humboldt-Universit ät zu Berlin,\nGermany (2015), University of Zurich, Switzerland (2016), and Technical Universityof Dresden, Germany (2016). This infatigable research journey led him to write theHandbook of Big Data Technologies (2017) and later the Encyclopedia of Big Data\nTechnologies (2019), which will remain as one of his most notable legacies to the ﬁeld\nof database research.\nIn 2018, Sherif joined University of Tartu ’s Institute of Computer Science in 2018\nfunded by a Top Researcher grant from the Estonian Research Council. During his\ntwo-years tenure, he created and led a Data Systems Research Group, which he grew\nfrom 1 to 16 researchers and research students in less than 24 months. During this time,he developed and spread his vision. He imagined a highly scalable engine for dis-tributed event processing. His efforts immediately produced notable results: at CAiSE2019 his work on stream analytics earned a Best Paper Award. Sherif was a tirelessresearcher. In fact, he started in parallel a research stream on explainable machinelearning. At ADBIS 2019, he presented a hybrid local-global approach for generatingexplanations from black-box machine learning models.\nSherif Sakr will be remembered for generously giving his time to his community.\nDuring his career, Prof. Sakr was associate editor of the Cluster Computing journal and\nTransactions on Large-Scale Data and Knowledge-Centered Systems (TLDKS). He\nserved as an editorial board member and guest editor for several reputable top-rankedscienti ﬁc journals. He toured the world as a distinguished speaker of both the ACM and\nthe IEEE Computer Society. Prof. Sakr published more than 150 refereed research\n\npublications in international journals and conferences. He was also author of six books,\nincluding Big Data 2.0 Processing Systems (2016). His research received more than\n4,000 citations1. In 2019, he received the Best Arab Scholar Award from the Abdul\nHammed Shoman Foundation.\nAbove and beyond all of the above, Sherif Sakr was a good person. The kind of\nperson one would like to meet both personally and professionally. He cared thateveryone felt comfortable and approached life with enthusiasm. He forged a groupupon his values: hard work, intellectual honesty, and mutual support. His colleagueswill remember Sherif as a passionate and visionary scientist, and someone who hadtime for everyone, devoting much time to ensuring that his students were aiming highand pushing them to maximize their potential.\nSherif Sakr was due to organize the ADBIS conference in Tartu in 2021. Unfor-\ntunately, he passed away during the night on March 24, 2020. His team will take over\nhis mission to host ADBIS 2021.\nJune 2020 Marlon Dumas\nRiccardo Tommasini\n1cf. Google Scholar 2020.vi Obituary\n\nPreface\nThe 24th European Conference on Advances in Databases and Information Systems\n(ADBIS 2020) was set to be held in Lyon, France, during August 25 –28, 2020, in\nconjunction with the 24th International Conference on Theory and Practice of Digital\nLibraries (TPDL 2020) and the 16th EDA days on Business Intelligence & Big Data(EDA 2020). However, because of the worldwide COVID-19 crisis, ADBIS, TPDL,and EDA had to take place online during August 25 –27, 2020. Yet, the three con-\nferences joined their forces to propose common keynotes, workshops, and a DoctoralConsortium.\nADBIS established itself as a highly recognized conference in Europe. It aims at\nproviding an international forum for exchanging research achievements on databases\nand data engineering, both from practical and theoretical perspectives. ADBIS also\naims at promoting the interaction and collaboration of the database and data engi-neering as well as information systems research communities worldwide.\nPrevious ADBIS conferences were held in Saint Petersburg (1997), Poznan (1998),\nMaribor (1999), Prague (2000), Vilnius (2001), Bratislava (2002), Dresden (2003),Budapest (2004), Tallinn (2005), Thessaloniki (2006), Varna (2007), Pori (2008), Riga(2009), Novi Sad (2010), Vienna (2011), Poznan (2012), Genoa (2013), Ohrid (2014),Poitiers (2015), Prague (2016), Nicosia (2017), Budapest (2018), and Bled (2019).\nADBIS 2020 attracted 82 paper submissions, which were reviewed by an Interna-\ntional Program Committee constituted of members from 28 countries. The ProgramCommittee selected 13 long research papers for inclusion in this volume (acceptancerate: 16%). The selected papers span a wide spectrum of topics related to the ADBISconference from different areas of research in database and information systems,including big data and social media analysis, business intelligence, and machinelearning.\nThis volume also includes extended abstracts of the three keynotes that related most\nto ADBIS ’topics, which were given by Amr El Abbadi, from the University of\nCalifornia (USA), Johann Gamper, from the Free University of Bozen-Bolzano (Italy),and Ioana Manolescu from Inria Saclay –Ȋle-de-France and École Polytechnique\n(France).\nFinally, we would like to express our sincere gratitude to everyone who contributed\nto make ADBIS 2020 a successful event:\n–authors, for submitting their research papers to the conference;\n–keynote speakers who honored us with their talks at ADBIS 2020;\n–members of the Program Committee and external reviewers, for dedicating their\ntime and expertise to build a high-quality program;\n–members of the ADBIS Steering Committee for their trust and support, and espe-\ncially its chair Yannis Manolopoulos;\n–our academic and private sponsors and partners: the Universities of Lyon 2 and\nLyon 3, IDEXLYON, the ERIC laboratory, OnlyLyon, Springer for publishing\n\nthese proceedings, the Coalition for Networked Information, as well as our PCO\nInsight Outside;\n–last but not least, all members of the Organizing Committee, who had to switch\nfrom a physical organization to an online organization in troubled times.\nJune 2020 J érôme Darmont\nBoris Novikov\nRobert Wrembelviii Preface\n\nOrganization\nGeneral Chair\nJérôme Darmont Universit éLyon 2, France\nSteering Committee Chair\nYannis Manolopoulos Open University of Cyprus, Cyprus\nSteering Committee\nLadjel Bellatreche ENSMA Poitiers, France\nAndras Benczur E ötvös Lor ánd University, Hungary\nMaria Bielikova Slovak University of Technology in Bratislava,\nSlovakia\nBarbara Catania University of Genoa, Italy\nJérôme Darmont Universit éLyon 2, France\nJohann Eder Alpen Adria Universit ät Klagenfurt, Austria\nTheo Haerder Technical University Kaiserslautern, GermanyMirjana Ivanovi ć University of Novi Sad, Serbia\nHannu Jaakkola Tampere University of Technology, FinlandMarite Kirikova Riga Technical University, LatviaRainer Manthey University of Bonn, Germany\nManuk Manukyan Yerevan State University, Armenia\nTadeusz Morzy Poznan University of Technology, PolandBoris Novikov National Research University, Higher School\nof Economics in Saint Petersburg, Russia\nGeorge Papadopoulos University of Cyprus, CyprusJaroslav Pokorn ý Charles University in Prague, Czech Republic\nBoris Rachev Technical University of Varna, BulgariaSherif Sakr University of Tartu, Estonia\nBernhard Thalheim Christian Albrechts University, Germany\nGoce Trajcevski Iowa State University, USAValentino Vrani ć Slovak University of Technology in Bratislava,\nSlovakia\nTatjana Welzer University of Maribor, SloveniaRobert Wrembel Poznan University of Technology, PolandEster Zumpano University of Calabria, Italy\n\nProgram Committee Chairs\nBoris Novikov National Research University, Higher School\nof Economics in Saint Petersburg, Russia\nRobert Wrembel Poznan University of Technology, Poland\nProgram Committee\nAlberto Abell ó Universitat Polit ècnica de Catalunya, Spain\nBernd Amann Sorbonne Universit é, France\nAndreas Behrend University of Bonn, Germany\nLadjel Bellatreche ENSMA Poitiers, FranceAndr ás Bencz úrE ötvös Lor ánd University, Hungary\nFadila Bentayeb Universit éLyon 2, France\nMaria Bielikova Slovak University of Technology in Bratislava,\nSlovakia\nSandro Bimonte IRSTEA Clermont-Ferrand, FranceMiklos Biro Software Competence Center Hagenberg, Austria\nPawel Boi ński Poznan University of Technology, Poland\nOmar Boussaid Universit éLyon 2, France\nDrazen Brdjanin University of Banja Luka, SerbiaAlbertas Caplinskas Vilnius University, LithuaniaBarbara Catania University of Genoa, ItalyTania Cerquitelli Politecnico di Torino, ItalyAjantha Dahanayake Lappeenranta University of Technology, FinlandJérôme Darmont Universit éLyon 2, France\nChristos Doulkeridis University of Piraeus, Greece\nJohann Eder Alpen Adria Universit ät Klagenfurt, Austria\nMarkus Endres University of Passau, GermanyWerner Esswein Technische Universit ät Dresden, Germany\nGeorgios Evangelidis University of Macedonia, GreeceFlavio Ferrarotti Software Competence Centre Hagenberg, AustriaFlavius Frasincar Erasmus University Rotterdam, The NetherlandsJohann Gamper Free University of Bozen-Bolzano, Italy\nMatteo Golfarelli University of Bologna, Italy\nMarcin Gorawski Silesian University of Technology, PolandJānis Grabis Riga Technical University, Latvia\nLe Gruenwald The University of Oklahoma, USAFrancesco Guerra Universit àdi Modena e Reggio Emilia, Italy\nGiancarlo Guizzardi Federal University of Espirito Santo, BrazilHele-Mai Haav Tallinn University of Technology, EstoniaTomas Horvath E ötvös Lor ánd University, Hungary\nTheo H ärder Technical University Kaiserslautern, Germany\nMarko H ölbl University of Maribor, Slovenia\nMirjana Ivanovi ć University of Novi Sad, Serbia\nHannu Jaakkola University of Tampere, Finlandx Organization\n\nStefan Jablonski University of Bayreuth, Germany\nAida Kami šalićLatiﬁć Universtiy of Maribor, Slovenia\nDimitris Karagiannis University of Vienna, AustriaZoubida Kedad University of Versailles, FranceAttila Kiss E ötvös Lor ánd University, Hungary\nMichal Kr átký Technical University of Ostrava, Czech Republic\nJulius K öpke Alpen Adria Universit ät Klagenfurt, Austria\nDejan Lavbi č University of Ljubljana, Slovenia\nWolfgang Lehner Technical University Dresden, GermanyDaniel Lemire Universit édu Qu ébecàMontr éal, Canada\nSebastian Link The University of Auckland, New ZealandYurii Litvinov Saint Petersburg State University, RussiaFederica Mandreoli University of Modena, Italy\nYannis Manolopoulos Open University of Cyprus, Cyprus\nManuk Manukyan Yerevan State University, ArmeniaPatrick Marcel Universit éde Tours, France\nBálint Moln árE ötvös University of Budapest, Hungary\nAngelo Montanari University of Udine, ItalyTadeusz Morzy Poznan University of Technology, PolandMartin Ne časký Charles University, Czech Republic\nBoris Novikov National Research University, Higher School\nof Economics in Saint Petersburg, Russia\nKjetil N ørvåg Norwegian University of Science and Technology,\nNorway\nAndreas Oberweis Karlsruhe Institute of Technology, GermanyCarlos Ordonez University of Houston, USAGeorge Papadopoulos University of Cyprus, CyprusAndr ás Pataricza Budapest University of Technology and Economics,\nHungary\nJaroslav Pokorn ý Charles University in Prague, Czech Republic\nGiuseppe Polese University of Salerno, ItalyAlvaro E. Prieto University of Extremadura, SpainMilo šRadovanovi ć University of Novi Sad, Serbia\nHeri Ramampiaro Norwegian University of Science and Technology,\nNorway\nFranck Ravat Universit éde Toulouse, France\nStefano Rizzi University of Bologna, Italy\nOscar Romero Universitat Polit ècnica de Catalunya, Spain\nGunter Saake University of Magdeburg, GermanyKai-Uwe Sattler Technical University Ilmenau, GermanyMilos Savic University of Novi Sad, SerbiaPatrick Sch äfer Humboldt Universit ät zu Berlin, Germany\nTimos Sellis Swinburne University of Technology, AustraliaBela Stantic Grif ﬁth University, Australia\nKostas Stefanidis University of Tampere, Finland\nSergey Stupnikov Russian Academy of Sciences, RussiaOrganization xi\n\nOlivier Teste Universit éde Toulouse, France\nBernhard Thalheim Christian Albrechts University Kiel, GermanyGoce Trajcevski Iowa State University, USARaquel Trillo-Lado Universidad de Zaragoza, SpainOlegas Vasilecas Vilnius Gediminas Technical University, Lithuania\nGoran Velinov UKIM, North Macedonia\nIsabelle Wattiau ESSEC, CNAM, FranceTatjana Welzer University of Maribor, SloveniaMarek Wojciechowski Poznan University of Technology, PolandRobert Wrembel Poznan University of Technology, PolandAnna Yarygina Saint Petersburg State University, RussiaVladimir Zadorozhny University of Pittsburgh, USAJaroslav Zendulka Brno University of Technology, Czech Republic\nAdditional Reviewers\nAndrea BrunelloAlexandre ChansonStefano CirilloVincenzo DeufemiaSenén Gonz ález\nAnna GorawskaSergio Ilarri\nIgor Kuralenok\nPetar JovanovicNicolas Labroche\nChristos MettourisSergi NadalDemetris PaschalidesOszk ár Semer áth\nJakub Ševcech\nArtem Tro ﬁmov\nWilleme Verdeaux\nAlexandros Yeratziotis\nProceeding Chairs\nFadila Bentayeb Universit éLyon 2, France\nElöd Egyed-Zsigmond INSA Lyon, France\nNadia Kabachi Universit éLyon 1, France\nWorkshop Chairs\nLadjel Bellatreche ENSMA Poitiers, France\nMária Bielikov á Slovak University of Technology, Slovakia\nChristos Papatheodorou Ionian University, Greece\nGuilaine Talens Universit éLyon 3, France\nDoctoral Consortium Chairs\nBarbara Catania University of Genoa, Italy\nElena Demidova L3S Research Center, GermanyOscar Romero Universitat Polit ècnica de Catalunya, Spain\nMaja Zumer University of Ljubljana, Sloveniaxii Organization\n\nJournal Special Issue Chair\nLadjel Bellatreche ENSMA Poitiers, France\nPublicity Chair\nSelma Khouri ESI Alger, Algeria\nOrganizing Committee\nFadila Bentayeb Universit éLyon 2, France\nOmar Boussa ïd Universit éLyon 2, France\nJérôme Darmont Universit éLyon 2, France\nFabien Duchateau Universit éLyon 1, France\nElöd Egyed-Zsigmond INSA Lyon, France\nMihaela Juganaru-Mathieu École des Mines de Saint- Étienne, France\nNadia Kabachi Universit éLyon 1, France\nOmar Larouk ENSSIB Lyon, FranceFabrice Muhlenbach Universit éde Saint- Étienne, France\nHabiba Osman Universit éLyon 2, France\nMuriel Perez Universit éde Saint- Étienne, France\nPegdwend éSawadogo Universit éLyon 2, France\nGuilaine Talens Universit éLyon 3, France\nCaroline Wintergerst Universit éLyon 3, FranceOrganization xiii\n\nKeynote Speakers ’Bios\nThe 24th European Conference on Advances in Databases and Information Systems\n(ADBIS 2020), the 24th International Conference on Theory and Practice of Digital\nLibraries (TPDL 2020), and the 16th EDA days on Business Intelligence & Big Data\n(EDA 2020) were “colocated ”online during August 25 –27, 2020, because of the\nCOVID-19 crisis. This joint event was set to be held originally in Lyon, France.\nKeynotes were common to all three conferences. This chapter introduces the ﬁve\nkeynote speakers of high scienti ﬁc proﬁle who honored us with an invited speech. We\nthank them very much. Extended abstracts of keynotes by: Amr El Abbadi, JohannGamper, and Ioana Manolescu are included in this LNCS volume. Extended abstractsof keynotes by Ver ónika Peralta and Elaine Toms are included in the EDA and TPDL\nproceedings, respectively.\nAmr El Abbadi (University of California, USA)Amr El Abbadi is a Professor of Computer Science at the University of California,\nSanta Barbara. He received his Bachelor in Engineering from Alexandria University,Egypt, and his PhD from Cornell University. His research interests are in the ﬁelds of\nfault-tolerant distributed systems and databases, focusing recently on Cloud datamanagement and blockchain-based systems.\nProf. El Abbadi is an ACM Fellow, AAAS Fellow, and IEEE Fellow. He was Chair\nof the Computer Science Department at UCSB from 2007 to 2011. He has served as a\njournal editor for several database journals, including The VLDB Journal andIEEE\nTransactions on Computers and The Computer Journal. He has been Program Chair\nfor multiple database and distributed systems conferences. He currently serves on theExecutive Committee of the IEEE Technical Committee on Data Engineering (TCDE)and was a board member of the VLDB Endowment from 2002 to 2008.\nIn 2007, Prof. El Abbadi received the UCSB Senate Outstanding Mentorship Award\nfor his excellence in mentoring graduate students. In 2013, his student, Sudipto Das\nreceived the SIGMOD Jim Gray Doctoral Dissertation Award. Prof. El Abbadi is also a\nco-recipient of the Test of Time Award at EDBT/ICDT 2015. He has published over300 articles in databases and distributed systems and has supervised over 35 PhDstudents.\nJohann Gamper (Free University of Bozen-Bolzano, Italy)Professor Johann Gamper ’s main research areas are temporal databases, time series\ndata, data warehousing and data analytics, approximate query answering, datasummarization, and graph matching. His research concentrates on database technolo-\ngies with a focus on processing and querying temporal data.\nJohann Gamper is author of 120+ publications in international journals and\nconference proceedings, many of which are in the most prestigious outlets of database\n\nsystems (TODS, VLDBJ, TKDE, SIGMOD, VLDB, ICDE). He regularly serves as\nreviewer for technical journals, PC member, and organizer of conferences.\nIoana Manolescu (Inria Saclay –Ȋle-de-France et École Polytechnique, France)\nDoctor Ioana Manolescu is a Senior Researcher who leads of the INRIA/LIX CEDAR\nproject-team, focused on Rich Data Exploration at Cloud Scale. She is also part-timeprofessor at École Polytechnique, Paris.\nHer research interests include models, tools, and algorithms for data journalism and\njournalistic fact-checking; ef ﬁcient ontology-mediated query answering; and\ncloud-based management of web data.\nIoana Manolescu is also member of the PVLDB Endowment Board of Trustees.\nVerónika Peralta (University of Tours, France)\nVerónika Peralta is Associate Professor at the University of Tours, France, and a\nmember of the Fundamental and Applied Computer Science Laboratory (LIFAT), since2008. She received her PhD in Computer Science from the University of Versailles andthe University of the Republic of Uruguay in 2006. Her research interests include dataquality, data warehousing, exploratory analysis, OLAP, query recommendation, and\nquery personalization.\nHer teaching mainly concerns databases, data warehousing, and information\nsystems. She has taught multiple courses since 1996, in several universities of France,Uruguay, and Argentina. She has also several years of professional experience as a datawarehouse developer and consultant.\nElaine Toms (University of Shef ﬁeld, UK)\nElaine Toms is currently Professor of Information Innovation Management, Manage-\nment School, University of Shef ﬁeld, UK. She previously held posts at the iSchool,\nUniversity of Shef ﬁeld; the Faculty of Management and School of Information Studies,\nDalhousie University, Canada; and the Faculty of Information, University of Toronto,Canada. She was the ﬁrst information scientist to be appointed to a Canada Research\nChair.\nOver the course of her career, she has held multiple administration roles (e.g.,\nDirector of Teaching Quality Enhancement and of Research); been actively engaged inprofessional associations including ASIST (serving on the Board of Directors); hasserved as program chair for multiple conferences (e.g., ASIST, Hypertext, and JCDL);\nand currently serves on the editorial board of IPM and is an associate editor of JASIST.\nShe completed her PhD at Western University, Canada, from which she went on to\nexamine multiple facets of the information interaction problem from interface issues tointerruptions and task, with a particular focus on evaluation. Her work has been fundedby multiple groups on both sides of the pond (e.g., both the science and social scienceresearch councils in Canada, OCLC, Heritage Canada, Canada Foundation forInnovation, Horizon 2020).xvi Keynote Speakers ’Bios\n\nShe has been an investigator with multiple research networks (e.g., NECTAR,\nNetwork for Effective Collaboration Through Advanced Research; PROMISE, Partic-ipative Research labOratory for Multimedia and Multilingual Information SystemsEvaluation).Keynote Speakers ’Bios xvii\n\nContents\nKeynote Extended Abstracts\nBlockchains and Databases: Opportunities and Challenges\nfor the Permissioned and the Permissionless . . . . . . . . . . . . . . . . . . . . . . . . 3\nDivyakant Agrawal, Amr El Abbadi, Mohammad Javad Amiri,Sujaya Maiyya, and Victor Zakhary\nProcessing Temporal and Time Series Data: Present State\nand Future Challenges . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 8\nJohann Gamper and Anton Dign ös\nIntegrating (Very) Heterogeneous Data Sources:\nA Structured and an Unstructured Perspective. . . . . . . . . . . . . . . . . . . . . . . 15\nIoana Manolescu\nData Access and Database Performance\nUpper Bound on the Size of FP-Tree. . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23\nNima Shahbazi and Jarek Gryz\nAn Efficient Index for Reachability Queries in Public Transport Networks . . . 34\nBezaye Tesfaye, Nikolaus Augsten, Mateusz Pawlik, Michael H. B öhlen,\nand Christian S. Jensen\nContext-Free Path Querying by Kronecker Product . . . . . . . . . . . . . . . . . . . 49\nEgor Orachev, Ilya Epelbaum, Rustam Azimov, and Semyon Grigorev\nPattern Sampling in Distributed Databases . . . . . . . . . . . . . . . . . . . . . . . . . 60\nLamine Diop, Cheikh Talibouya Diop, Arnaud Giacometti,and Arnaud Soulet\nCan We Probabilistically Generate Uniformly Distributed Relation\nInstances Efficiently?. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 75\nJoachim Biskup and Marcel Preu ß\nMachine Learning\nTowards Proximity Graph Auto-configuration: An Approach\nBased on Meta-learning . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 93\nRafael Seidi Oyamada, Larissa C. Shimomura, Sylvio Barbon Junior,and Daniel S. Kaster\n\nFake News Detection Based on Subjective Opinions . . . . . . . . . . . . . . . . . . 108\nDanchen Zhang and Vladimir I. Zadorozhny\nImproving on Coalitional Prediction Explanation. . . . . . . . . . . . . . . . . . . . . 122\nGabriel Ferrettini, Julien Aligon, and Chantal Soul é-Dupuy\nData Processing\nJSON Functionally . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 139\nJaroslav Pokorn ý\nSemantic Web\nTemplate-Based Multi-solution Approach for Data-to-Text Generation . . . . . . 157\nAbelardo Vieira Mota, Ticiana Linhares Coelho da Silva,\nand Jos éAntônio Fernandes de Mac êdo\nDistributed Tree-Pattern Matching in Big Data Analytics Systems . . . . . . . . . 171\nRalf Diestelk ämper and Melanie Herschel\nData Analytics\nIterations for Propensity Score Matching in MonetDB . . . . . . . . . . . . . . . . . 189\nMichael H. B öhlen, Oksana Dolmatova, Michael Krauthammer,\nAlphonse Mariyagnanaseelan, Jonathan Stahl, and Timo Surbeck\nThe Tell-Tale Cube . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 204\nAntoine Ch édin, Matteo Francia, Patrick Marcel, Ver ónika Peralta,\nand Stefano Rizzi\nCorrection to: An Efficient Index for Reachability Queries\nin Public Transport Networks . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . C1\nBezaye Tesfaye, Nikolaus Augsten, Mateusz Pawlik,Michael H. B öhlen, and Christian S. Jensen\nAuthor Index ............................................ 2 1 9xx Contents",
  "textLength": 27238
}