{
  "paperId": "a8f23aae569e45d5f5df3ee225a3231d5999e145",
  "title": "PCF Learned Sort: a Learning Augmented Sort Algorithm with O(n log log n) Expected Complexity",
  "pdfPath": "a8f23aae569e45d5f5df3ee225a3231d5999e145.pdf",
  "text": "Published in Transactions on Machine Learning Research (10/2025)\nPCF Learned Sort: a Learning Augmented Sort Algorithm\nwithO(nlog logn)Expected Complexity\nAtsuki Sato a_sato@hal.t.u-tokyo.ac.jp\nGraduate School of Information Science and Technology\nThe University of Tokyo\nYusuke Matsuimatsui@hal.t.u-tokyo.ac.jp\nGraduate School of Information Science and Technology\nThe University of Tokyo\nReviewed on OpenReview:https: // openreview. net/ forum? id= wVkb8WHbvR\nAbstract\nSorting is one of the most fundamental algorithms in computer science. Recently, Learned\nSorts, which use machine learning to improve sorting speed, have attracted attention. While\nexistingstudiesshowthatLearnedSortisempiricallyfasterthanclassicalsortingalgorithms,\nthey do not provide theoretical guarantees about its computational complexity. We propose\nPiecewise Constant Function (PCF) Learned Sort, a theoretically guaranteed Learned Sort\nalgorithm. We prove that the expected complexity of PCF Learned Sort isO(nlog logn)\nunder mild assumptions on the data distribution. We also confirm empirically that PCF\nLearned Sort has a computational complexity ofO(nlog logn)on both synthetic and real\ndatasets. This is the first study to theoretically support the empirical success of Learned\nSort, and provides evidence for why Learned Sort is fast.\n1 Introduction\nSorting is one of the most fundamental algorithms in computer science and has been extensively studied for\nmanyyears. Recently, anovelsortingmethodcalledLearnedSorthasbeenproposed(Kraskaetal.,2019). In\nLearned Sort, a machine learning model is trained to estimate the distribution of elements in the input array,\nspecifically, the cumulative distribution function (CDF). The model’s predictions are then used to rearrange\nthe elements, followed by a minor refinement step to complete the sorting process. Empirical results show\nthat Learned Sort is faster than classical sorting algorithms, including highly optimized counting-based\nsorting algorithms, comparison sorting algorithms, and hybrid sorting algorithms.\nOn the other hand, there are few theoretical guarantees regarding the computational complexity of Learned\nSort. The first proposed Learned Sort algorithm (Kraska et al., 2019) has a best-case complexity ofO(n), but\nits expected or worst-case complexity is not discussed. The more efficient Learned Sort algorithms proposed\nlater (Kristo et al., 2020; 2021a) also haveO(n)best-case complexity, butO(n2)worst-case complexity (or\nO(nlogn)with some modifications). The goal of this paper is to develop a Learned Sort that is theoretically\nguaranteed to be computationally efficient.\nWe propose Piecewise Constant Function (PCF) Learned Sort, which can sort with an expected complexity\nO(nlog logn)under mild assumptions on the data distribution. In addition, we show that PCF Learned Sort\nadmits a worst-case complexity guarantee that depends on the choice of the internal sorting algorithm. For\ninstance, if MergeSort—whose worst-case complexity isO(nlogn)—is used, then the worst-case complexity\nof PCF Learned Sort isO(nlogn). If we instead use the algorithm by Han (2020), which has a worst-case\ncomplexity ofO(n√logn), then the worst-case complexity of PCF Learned Sort becomesO(n√logn). We\nthen empirically confirm that our Learned Sort can sort with a complexity ofO(nlog logn)on both synthetic\nand real datasets.\n1arXiv:2405.07122v3  [cs.DS]  10 Nov 2025\n\nPublished in Transactions on Machine Learning Research (10/2025)\nIndependently and concurrently, Zeighami & Shahabi (2024) explored complexity-guaranteed Learned Sort.\nWhile our PCF Learned Sort is motivated by similar principles and incorporates comparable design choices,\nseveral key distinctions exist between our approach and theirs. A comprehensive comparison between our\nmethod and that of Zeighami & Shahabi (2024) is provided in Section 5.\nThis paper is organized as follows. Section 2 reviews related literature. Section 3 introduces PCF Learned\nSort and provides complexity theorems with proof sketches. Section 4 provides empirical validation of the\ntheoretical results. We discuss implications and limitations in Section 5, and conclude in Section 6.\n2 Related Work\nOur research is in the context of algorithms with machine learning (Section 2.1). There are two types of\nsorting algorithms, comparison sorts (Section 2.2) and non-comparison sorts (Section 2.3), and our proposed\nmethodisanon-comparisonsort. However, theidea, implementation, andproofofcomputationalcomplexity\nof our method are similar to those of sample sort, which is a type of comparison sort. Furthermore, our\nproposedalgorithmandproofofcomputationalcomplexityarebasedonthoseofLearnedIndex(Section2.4).\n2.1 Algorithms with Machine Learning\nOur work lies in the emerging area of Learned Sort, where machine learning models accelerate sorting. The\nfirst approach by Kraska et al. (2019) trained a model ˜F(q)to approximate the CDFF(q)and placed\neach element at positionn ˜F(x), and then applies insertion sort to complete the ordering. While this yields\nO(n)in favorable cases, the insertion-based refinement causes aO(n2)worst case. Later implementations\nimproved cache efficiency (Kristo et al., 2020), robustness to duplicates (Kristo et al., 2021a), and even\nintroduced cache-friendly CDF models tailored for sorting (Ferragina & Odorisio, 2025), but still relied on\ninsertion sort and thus retained a quadratic worst-case complexity. Using stronger fallback algorithms such\nas Introsort (Musser, 1997) or TimSort (McIlroy, 1993) reduces this toO(nlogn), though this only matches\nclassical comparison-based sorts and does not fully explain the empirical advantage of Learned Sort.\nParallelization has also been explored: Carvalho (2022) proposed IPLS, integrating learned partitioning into\nIPS4o (Axtmann et al., 2017), and Carvalho & Lawrence (2023) framed LearnedSort as a sample sort with a\nparallel IPS4o implementation. These studies primarily highlight the engineering potential of learned sorting\nin parallel settings, which is complementary but orthogonal to our focus on providing theoretical guarantees\nfor the sequential case.\nIn a broader context, Li et al. (2020) showed that neural programs can achieve strong generalization and\nreplicate efficient algorithmic behaviors such as sorting, demonstrating that machine learning can recover\nalgorithmic complexity classes likeO(nlogn)without explicit manual design. This provides a useful per-\nspective on the generalizability of learned algorithms.\nRelated to this, the field ofalgorithms with predictionsstudies how machine learning predictions accelerate\nclassical algorithms (Mitzenmacher & Vassilvitskii, 2022), with applications in caching (Narayanan et al.,\n2018;Rohatgi,2020;Lykouris&Vassilvitskii,2021;Imetal.,2022), skirental(Purohitetal.,2018;Gollapudi\n& Panigrahi, 2019; Shin et al., 2023), scheduling (Gollapudi & Panigrahi, 2019; Lattanzi et al., 2020; Lassota\net al., 2023), and matching (Antoniadis et al., 2023; Dinitz et al., 2021; Sakaue & Oki, 2022). Sorting with\npredictions has also been analyzed (Lu et al., 2021; Chan et al., 2023; Erlebach et al., 2023), including\ntight guarantees by Bai & Coester (2023). In the context of algorithms with predictions, machine learning\npredictions are typically assumed to be available at no cost, and the models are treated as an opaque box.\nThis exclusion contrasts with our problem setting, where we ensure that the computational complexity covers\nthe entire process from receiving an unsorted array to returning a sorted array.\n2.2 Comparison Sorts\nSorting algorithms that use comparisons between keys and require no other information about the keys\nare called comparison sorts. It is well-known that the worst-case complexity of a comparison sort is at\nleastΩ(nlogn). Commonly used comparison sorting algorithms include QuickSort, heap sort, merge sort,\n2\n\nPublished in Transactions on Machine Learning Research (10/2025)\nand insertion sort. The GNU Standard Template Library in C++ uses Introsort (Musser, 1997), an algo-\nrithm that combines QuickSort, heap sort, and insertion sort. Java (Java, 2023) and Python up to version\n3.10 (Peters, 2002) use TimSort (McIlroy, 1993), an improved version of merge sort. Python 3.11 and later\nuse Powersort (Munro & Wild, 2018), a merge sort that determines a near-optimal merge order.\nSample sort (Frazer & McKellar, 1970) extends QuickSort by using multiple pivots instead of one. Sample\nsort samples a small number of keys from the array, determines multiple pivots, and uses them to parti-\ntion the array into multiple buckets. The partitioning is repeated recursively until the array is sufficiently\nsmall. Among its implementations, the in-place parallel superscalar sample sort (Axtmann et al., 2017) was\nintroduced as a highly efficient parallel algorithm, and later engineering refinements further improved its\nperformance (Axtmann et al., 2022). Its computational and cache efficiency is theoretically guaranteed by a\ntheorem about the probability that the pivots partition the array (nearly) equally.\n2.3 Non-Comparison Sorts\nNon-comparison sorts use information other than key comparison. Radix sort and counting sort are the\nmost common types of non-comparison sorts. Radix sort uses counting sort as a subroutine for each digit.\nWhen the number of digits in the array element isw, the computational complexity of radix sort isO(wn).\nThus, radix sort is particularly effective when the number of digits is small. There are several variants of\nradix sort, such as Spreadsort (Ross, 2002), which integrates the advantages of comparison sort into radix\nsort and is implemented in the Boost C++ Libraries, and RegionSort (Obeya et al., 2019), which enables\nefficient parallelization by modeling and resolving dependencies among the element swaps.\nIn addition, non-comparison sorting algorithms tailored for specific data types have been developed. For\ninteger arrays, a deterministic algorithm with worst-case complexity ofO(nlog logn)(Han, 2002) and a ran-\ndomized algorithm with expected complexity ofO(n√log logn)(Han & Thorup, 2002) have been proposed.\nFor real-valued arrays, recent advances have led to the development of a sorting algorithm with a worst-case\ncomplexity ofO(n√logn)(Han, 2020). Our PCF Learned Sort also targets real-valued arrays and, under\nmild assumptions on the distribution, achieves an expected complexity ofO(nlog logn). Moreover, when\nthe algorithm of Han (2020) is used as the internal sorting component, PCF Learned Sort has a worst-case\ncomplexity ofO(n√logn), which matches that of Han (2020).\n2.4 Learned Index\nKraska et al. (2018) showed that index data structures such as B-trees and Bloom filters can be made\nfaster or more memory efficient by combining them with machine learning models and named such novel\ndata structures Learned Index. Since then, learning augmented B-trees (Wang et al., 2020; Kipf et al., 2020;\nFerragina & Vinciguerra, 2020; Zeighami & Shahabi, 2023), Bloom filters (Mitzenmacher, 2018; Vaidya et al.,\n2021; Sato & Matsui, 2023; 2024), and even range-minimum query structures (Ferragina & Lari, 2025) have\nbeen proposed. There are several works on learning augmented B-trees whose performance is theoretically\nguaranteed. PGM-index (Ferragina & Vinciguerra, 2020) is a learning augmented B-tree that is guaranteed\nto have the same worst-case query complexity as the classical B-tree, i.e.,O(logn). Zeighami & Shahabi\n(2023) proposed a learning augmented B-tree with an expected query complexity ofO(log logn)under mild\nassumptions on the distribution. More broadly, this line of research connects to earlier studies on compressed\ndata structures with provable guarantees, such as the foundational work of Sadakane (2007).\n3 Methods\nThis section introduces ourLearned Sort frameworkand its PCF-based instantiation. In Section 3.1, we set\nup the notation, in Section 3.2 we present the general framework, and in Section 3.3 we instantiate it with\na PCF-based CDF model to obtain concrete complexity guarantees.\n3\n\nPublished in Transactions on Machine Learning Research (10/2025)\n3648593822477443342421566223805750457140\n362234242123\n3847434540\n485056575962717480\n485974566280575071\n384340\n4745\n222123\n363424\n384043\n4547\n212223\n243436\n2122232434363840434547485056575962717480\nstandard sortif |bucket| <𝝉standard sortif |bucket| ≥𝜹\nRecursive model-based bucketing until |bucket| <𝝉\nConcatenate\nCDF Model\nCDF Model\nCDF Model\n010.55040607030𝑞𝐹𝒙𝑞#𝐹(𝑞)CDF Model(Piecewise Constant Function)\n: Output of CDF model: Empirical CDF\n𝒙 𝒄! 𝒄\" 𝒄#$! \n𝒙%&'()* \nFigure 1: PCF Learned Sort: First, the input array is partitioned intoγ+ 1buckets using a CDF model-\nbased method. Buckets larger thanδor smaller thanτare sorted with a standard sort (e.g., IntroSort\nor QuickSort). Otherwise, the recursive model-based bucketing is repeated. Finally, the sorted arrays are\nconcatenated. The CDF model used for bucketing is a Piecewise Constant Function (PCF). The function is\nconstant within each interval, and the interval widths are constant.\n3.1 Notation and Setup\nFollowing the learned-sort paradigm Kraska et al. (2019); Kristo et al. (2020; 2021a), our learned sort\nalgorithmrecursivelyappliesmodel-based bucketing. Model-basedbucketingpartitionsthearrayintomultiple\nbuckets using a CDF model trained on the input so that the bucket with the larger ID gets the larger value.\nLetD⊆Rbe the domain of possible key values andx∈Dnbe the input array. For vector/arrayv, we\nwrite|v|for its length (number of elements), e.g.,|x|=n. If|x|is smaller than a fixed thresholdτ∈N,\nthe algorithm falls back to a classic sorting algorithm. We refer to this fallback classical sorting algorithm\nas thestandard sort. As the standard sort, we can use any sorting algorithm, such as IntroSort, QuickSort,\nor the algorithm of Han (2020).\nFor model-based bucketing, we define functionsα(n),β(n),γ(n),δ(n) :N→Nas follows:α(n)is the number\nof samples used to train the CDF model,β(n)is the number of PCF bins (a hyperparameter; see Section 3.3),\nγ(n) + 1is the number of buckets, andδ(n)is the threshold that determines the behavior after bucketing\n(see Section 3.2). For brevity, we writeα,β,γ,δ.\n3.2 Learned-Sort Framework\nAlgorithm description.At a high level, our algorithm is a recursive model-based bucketing scheme aug-\nmented with an exception-handling mechanism for bucketing “failures.” This exception-handling mechanism\ngreatly simplifies the analysis of both expected and worst-case complexity. The overall workflow is visualized\nin Figure 1, and the pseudocode is given in Algorithm 1.\nIf the length of the input array is less thanτ, our algorithm sorts the input array using a standard sort (e.g.,\nIntroSort or QuickSort). Otherwise, model-based bucketing is performed.\nThe model-based bucketing methodMtakes an input arrayxand partitions it into several buckets. First,\nall or some elements ofxare used to train the CDF model ˜F:D→[0,1]. The ˜F(q)is trained to approximate\nthe empirical CDFF x(q) =|i∈{1,...,n}|x i≤q|/|x|. Any non-decreasing model can serve as the CDF\nmodel ˜F(q)(e.g., linear models, monotonic MLPs, or the PCF introduced in Section 3.3).\n4\n\nPublished in Transactions on Machine Learning Research (10/2025)\nAlgorithm 1The Learned Sort algorithm\n1:Input:x∈RnOutput:x sorted∈Rn(the sorted version ofx)\n2:Subroutines:\n3:Standard-Sort(x): The standard sort with complexity guarantees (e.g, IntroSort or QuickSort)\n4:CDF-Model(x): Instantiate a CDF Model ˜F(q)that estimatesF x(q)\n5:functionLearned-Sort(x)\n6:n←|x|\n7:ifn<τthen▷Small bucket\n8:returnStandard-Sort(x)\n9: ˜F(q)←CDF-Model(x)▷Model-based bucketing\n10:c 1←[ ],c 2←[ ], ... ,c γ+1←[ ]\n11:fori= 1,2,...,n\n12:j←/floorleftbig˜F(xi)γ/floorrightbig\n+ 1\n13:c j.Append(x i)\n14:forj= 1,2,...,γ+ 1▷Recursively sort and concatenate\n15:if|c j|≥δthen\n16:c j←Standard-Sort(c j)\n17:else\n18:c j←Learned-Sort(c j)\n19:x sorted←Concatenate(c 1,c2,...,cγ+1)\n20:returnx sorted\nAfter training, the CDF model is used to partition the input arrayxintoγ+ 1buckets. Allγ+ 1buckets,\n{cj}γ+1\nj=1, are initialized to be empty, and then for eachi∈ {1,...,n},x iis appended toc⌊˜F(xi)γ⌋+1.\nThis is based on the intuition that the number of elements less than or equal tox iin the arrayx(i.e.,\n|{j∈{1,...,n}|x j≤xi}|) is approximately equal ton ˜F(xi).\nWe restrict the CDF model ˜Fto non-decreasing functions to ensure that the bucket with the larger ID gets\nthe larger value, i.e.,p∈c j∧q∈ck∧j <k⇒p<q. This means that each bucket is responsible for a\ndisjoint and continuous interval. Lett j= minx∈cjx(j= 1,...,γ+ 1), t γ+2=∞, then thej-th bucketc j\n(j= 1,...,γ+ 1) is responsible for a continuous intervalI j:= [tj,tj+1).\nAfter model-based bucketing, our algorithm determines for each bucket whether the bucketing “succeeds” or\n“fails.” For eachj∈{1,...,γ+ 1}, we check whether the size of bucketc jis less thanδ. If|c j|≥δ(which\nmeans the bucketing “fails”), the bucket is sorted using the standard sort (e.g., IntroSort or QuickSort). If\n|cj|< δ(which means the bucketing “succeeds”), the bucket is sorted by recursively calling our Learned\nSort algorithm. Note that the parameters such asγandδare redetermined for each recursion according to\nthe size of the bucket (i.e., the input array in the next recursion step), and the CDF model is retrained for\neach bucket. Finally, the sorted buckets are concatenated to form the sorted array.\nWorst-case complexity.The following lemma guarantees the worst-case complexity of our Learned Sort.\nLemma 3.1.Assume that there exists a model-based bucketing algorithmMsuch thatMcan perform\nbucketing (including model training and inferences) an array of lengthnintoγ+ 1 =O(n)buckets with a\nworst-case complexity ofO(n). Also, assume that the standard sort has a worst-case complexity ofO(nU(n)),\nwhereU(n)is a non-decreasing function. Then, the worst-case complexity of our Learned Sort with suchM\nandδ=⌊nd⌋(wheredis a constant satisfying0<d<1) isO(nU(n) +nlog logn).\nThis lemma can be intuitively shown from the following two points: (1) the maximum recursion depth is\nO(log logn), and (2) each element of the input arrayxundergoes several bucketing and only one standard\nsort. The first point can be shown from the fact that the size of the bucket in thei-th recursion depth is\nless thanndi. The second point is evident from the algorithm’s design since the buckets sorted by standard\nsort are now left only to be concatenated. The exact proof is given in Section A.1.\n5\n\nPublished in Transactions on Machine Learning Research (10/2025)\nNote that this guarantee critically relies on the exception-handling mechanism: without it, the recursion\ndepth could reachΘ(n)and the worst-case time would degrade toΘ(n2), whereas with it the recursion\ndepth is always bounded byO(log logn).\nExpected complexity.Next, we introduce a lemma about the expected computational complexity of our\nLearned Sort. The following assumption is necessary to guarantee the expected computational complexity.\nAssumption 3.2.The input arrayx∈Dnis formed by independent sampling according to a probability\ndensity distributionf(x):D→R ≥0.\nWe definefI(x):I→R≥0to be the conditional probability density distribution off(x)under the condition\nthatx∈Ifor a intervalI⊆D, i.e.,f I(x):=f(x)/integraltext\nIf(y)dy.\nThe expected computational complexity of our proposed Learned Sort is guaranteed by the following lemma.\nLemma 3.3.Letx I(∈In)be the array formed by samplingntimes independently according tof I(x).\nAssume that there exist a model-based bucketing algorithmMand a constantd(∈(0,1))that satisfy the\nfollowing three conditions for any intervalI(⊆D): (i)Mcan perform bucketing (including model training\nand inferences) on an array of lengthn, with an expected complexity ofO(n), (ii)γ+ 1 =O(n), and (iii)\nPr[∃j,|cj|≥⌊nd⌋] =O/parenleftig\n1\nlogn/parenrightig\n. Also, assume that the standard sort has an expected complexity ofO(nlogn).\nThen, the expected complexity of our Learned Sort with suchMandδ=⌊nd⌋isO(nlog logn).\nThis lemma can be proved intuitively by the following two points: (1) the maximum recursion depth is\nO(log logn), and (2) the expected total computational complexity from thei-th to the(i+ 1)-th recursion\ndepth isO(n). The first point is the same as in the explanation of the proof of Theorem 3.1. The second\npoint holds because the expected computational complexity from thei-th to the(i+ 1)-th recursion depth\nisO(nlogn)with probabilityO(1\nlogn), andO(n)in other cases. See Section A.2 for the exact proof.\nNote that the assumption of Theorem 3.3 includes “Mworks well with high probability for anyI(⊆D).”\nThis is because our Learned Sort algorithm recursively repeats the model-based bucketing. The range of\nelements in the bucket, i.e., the input array in the next recursion step, can be any intervalI(⊆D).\n3.3 PCF Learned Sort\nWe now instantiate the framework withPCF Learned Sort, which satisfies the assumptions of Theorem 3.1\nand Theorem 3.3, thereby providing both worst-case and expected-time guarantees. PCF Learned Sort\napproximates the CDF using aPiecewise Constant Function (PCF)withβequal-width bins; the model\noutput is constant within each bin (see the right panel of Figure 1). The study that develops a Learned\nIndex with a theoretical guarantee on its complexity (Zeighami & Shahabi, 2023) also used PCF as a CDF\nmodel. While our framework admits more expressive CDF models (such as spline-based or neural models),\nwe focus on PCF due to its minimal training and inference cost and the tractability of its theoretical analysis.\nThe model-based bucketing method in PCF Learned SortM PCFtrains the CDF model ˜Fas follows. The\nparametersα∈{1,...,n}andβ∈Nare determined byn, whereαis the number of samples used to train\nthe model andβis the number of intervals in the PCF. The PCF is trained by counting the number of\nsamples in each interval. We definei(x) =⌊(x−x min)β/(x max−xmin)⌋+ 1, wherex min= minixiand\nxmax= maxixi. Fromx,αsamples are taken to forma∈Dα, andi(x)is used to constructb∈Zβ+1\n≥0with\nbi=|{j∈{1,...,α}|i(a j)≤i}|. This counting procedure trains the PCF. Note thatbis an non-decreasing\nnon-negative array andb β+1=α, i.e.,0≤b 1≤b2≤···≤b β+1=α.\nInference for ˜F(x)is then given by ˜F(x) =bi(x)\nα. Sincei(x)andbare non-decreasing, ˜F(x)is also non-\ndecreasing. Also,0≤ ˜F(x)≤1because0≤b i≤αfor everyi.\nThe following is a lemma to bound the probability thatM PCFwill “fail” bucketing. This lemma is important\nto guarantee the expected computational complexity of PCF Learned Sort.\nLemma 3.4.Letσ 1andσ 2be respectively the lower and upper bounds of the probability density distribution\nf(x)inD, and assume that0<σ 1≤σ2<∞. That is,x∈D ⇒σ 1≤f(x)≤σ 2. Then, in model-based\n6\n\nPublished in Transactions on Machine Learning Research (10/2025)\nbucketing ofx I(∈In)to{cj}γ+1\nj=1usingM PCF, the following holds for any intervalI(⊆D):\nK:=γδ\n2n−2σ2γ\nσ1β≥1⇒Pr[∃j,|c j|>δ]≤2n\nδexp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(1)\nThe proof of this lemma is based on and combines proofs from two existing studies. The first is Lemma\n5.2. from a study of IPS4o (Axtmann et al., 2022), an efficient sample sort. This lemma guarantees the\nprobability of a “successful recursion step” when selecting pivots from samples and using them to perform a\npartition. This lemma is for the method that does not use the CDF model, so the proof cannot be applied\ndirectly to our case. Another proof we refer to is the proof of Lemma 4.5. from a study that addressed\nthe computational complexity guarantee of the Learned Index (Zeighami & Shahabi, 2023). This lemma\nprovides a probabilistic guarantee for the error between the output of the PCF and the empirical CDF.\nSome modifications are required to adapt it to the context of sorting and to attribute it to the probability\nof bucketing failure, i.e.,Pr[∃j,|c j|> δ]. By appropriately combining the proofs of these two lemmas,\nTheorem 3.4 is proved. The exact proof is given in Section A.3.\nHere, we emphasize that the assumption of this lemma,0< σ 1≤σ 2<∞, is sufficiently reasonable and\n“mild” as described in (Zeighami & Shahabi, 2023). It asserts that the probability density functionf(x)is\nboth bounded and nonzero over its domainD. This class of distributions covers the majority of real-world\nscenarios because real-world data is commonly derived from bounded and continuous phenomena, e.g., age,\ngrades, and data over a period of time. Empirically, Zeighami & Shahabi (2023) further suggest that the\nratioσ 2/σ1tends to remain close to 1 in a wide variety of practical datasets, and even for more challenging\ncases like OSM, the ratio still appears to remain at most around 20.\nUsing Theorem 3.1, Theorem 3.3, and Theorem 3.4, we can prove the following theorems.\nTheorem 3.5.IfM PCFis the bucketing method, the worst-case complexity of standard sort isO(nU(n))\n(whereU(n)is a non-decreasing function), andα=β=γ=δ=⌊n3/4⌋, then the worst-case complexity of\nPCF Learned Sort isO(nU(n) +nlog logn).\nProof.Whenα=β=γ=⌊n3/4⌋, the computational complexity for model-based bucketing isO(n)because\n(i) the PCF is trained inO(α+β) =O(n3/4), and (ii) the total complexity of inference fornelements is\nO(n), since the inference is performed inO(1)per element. Therefore, sinceγ+ 1 =O(n), the worst-case\ncomplexity of standard sort isO(nU(n)), andδ=⌊n3/4⌋, we can prove the worst-case complexity of PCF\nLearned Sort isO(nU(n) +nlog logn)by Theorem 3.1.\nTheorem 3.6.Letσ 1andσ 2be the lower and upper bounds, respectively, of the probability density distri-\nbutionf(x)inD, and assume that0<σ 1≤σ2<∞. Then, ifM PCFis the bucketing method, the expected\ncomplexity of standard sort isO(nlogn), andα=β=γ=δ=⌊n3/4⌋, then the expected complexity of PCF\nLearned Sort isO(nlog logn).\nProof.Whenα=β=γ=⌊n3/4⌋, the computational complexity for model-based bucketing isO(n). Since\nK= Ω(√n)whenα=β=γ=δ=⌊n3/4⌋,K≥1for sufficiently largen, and\n2n\nδexp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n=O(n1\n4exp(−√n))≤O/parenleftbigg1\nlogn/parenrightbigg\n.(2)\nGiven thatγ+ 1 =O(n), the expected complexity of standard sort isO(nlogn), andδ=⌊n3/4⌋, it follows\nfrom Theorem 3.3 and Theorem 3.4 that the expected complexity of PCF Learned Sort isO(nlog logn).\nNote that the exact value ofσ 1andσ 2is not required to run PCF Learned Sort since the parameters for\nthis algorithm, i.e.,α,β,γ, andδ, are determined without any prior knowledge. In other words, PCF\nLearned Sort can sort in expectedO(nlog logn)complexity as long as0<σ 1≤f(x)≤σ 2<∞, even if it\ndoes not know the exact value ofσ 1andσ 2. Ifσ 1andσ 2do not satisfy the assumption of Theorem 3.6,\nthe expected complexity of PCF Learned Sort increases toO(nU(n) +nlog logn). Such scenarios arise, for\n7\n\nPublished in Transactions on Machine Learning Research (10/2025)\ninstance, in heavy-tailed distributions, datasets with extremely sparse regions (σ 1= 0), or cases where the\ndensity is highly concentrated at particular values (σ 2=∞). However, thanks to the worst-case bound in\nTheorem 3.5, the complexity never exceedsO(nU(n)+nlog logn). Thus, the algorithm remains robust even\nunder distributions that do not fully satisfy the assumption.\nAlternative CDF Models.Our framework is not limited to PCF; it can also accommodate more expres-\nsive CDF models. For instance, we can replace PCF with a spline-based model that approximates the CDF\nby interpolating the empirical distribution at bin boundaries. Concretely, givenβintervals, we evaluate the\nempirical CDF at the endpoints of each interval and then construct a piecewise linear spline that connects\nthese values, yielding a continuous and non-decreasing CDF approximation. We refer to the algorithm that\napplies this spline-based CDF model within our Learned Sort framework asSpline Learned Sort. We show\nthat spline-based models constructed in this way still satisfy the assumptions of Theorem 3.3, and thus the\nexpected time complexity guarantee ofO(nlog logn)remains valid. A detailed theoretical proof for the\nspline-based case is provided in Section A.5.\n4 Experiments\nIn this section, we empirically validate our theoretical results. First, in Section 4.1, we confirm that the\ncomplexity of PCF Learned Sort isO(nlog logn)for both synthetic and real datasets. Then, in Section 4.2,\nwe conduct experiments with various parameter settings and empirically confirm Theorem 3.4, a lemma that\nbounds the probability of bucketing failure and plays a crucial role in guaranteeing the expected complexity\nof PCF Learned Sort. Finally, in Section 4.3, we present from sorting time measurements.\nSetup.We experimented with synthetic datasets created from the following four distributions: uniform\n(min= 0,max= 1), normal (µ= 0,σ= 1), exponential (λ= 1), lognormal (µ= 0,σ= 1). The input array\nwas generated by independently takingnsamples from each distribution. Only the uniform distribution\nsatisfies the theoretical assumptions required for our complexity guarantees. The other distributions violate\nthese assumptions, but we include them to evaluate the empirical robustness of PCF Learned Sort.\nWe also used the following 16 real datasets, includingChicago [Start, Tot](Chicago, 2021),NYC\n[Pickup, Dist, Tot](nyc, 2020),SOF [Humidity, Pressure, Temperature](Mavrodiev, 2019),Wiki,\nOSM,Books,Face(Marcus et al., 2020), andStocks [Volume, Open, Date, Low](Onyshchak, 2020).\nFurther dataset details are provided in Appendix B. For each dataset, we randomly samplenelements,\nshuffle them, and use them as an input array to examine the complexity of the sort algorithms. Since these\nare real-world datasets, we cannot definitively determine whether they satisfy our theoretical assumptions.\nHowever, as shown in the histograms in Figure 2, Chicago [Start], NYC [Pickup, Tot], SOF [Humidity], and\nFace appear to distribute values across a relatively dense and continuous domain, aligning well with our as-\nsumptions. In contrast, other datasets exhibit long tails or sparse regions, suggesting that our assumptions\nmay not hold. Furthermore, note that for several datasets (Chicago [Start, Tot], NYC [Dist, Tot], SOF\n[Humidity, Pressure, Temperature], and Stocks [Volume, Open, Date, Low]), the number of unique values is\nextremely small (less than 3.2% of the total elements, as detailed in Appendix B).\nAll experiments were run on a Linux machine equipped with an Intel®Core™i9-11900H CPU @ 2.50GHz\nand 62GB of memory. GCC version 9.4.0 was used for compilation, employing the-O3optimization flag.\n4.1 Computational Complexity of PCF Learned Sort\nWe meticulously counted the total number of basic operations for sorting the input array to observe the\ncomputational complexity of each sorting algorithm. Here, the basic operations consist of four arithmetic\noperations, powers, comparisons, logical operations, assignments, and memory access. We chose this metric,\nwhich counts basic operations, to mitigate the environmental dependencies observed in other metrics, such as\nCPU instructions and CPU time, which are heavily influenced by compiler optimizations and the underlying\nhardware. This is the same idea as the metric selection in the experiment of (Zeighami & Shahabi, 2023).\n8\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure2: Numberofoperationstosortthearray. Beloweachgraphisahistogramvisualizingthedistribution\nof each dataset. The standard deviation of the10measurements is represented by the shaded area. Our\nPCF Learned Sort consistently achieves a complexity lower thanO(nlogn), while Learned Sort 2.0 (Kristo\net al., 2021a), which hasO(n2)worst-case complexity, occasionally requires huge operations.\nThe parameters of PCF Learned Sort are set as in Theorems 3.5 and 3.6,α=β=γ=δ=⌊n3/4⌋and\nτ= 100. As the standard sort, we used QuickSort, which has an expected complexity ofO(nlogn). For\nease of implementation and straightforward measurement of comparison counts, we chose QuickSort. We\ncompared our PCF Learned Sort against (plain) QuickSort, radix sort, and Learned Sort 2.0 (Kristo et al.,\n2021b). Learned Sort 2.0 was selected as the learned-method baseline because it allows relatively simple\ncounting of operations (a broader comparison appears in the sorting time experiments of Section 4.3).\nFigure 2 shows the number of operations divided by the length of the input array,n. Each point represents\nthe average over 10 runs, with the shaded region indicating the standard deviation. Note that the horizontal\naxis is logarithmic. As a result, the curve for QuickSort (withO(nlogn)complexity) appears approximately\nlinearinthisplotforsyntheticdatasetsandreal-worlddatasetswithfewduplicates(i.e., NYC[Pickup], Wiki,\nOSM, Books, and Face). In contrast, the curve for PCF Learned Sort is nearly flat, suggesting a complexity\nsignificantly lower thanO(nlogn). PCF Learned Sort consistently requires the fewest operations across all\nconditions, achieving up to 2.8 times fewer operations than QuickSort. These results confirm not only our\ntheoretical analysis but also the robustness of PCF Learned Sort under assumption-violating scenarios.\n9\n\nPublished in Transactions on Machine Learning Research (10/2025)\n𝑎𝑎𝑎𝑏𝑏𝑐𝑏𝑐𝑑𝑐𝑑𝑑𝑐=0.75,𝑑=0.75𝑏=0.75,𝑑=0.75𝑏=0.75,𝑐=0.75𝑎=0.75,𝑑=0.75𝑎=0.75,𝑐=0.75𝑎=0.75,𝑏=0.75Pr∃𝑗,𝒄!≤𝛿\nFigure 3: Heatmap showing the empirical frequency of bucketing failure, i.e.,∃j,|c j|> δ. The variables\na,b,c,d, except those on the x- and y-axes, were set to0.75. The white dotted line represents the parameters\nthat make the right side of Equation (1) equal to 0.5. The close alignment between this white dotted line\nand the actual success/fail boundery suggests the theoretical bound by is Equation (1) reasonably tight.\nFor datasets with many duplicates, QuickSort, Learned Sort 2.0 (Kristo et al., 2021a), and PCF Learned\nSort all exhibit relatively few operations. This behavior arises because highly duplicated datasets often result\nin buckets containing only one distinct value, allowing the algorithms to terminate early. Even under such\nconditions, PCF Learned Sort performs fewer operations than the other algorithms.\nThe curve for radix sort is also flat but lies consistently above that of PCF Learned Sort. This is due to the\ndifference in partitioning strategies. While the radix sort partitions at a fixed granularity, our PCF Learned\nSort performs partitioning using intervals that are adaptively set by the learning model.\nIn particular, on the SOF [Temperature] dataset with medium input sizes (2×105<n≤2×107), Learned\nSort 2.0 incurs extremely high costs: while all other methods keep the number of operations pernbelow\n100, it can exceed50,000. This shows that Learned Sort methods without worst-case guarantees may suffer\nfrom pathological overhead. By contrast, our method maintains both expected and worst-case guarantees,\nensuring robust performance across diverse datasets.\n4.2 Confirmation of Theorem 3.4\nTheorem 3.4 bounds the probability that a bucket of size greater thanδexists. This is an important\nlemma that allows us to guarantee the expected computational complexity of PCF Learned Sort. Here, we\nempirically confirm that this upper bound is appropriate.\nWe have experimented withα=⌊na⌋,β=⌊nb⌋,γ=⌊nc⌋,δ=⌊nd⌋, varyinga,b,c,dfrom 0.05 to 0.95 at\n0.05 intervals. For eacha,b,c,dsetting, the following was repeated100times: we tookn= 106elements\nfrom the uniform distribution to form the input array and divided the array intoγ+ 1buckets byM PCF,\nand checked whether or not∃j,|c j|> δ. Thus, for eacha,b,c,d∈{0.05,0.10,...,0.95}, we obtained the\nempirical frequency at which bucketing “fails.”\nHeat maps in Figure 3 show the empirical frequency of bucketing failures when two of thea,b,c,dparameters\nare fixed, and the other two parameters are varied. The values of the two fixed variables are set to 0.75,\ne.g., in the upper left heap map of Figure 3 (horizontal axis isaand vertical axis isb),c=d= 0.75. The\nwhite dotted line represents the parameter so that the right side of Equation (1) is 0.5. That is, Theorem 3.4\nasserts that “in the region upper right of the white dotted line, the probability of bucketing failure is less\nthan 0.5.”\nWeobservethatthewhitedottedlineiscloseto(orslightlytotheupperrightof)theactualboundofwhether\nbucketing “succeeds” or “fails” more often. This suggests that the theoretical upper bound from Theorem 3.4\nagrees well (to some extent) with the actual probability. We can also confirm that, as Theorem 3.4 claims,\nthe probability of bucketing failure is indeed small in the region upper right of the white line.\n4.3 Experiments on Sorting Time\nWe empirically compare the sorting time of our PCF Learned Sort against several baselines. Note that\nthe metric used in Section 4.1, the number of operations, does not change depending on the machine or\ncompilation method, but the sorting time does. As the standard sort used in PCF Learned Sort, we used\n10\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure4: Timetosortthearray. Thestandarddeviationofthe10measurementsisrepresentedbytheshaded\narea. Our PCF Learned Sort is significantly faster thanstd::sort, and more importantly, it maintains\nrobust performance across all datasets, whereas other learned sorts without worst-case guarantees can suffer\ncatastrophic slowdowns, as seen with Learned Sort 2.0 on the SOF [Temperature] dataset.\nstd::sort, which has a worst-case complexity ofO(nlogn). We compared our PCF Learned Sort with\nstd::sort, radix sort,boost::sort::spreadsort::float_sort(Boost C++ implementation of Spread-\nsort (Ross, 2002)), and Learned Sort 2.0 (Kristo et al., 2021b). In addition, we evaluated more recent\nstate-of-the-art learned sorting algorithms (Ferragina & Odorisio, 2025)—Balanced Learned Sort (BLS),\nUnbalanced Learned Sort (ULS), and Learned Sort 2.1—as well as IS4o (Axtmann et al., 2017), one of the\nstate-of-the-art non-learned sequential sample sort algorithms.\nFigure 4 shows the sorting time divided byn. It shows the mean and standard deviation of the10mea-\nsurements for each condition. Note that the horizontal axis is logarithmic, and therefore the curve of\nstd::sort, which has a complexity ofO(nlogn), is almost linear in this plot for synthetic datasets and\nreal-world datasets with few duplicates. In contrast, our PCF Learned Sort graph shows a relatively slow\nincrease, suggesting that PCF Learned Sort has a complexity much smaller thanO(nlogn). We see that our\nPCF Learned Sort is up to 2.5 times faster thanstd::sort. Furthermore, we find that for relatively large\nn(>106), our PCF Learned Sort usually outperforms not only radix sort but also Spreadsort, an algorithm\nthat cleverly incorporates the advantage of comparison sort into radix sort.\nThe figure also shows that highly optimized methods like IS4o and other learned sorts often outperform PCF\nLearned Sort in average speed. This is because these methods are highly optimized implementations that\nconsider factors like cache efficiency, whereas our implementation prioritizes providing rigorous theoretical\nguarantees. However, this speed comes at the cost of robustness: learned sorts without worst-case guarantees\ncansuffercatastrophicslowdowns. Forexample, ontheSOF[Temperature]datasetwithn= 2×107, Learned\nSort 2.0 took up to 326.4 seconds, while our method consistently finished in 0.45 seconds. Moreover, as shown\nin our adversarial analysis (Section C), other recent learned sorts (BLS, ULS, Learned Sort 2.1) also exhibit\nvulnerabilities. These results highlight the practical value of our theoretical guarantees.\n11\n\nPublished in Transactions on Machine Learning Research (10/2025)\nTo better understand runtime behavior, we profiled PCF Learned Sort across its stages (Section D). The\nresults show that while the training stage is consistently lightweight across datasets and input sizes, the\nbucketing stage often becomes the bottleneck. The dominant cost varies depending on bothnand the\ndataset characteristics, suggesting opportunities for further optimization.\n5 Discussion\nComparison with (Zeighami & Shahabi, 2024).Most recently, a concurrent work (Zeighami & Sha-\nhabi, 2024) introduced a theoretical framework for learned database operations, including sorting, indexing,\nandcardinalityestimation. Akeystrengthoftheirapproachistheformaldefinitionof“distributionlearnabil-\nity” and its applicability to a broad class of distributions, including those subject to distribution shifts. Using\nthis framework, they developed a Learned Sort algorithm with an expected running time ofO(nlog logn)\nunder certain distributional assumptions. While their approach employs a bucketing-based sorting algorithm\nsimilar to ours, there are several key differences between their method and ours.\nFirst, their algorithm relies on detailed prior knowledge about the distribution; it explicitly requires a\nparameterκ 2, which represents the “learning possibility” of the distribution (see Definition 3.2 in (Zeighami\n& Shahabi, 2024) for details). Sinceκ 2depends onρ 1andρ 2, their algorithm cannot be executed without\nknowing the values ofρ 1andρ 2(or at least their lower and upper bounds). In contrast, our algorithm does\nnot require these values, making it more widely applicable.\nSecond, they do not provide experimental results. Since estimatingρ 1andρ 2from real data is challenging,\nempirical evaluation of their method is difficult. On the other hand, since our algorithm does not depend\non these specific values, it is easy to implement and evaluate experimentally.\nFinally, their algorithm lacks a worst-case complexity guarantee. In particular, there are cases where the\nalgorithm may not terminate, making it impossible to give an upper bound on its worst-case complexity. In\ncontrast, we provide a formal worst-case complexity guarantee.\nLimitations of the Current Theoretical Framework.Our proof of theO(nlog logn)expected com-\nplexity (Theorem 3.6), does not extend to distributions withf(x) = 0or∞. A similar limitation is observed\nin Learned Indexes (Zeighami & Shahabi, 2023), and extending the theory to cover a broader class of dis-\ntributions remains an open direction in both Learned Indexes and Learned Sorts contexts. One promising\ndirection is to integrate more advanced CDF approximation methods with theoretical guarantees into our\nLearned Sort algorithm. By adopting a refined CDF model and a bucketing algorithm that satisfies the\nconditions of Theorem 3.3, it may be possible to achieve stronger theoretical guarantees.\nImplementation Considerations and Optimizations.A straightforward implementation of PCF\nLearned Sort is not in-place, as it requires an auxiliary buffer for buckets nearly as large as the input.\nEngineering techniques from highly optimized sample-sort implementations (Axtmann et al., 2017; 2022)\nsuggest in-place variants without changing the asymptotic structure of our algorithm. Another important\naspect is real-world efficiency: optimizing memory access patterns to enhance cache efficiency, reducing cache\nmisses, and leveraging cache-aware data layouts could improve empirical performance without compromising\ntheoretical guarantees. Dynamically tuning parameters such asα,β,γ, andδbased on the input distribution\nmay yield further performance gains while maintaining guarantees.\nParallelization Potential.Although our analysis targets the sequential setting, the structure of PCF\nLearned Sort admits parallelization at several stages: training the CDF model, computing bucket IDs, scat-\ntering into buckets, and sorting buckets are all amenable to data parallelism. This observation is consistent\nwith prior engineering work that integrates learned partitioning with high-performance (in-place) sample-\nsort pipelines and parallel learned-sorting frameworks (Axtmann et al., 2017; Carvalho, 2022; Carvalho &\nLawrence, 2023). These results complement our theoretical analysis and suggest opportunities for developing\nparallel learned-sorting algorithms with provable guarantees.\n12\n\nPublished in Transactions on Machine Learning Research (10/2025)\n6 Conclusion\nWeproposedPCFLearnedSort, whichprovidesguaranteesonbothitsexpectedandworst-casecomplexities.\nWe then confirmed these computational complexities empirically on both synthetic and real data. This is\nthe first study to support the empirical success of Learned Sort theoretically and provides insight into why\nLearned Sort is fast.\n13\n\nPublished in Transactions on Machine Learning Research (10/2025)\nReferences\nTlc trip record data, 2020. URLhttps://www1.nyc.gov/site/tlc/about/tlc-trip-record-data.page.\nAntonios Antoniadis, Christian Coester, Marek Eliáš, Adam Polak, and Bertrand Simon. Online metric\nalgorithms with untrusted predictions.ACM Transactions on Algorithms, 2023.\nMichael Axtmann, Sascha Witt, Daniel Ferizovic, and Peter Sanders. In-Place Parallel Super Scalar Sam-\nplesort (IPSSSSo). In25th Annual European Symposium on Algorithms (ESA 2017), volume 87 ofLeibniz\nInternational Proceedings in Informatics (LIPIcs), pp. 9:1–9:14. Schloss Dagstuhl–Leibniz-Zentrum fuer\nInformatik, 2017. doi: 10.4230/LIPIcs.ESA.2017.9.\nMichael Axtmann, Sascha Witt, Daniel Ferizovic, and Peter Sanders. Engineering in-place (shared-memory)\nsorting algorithms.ACM Transactions on Parallel Computing, 2022.\nXingjian Bai and Christian Coester. Sorting with predictions.Advances in Neural Information Processing\nSystems, 2023.\nIvan Carvalho. Towards parallel learned sorting.arXiv preprint arXiv:2208.06902, 2022.\nIvan Carvalho and Ramon Lawrence. Learnedsort as a learning-augmented samplesort: Analysis and par-\nallelization. InProceedings of the 35th International Conference on Scientific and Statistical Database\nManagement, pp. 1–9, 2023.\nT.-H. Hubert Chan, Enze Sun, and Bo Wang. Generalized sorting with predictions revisited. InFrontiers\nof Algorithmics, 2023.\nCity of Chicago. Taxi trips: City of chicago: Data portal, May 2021. URLhttps://data.cityofchicago.\norg/Transportation/Taxi-Trips/wrvz-psew#column-menu.\nMichael Dinitz, Sungjin Im, Thomas Lavastida, Benjamin Moseley, and Sergei Vassilvitskii. Faster matchings\nvia learned duals.Advances in Neural Information Processing Systems, 2021.\nThomas Erlebach, Murilo de Lima, Nicole Megow, and Jens Schlöter. Sorting and hypergraph orientation\nunder uncertainty with predictions. InProceedings of the International Joint Conference on Artificial\nIntelligence (IJCAI), 2023.\nPaolo Ferragina and Filippo Lari. Fl-rmq: A learned approach to range minimum queries. In36th Annual\nSymposium on Combinatorial Pattern Matching (CPM 2025), 2025.\nPaolo Ferragina and Mattia Odorisio. Fast, robust, and learned distribution-based sorting.IEEE Access,\n13:45198–45214, 2025.\nPaolo Ferragina and Giorgio Vinciguerra. The pgm-index: a fully-dynamic compressed learned index with\nprovable worst-case bounds.Proceedings of the Very Large Data Bases Endowment, 2020.\nW Donald Frazer and Archie C McKellar. Samplesort: A sampling approach to minimal storage tree sorting.\nJournal of the Association for Computing Machinery, 1970.\nSreenivas Gollapudi and Debmalya Panigrahi. Online algorithms for rent-or-buy with expert advice. In\nProceedings of the International Conference on Machine Learning, 2019.\nYijie Han. Deterministic sorting in o(n log log n) time and linear space. InProceedings of the Annual ACM\nSymposium on Theory of Computing, 2002.\nYijie Han. Sorting real numbers in o(n sqrt(log n)) time and linear space.Algorithmica, 2020.\nYijie Han and Mikkel Thorup. Integer sorting in o(n sqrt(log log n)) expected time and linear space. In\nProceedings of the Symposium on Foundations of Computer Science, 2002.\nSungjin Im, Ravi Kumar, Aditya Petety, and Manish Purohit. Parsimonious learning-augmented caching.\nInProceedings of the International Conference on Machine Learning, 2022.\n14\n\nPublished in Transactions on Machine Learning Research (10/2025)\nJava. List (java se 21 & jdk 21). URL:https://docs.oracle.com/en/java/javase/21/docs/api/java.\nbase/java/util/List.html#sort(java.util.Comparator), 2023. Accessed on 2024-01-18.\nAndreas Kipf, Ryan Marcus, Alexander van Renen, Mihail Stoian, Alfons Kemper, Tim Kraska, and Thomas\nNeumann. Radixspline: a single-pass learned index. InProceedings of the international workshop on\nexploiting artificial intelligence techniques for data management, 2020.\nTim Kraska, Alex Beutel, Ed H Chi, Jeffrey Dean, and Neoklis Polyzotis. The case for learned index\nstructures. InProceedings of the International Conference on Management of Data, 2018.\nTim Kraska, Mohammad Alizadeh, Alex Beutel, Ed H Chi, Jialin Ding, Ani Kristo, Guillaume Leclerc,\nSamuel Madden, Hongzi Mao, and Vikram Nathan. Sagedb: A learned database system. InProceedings\nof the Conference on Innovative Data Systems Research, 2019.\nAni Kristo, Kapil Vaidya, Ugur Çetintemel, Sanchit Misra, and Tim Kraska. The case for a learned sorting\nalgorithm. InProceedings of the ACM SIGMOD International Conference on Management of Data, 2020.\nAni Kristo, Kapil Vaidya, and Tim Kraska. Defeating duplicates: A re-design of the learnedsort algorithm.\narXiv preprint arXiv:2107.03290, 2021a.\nAni Kristo, Kapil Vaidya, and Tim Kraska. LearnedSort, License: GPL 3.0. URL:https://github.com/\nanikristo/LearnedSort, 2021b. Accessed on 2024-01-18.\nAlexandra Anna Lassota, Alexander Lindermayr, Nicole Megow, and Jens Schlöter. Minimalistic predictions\nto schedule jobs with online precedence constraints. InProceedings of the International Conference on\nMachine Learning, 2023.\nSilvio Lattanzi, Thomas Lavastida, Benjamin Moseley, and Sergei Vassilvitskii. Online scheduling via learned\nweights. InProceedings of the ACM-SIAM Symposium on Discrete Algorithms, 2020.\nYujia Li, Felix Gimeno, Pushmeet Kohli, and Oriol Vinyals. Strong generalization and efficiency in neural\nprograms.arXiv preprint arXiv:2007.03629, 2020.\nPinyan Lu, Xuandi Ren, Enze Sun, and Yubo Zhang. Generalized sorting with predictions. InSymposium\non Simplicity in Algorithms (SOSA), 2021.\nThodoris Lykouris and Sergei Vassilvitskii. Competitive caching with machine learned advice.Journal of\nthe Association for Computing Machinery, 2021.\nRyan Marcus, Andreas Kipf, Alexander van Renen, Mihail Stoian, Sanchit Misra, Alfons Kemper, Thomas\nNeumann, and Tim Kraska. Benchmarking learned indexes.Proceedings of the Very Large Data Bases\nEndowment, 2020. Accessed on 2024-01-18.\nHristo Mavrodiev. Sofia air quality dataset, Sep 2019. URLhttps://www.kaggle.com/hmavrodiev/\nsofia-air-quality-dataset.\nPeter McIlroy. Optimistic sorting and information theoretic complexity. InProceedings of the ACM-SIAM\nSymposium on Discrete algorithms, 1993.\nMichael Mitzenmacher. A model for learned bloom filters and optimizing by sandwiching.Advances in\nNeural Information Processing Systems, 2018.\nMichael Mitzenmacher and Sergei Vassilvitskii. Algorithms with predictions.Communications of the ACM,\n2022.\nJ Ian Munro and Sebastian Wild. Nearly-optimal mergesorts: Fast, practical sorting methods that optimally\nadapt to existing runs. InEuropean Symposium on Algorithms, 2018.\nDavid R Musser. Introspective sorting and selection algorithms.Software: Practice and Experience, 1997.\n15\n\nPublished in Transactions on Machine Learning Research (10/2025)\nArvind Narayanan, Saurabh Verma, Eman Ramadan, Pariya Babaie, and Zhi-Li Zhang. Deepcache: A deep\nlearning based framework for content caching. InProceedings of the Workshop on Network Meets AI &\nML, 2018.\nOmar Obeya, Endrias Kahssay, Edward Fan, and Julian Shun. Theoretically-efficient and practical par-\nallel in-place radix sorting. InProceedings of the ACM Symposium on Parallelism in Algorithms and\nArchitectures, 2019.\nOleh Onyshchak. Stock market dataset, Apr 2020. URLhttps://www.kaggle.com/jacksoncrow/\nstock-market-dataset.\nTim Peters. Python: list.sort. URL:https://github.com/python/cpython/blob/main/Objects/\nlistsort.txt, 2002. Accessed on 2024-01-18.\nManish Purohit, Zoya Svitkina, and Ravi Kumar. Improving online algorithms via ml predictions.Advances\nin Neural Information Processing Systems, 2018.\nDhruv Rohatgi. Near-optimal bounds for online caching with machine learned advice. InProceedings of the\nACM-SIAM Symposium on Discrete Algorithms, 2020.\nSteven J Ross. The spreadsort high-performance general-case sorting algorithm. InPDPTA, 2002.\nKunihiko Sadakane. Compressed suffix trees with full functionality.Theory of Computing Systems, 41(4):\n589–607, 2007.\nShinsaku Sakaue and Taihei Oki. Discrete-convex-analysis-based framework for warm-starting algorithms\nwith predictions.Advances in Neural Information Processing Systems, 2022.\nAtsuki Sato and Yusuke Matsui. Fast partitioned learned bloom filter.Advances in Neural Information\nProcessing Systems, 2023.\nAtsuki Sato and Yusuke Matsui. Fast construction of partitioned learned bloom filter with theoretical\nguarantees.arXiv preprint arXiv:2410.13278, 2024.\nYongho Shin, Changyeol Lee, Gukryeol Lee, and Hyung-Chan An. Improved learning-augmented algorithms\nfor the multi-option ski rental problem via best-possible competitive analysis. InProceedings of the Inter-\nnational Conference on Machine Learning, 2023.\nKapil Vaidya, Eric Knorr, Tim Kraska, and Michael Mitzenmacher. Partitioned learned bloom filter. In\nInternational Conference on Learning Representations, 2021.\nYouyun Wang, Chuzhe Tang, Zhaoguo Wang, and Haibo Chen. Sindex: a scalable learned index for string\nkeys. InProceedings of the ACM SIGOPS Asia-Pacific Workshop on Systems, 2020.\nSepanta Zeighami and Cyrus Shahabi. On distribution dependent sub-logarithmic query time of learned\nindexing. InProceedings of the International Conference on Machine Learning, 2023.\nSepanta Zeighami and Cyrus Shahabi. Theoretical analysis of learned database operations under distribution\nshift through distribution learnability. InProceedings of the 41st International Conference on Machine\nLearning, 2024.\n16\n\nPublished in Transactions on Machine Learning Research (10/2025)\nA Proofs\nHere, we give the proofs omitted in the main paper. In Section A.1, we give the proof of Theorem 3.1,\nwhich is important for proving the worst-case complexity of PCF Learned Sort. Section A.2 and Section A.3\ngive proofs of Theorem 3.3 and Theorem 3.4, respectively, which are important for proving the expected\ncomputational complexity of PCF Learned Sort. The quantization-aware version of Theorem 3.4 and Theo-\nrem 3.6 is defined and the proof is given in the Section A.4. Finally, we provide the proofs of the theorems\nguaranteeing the complexity of Spline Learned Sort in Section A.5.\nA.1 Proof of Theorem 3.1\nProof.LetP(n)be the worst-case complexity of our Learned Sort when using the model-based bucketing\nalgorithmMas assumed in Theorem 3.1 andδ=⌊nd⌋. LetS(n)be the worst-case complexity of the\nstandard sort andR(n)be the worst-case complexity of model-based bucketing (including model training\nandinferences). SinceS(n) =O(nU(n))andthestandardsortterminatesafterafinitenumberofoperations,\n∃C1,l1(>0), n≥0⇒S(n)≤C 1+l1nU(n).(3)\nSinceR(n) =O(n)andγ+ 1 =O(n),\n∃n2,l2(>0), n≥n 2⇒R(n)≤l 2n.(4)\n∃n3,l3(>0), n≥n 3⇒γ+ 1≤l 3n.(5)\nIn the following, we proveP(n) =O(nU(n) +nlog logn)by mathematical induction.\nFirst, forn<max(n 2,n3,τ) = :n0, there exists a constantC(>0)such thatP(n)≤C. That is, forn<n 0,\nour Learned Sort terminates in a finite number of operations. This is because, sinceδ <n, the bucket will\neither be smaller than the original array lengthn, or the bucket will be immediately sorted by the standard\nsort.\nNext, assume that there exists a constantC(>0)andl(>0)such thatP(n)≤C+l(nU(n) +nlog logn)\nfor alln < k, wherekis an integer such thatk≥n 0. Without loss of generality, we assume thatC≥C 1\nandl≥l 1. LetSγ,kbe the set consisting of all(γ+ 1)-dimensional vectors of positive integers whose sum\nisk, i.e.,S γ,k:=/braceleftig\ns∈Zγ\n≥0|/summationtextγ+1\ni=1si=k/bracerightig\n. Then,\nP(k)≤R(k) + max\ns∈Sγ,kγ+1/summationdisplay\ni=1/braceleftbig\n1[si≥⌊kd⌋]·S(si) +1[si<⌊kd⌋]·P(si)/bracerightbig\n≤l2k+ max\ns∈Sγ,kγ+1/summationdisplay\ni=1/braceleftbig\n1[si≥⌊kd⌋]·(C 1+l1siU(si)) +1[si<⌊kd⌋]·(C+l(s iU(si) +silog logsi))/bracerightbig\n≤l2k+ max\ns∈Sγ,kγ+1/summationdisplay\ni=1/parenleftbig\nC+lsiU(si) +lsilog logkd/parenrightbig\n≤l2k+C(γ+ 1) +lkU(k) +lklog logkd\n≤l2k+Cl 3k+lkU(k) +lklog logk+lklogd\n≤/parenleftbigg\nl2+Cl 3−llog1\nd/parenrightbigg\nk+ (C+l(kU(k) +klog logk)).(6)\nTherefore, if we takelsuch that\nl2+Cl 3\nlog1\nd≤l,(7)\nthenP(k)≤C+l(kU(k) +klog logk)(note that the left side of Equation (7) is a constant independent of\nk).\nHence, by mathematical induction, it is proved that there exists a constantC(>0)andl(>0)such that\nP(n)≤C+l(kU(k) +lklog logk)for alln∈N.\n17\n\nPublished in Transactions on Machine Learning Research (10/2025)\nA.2 Proof of Theorem 3.3\nProof.The proof approach is the same as in Theorem 3.1, but in Theorem 3.3, the “expected” computa-\ntional complexity is bounded. The following two randomnesses are considered for computing the “expected”\ncomputational complexity: (i) the randomness with whichnelements are independently sampled according\nto the probability density functionf(x)in the process of forming the input arrayx, and (ii) the randomness\nof the PCF Learned Sort algorithm samplingαelements from the input arrayxfor training the PCF.\nLetT(n)be the expected complexity of our Learned Sort when using the model-based bucketing algorithm\nMas assumed in Theorem 3.3 andδ=⌊nd⌋. LetS(n)be the expected complexity of the standard sort and\nR(n)be the expected complexity of model-based bucketing (including model training and inferences). Since\nS(n) =O(nlogn)and the standard sort terminates after a finite number of operations,\n∃C1,l1(>0), n≥0⇒S(n)≤C 1+l1nlogn.(8)\nSinceR(n) =O(n),Pr[∃j,|c j|≥⌊nd⌋] =O(1/logn), andγ+ 1 =O(n),\n∃n2,l2(>0), n≥n 2⇒R(n)≤l 2n,(9)\n∃n3,l3(>0), n≥n 3⇒Pr[∃j,|c j|≥⌊nd⌋]≤l3\nlogn,(10)\n∃n4,l4(>0), n≥n 4⇒γ+ 1≤l 4n.(11)\nIn the following, we proveT(n) =O(nlog logn)by mathematical induction.\nFirst, forn <max(n 2,n3,n4,τ) = :n0, there exists a constantC(>0)such thatT(n)≤C. That is, for\nn<n 0, our Learned Sort terminates in a finite number of operations.\nNext, assume that there exists a constantC(>0)andl(>0)such thatT(n)≤C+lnlog lognfor alln<k,\nwherekis an integer such thatk≥n 0. Then, fromk≥n 2,\nT(k)≤R(k) +E\nγ+1/summationdisplay\nj=11[|cj|≥⌊kd⌋]·S(|cj|) +1[|cj|<⌊kd⌋]·T(|cj|)\n\n≤l2k+ Pr/bracketleftbig\n∃j,|cj|≥⌊kd⌋/bracketrightbig\n·E\nγ+1/summationdisplay\nj=1S(|cj|)\n+E\nγ+1/summationdisplay\nj=11[|cj|<⌊kd⌋]·T(|cj|)\n\n≤l2k+ Pr[∃j,|c j|≥⌊kd⌋]·{C 1(γ+ 1) +l 1klogk}+E/bracketleftiggγ+1/summationdisplay\ni=1T(min(⌊kd⌋,|cj|))/bracketrightigg\n.(12)\nHere, fromk≥n 3andk≥n 4,\nPr[∃j,|cj|≥⌊kd⌋]·{C 1(γ+ 1) +l 1klogk}≤l3\nlogk·(C1l4k+l 1klogk)\n≤(C 1l3l4+l1l3)k.(13)\nAlso, from the assumption of induction andk≥n 4,\nE/bracketleftiggγ+1/summationdisplay\ni=1T(min(⌊kd⌋,|cj|))/bracketrightigg\n≤E/bracketleftiggγ+1/summationdisplay\ni=1/braceleftbig\nC+l·min(⌊kd⌋,|cj|) log log min(⌊kd⌋,|cj|)/bracerightbig/bracketrightigg\n≤E/bracketleftigg\nC(γ+ 1) +γ+1/summationdisplay\ni=1l·|cj|log log⌊kd⌋/bracketrightigg\n≤Cl 4k+lklog log⌊kd⌋\n≤Cl 4k+lklogd+lklog logk.(14)\n18\n\nPublished in Transactions on Machine Learning Research (10/2025)\nTherefore,\nT(k)≤l 2k+ (C 1l3l4+l1l3)k+Cl 4k+lklogd+lklog logk\n≤/braceleftbigg\nl2+C 1l3l4+l1l3+Cl 4−llog1\nd/bracerightbigg\nk+ (C+lklog logk).(15)\nTherefore, if we takelsuch that\nl2+C 1l3l4+l1l3+Cl 4\nlog1\nd≤l,(16)\nthenT(k)≤C+lklog logk(note that the left side of Equation (16) is a constant independent ofk).\nHence, by mathematical induction, it is proved that there exists a constantC(>0)andl(>0)such that\nT(n)≤C+lnlog lognfor alln∈N.\nA.3 Proof of Theorem 3.4\nWe first present the following lemma to prove Theorem 3.4.\nLemma A.1.Lete(∈In)be a sorted version ofx I(∈In)and∆ := (x max−xmin)/β(wherex minand\nxmaxare the minimum and maximum values ofx I, respectively).\nAlso, define the setS randTras follows (r= 1,...,n):\nSr={k|e max(1,r−δ/2) + ∆<ek≤er−∆},T r={k|er+ ∆≤ek<emin(r+δ/2,n)−∆}.(17)\nUsing this definition, defineY jr,Zjr,Yr,Zras follows (j= 1,...,α, r= 1,...,n):\nYjr=/braceleftigg\n1 (j∈S r)\n0 (else), Zjr=/braceleftigg\n1 (j∈T r)\n0 (else), Yr=α/summationdisplay\nj=1Yjr, Zr=α/summationdisplay\nj=1Zjr (18)\nWhen usingM PCF, if the size of the bucket to whiche ris allocated is greater than or equal toδ, the following\nholds:/parenleftbigg\nr≥δ\n2+ 1∧Yr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n∨/parenleftbigg\nr≤n−δ\n2∧Zr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n.(19)\nProof.We prove the contraposition of the lemma. That is, we prove thate ris allocated to a bucket smaller\nthanδunder the assumption that/parenleftig\nr<δ\n2+ 1∨Yr>/floorleftig\nα\nγ/floorrightig/parenrightig\n∧/parenleftig\nr>n−δ\n2∨Zr>/floorleftig\nα\nγ/floorrightig/parenrightig\n.\nFor convenience, we hypothetically definee 0=−∞,en+1=∞, and assigne 0to the 0th bucket ande n+1to\nthe(γ+ 2)-th bucket. The size of the 0th bucket and the(γ+ 2)-th bucket are both 1.\nFirst, we prove thate rande min(r+δ/2,n+1) are assigned to different buckets. Whenn−δ/2<r≤n,e rand\nemin(r+δ/2,n+1) =en+1are obviously assigned to different buckets. Whenr≤n−δ/2, the ID of the bucket\nto whiche ris assigned is\n⌊˜F(er)γ⌋+ 1 =/floorleftigγ\nαbi(er)/floorrightig\n+ 1\n≤γ\nαbi(er)+ 1\n=γ\nα|{j|i(aj)≤i(er)}|+ 1\n≤γ\nα|{j|aj≤er+ ∆}|+ 1.(20)\n19\n\nPublished in Transactions on Machine Learning Research (10/2025)\nThe ID of the bucket to whiche min(r+δ/2,n+1) =er+δ/2is assigned is\n⌊˜F(er+δ/2 )γ⌋+ 1 =/floorleftigγ\nαbi(er+δ/2 )/floorrightig\n+ 1\n>γ\nαbi(er+δ/2 )\n=γ\nα/vextendsingle/vextendsingle{j|i(aj)≤i(er+δ/2 )}/vextendsingle/vextendsingle\n≥γ\nα/vextendsingle/vextendsingle{j|aj≤er+δ/2−∆}/vextendsingle/vextendsingle.(21)\nThus, taking the difference between these two bucket IDs,\n/parenleftbig\n⌊˜F(er+δ/2 )γ⌋+ 1/parenrightbig\n−/parenleftbig\n⌊˜F(er)γ⌋+ 1/parenrightbig\n>γ\nα/vextendsingle/vextendsingle{j|aj≤er+δ/2−∆}/vextendsingle/vextendsingle−/parenleftigγ\nα|{j|aj≤er+ ∆}|+ 1/parenrightig\n=γ\nα/vextendsingle/vextendsingle{j|er+ ∆<aj≤er+δ/2−∆}/vextendsingle/vextendsingle−1\n=γ\nα|Tr|−1\n=γ\nαα/summationdisplay\nj=1Zjr−1\n=γ\nαZr−1\n≥0.(22)\nTherefore,e rande min(r+δ/2,n+1) are assigned to different buckets.\nIn the same way, we can prove thate max(0,r−δ/2) anderare also assigned to different buckets. Thus, the size\nof the bucket to whiche ris assigned is at mostδ−1(at most frome max(0,r−δ/2)+1 toe min(r+δ/2,n+1)−1 ),\nand the contraposition of the lemma is proved.\nUsing Theorem A.1, we can prove Theorem 3.4.\nProof.Letq= max\ny/integraltexty+∆\nyfI(x)dx(whereyis a value such that(y,y+ ∆)⊆I). Then, fromσ 1≤f(x)≤σ 2\nfor allx∈I,\nq≤maxy/integraltexty+∆\nyf(y)dy/integraltext\nIf(x)dx\n≤maxy/integraltexty+∆\nyσ2dy/integraltext\nIσ1dx\n≤σ2∆\nσ1(xmax−xmin)\n=σ2\nσ1β.(23)\nThus, whenr≥δ\n2+ 1,\nE/bracketleftbiggδ\n2−|Sr|/bracketrightbigg\n=E/bracketleftbiggδ\n2−/vextendsingle/vextendsingle{k|er−δ/2 + ∆<ek≤er−∆}/vextendsingle/vextendsingle/bracketrightbigg\n=E/bracketleftbig/vextendsingle/vextendsingle{k|er−δ/2<ek≤er−δ/2 + ∆}/vextendsingle/vextendsingle/bracketrightbig\n+E[|{k|e r−∆<ek≤er}|]\n≤nq+nq\n≤2σ2n\nσ1β.(24)\n20\n\nPublished in Transactions on Machine Learning Research (10/2025)\nThus, whenr≥δ\n2+ 1,\nE[Yr] =α\nnE[|Sr|]\n=α\nn/parenleftbiggδ\n2−E/bracketleftbiggδ\n2−|Sr|/bracketrightbigg/parenrightbigg\n≥αδ\n2n−2σ2α\nσ1β\n=αK\nγ.(25)\nHere, whenK≥1, we have\n0≤1−α\nγE[Yr]<1.(26)\nTherefore, from the Chernoff bound,\nPr/bracketleftbigg\nYr≤α\nγ/bracketrightbigg\n= Pr/bracketleftbigg\nYr≤/braceleftbigg\n1−/parenleftbigg\n1−α\nγE[Yr]/parenrightbigg/bracerightbigg\nE[Yr]/bracketrightbigg\n≤exp/braceleftigg\n−1\n2/parenleftbigg\n1−α\nγE[Yr]/parenrightbigg2\nE[Yr]/bracerightigg\n≤exp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(27)\nIn the same way, we can prove that whenr≤n−δ\n2,\nPr/bracketleftbigg\nZr≤α\nγ/bracketrightbigg\n≤exp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(28)\nThus, by definingE rto be the event “e ris allocated to a bucket with size greater than or equal toδ,” from\nTheorem A.1,\nPr[Er]≤Pr/bracketleftbigg/parenleftbigg\nr≥δ\n2+ 1∧Yr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n∨/parenleftbigg\nr≤n−δ\n2∧Zr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg/bracketrightbigg\n≤Pr/bracketleftbigg/parenleftbigg\nr≥δ\n2+ 1∧Yr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg/bracketrightbigg\n+ Pr/bracketleftbigg/parenleftbigg\nr≤n−δ\n2∧Zr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg/bracketrightbigg\n≤\n\nexp/braceleftig\n−αK\n2γ/parenleftbig\n1−1\nK/parenrightbig2/bracerightig\n,/parenleftbig\nr<δ\n2+ 1∨r>n−δ\n2/parenrightbig\n2 exp/braceleftig\n−αK\n2γ/parenleftbig\n1−1\nK/parenrightbig2/bracerightig\n,(else)\n≤2 exp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(29)\nTherefore,\nE/bracketleftiggn/summationdisplay\nr=11[Er]/bracketrightigg\n≤2nexp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n(30)\nThen, noting that the number of buckets with size greater than or equal toδis less than or equal to/summationtextn\nr=11[Er]/δ,\nE[|{j||c j|>δ}|]≤2n\nδexp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(31)\n21\n\nPublished in Transactions on Machine Learning Research (10/2025)\nThen, from Markov’s inequality, we have\nPr[∃j,|cj|>δ] = Pr[|{j||c j|>δ}|≥1]\n≤2n\nδexp/braceleftigg\n−αK\n2γ/parenleftbigg\n1−1\nK/parenrightbigg2/bracerightigg\n.(32)\nA.4 The Quantization-Aware Version of Theorem 3.4 and Theorem 3.6\nIn general, computers represent numbers in a finite number of bits, so the numbers they handle are inherently\ndiscrete. However, Theorem 3.6, which states that the expected computational complexity of PCF Learned\nSort isO(nlog logn), does not cover discrete distributions. Here, we define the quantization process by which\na computer represents numbers in finite bits and then show that the expected computational complexity of\nPCF Learned Sort is stillO(nlog logn), under the assumption that “the quantization is fine enough.”\nFirst, we assume the sampling and quantization process is as follows:\nAssumption A.2.For a range of valuesD(⊆R), definem(∈N)contiguous regionsD 1,D2,...,Dm\nsuch that (i) they are disjoint from each other and (ii) together they formD. For each region, determine\nrepresentative valuesr 1,r2,...,rm. Here,r 1,r2,...,rmare values contained inD 1,D2,...,Dm, respectively.\nFor a valuex(∈D), the quantized value ofx,x′, is obtained asx′=ri, whereiis the (only)isuch that\nx∈Di. The valuexis sampled according to the probability density functionf(x), but a computer keepsx′\n(instead ofx) inlog2mbits with some quantization error.\nAlso, for the intervalI⊆D, we defineη(I)as follows.\nDefinition A.3.η(I)is the maximum width ofD ithat intersects with intervalI, i.e.,\nη(I) := max{|D i||Di∪I̸=∅,i= 1,...,m},(33)\nwhere|Di|is the width of the rangeD i.\nWe can prove thatη(I)is the upper bound of the quantization error ofxinI, i.e.,|x−x′|≤η(I)when\nx∈I.\nNow, the assumption that the quantization is “fine enough” is specifically defined as follows.\nAssumption A.4.(Recall that our PCF Learned Sort recursively calls its own algorithm. Each time of\nrecursion, the range of values of interestIchanges, and the length of the array of interestnalso changes.)\nFor allIandnthat appear in the algorithm, the following holds:\nβη(I)\n|I|≤1\n2.(34)\nWe show intuitively and empirically that this is a satisfactory assumption.\nFirst, to show intuitively that this assumption is satisfactory, we give an example. LetIbe a range of values\nthat can be represented by a 64-bit double (1 bit for the sign, 11 bits for the exponent part, and 52 bits for\nthe mantissa part), that is,I= [−1.79×10308,1.79×10308]. The quantization is performed by mapping each\nvalue to the nearest number that can be represented by a 64-bit double. In this setting,η(I) = 1.99×10292,\n|I|= 3.59×10308.η(I)/|I|= 5.55×10−17. Thus, for usualβ,β≤9×1015, Equation (34) holds.\nSecond, we show that Equation (34) is a satisfactory assumption empirically. In the 1,280 measurements,\nwhere 10 measurements each for 16 differentn(∈{103,2×103,5×103,...,108})on 8 different datasets,\n5.23×107pairs of(I,β)appeared (we setβ=/floorleftbig\nn3/4/floorrightbig\n), and the left side of Equation (34) is at most\n8.11×10−9, indicating that Equation (34) is always true with a margin.\nUnder this definition and assumption about quantization, we can prove the quantization-aware version of\nTheorem 3.4.\n22\n\nPublished in Transactions on Machine Learning Research (10/2025)\nLemma A.5(Quantization-aware version of Theorem 3.4).Letσ 1andσ 2be respectively the lower and\nupper bounds of the probability density distributionf(x)inD, and assume that0<σ 1≤σ2<∞. That is,\nx∈D ⇒σ 1≤f(x)≤σ 2. Also, letx′\nIbe the array created by the quantization ofx(∈In)in the manner\ndefined in Theorem A.2.\nThen, in model-based bucketing ofx′\nI(∈In)to{cj}γ+1\nj=1usingM PCF, the following holds for any interval\nI(⊆D)under Theorem A.4:\nK:=γδ\n2n−4σ2γ\nσ1β≥1⇒Pr[∃j,|c j|>δ]≤2n\nδexp/braceleftigg\n−αK′\n2γ/parenleftbigg\n1−1\nK′/parenrightbigg2/bracerightigg\n.(35)\nThe proof of Theorem A.5 is done in the same way as Theorem 3.4. That is, we first prove the following\nlemma.\nLemma A.6(Quantization-aware version of Theorem A.6).Lete′(∈In)be a sorted version ofx′\nI(∈In)\nand∆ := (x′\nmax−x′\nmin)/β(wherex′\nminandx′\nmaxare the minimum and maximum values ofx′\nI, respectively).\nAlso, define the setS′\nr,T′\nras follows (r= 1,...,n):\nS′\nr={k|e max(1,r−δ/2) + ∆ + 2η(I)<e k≤er−∆−2η(I)},(36)\nT′\nr={k|er+ ∆ + 2η(I)≤e k<emin(r+δ/2,n)−∆−2η(I)}.(37)\nUsing this definition, defineY′\njr,Z′\njr,Y′\nr,Z′\nras follows (j= 1,...,α, r= 1,...,n):\nY′\njr=/braceleftigg\n1 (j∈S′\nr)\n0 (else), Z′\njr=/braceleftigg\n1 (j∈T′\nr)\n0 (else), Y′\nr=α/summationdisplay\nj=1Y′\njr, Z′\nr=α/summationdisplay\nj=1Z′\njr.(38)\nIf the size of the bucket to whiche′\nris allocated is greater than or equal toδ, then the following holds:\n/parenleftbigg\nr≥δ\n2+ 1∧Y′\nr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n∨/parenleftbigg\nr≤n−δ\n2∧Z′\nr≤/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n.(39)\nProof.The proof method is exactly the same as for Theorem A.1. That is, by taking the difference between\nthe IDs of the buckets to whiche′\nr+δ/2ande′\nrare assigned,\n/parenleftig\n⌊˜F(e′\nr+δ/2 )γ⌋+ 1/parenrightig\n−/parenleftbig\n⌊˜F(e′\nr)γ⌋+ 1/parenrightbig\n>γ\nα/vextendsingle/vextendsingle{j|aj≤er+δ/2−∆−2η(I)}/vextendsingle/vextendsingle−/parenleftigγ\nα|{j|aj≤er+ ∆ + 2η(I)}|+ 1/parenrightig\n=γ\nα/vextendsingle/vextendsingle{j|er+ ∆ + 2η(I)<a j≤er+δ/2−∆−2η(I)}/vextendsingle/vextendsingle−1\n=γ\nαZ′\nr−1\n≥0,(40)\nwhenZ′\nr>/floorleftig\nα\nγ/floorrightig\n. Thus, we can prove that when\n/parenleftbigg\nr<δ\n2+ 1∨Y′\nr>/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n∧/parenleftbigg\nr>n−δ\n2∨Z′\nr>/floorleftbiggα\nγ/floorrightbigg/parenrightbigg\n(41)\nholds,e′\nr+δ/2ande′\nrare assigned to the different bucket ande′\nr−δ/2ande′\nrare assigned to the different\nbucket. Then, the contraposition of the lemma is proved.\nUsing Theorem A.6, we can prove Theorem A.5.\n23\n\nPublished in Transactions on Machine Learning Research (10/2025)\nProof.Letq′= max\ny/integraltexty+∆2η(I)\nyfI(x)dx(whereyis a value such that(y,y+ ∆ + 2η(I)⊆I). Then, from\nσ1≤f(x)≤σ 2for allx∈I,\nq′≤maxy/integraltexty+∆+2η(I)\nyf(y)dy/integraltext\nIf(x)dx\n≤maxy/integraltexty+∆+2η(I)\nyσ2dy/integraltext\nIσ1dx\n=σ2(∆ + 2η(I))\nσ1(x′max−x′\nmin)\n≤σ2\nσ1β·/parenleftbigg\n1 +2βη(I)\n|I|/parenrightbigg\n≤2σ2\nσ1β.(42)\nThe last inequality is obtained by Theorem A.4.\nThus, whenr≥δ\n2+ 1,\nE/bracketleftbiggδ\n2−|S′\nr|/bracketrightbigg\n=E/bracketleftbiggδ\n2−/vextendsingle/vextendsingle{k|er−δ/2 + ∆ + 2η(I)<e k≤er−∆−2η(I)}/vextendsingle/vextendsingle/bracketrightbigg\n=E/bracketleftbig/vextendsingle/vextendsingle{k|er−δ/2<ek≤er−δ/2 + ∆ + 2η(I)}/vextendsingle/vextendsingle/bracketrightbig\n+E[|{k|e r−∆−2η(I)<e k≤er}|]\n≤nq′+nq′\n≤4σ2n\nσ1β.(43)\nThus, whenr≥δ\n2+ 1,\nE[Y′\nr] =α\nnE[|S′\nr|]\n=α\nn/parenleftbiggδ\n2−E/bracketleftbiggδ\n2−|S′\nr|/bracketrightbigg/parenrightbigg\n≥αδ\n2n−4σ2α\nσ1β\n=αK′\nγ.(44)\nFrom this point forward, by proceeding in exactly the same way as the proof of Theorem 3.4, we can prove\nthe following using Theorem A.1:\nK′≥1⇒Pr[∃j,|c j|>δ]≤2n\nδexp/braceleftigg\n−αK′\n2γ/parenleftbigg\n1−1\nK′/parenrightbigg2/bracerightigg\n.(45)\nUsing Theorem A.5, we can prove the following theorem.\nTheorem A.7(Quantization-aware version of Theorem 3.6).Letσ 1andσ 2be the lower and upper bounds,\nrespectively, of the probability density distributionf(x)inD, and assume that0< σ 1≤σ 2<∞. Also,\nassume that the input array is quantized in a way that satisfies Theorem A.2 and Theorem A.4. Then, the\nexpected complexity of PCF Learned Sort withM PCFas the bucketing method andα=β=γ=δ=⌊n3/4⌋\nisO(nlog logn).\n24\n\nPublished in Transactions on Machine Learning Research (10/2025)\nProof.Whenα=β=γ=⌊n3/4⌋, the computational complexity for model-based bucketing isO(n). Since\nK′= Ω(√n)whenα=β=γ=δ=⌊n3/4⌋,K′≥1for sufficiently largen, and\n2n\nδexp/braceleftigg\n−αK′\n2γ/parenleftbigg\n1−1\nK′/parenrightbigg2/bracerightigg\n=O(n1\n4exp(−√n))≤O/parenleftbigg1\nlogn/parenrightbigg\n.(46)\nTherefore, from Theorem 3.3 and Theorem A.5, the expected computational complexity of PCF Learned\nSort isO(nlog logn).\nA.5 Proofs for Spline Learned Sort\nDefinition of Spline Learned Sort.We now formally defineSpline Learned Sort, which we propose as\na variant of PCF Learned Sort. In particular, Spline Learned Sort replacesM PCF—the bucketing method\nthat uses PCF as the CDF model—withM Spline, a bucketing method based on a spline-based CDF model.\nBelow, we give a rigorous description ofM Spline.\nThe training algorithm of the CDF model inM Splineis the same as inM PCF. That is, the parameters\nα,β∈Nare determined byn. Then, following this setting, we sample an arrayaof lengthαfrom the input\narrayx, which is subsequently bin-counted (as described in Section 3.3).\nFor later explanation and proofs, we introduce additional terminology. We define the vector of thresholds\nused for counting ast∈Rβ+2:ti=x min+ (x max−xmin)(i−1)/βfori= 1,2,...,β+ 2. Thus, thei-th\nbin during CDF model training corresponds to the interval[t i,ti+1). Accordingly, the non-decreasing, non-\nnegative arraybformed by bin-counting is given byb i=|{j∈{1,...,α}|a j<ti+1}|fori= 1,2,...,β+ 1.\nWealsodenotebyF a(x)theempiricalCDFofthesampledarraya:F a(x) =|{j∈{1,2,...,α}|a j≤x}|/α.\nThe inference algorithm of the CDF model inM Splineis similar to but slightly different from that in\nMPCF. In PCF, the prediction is constant within each interval[t i,ti+1). In contrast, in the spline-based\ncase, the prediction is obtained by linearly interpolating the empirical CDF values at the endpoints of\nthe interval. Specifically, the output ˜F(x)for inputxis obtained as follows. As in PCF, we compute\ni(x) =/floorleftig\n(x−x min)β\nxmax−xmin/floorrightig\n+ 1, so thatx∈[t i(x),ti(x)+1 ). While PCF returnsF a(ti(x)+1 ) =bi(x)/αas the CDF\nprediction, the spline-based method linearly interpolates betweenF a(ti(x))andF a(ti(x)+1 ):\n˜F(x) =F a(ti(x)) +x−ti(x)\nti(x)+1−ti(x)·(Fa(ti(x)+1 )−F a(ti(x)))(47)\n=1\nα/parenleftbigg\nbi(x)−1 +x−ti(x)\nti(x)+1−ti(x)·(bi(x)−bi(x)−1 )/parenrightbigg\n,(48)\nwithb 0= 0.\nUnlike PCF, which only considers which bin a value falls into, the spline-based method also accounts for\nthe relative position of the value within the bin to compute the predicted CDF ˜F(x). The asymptotic\ncomputational complexity for training and inference is the same as PCF:O(n)for training andO(1)per\nelement for inference. However, unlike PCF (which only requires array lookups), the spline-based approach\nrequires additional subtractions and multiplications during inference, leading to a larger constant factor in\nruntime.\nTheorems Guaranteeing the Complexity of Spline Learned Sort.WhenM Splineis used as the\nbucketing method in our learned sort framework, the same complexity guarantees as in PCF Learned Sort\nhold. Inparticular, weobtainthefollowingworst-caseguarantee(TheoremA.8)andexpected-caseguarantee\n(Theorem A.9).\nTheoremA.8(SplineversionofTheorem3.5).IfM Splineis the bucketing method, the worst-case complexity\nof the standard sort isO(nU(n))(whereU(n)is a non-decreasing function), andα=β=γ=δ=⌊n3/4⌋,\nthen the worst-case complexity of Spline Learned Sort isO(nU(n) +nlog logn).\nProof.The proof is identical to that of Theorem 3.5, using Theorem 3.1.\n25\n\nPublished in Transactions on Machine Learning Research (10/2025)\nTheorem A.9(Spline version of Theorem 3.6).Letσ 1andσ 2be the lower and upper bounds, respectively,\nof the probability densityf(x)onD, and assume0< σ 1≤σ 2<∞. IfM Splineis the bucketing method,\nthe expected complexity of the standard sort isO(nlogn), andα=β=γ=δ=⌊n3/4⌋, then the expected\ncomplexity of Spline Learned Sort isO(nlog logn).\nTo prove this theorem, we first establish the following lemma.\nLemma A.10(Spline version of Theorem A.1).Definee,S r,Tr,Yjr,Zjr,Yr,Zrexactly as in Theorem A.1\n(j= 1,...,α, r= 1,...,n). That is, lete∈Inbe the sorted version ofx I∈Inand set∆ := (x max−xmin)/β\n(wherex minandx maxare the minimum and maximum values ofx I, respectively). Also define\nSr={k|e max(1,r−δ/2) + ∆<ek≤er−∆},T r={k|er+ ∆≤ek<emin(r+δ/2,n)−∆},(49)\nand\nYjr=/braceleftigg\n1 (j∈S r)\n0 (otherwise), Zjr=/braceleftigg\n1 (j∈T r)\n0 (otherwise), Yr=α/summationdisplay\nj=1Yjr, Zr=α/summationdisplay\nj=1Zjr.(50)\nWhen usingM Spline, if the size of the bucket to whiche ris assigned is at leastδ, then the same condition\nas in Equation(19)holds; namely,\n/parenleftig\nr≥δ\n2+ 1∧Yr≤/floorleftig\nα\nγ/floorrightig/parenrightig\n∨/parenleftig\nr≤n−δ\n2∧Zr≤/floorleftig\nα\nγ/floorrightig/parenrightig\n.(51)\nProof.The proof proceeds exactly as in Theorem A.1, by contraposition. That is, assume/parenleftig\nr<δ\n2+ 1∨Yr>⌊α\nγ⌋/parenrightig\n∧/parenleftig\nr>n−δ\n2∨Zr>⌊α\nγ⌋/parenrightig\n, and prove thate ris assigned to a bucket smaller\nthanδ.\nFirst, we show thate rande min(r+δ/2,n+1) are assigned to different buckets. As in the proof of Theorem A.1,\nthe casen−δ/2<r≤nis immediate; hence we focus onr≤n−δ/2. The bucket ID ofe ris⌊˜F(er)γ⌋+ 1,\nwhile that ofe r+δ/2is⌊˜F(er+δ/2 )γ⌋+1. By the definition of the spline-based CDF model and the inequalities\nti(er)+1≤er+ ∆, ti(er+δ/2 )≥er+δ/2−∆, we obtain\n˜F(er)≤F a(ti(er)+1) =1\nα/vextendsingle/vextendsingle{j|aj≤ti(er)+1}/vextendsingle/vextendsingle≤1\nα|{j|aj≤er+ ∆}|,(52)\n˜F(er+δ/2 )≥F a(ti(er+δ/2 )) =1\nα/vextendsingle/vextendsingle/vextendsingle{j|aj≤ti(er+δ/2 )}/vextendsingle/vextendsingle/vextendsingle≥1\nα/vextendsingle/vextendsingle{j|aj≤er+δ/2−∆}/vextendsingle/vextendsingle.(53)\nHence, their bucket IDs satisfy\n⌊˜F(er)γ⌋+ 1≤γ\nα|{j|aj≤er+ ∆}|+ 1,(54)\n⌊˜F(er+δ/2 )γ⌋+ 1>γ\nα/vextendsingle/vextendsingle{j|aj≤er+δ/2−∆}/vextendsingle/vextendsingle,(55)\nwhich are identical to Equations (20) and (21). Thus,\n/parenleftbig\n⌊˜F(er+δ/2 )γ⌋+ 1/parenrightbig\n−/parenleftbig\n⌊˜F(er)γ⌋+ 1/parenrightbig\n>0,(56)\nand hencee rander+δ/2are assigned to different buckets.\nBy a symmetric argument,e max(0,r−δ/2) anderare also assigned to different buckets. Therefore, the bucket\ncontaininge rhas size at mostδ−1, completing the contraposition.\nFrom Lemma A.10, we obtain the following theorem.\nTheorem A.11(Spline version of Theorem 3.4).Letσ 1andσ 2be the lower and upper bounds of the\nprobability densityf(x)onD, and assume0<σ 1≤σ2<∞(i.e.,σ 1≤f(x)≤σ 2for allx∈D). Then, in\nmodel-based bucketing ofx I∈Ininto{cj}γ+1\nj=1usingM Spline, the following holds for any intervalI⊆D:\nK:=γδ\n2n−2σ2γ\nσ1β≥1⇒Pr[∃j,|c j|>δ]≤2n\nδexp/braceleftbigg\n−αK\n2γ/parenleftbig\n1−1\nK/parenrightbig2/bracerightbigg\n.(57)\nProof.The proof is identical to that of Theorem 3.4, using Lemma A.10.\n26\n\nPublished in Transactions on Machine Learning Research (10/2025)\nTable 1: Statistics of real-world datasets used in our experiments.\nDataset Size # Unique Values % of Duplicates\nChicago [Start] (Chicago, 2021) 39,588,772 216,610 99.45\nChicago [Tot] (Chicago, 2021) 39,199,154 6,887 99.98\nNYC [Pickup] (nyc, 2020) 100,000,000 26,666,741 73.33\nNYC [Dist] (nyc, 2020) 200,107,656 2,060 100.00\nNYC [Tot] (nyc, 2020) 199,964,459 7,428 100.00\nSOF [Humidity] (Mavrodiev, 2019) 96,318,228 8,128 99.99\nSOF [Pressure] (Mavrodiev, 2019) 96,317,180 862,502 99.10\nSOF [Temperature] (Mavrodiev, 2019) 96,432,856 5,638 99.99\nWiki (Marcus et al., 2020) 200,000,000 90,437,011 54.78\nOSM (Marcus et al., 2020) 800,000,000 799,469,195 0.07\nBooks (Marcus et al., 2020) 800,000,000 799,994,961 0.00\nFace (Marcus et al., 2020) 199,998,000 199,998,000 0.00\nStocks [Volume] (Onyshchak, 2020) 27,596,686 325,654 98.82\nStocks [Open] (Onyshchak, 2020) 27,596,686 830,758 96.99\nStocks [Date] (Onyshchak, 2020) 27,596,686 14,646 99.95\nStocks [Low] (Onyshchak, 2020) 27,596,686 863,701 96.87\nFinally, using Theorem A.11, we can prove Theorem A.9.\nProof of Theorem A.9.The proof follows exactly the same steps as Theorem 3.6, applying Theorem A.11 to\nTheorem 3.3.\nB Real Dataset Details\nIn the main text, we provided only a concise list of the real datasets used in our experiments. Here we\ndescribe each dataset in more detail.\n•Chicago [Start, Tot]: The Chicago Taxi Trips dataset includes taxi trips reported to the City of\nChicago in its role as a regulatory agency over the last six years. The data to be sorted includes\ntrip starting timestamps and total fare amounts.\n•NYC [Pickup, Dist, Tot]: The New York City yellow taxi trip dataset includes trip pickup\ndatetimes, trip distances, and total fare amounts.\n•SOF [Humidity, Pressure, Temperature]: The Sofia dataset contains time-series air quality\nmetrics (humidity, pressure, and temperature) measured at 1-minute intervals from outdoor sensors\nin Sofia, Bulgaria.\n•Wiki: The Wikipedia dataset contains article edit timestamps (Marcus et al., 2020).\n•OSM:UniformlysampledOpenStreetMaplocationsrepresentedasGoogleS2CellIds(Marcusetal.,\n2020).\n•Books: Book sale popularity data from Amazon (Marcus et al., 2020).\n•Face: The FB dataset contains an upsampled set of Facebook user IDs obtained via random walks\non the FB social graph (Marcus et al., 2020). As in (Kristo et al., 2021a; Ferragina & Odorisio,\n2025), the outliers greater than the 0.99999 quantile are discarded.\n•Stocks [Volume, Open, Date, Low]: The Stocks dataset contains historical daily opening, low\nprices, trading volumes, and dates for all NASDAQ tickers (stocks and ETFs), retrieved via the\nyfinance Python package up to April 1, 2020.\n27\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure 5: Time to sort the array in adversarial environments. Below each graph is a histogram that visualizes\nthe distribution of each dataset. The standard deviation of the10measurements is represented by the shaded\narea.\nFurthermore, the detailed statistics of these datasets, including their sizes, the number of unique values,\nand the percentage of duplicates, are summarized in Table 1. The percentage of duplicates is computed\nas100×/parenleftig\n1−|unique_values|\nn/parenrightig\n, wherenis the total number of elements andunique_valuesis the set of\ndistinct elements. In particular, for several datasets (Chicago [Start, Tot], NYC [Dist, Tot], SOF [Humidity,\nPressure, Temperature], and Stocks [Volume, Open, Date, Low]), the number of unique values is extremely\nsmall, accounting for less than 3.2% of the total elements.\nC Experiments in Adversarial Environments\nTo evaluate the robustness of our Learned Sort, we conducted experiments under adversarially constructed\ninputs that explicitly violate the assumptions of Theorem 3.3. Specifically, given an original dataset of size\nn, we injectednduplicate elements of a randomly chosen value inside the range[x min,xmax], wherex minand\nxmaxis the minimun and maximum value of the input arrayx. As a result, the array length doubled to2n,\nand the constructed distribution contained a point mass of probability one-half, leading to a huge probability\ndensity at that value. This setting intentionally breaks the assumptionσ 2<∞required in Theorem 3.3.\n28\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure 5 reports the sorting time on such adversarial datasets. The results show that the expected bound\nofO(nlog logn)for our PCF Learend Sort no longer holds once the assumptions are violated, and the\nperformance of PCF Learned Sort occasionally degrades to the level ofstd::sort. However, we consistently\nobservedthatPCFLearnedSortneverexceededtheworst-casecomplexityofO(nlogn), andthusitsruntime\nremained comparable tostd::sort.\nOn the other hand, we found that Learned Sort 2.0 (Kristo et al., 2021b), which hasO(n2)worst-case\ncomplexity, sometimes exhibited severe slowdowns. For example, on data of sizen= 105sampled from\na Normal distribution with injected duplicates, the sorting time of Learned Sort 2.0 reached up to 10.89\nseconds, whereas PCF Learned Sort required at most 0.021 seconds.\nWe also found that BLS, ULS, and Learned Sort 2.1 (Ferragina & Odorisio, 2025), which also haveO(n2)\nworst-case complexity, sometimes exhibited substantial performance degradation. For example, on data of\nsizen= 106sampled from a Normal distribution with injected point masses, Learned Sort 2.1 took up to\n0.154 seconds, compared with 0.042 seconds for PCF Learned Sort and 0.078 seconds forstd::sort.\nThese results highlight the fragility of sorting algorithms without strong worst-case complexity guarantees, a\nlimitationsharedbymanyexistinglearnedsortingalgorithms. Theyunderscoretheimportanceofdeveloping\nlearned sorting algorithms—such as our PCF Learned Sort—that combine practical efficiency with rigorous\nworst-case complexity guarantees.\nD Runtime Profiling\nTo better understand the practical behavior of PCF Learned Sort, we profiled the runtime of its major\ncomponents: (i) model training, (ii) bucketing, (iii) standard sort applied to buckets that are too small\n(<τ), and (iv) standard sort applied to buckets that are too large (≥δ). The results are shown in Figure 6.\nForsmallinputsizesn, themajorityoftheruntimeistypicallyspentonapplyingthestandardsorttobuckets\nsmaller thanτ. Asnincreases, the relative cost shifts, and most of the runtime is instead consumed by the\nbucketing stage. Model training remains consistently lightweight, comparable to or faster than bucketing,\nand never exceeds roughly one quarter of the total runtime. Thus, training does not become the dominant\nfactor in practice.\nFigure7showstheresultsforadversariallyclusteredinputs(asdescribedinSectionC).Undertheadversarial\nsetting, the bucketing algorithm more frequently produces large buckets, which are then handled by standard\nsort. In these cases, a larger fraction of the runtime is attributed to this fallback mechanism.\nOverall, these analyses clarify which components of PCF Learned Sort dominate the runtime under different\nconditions. They also highlight that the algorithm adapts gracefully: training and bucketing scale well, while\nthe worst-case fallback ensures robustness without catastrophic slowdowns.\n29\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure 6: Breakdown of runtime components in PCF Learned Sort. The total runtime is decomposed into\n(i) model training, (ii) bucketing, (iii) standard sort applied to buckets smaller thanτ, and (iv) standard\nsort applied to buckets larger thanδ.\n30\n\nPublished in Transactions on Machine Learning Research (10/2025)\nFigure 7: Breakdown of runtime components in PCF Learned Sort in adversarial environments. The total\nruntime is decomposed into (i) model training, (ii) bucketing, (iii) standard sort applied to buckets smaller\nthanτ, and (iv) standard sort applied to buckets larger thanδ.\n31",
  "textLength": 87240
}