{
  "paperId": "b77a705565304067d3cd1db53a7016566d4f45c3",
  "title": "ILX: Intelligent \"Location+X\" Data Systems (Vision Paper)",
  "pdfPath": "b77a705565304067d3cd1db53a7016566d4f45c3.pdf",
  "text": "ILX: Intelligent \"Location+X\" Data Systems (Vision Paper)\nWalid G. Aref1, Ahmed M. Aly2, Anas Daghistani3, Yeasir Rayhan1, Jianguo Wang1, Libin Zhou1\n1Purdue University, West Lafayette, IN, USA\n2Meta Platforms, Menlo Park, CA, USA\n3Umm Al-Qura University, Mecca, Saudi Arabia\n1{aref, yrayhan, csjgwang, zhou822}@purdue.edu,2aaly@fb.com,3ahdaghistani@uqu.edu.sa\nABSTRACT\nDue to the ubiquity of mobile phones and location-detection devices,\nlocation data is being generated in very large volumes. Queries and\noperations that are performed on location data warrant the use of\ndatabase systems. Despite that, location data is being supported in\ndata systems as an afterthought. Typically, relational or NoSQL data\nsystems that are mostly designed with non-location data in mind\nget extended with spatial or spatiotemporal indexes, some query op-\nerators, and higher level syntactic sugar in order to support location\ndata. The ubiquity of location data and location data services call\nfor systems that are solely designed and optimized for the efficient\nsupport of location data. This paper envisions designing intelligent\nlocation+X data systems, ILX for short, where location is treated as\na first-class citizen type. ILX is tailored with location data as the\nmain data type (location-first). Because location data is typically\naugmented with other data types X, e.g., graphs, text data, click\nstreams, annotations, etc., ILX needs to be extensible to support\nother data types X along with location. This paper envisions the\nmain features that ILX should support, and highlights research\nchallenges in realizing and supporting ILX.\nCCS CONCEPTS\n•Information systems →Database design and models ;Lo-\ncation based services ;Geographic information systems ;Database\nmanagement system engines ;Database query processing .\nKEYWORDS\nmachine learning-based location+X system, intelligent location\nservers, extensible location-based server, query processing, index-\ning\n1 INTRODUCTION\nLocation data is ubiquitous due to the popularity of smart phones\nand location-detection devices. Moreover, location data services\nare getting into almost all aspects of life, and are getting very\nsophisticated. This warrants designing data systems that are well-\noptimized for handling and processing location data, and that treat\nlocation data as a first-class citizen. Unfortunately, this is not the\ncase. Location data is almost always supported in data systems as an\nafterthought. Typically, systems that are originally optimized with\nother objectives in mind eventually get extended to support location\ndata as an afterthought. For example, consider the many extensions\nof relational data systems to support location data. These systems\nare designed and are optimized to efficiently support relational\ndata with location data being an afterthought add-on feature. Other\nexamples include NoSQL and big data systems, e.g., Hadoop, Spark,\netc., that are designed with other objectives in mind, and withlocation data either being entirely out of the picture, or is supported\nas an add-on after the fact. Afterwards, researchers try to fit location\ndata into these systems, and possibly apply some tweaks with sub-\noptimal extensions to support location data into these systems.\nContrast this with designing a system that is mainly optimized\nfrom the beginning to support location data as first-class citizen. A\nstrong analogy would be when starting from a car and tweaking\nits design to make it fly vs. designing an airplane from scratch,\nor starting from a helicopter and extending its design to make it\nfunction as a submarine in addition to being a helicopter. While\nthese extensions are possible given good engineering and resources,\nthey would not perform as efficient as an airplane or a submarine\nthat are designed from scratch as such.\nNot to pick on any other researchers, the first author lists only the\nsystems that his group has developed that follow that same pitfall\nabove, e.g., AQWA [ 17] that extends on Hadoop [ 101], Location-\nSpark [ 108] that extends on Spark [ 122], Tornado/SWARM [ 34,75]\nthat extends over Apache Storm [ 6], SP-GiST [ 20] that extends Post-\ngreSQL [ 105], and GRFusion [ 50,51] that extends over VoltDB [ 106].\nClearly, Hadoop, Spark, Spark, PostgreSQL, and VoltDB have been\noriginally optimized for non-location data. Many other researchers\nand industries follow the same paths with some notable successes,\ne.g., Oracle Spatial [12], Spatial Hadoop [43], and GeoSpark [119].\nIn recent years, in two keynote talks, the first author of this\npaper has been advocating for Location+X systems [ 18,19] that\nhighlight several research challenges and potential solutions for\nlocation-first systems that are to be augmented with other X data\ntypes, e.g., graphs, text, and relational data. This paper extends\nbeyond the ideas in the two keynotes [ 18,19], and presents the\nvision for Intelligent Location+ Xsystems, ILX, for short. The pa-\nper highlights the main features of ILX, and identifies important\nresearch challenges in realizing it. Notice that there are already\nexisting research that supports ILX-like \"location-first\" vision in\nsome aspects. This paper helps identify and references these efforts\nwhenever appropriate and as space permits.\n2 HIGHLIGHTS OF ILX\nILX stands for Intelligent Location+X systems. In this section, we\nhighlight each of the components of ILX, mainly the Location-first,\nIntelligence, and Extensibility components, and discuss the features\nthat ILX and its surrounding eco-system should support.\n2.1 The \"L\" in ILX: Location\nLocation and Location + Time are first-class citizens in ILX. In\naddition to being optimized for operating on location data, ILX\nand its supporting eco-system will provide the following important\nhigh-level location-based features.arXiv:2206.09520v2  [cs.DB]  2 Aug 2022\n\nWalid G. Aref1, Ahmed M. Aly2, Anas Daghistani3, Yeasir Rayhan1, Jianguo Wang1, Libin Zhou1\n2.1.1 Protection, Privacy, and the Right to be Forgotten of\nUser’s Location Data. ILX should guarantee the privacy of user’s\nlocation data, e.g., as in [ 52,97,123]. Users should be able to learn\nand control what ILX knows about them. More generally, ILX should\nsupport the General Data Protection Regulation ( GDPR [8]). Pri-\nvacy and protection of user data and the right to be forgotten should\nbe declaratively and intrinsically associated with location data in\nILX and should not be left to the applications to enforce. Lower-\nlevel layers of ILX should be able to enforce these features, and the\nuser should be able to audit and verify how her/his data is being\nused and the time it should expire from the system.\nILX should prevent snooping data by implementing an end-to-\nend encryption technique. Also, ILX should not allow users to track\nthe locations of individuals. ILX should guarantee to only return\nquery answers that cannot be used to reveal the identity of any user\nof her/his location. Moreover, an intelligent mechanism should be\nimplemented in ILX to detect and block users that are trying to\ntrack other users or reveal their identity.\n2.1.2 Discovery, Integration, and Pricing of Location Data.\nILX should be able to support location data lakes [ 110] and identify\nrelevant location datasets [ 38,46] given user requests. ILX should\nsupport location data integration of the discovered datasets. Query\nissuers in ILX may not worry about which data set to use to answer\na certain query. Thus, ILX’s query language should have embedded\nin it the dataset discovery process. However, what users should\nbe concerned with is the cost of answering their query. Location\ndata collection and preparation is costly. Thus, the query execu-\ntion engine and query optimizer for ILX should have cost of data\nand pricing as an optimization parameter while generating query\nplans and while discovering and selecting the appropriate location\ndatasets needed to answer location-driven queries.\n2.1.3 Location Data Cleaning and Support for Uncertainty.\nLike all other data sources, location data contains many errors and\nneeds cleaning. The ILX eco-system should provide cleaning tools\nfor location data, especially the ones uniquely related to location\ndata, e.g., the faulty geographic colocation of two shopping stores\nin the same location and in the same time duration.\nIn addition to cleaning location data from data entry mistakes,\nlocation data is inherently uncertain, e.g., due to accuracy errors\nin location-detection devices. ILX’s query language and execution\nengine should deal with the uncertainty in location data and provide\nquery operators that reason given the uncertainty [102].\n2.1.4 Location Data Transactional and Online Analytics\nSupport. ILX should offer transactional support due to the heavy\nupdate nature of location and related data, e.g., due to objects\ncontinuously changing their locations and changing the associ-\nated data. Moreover, ILX should be able to perform online analyt-\nics [54,85,98,116,118], especially ones that are unique to location\ndata. Finally, because geospatial data is hierarchical in nature (both\nin space and time), ILX should support hierarchical and multi-\nresolution analytics both in the space and time dimensions.\n2.1.5 Human-in-the-loop and Crowdsourcing. Many transac-\ntions in ILX will involve human actions [ 44]. Thus, ILX should\nnatively support Human-in-the-loop, humans-as-query-operatorsin location-based query evaluation pipelines, and humans as opera-\ntors in long-standing transactions. ILX should protect the location\nprivacy of crowdsourcing workers and tasks, e.g,. as in [111].\n2.1.6 Sampling, Predication, and Approximate Location-\ndata Processing. Given the massive sizes of location data and\ndemands from location-service for online responses, it may not\nbe feasible to process all location data made available for a given\ntask in a timely fashion. Location-data sampling and approximate\nquery processing techniques should be an integral component of\nILX’s query execution engine. Tradeoffs between the approxima-\ntion quality and the runtime requirements of the location service\ntasks should be well-studied in the context of ILX.\n2.1.7 The Time Dimension, Data Streaming, and Continu-\nous Data Support. In ILX, the time line can be split into three\ntime zones: the past time, the current time (Time NOW), and the\nfuture time. ILX should be able to support all three notions of time.\nPast-time Data . Past-time data reflects historical location data.\nILX should be able to store, update, and query historical location\ndata. Workloads in past-time location data are mainly analytical\nquery workloads. One good example of this category is the historical\nlocation data that is in the form of moving object trajectories that\nhave taken place in the past. ILX should be able to handle these\nhistorical location data natively.\nCurrent-time Data. Current-time data is continuously arriving\ndata that reflects what is happening in the time NOW. The workload\nis heavy in updates to ingest all location data updates that reflect\nchanges of objects’ locations over time. The workload of current-\ntime data is also heavy in reads in support of continuous queries\n(that mainly continuously probe current-time data to check current\nstatus). Thus, ILX should be able to handle current-time location\ndata workloads that are heavy in both updates and in continuous\nand snapshot analytics.\nFuture Time. ILX should be able to support future prediction\ntype of location data. This is useful for what-if scenarios, decision\nsupport, and prediction analytical workloads.\n2.1.8 3D and 4D Data Support Beyond GeoLocation Data.\nILX will support spatial data beyond geolocation data. For example,\nbrain data atlases, connectivity networks, and brain simulations [ 47]\nare non-geolocation data that fall perfectly within the scope of ILX.\nSimilarly, geolocation data contains 3D and 4D data, e.g., terrain\ndata and simulations of flood over terrain data. ILX dimensionality\nshould extend to support these scenarios.\n2.1.9 Visualization. ILX will provide a suite of visualization\ntools that are tightly-integrated into ILX’s query processing and\nsampling components, e.g., as in [ 40,49,109]. Visualization would\nsupport 2D, 3D, and 4D data via animations over time.\n2.2 The \"X\" in ILX: Extensibility\nTypically, location data is associated with other data types X, e.g.,\ngraphs, road networks, points of interest, social network data, click\nstreams, text and tweets, documents, and relational data. The loca-\ntion engine in ILX should be extensible to introduce new data types\nX as needed by the driving location-service applications. Thus, ex-\ntensibility for adding new data types X will be a first-class feature\n\nILX: Intelligent \"Location+X\" Data Systems (Vision Paper)\nin ILX. Extensibility will be at all engine levels including storage,\nindexing, query processing operators, and query optimization.\n2.2.1 Extensibility in Multi-model Databases. Recently,\nmulti-model databases have been gaining significant attention in\norder to address the big varieties in data applications [ 74]. Example\nmulti-model databases include ArangoDB [ 7], OrientDB [ 13],\nBigDAWG [42], and Oracle Converged Database [4].\nCurrent multi-model databases either do not support location\ndata at all, or do not support it efficiently, e.g., may support location\ndata as JSON documents, or have geometric data types without\nindexing support. Notably, Oracle Converged Database [ 4] supports\nlocation data with indexing support but is implemented on top of\nrelational tables, which is against the vision and premise of ILX.\nMulti-model database systems support multiple fixed data types\nwithin the same system. Having extensibility as a main feature in\nmulti-model databases can be one step in the correct direction.\n2.2.2 Multi-model Data Stream Support. Current multi-model\ndata systems do not support data streaming. In addition to being\nmulti-model in nature, e.g., as in [ 7], the multi-model ILX should\nalso support both online streaming in addition to the offline pro-\ncessing of location and location+time data.\n2.3 The \"I\" in ILX: Intelligence\nAdopting Machine learning (ML) techniques in systems is a very\npromising direction given nowadays advances in hardware, GPUs,\nneural networks, deep learning, and ML software stacks. Loca-\ntion+X systems are no exception. Potential benefits for enabling\nlocation-first ILX systems with ML techniques are multi-fold.\n2.3.1 Enhancing over Existing Heuristics. Many location-\nrelated problems involve heuristics that serve as approximations\nfor NP-Complete and NP-Hard problems. Replacing these heuris-\ntic solutions with ML-based techniques is expected to produce\nmore efficient and more accurate learning-based solutions, e.g., as\nin [113]. Another example is handling the dynamic nature and the\nchange in distribution of location data and location queries over\ntime. Reinforcement learning can be used to adapt the underly-\ning organization and partitioning of location data to rebalance the\nload. One important challenge for using ML in ILX is the need for\naccurate yet real-time responses to location-based queries. The ben-\nefits of augmenting ML into ILX in terms of scalability, adaptivity,\nreal-timeliness, and accuracy need to be investigated.\n2.3.2 Support for Explainability. Explainability in AI is an im-\nportant subject. For the same reasons, explainability is needed in\nILX to explain why the ML-based decisions in ILX are made, and\nwhy other choices are excluded. In the broader sense, explainabil-\nity is needed in ILX when choices are made. For example, when a\nwell-known shortest path is not chosen, the user should be given\nfeedback as to why the well-known shortest path has not been\nchosen, e.g., due to new construction, lane closure, accident, etc.\n2.3.3 Recommendation Operators. ILX should support\nlocation-driven recommendations and ranking in its query\nlanguage and execution engine. ILX’s query language should\nhave embedded in it personalized recommendation operators,\ne.g., based on location-aware Collaborative Filtering , to rank thequery engine’s responses. More generally, recommendations in\nILX must be aware of the surrounding context that includes\nnot only the locations of objects but also the time of day, the\ntemperature, the dietary restrictions, etc. Means to automatically\ncollect these contexts and means to incorporate user contexts in\nquery processing and in recommendations need to be incorporated\ninto ILX to return the most relevant and diversified results to the\nquery issuer, e.g., as in [37, 53, 57].\n3 INFRASTRUCTURE HIGHLIGHTS OF ILX\nThe massive sizes of location data can flood any location server\nwith data. Thus, one of the main goals in realizing ILX is scalabil-\nity. Scalability in ILX will be achieved by a multiplicity of means\nincluding adaptivity, elasticity, and the adoption of new hardware\nand memory platforms, e.g., main-memory and persistent memory\nclusters, NUMA-awareness, vectorization, and GPU query process-\ning. ILX will adopt important query processing strategies including\nfederated query processing, query compilation, and approximate\nquery processing techniques, e.g., distance oracles and other es-\nsential location-related query operators. In this section, we briefly\nhighlight these approaches and their roles in ILX.\n3.1 Adaptivity, Elasticity, and Memory\nDisaggregation\nDue to the dynamic changes in location data distributions over\nspace and time, and the occurrence of hot spots, new servers will\nneed to be allocated online while ILX is running. Similarly, servers\nwill need to be dynamically deallocated from lightly loaded geospa-\ntial regions. Moreover, ILX will use disaggregated architectures\n(Compute servers vs. Memory servers) [ 114], where one can add or\nremove compute or memory independent of each other.\n3.2 Utilizing Modern Hardware\n3.2.1 NUMA Awareness. Multi-socket systems with non-\nuniform memory access architectures (NUMA) have been intro-\nduced, where each socket is equipped with multiple cores along\nwith its own local memory, and is connected to other sockets, i.e., re-\nmote memory with interconnect links. To fully utilize these modern\nmulti-core NUMA hardware, NUMA-aware algorithms [ 64,67,90]\nare continuously being developed for data systems. ILX should be\ndesigned while considering the characteristics of these multi-core\nNUMA architectures.\n3.2.2 Vectorization. Vectorizing a query execution engine [ 89]\nor a standalone database operator, e.g., join [ 21,24,58], scan [ 115,\n124], aggregation [ 33,86,117], sorting[ 31,55,56,87,95], Bloom\nfilters [ 61] or compression [ 88] to utilize data parallelism has gained\npopularity in recent times due to the introduction of complex SIMD\ninstructions in modern multi-core CPU platforms and the perfor-\nmance gain while executing database queries. VectorWise [ 25],\nDB2 BLU [ 92], columnar SQL Server [ 62], Quickstep [ 82] are exam-\nple data systems that implement vectorization. It is only natural\nthat ILX-based systems should benefit from vectorization and its\npotential can be investigated while designing vectorized location\ndatabase operators for ILX.\n\nWalid G. Aref1, Ahmed M. Aly2, Anas Daghistani3, Yeasir Rayhan1, Jianguo Wang1, Libin Zhou1\n3.2.3 Main-memory Techniques. There is a surge of interest\nin main-memory databases [ 39,45,63,83] because of the dropping\nprice and increasing capacity of main-memory. Thus, it is possi-\nble to keep large portions of location data in main-memory for\nhigh performance. Many location data techniques need to be re-\nvisited for main-memory and the cache hierarchy, e.g., as in [ 112].\nCaching that is aware of location proximity is called for. Optimizing\nto minimize CPU cache misses while performing memory-based\nlocation operations would be critical to high performance. The\nmain-memory location engine needs to be redesigned because of\nthe lack of need for a buffer manager anymore. Thus, efficient loca-\ntion data layout in main-memory and cache-aware location-based\nindexes are important factors for a highly performant ILX system.\n3.2.4 Persistent Memory. Typically, location-based data sys-\ntems have been optimized for the traditional memory hierarchy:\ncache memory, main-memory, disk (or SSD). With the introduction\nof Persistent and Non-Volatile Memories, e.g., Intel Optane Persis-\ntent Memory [ 11], the traditional memory hierarchy has changed\nsignificantly. First, persistent memory is \"persistent\". Thus, there\nis no need for disk-like storage. Second, the speed gap between\nmain-memory and persistent memory is much narrower than what\nis between main-memory and disk. Thus, location data indexes\nthat have been optimized for disk-based memory hierarchies will\nneed a complete redesign to fit into a persistent-memory-based\nmemory hierarchy, e.g., as in [ 72,73]. Another important factor is\nthat the read and write speeds for persistent memory are not sym-\nmetric. Writes are multiple of times slower than Reads. Location\ndata indexes over persistent memory need to be optimized for that.\n3.2.5 GPUs. GPUs have a complex memory architecture with\nvarious types of memories including texture memory, which is\na read-only off-chip memory with caching enabled [ 14]. Texture\ncache is specially optimized for 2D spatial locality that makes it\nan optimal candidate for handling location data in ILX. Designing\nGPU-friendly data model and algebra by capturing the geometric\nproperties of spatial data to answer spatial queries over large data\nsets has been gaining popularity [ 41] and is in the right direction.\nILX needs GPU support to naturally make use of the GPU’s 2D\ncache memory that is quite fit for location data. Moreover, GPUs\nwould help subsidize for the expensive geometric data operations,\ne.g., polygon-polygon intersections, and spatial joins. However, the\nissue of impedance mismatch between the GPU and CPU memory\nspaces still need to be addressed to avoid copying data back and\nforth between the two memory spaces.\n3.3 Query Processing\nIn ILX, we will adopt several query processing strategies including\n(a)Federated Query Processing due to the variety in the input loca-\ntion data sources, (b) Multi-model Query Compilation Techniques\nto allow location data services and continuous location queries\nto execute as close to the bare bone of the underlying hardware\nwithout multiple software layers that defeat the real-time nature in\nperforming location services, and (c) Query Operators and Services\nunique to the ILX environment including Distance Oracles, Map\nMatching operators, and Address Translation services. Below, we\npresent highlights of these query processing features in ILX.\nUser-Facing APIs & VisualizationQuery Optimizer and Index SelectionDistributed Query-Execution\nHeterogenous Data SourcesDistributed CacheDistributed Spatial Indexing\nData StreamsNon-VolatileShared Storage DataLakeFederated Query Processing\nDisaggreg-ated Memory\nFigure 1: ILX federated query processing architecture.\n3.3.1 Federated Query Processing. Federated query processing\nhas been adopted by many recent systems to handle the diversity\nin the sources of data and be able to process queries across the\nmultiplicity of sources. Example systems are F1 [ 100], Presto [ 96],\nFlink [ 28], and Iceberg [ 5]. The envisioned ILX will have a layered\narchitecture that builds on federated query processing. Refer to\nFigure 1. We briefly explain the stack of layers that constitute ILX.\nThe user-facing layer offers several APIs for issuing the user\nqueries and receiving the query results. The user-facing layer also\noffers several visualization tools for presenting the query results\nusing visual representation. For streaming applications, the query\nresults update the visualization in an online fashion. The query\nprocessing layer consists of three components: a) an optimizer, b)\ndistributed execution, and c) caching. The optimizer is responsible\nfor finding the best plan for the query, as well as finding the best\nspatial and relational indexes that speed up the execution of the\nquery. The execution units (i.e., operators) of ILX are distributed.\nA key feature in ILX is that the data is spatially indexed and parti-\ntioned according to the spatial features of the data (be it streamed or\nstatic), and also according to the query workload distribution. This\npartitioning would lead to efficient distributed execution with high\nthroughput and low latency. Moreover, the caching layer boosts\nthe performance of repeating queries, i.e., these queries that focus\non hotspot locations, e.g., downtown areas, event locations, etc., or\ncontinuous query evaluation, e.g., in support of data streaming.\nILX does not rely on a single data format for its data sources.\nThus, ILX is founded on a federated query processing platform,\nwhere it supports extensible data readers and adapters that can read\nheterogeneous data formats from different storage and streaming\nsources. Moreover, ILX can operate on multiple data sources with\na variety of formats. A single query can perform a join between a\nstreaming data source and an RDF file from the data lake.\n3.3.2 Multi-model Query Compilation. Query compilation\nhas proven to be quite effective in enhancing the performance\nof database systems, e.g., [ 59,77]. In contrast to producing a query\n\nILX: Intelligent \"Location+X\" Data Systems (Vision Paper)\nevaluation pipeline that the query interpreter executes one-tuple-\nat-a-time or a vector of tuples at a time, in case vectorization is\nused, in query compilation, low level C code can be generated and\ncompiled to execute the query. Query compilation eliminates the\nsoftware interpretation layer, and results in executing the query as\nclose as possible to the bare metal of the hardware.\nThere has been good efforts in compiling queries that involve spa-\ntial predicates, e.g., [ 107]. However, given the multi-model nature in\nILX, query compilation needs to be extended to cover multi-model\nqueries that access , e.g., location, text/JSON, relations, and graph\ntraversal operations.\n3.3.3 Query Operators and Services. At the core of ILX is a set\nof unique location-related operators that cater to the unique fea-\ntures of location query processing in ILX. These operators include\nDistance Oracle operators, Map Matching operators, and Address\nTranslation services. We describe each one briefly below. Notice\nthat some of these operators are offered by service providers, e.g.,\nGoogle Maps GeoLocation APIs [ 9]. However, they are not open-\nsource, and are provided at a pay-as-you-go pricing model [10].\nDistance Oracles. Distance oracles offer a fast means for com-\nputing shortest distance in road networks, e.g., [ 48,93,94]. Based\non the amount of storage allowed for preprocessing, they provide\na spectrum of approximate solutions with various error bounds\n(including 0 error). Distance oracles are an integral component\nfor scalability in ILX’s query processor. However, current distance\noracle technology will need to be extended to allow for operating\non arbitrary subsets of the road network, e.g., when a subset of the\nroads is dynamically selected, e.g., via querying, and then a shortest\npath computation is required on the selected subset.\nMap Matching Operators. A core operator in ILX is the map-\nmatching operator. It maps the physical location of an object to a\nlogical location on the map. Given a road network, say 𝑅𝑁, and the\nphysical location of an object 𝑂, e.g., 𝑂’s longitude, latitude from a\nGPS reading, say 𝐿𝑂(𝑙𝑜𝑛𝑔, 𝑙𝑎𝑡 ), the map matching operator returns\nfrom 𝑅𝑁, the logical location of the object on the map, e.g., the\nidentifier of the road (edge), the intersection (vertex), or the textual\naddress that 𝑂most likely lies in. Notice that there is the possibil-\nity of transient errors in the map matching operator due to the\ninaccuracy in the GPS measurement devices and the misalignment\nand misregistration of the underlying maps into physical space.\nAlso, the errors depend on whether the map matching operation\nis performed online or offline. In the case of offline map matching,\nthe entire trajectory of the object is present, and hence it should\nbe more accurate to predict the location of an object at any given\npoint in time. In contrast, in the case of online map matching, only\nthe current and past locations of the object are available for the\nmap matching operator to decide on the logical location on the\nmap of an object at current time. Hence, in the online case, the\nmap matching operator is prone to more errors. The map matching\noperator is commonly used in GPS devices to display the location\nof the object on the logical map and to help with the vehicle nav-\nigation process using the logical map as a guide. It is anticipated\nthat ILX will also make heavy use of this operator at both the query\nprocessing and optimization levels. Many useful map matching\noperators exist that we plan to utilize and build on from within ILX,\ne.g., [26, 71, 78, 80, 121].Address Translation Operators. Another important and use-\nful building block for query processing and optimization in ILX is\nthe address translation operator. This operator is the inverse of the\nmap matching operator. Given a textual address input, this operator\nreturns the address’s corresponding longitude and latitude.\nThe distance oracle, map matching, and address translation op-\nerations will be used extensively in query processing within ILX.\n3.4 Location-based Access Methods\n3.4.1 Clustered Location Data Indexes. Access methods and\nindexes for location data are essential components in ILX. However,\nwith the location data type being a first-class citizen in ILX, location\ndata indexes need to become the primary storage methods and\nclustered indexes that host all the other types of data in addition\nto the location data. For example, if ILX has a quad-tree index to\nstore the coordinates for a point data set, the same quad-tree could\nserve as a clustered index that also stores the entire description of\nthe point data objects, e.g., the city names, the city population, etc.,\ninside the index. Additional indexing methods will be based on the\ntypes X associated with the location data. However, clustering of\ndata will be location-driven.\n3.4.2 Update-Intensive Indexing Techniques. The continu-\nous move and change in location of objects in space over time\nresults in an update-intensive workload. Thus, an important fea-\nture in location access methods is the support for update-intensive\nindexing. Techniques exist for handling frequent updates in lo-\ncation indexes, e.g., [ 103]. However, they need to be extended to\nsupport (1) memory-based location indexes, (2) become cache- and\nNUMA-aware, and (3) be optimized for disaggregated memory. Dis-\naggregation has become feasible and practical due to the successful\nuse of high-speed remote direct memory access (RDMA) over the\nnetwork [ 114]. Location data indexes need to be adapted to support\nthe disaggregated architecture over RDMA.\n3.4.3 LSM-based Location Indexes. LSM indexes [ 79] are opti-\nmized for write-intensive key-value workloads. Because location\nserves as a secondary key, to be effective, LSM indexes need to be\nadapted in support of update-intensive secondary-key location-data\nworkloads [99].\n3.4.4 Location-based Learned Indexes. Machine Learning\n(ML) techniques have been applied successfully to build various\ntypes of learned indexes [ 60]. It has been extended to the multi-\ndimensional case, e.g., [ 15,16]. Learned indexes have shown poten-\ntial in terms of smaller index size and faster performance in contrast\nto traditional indexes. Learned indexes work well for static data\nsets as training of the learned models take place in a preprocessing\nphase. Realizing learned indexes for dynamic data sets has been a\nchallenge due to the need to continuously retrain the models. There\nare some very successful attempts to deal with dynamic data in the\nmultidimensional case. Of mention are LISA [ 66] and RSMI [ 91].\nILX needs to adopt similar ideas, and extend these learned indexes\nto accommodate the time dimension to be able to handle real-time\ntrajectory data.\n\nWalid G. Aref1, Ahmed M. Aly2, Anas Daghistani3, Yeasir Rayhan1, Jianguo Wang1, Libin Zhou1\n3.5 Concurrency Control, Integrity, and Fault\nTolerance\nConcurrency control plays a critical role in ILX to coordinate con-\ncurrent read and write operations for scalability. Many existing\nconcurrency control protocols in spatial databases are based on\nlocking data objects (e.g., [ 29,30,36,104]). Two possible approaches\ncan be explored in ILX. First, in contrast to locking data objects,\nILX can consider locking the underlying physical space or specific\nlocations in space under the premise that no two objects can share\nthe underlying physical space at the same time. In contrast to data-\ndriven locking, locking physical locations can resemble space-driven\nlocking in location data indexes that have disjoint space-driven par-\ntitioning of the underlying space. Two issues remain to be addressed\nfor this approach to be credible: (1) Handle consistently the issue of\nmulti-granularity locking in the physical space and (2) Handle the\nissue of location uncertainty. If the location of an object is uncer-\ntain or is not measured precisely, then locking of physical locations\nmay not have one-to-one correspondence with the locations of the\nobjects as stored within ILX or within ILX’s location data indexes.\nThis may introduce overlaps in potential locations of where objects\nmight be in space. More research is needed to address the issue of\nuncertainty in conjunction with physical location locking and the\nlocation overlaps it introduces.\nThe second approach that needs to be explored in ILX is to adopt\nconcurrency control techniques that can scale to hundreds and\nthousands of cores [ 22,120]. It is important to design lock-free\nconcurrency control for spatial access methods along the same\nlines as the lock-free B-tree (the Bw-tree [65]).\nFinally, the new infrastructure that ILX will be deployed in poses\nadditional challenges for concurrency control. For example, in the\nRDMA-enabled disaggregated memory architecture [ 27,114], it is\nnon-trivial to lock the remote objects using RDMA primitives, and\nhence existing concurrency control protocols need to be revisited.\nILX should be able to tolerate faults, e.g., via replication. ILX\nshould be able to recover its indexes if they get partially or com-\npletely lost or damaged due upon faulting. Recovering from faults\nare to be performed online without system shutdown and while\nguaranteeing correctness of the system operation e.g., during on-\nline repartitioning of data, ILX should guarantee that no data gets\nlost and no data is reported twice as part of an answer to a query.\n3.6 Location Data Compression\nData compression is an important technique especially for spatial\ndatabases due to the huge amount of location data. It not only can\nsave memory but also can improve query time due to the smaller\ndata sizes being retrieved. Compression is highly under-studied in\nspatial databases [ 32,69]. It requires a systematic study of compres-\nsion techniques for both location data and location data indexes.\nAlthough there are some compression algorithms for floating-point\ndata [ 68,84], it is not clear how they perform on location data\nbecause these algorithms usually work well on specific data dis-\ntributions. For location indexes, e.g., the R-tree, it is important to\ncompress the structural information, similar to B-tree structural\ncompression [ 23,70]. Another important design consideration is to\nsupport query processing on compressed data and indexes, whichwill improve the performance. More research is needed to evaluate\nthe impact to compression ratio.\n3.7 Semantics and RDF-based Location Data\nMany geospatial datasets are part of the Web of Data. Several\ngeospatial extensions to the SPARQL query language have been\nintroduced to query and reason over geospatial semantic data. ILX\nshould be able to natively store and reason over geospatial RDF\ndata. It is important for ILX to handle the slight geo-semantic inac-\ncuracies, e.g., the predicate \"north-of\" can roughly describe objects\nthat are slightly towards the northeast direction. ILX should be\nable to reason over location data given these semantic ambiguities.\nMoreover, ILX should be able to make use of the interlinked topo-\nlogical relations in the Linked Open Data cloud (LOD), and help\nproduce new geospatial interlinks progressively in LOD as a side\neffect, e.g., as in [81].\n3.8 Security and Resilience to Attacks\nILX should be resilient to malicious activities, e.g., attacks to stop\nthe system, alter, or snoop data. Systems that use dynamic load\nbalancing mechanisms are vulnerable to malicious attacks [ 35]. This\ntype of attack affects system availability. Attackers can make the\nsystem in continuous state of rebalancing. Other types of attacks\nthat can affect ILX need to be investigated, e.g., faking the location\nof data, hiding the detection of important location data by flooding\nthe system with irrelevant data in the same location. ILX should be\nresilient to these attacks by having intelligence to detect and block\nmalicious users. It should analyze user behavior as individuals and\nas groups to detect and prevent any malicious activities.\n3.9 Useful EcoSystem Tools\nVarious geometrical and spatiotemporal toolkits and libraries exist,\ne.g., [ 1–3], that can be partly useful for the ILX ecosystem. Also,\nlocation data generators, e.g., [ 76], would be an integral part of the\nILX ecosystem.\n4 SUMMARY\nThis paper highlights the main features and challenges in realizing\nILX-like systems. Several existing research works follow some as-\npects of the ILX vision, and hence are in the right direction. Due\nto space limitation, not all of these research works are cited in this\npaper. However, this paper helps identify such works.\nBenchmarks for testing and tuning the performance of all of\nILX’s features will be an integral part of ILX’s ecosystem. Many\nsuch benchmarks already exist in the literature. However, once ILX\nis realized, targeted micro-benchmarks for specific features of ILX\nwill need to be developed.\n5 ACKNOWLEDGEMENTS\nThe authors acknowledge the support of the U.S. National Science\nFoundation under Grant Numbers III-1815796 and IIS-1910216.\n\nILX: Intelligent \"Location+X\" Data Systems (Vision Paper)\nREFERENCES\n[1][n.d.]. H3: Uber’s Hexagonal Hierarchical Spatial Index. https://eng.uber.com/\nh3/.\n[2][n.d.]. The LocationTech Technology (LTT). https://projects.eclipse.org/projec\nts/locationtech.\n[3] [n.d.]. S2 Geometry. https://s2geometry.io.\n[4]2020. Oracle’s Converged Database: How to Make Developers And Data More\nProductive. https://www.oracle.com/a/otn/docs/databas/oracle-converge\ndatabase-technicalbrief.pdf.\n[5] 2022. Apache Iceberg. https://www.dremio.com/resources/guides/apache-ice\nberg-an-architectural-look-under-the-covers/.\n[6] 2022. Apache Storm. https://storm.apache.org/.\n[7] 2022. ArangoDB. https://www.arangodb.com/.\n[8]2022. General Data Protection Regulation (GDPR). https://gdpr-info.eu/art-1-g\ndpr.\n[9]2022. GeoLocation API. https://developers.google.com/maps/documentation/ge\nolocation/overview.\n[10] 2022. GeoLocation API: Usage and Billing. https://developers.google.com/map\ns/documentation/geolocation/usage-and-billing.\n[11] 2022. Intel Optane Persistent Memory. https://www.intel.com/content/www/u\ns/en/architecture-and-technology/optane-dc-persistent-memory.html.\n[12] 2022. Oracle Spatial. https://www.oracle.com/database/spatial/.\n[13] 2022. OrientDB. https://orientdb.org/.\n[14] 2022. Texture Memory in GPU. https://docs.nvidia.com/gameworks/content/de\nvelopertools/desktop/analysis/report/cudaexperiments/kernellevel/memoryst\natisticstexture.htm.\n[15] Abdullah Al-Mamun, Ch. Md. Rakin Haider, Jianguo Wang, and Walid G. Aref.\n2022. The \"AI+R\"-tree: An Instance-optimized R-tree. In MDM .\n[16] Abdullah Al-Mamun, Hao Wu, and Walid G Aref. 2020. A tutorial on learned\nmulti-dimensional indexes. In SIGSPATIAL . 1–4.\n[17] Ahmed M. Aly, Ahmed R. Mahmood, Mohamed S. Hassan, Walid G. Aref, Mourad\nOuzzani, Hazem Elmeleegy, and Thamir Qadah. 2015. AQWA: Adaptive Query-\nWorkload-Aware Partitioning of Big Spatial Data. PVLDB 8, 13 (2015), 2062–2073.\n[18] Walid G. Aref. 2017. Location + X Big Data Systems: Challenges and Some\nSolutions. In GeoRich .\n[19] Walid G. Aref. 2019. The Dos and Don’ts of Spatial+X Data Management: A\n“Systems Perspective”. In MDM .\n[20] Walid G. Aref and Ihab F. Ilyas. 2001. SP-GiST: An Extensible Database Index for\nSupporting Space Partitioning Trees. J. Intell. Inf. Syst. 17, 2-3 (2001), 215–240.\n[21] Cagri Balkesen, Jens Teubner, Gustavo Alonso, and M. Tamer Özsu. 2013. Main-\nmemory hash joins on multi-core CPUs: Tuning to the underlying hardware. In\nICDE . 362–373.\n[22] Tiemo Bang, Norman May, Ilia Petrov, and Carsten Binnig. 2020. The tale of\n1000 Cores: an evaluation of concurrency control on real(ly) large multi-socket\nhardware. In DaMoN . 3:1–3:9.\n[23] Rudolf Bayer and Karl Unterauer. 1977. Prefix B-Trees. TODS 2, 1 (1977), 11–26.\n[24] Spyros Blanas, Yinan Li, and Jignesh M. Patel. 2011. Design and evaluation of\nmain memory hash join algorithms for multi-core CPUs. In SIGMOD . 37–48.\n[25] Peter A. Boncz, Marcin Zukowski, and Niels Nes. 2005. MonetDB/X100: Hyper-\nPipelining Query Execution. In CIDR . 225–237.\n[26] Sotiris Brakatsoulas, Dieter Pfoser, Randall Salas, and Carola Wenk. 2005. On\nMap-Matching Vehicle Tracking Data. In PVLDB . 853–864.\n[27] Wei Cao, Yingqiang Zhang, Xinjun Yang, Feifei Li, Sheng Wang, Qingda Hu,\nXuntao Cheng, Zongzhi Chen, Zhenjun Liu, Jing Fang, Bo Wang, Yuhui Wang,\nHaiqing Sun, Ze Yang, Zhushi Cheng, Sen Chen, Jian Wu, Wei Hu, Jianwei Zhao,\nYusong Gao, Songlu Cai, Yunyang Zhang, and Jiawang Tong. 2021. PolarDB\nServerless: A Cloud Native Database for Disaggregated Data Centers. In SIGMOD .\n2477–2489.\n[28] Paris Carbone, Asterios Katsifodimos, Stephan Ewen, Volker Markl, Seif Haridi,\nand Kostas Tzoumas. 2015. Apache Flink ™: Stream and Batch Processing in a\nSingle Engine. IEEE Data Eng. Bull. 38, 4 (2015), 28–38.\n[29] Kaushik Chakrabarti and Sharad Mehrotra. 1999. Efficient Concurrency Control\nin Multidimensional Access Methods. In SIGMOD . 25–36.\n[30] Natalia Chaudhry and Muhammad Murtaza Yousaf. 2022. Concurrency control\nfor real-time and mobile transactions: Historical view, challenges, and evolution\nof practices. Concurr. Comput. Pract. Exp. 34, 3 (2022).\n[31] Jatin Chhugani, Anthony D. Nguyen, Victor W. Lee, William Macy, Mostafa\nHagog, Yen-Kuang Chen, Akram Baransi, Sanjeev Kumar, and Pradeep Dubey.\n2008. Efficient implementation of sorting on multi-core SIMD CPU architecture.\nPVLDB 1, 2 (2008), 1313–1324.\n[32] Peter Chovanec, Michal Krátký, and Jiří Walder. 2010. Lossless R-tree compres-\nsion using variable-length codes. In ICITST . 1–8.\n[33] John Cieslewicz, Kenneth A. Ross, Kyoho Satsumi, and Yang Ye. 2010. Automatic\ncontention detection and amelioration for data-intensive operations. In SIGMOD .\n483–494.\n[34] Anas Daghistani, Walid G. Aref, Arif Ghafoor, and Ahmed R. Mahmood. 2021.\nSWARM: Adaptive Load Balancing in Distributed Streaming Systems for Big\nSpatial Data. ACM TSAS 7, 3 (2021), 14:1–14:43.[35] Anas Daghistani, Mosab Khayat, Muhamad Felemban, Walid G Aref, and Arif\nGhafoor. 2021. Guard: Attack-Resilient Adaptive Load Balancing in Distributed\nStreaming Systems. IEEE TDSC (2021).\n[36] Jing (David) Dai and Chang-Tien Lu. 2017. Concurrency Control for Spatial\nAccess. In Encyclopedia of GIS . 285–286.\n[37] Florian Daniel, Maristella Matera, Elisa Quintarelli, Letizia Tanca, and Vittorio\nZaccaria. 2018. Context-Aware Access to Heterogeneous Resources Through\nOn-the-Fly Mashups. In CAiSE . 119–134.\n[38] Dong Deng, Raul Castro Fernandez, Ziawasch Abedjan, Sibo Wang, Michael\nStonebraker, Ahmed K. Elmagarmid, Ihab F. Ilyas, Samuel Madden, Mourad\nOuzzani, and Nan Tang. 2017. The Data Civilizer System. In CIDR .\n[39] Cristian Diaconu, Craig Freedman, Erik Ismert, Per-Åke Larson, Pravin Mittal,\nRyan Stonecipher, Nitin Verma, and Mike Zwilling. 2013. Hekaton: SQL Server’s\nMemory-Optimized OLTP Engine. In SIGMOD . 1243–1254.\n[40] Liming Dong, Qiushi Bai, Taewoo Kim, Taiji Chen, Weidong Liu, and Chen\nLi. 2020. Marviq: Quality-Aware Geospatial Visualization of Range-Selection\nQueries Using Materialization. In SIGMOD . 67–82.\n[41] Harish Doraiswamy and Juliana Freire. 2020. A GPU-friendly Geometric Data\nModel and Algebra for Spatial Queries. In SIGMOD . 1875–1885.\n[42] Jennie Duggan, Aaron J. Elmore, Michael Stonebraker, Magdalena Balazinska,\nBill Howe, Jeremy Kepner, Sam Madden, David Maier, Tim Mattson, and Stan-\nley B. Zdonik. 2015. The BigDAWG Polystore System. SIGMOD Record 44, 2\n(2015), 11–16.\n[43] Ahmed Eldawy and Mohamed F. Mokbel. 2015. SpatialHadoop: A MapReduce\nFramework for Spatial Data. In ICDE . 1352–1363.\n[44] Mohamed Y. Eltabakh, Walid G. Aref, Ahmed K. Elmagarmid, and Mourad\nOuzzani. 2014. HandsOn DB: Managing Data Dependencies Involving Human\nActions. IEEE TKDE. 26, 9 (2014), 2193–2206.\n[45] Franz Faerber, Alfons Kemper, Per-Åke Larson, Justin J. Levandoski, Thomas\nNeumann, and Andrew Pavlo. 2017. Main Memory Database Systems. Founda-\ntions and Trends in Databases 8, 1-2 (2017), 1–130.\n[46] Raul Castro Fernandez, Ziawasch Abedjan, Famien Koko, Gina Yuan, Samuel\nMadden, and Michael Stonebraker. 2018. Aurum: A Data Discovery System. In\nICDE . 1001–1012.\n[47] Richard Frackowiak, Anastasia Ailamaki, and Ferath Kherif. 2016. Federating\nand Integrating What We Know About the Brain at All Scales: Computer Science\nMeets the Clinical Neurosciences. (2016), 157–170.\n[48] Robert Geisberger, Peter Sanders, Dominik Schultes, and Daniel Delling. 2008.\nContraction Hierarchies: Faster and Simpler Hierarchical Routing in Road Net-\nworks. In WEA .\n[49] Tao Guo, Kaiyu Feng, Gao Cong, and Zhifeng Bao. 2018. Efficient Selection of\nGeospatial Data on Maps for Interactive and Visualized Exploration. In SIGMOD .\n567–582.\n[50] Mohamed S. Hassan, Tatiana Kuznetsova, Hyun Chai Jeong, Walid G. Aref, and\nMohammad Sadoghi. 2018. Extending In-Memory Relational Database Engines\nwith Native Graph Support. In EDBT . 25–36.\n[51] Mohamed S. Hassan, Tatiana Kuznetsova, Hyun Chai Jeong, Walid G. Aref,\nand Mohammad Sadoghi. 2018. GRFusion: Graphs as First-Class Citizens in\nMain-Memory Relational Database Systems. In SIGMOD . 1789–1792.\n[52] Daeyoung Hong, Woohwan Jung, and Kyuseok Shim. 2022. Collecting Geospatial\nData Under Local Differential Privacy With Improving Frequency Estimation.\nIEEE TKDE (2022), 1–12.\n[53] Saeid Hosseini, Hongzhi Yin, Meihui Zhang, Xiaofang Zhou, and Shazia Sadiq.\n2016. Jointly Modeling Heterogeneous Temporal Properties in Location Recom-\nmendation. In DASFAA . 490–506.\n[54] Yan Huang, Shashi Shekhar, and Hui Xiong. 2004. Discovering Colocation\nPatterns from Spatial Data Sets: A General Approach. IEEE TKDE 16, 12 (2004),\n1472–1485.\n[55] Hiroshi Inoue, Takao Moriyama, Hideaki Komatsu, and Toshio Nakatani. 2007.\nAA-Sort: A New Parallel Sorting Algorithm for Multi-Core SIMD Processors. In\nPACT . 189–198.\n[56] Hiroshi Inoue and Kenjiro Taura. 2015. SIMD- and Cache-Friendly Algorithm\nfor Sorting an Array of Structures. PVLDB 8, 11 (2015), 1274–1285.\n[57] Georgios Kalamatianos, Georgios John Fakas, and Nikos Mamoulis. 2021. Pro-\nportionality in Spatial Keyword Search. In SIGMOD . 885–897.\n[58] Changkyu Kim, Eric Sedlar, Jatin Chhugani, Tim Kaldewey, Anthony D. Nguyen,\nAndrea Di Blas, Victor W. Lee, Nadathur Satish, and Pradeep Dubey. 2009. Sort\nvs. Hash Revisited: Fast Join Implementation on Modern Multi-Core CPUs.\nPVLDB 2, 2 (2009), 1378–1389.\n[59] Yannis Klonatos, Christoph Koch, Tiark Rompf, and Hassan Chafi. 2014. Building\nEfficient Query Engines in a High-Level Language. PVLDB 7, 10 (2014), 853–864.\n[60] Tim Kraska, Alex Beutel, Ed H Chi, Jeffrey Dean, and Neoklis Polyzotis. 2018.\nThe case for learned index structures. In SIGMOD . 489–504.\n[61] Harald Lang, Thomas Neumann, Alfons Kemper, and Peter A. Boncz. 2019.\nPerformance-Optimal Filtering: Bloom overtakes Cuckoo at High-Throughput.\nPVLDB 12, 5 (2019), 502–515.\n[62] Per-Åke Larson, Cipri Clinciu, Eric N. Hanson, Artem Oks, Susan L. Price,\nSrikumar Rangarajan, Aleksandras Surna, and Qingqing Zhou. 2011. SQL server\n\nWalid G. Aref1, Ahmed M. Aly2, Anas Daghistani3, Yeasir Rayhan1, Jianguo Wang1, Libin Zhou1\ncolumn store indexes. In SIGMOD . 1177–1184.\n[63] Juchang Lee, Yong Sik Kwon, Franz Färber, Michael Muehle, Chulwon Lee,\nChristian Bensberg, Joo-Yeon Lee, Arthur H. Lee, and Wolfgang Lehner. 2013.\nSAP HANA Distributed In-memory Database System: Transaction, Session, and\nMetadata Management. In ICDE . 1165–1173.\n[64] Viktor Leis, Peter A. Boncz, Alfons Kemper, and Thomas Neumann. 2014. Morsel-\ndriven parallelism: a NUMA-aware query evaluation framework for the many-\ncore age. In SIGMOD . 743–754.\n[65] Justin J. Levandoski, David B. Lomet, and Sudipta Sengupta. 2013. The Bw-Tree:\nA B-tree for new hardware platforms. In ICDE . 302–313.\n[66] Pengfei Li, Hua Lu, Qian Zheng, Long Yang, and Gang Pan. 2020. LISA: A\nLearned Index Structure for Spatial Data. In SIGMOD . 2119–2133.\n[67] Yinan Li, Ippokratis Pandis, René Müller, Vijayshankar Raman, and Guy M.\nLohman. 2013. NUMA-aware algorithms: the case of data shuffling. In CIDR .\n[68] Panagiotis Liakos, Katia Papakonstantinopoulou, and Yannis Kotidis. 2022.\nChimp: Efficient Lossless Floating Point Compression for Time Series Databases.\nPVLDB 15 (2022).\n[69] Hung-Yi Lin and Shih-Ying Chen. 2008. High Indexing Compression for Spatial\nDatabases. In CIT Workshops . 20–25.\n[70] David B. Lomet. 2001. The Evolution of Effective B-tree: Page Organization and\nTechniques: A Personal Account. SIGMOD Rec. 30, 3 (2001), 64–69.\n[71] Yin Lou, Chengyang Zhang, Yu Zheng, Xing Xie, Wei Wang, and Yan Huang.\n2009. Map-matching for low-sampling-rate GPS trajectories. In SIGSPATIAL .\n352–361.\n[72] Baotong Lu, Jialin Ding, Eric Lo, Umar Farooq Minhas, and Tianzheng Wang.\n2021. APEX: A High-Performance Learned Index on Persistent Memory. PVLDB\n15, 3 (2021), 597–610.\n[73] Baotong Lu, Xiangpeng Hao, Tianzheng Wang, and Eric Lo. 2020. Dash: Scalable\nHashing on Persistent Memory. PVLDB 13, 8 (2020), 1147–1161.\n[74] Jiaheng Lu and Irena Holubová. 2019. Multi-model Databases: A New Journey\nto Handle the Variety of Data. ACM Computing Surveys (CSUR) 52, 3 (2019),\n55:1–55:38.\n[75] Ahmed R. Mahmood, Ahmed M. Aly, Thamir Qadah, El Kindi Rezig, Anas\nDaghistani, Amgad Madkour, Ahmed S. Abdelhamid, Mohamed S. Hassan,\nWalid G. Aref, and Saleh M. Basalamah. 2015. Tornado: A Distributed Spatio-\nTextual Stream Processing System. PVLDB 8, 12 (2015), 2020–2023.\n[76] Mohamed F. Mokbel, Louai Alarabi, Jie Bao, Ahmed Eldawy, Amr Magdy, Mo-\nhamed Sarwat, Ethan Waytas, and Steven Yackel. 2013. MNTG: An Extensible\nWeb-Based Traffic Generator. In SSTD . 38–55.\n[77] T. Neumann. 2011. Efficiently Compiling Efficient Query Plans for Modern\nHardware. PVLDB 4, 9 (2011), 539–550.\n[78] Paul Newson and John Krumm. 2009. Hidden Markov map matching through\nnoise and sparseness. In SIGSPATIAL . 336–343.\n[79] Patrick E. O’Neil, Edward Cheng, Dieter Gawlick, and Elizabeth J. O’Neil. 1996.\nThe Log-Structured Merge-Tree (LSM-Tree). Acta Informatica 33, 4 (1996),\n351–385.\n[80] Takayuki Osogami and Rudy Raymond. 2013. Map Matching with Inverse\nReinforcement Learning. In IJCAI . 2547–2553.\n[81] George Papadakis, George Mandilaras, Nikos Mamoulis, and Manolis\nKoubarakis. 2022. Static and Dynamic Progressive Geospatial Interlinking.\nACM TSAS 8, 2 (2022).\n[82] Jignesh M. Patel, Harshad Deshmukh, Jianqiao Zhu, Navneet Potti, Zuyu Zhang,\nMarc Spehlmann, Hakan Memisoglu, and Saket Saurabh. 2018. Quickstep: A\nData Platform Based on the Scaling-Up Approach. PVLDB 11, 6 (2018), 663–676.\n[83] Jignesh M. Patel, Harshad Deshmukh, Jianqiao Zhu, Navneet Potti, Zuyu Zhang,\nMarc Spehlmann, Hakan Memisoglu, and Saket Saurabh. 2018. Quickstep: A\nData Platform Based on the Scaling-Up Approach. PVLDB 11, 6 (2018), 663–676.\n[84] Tuomas Pelkonen, Scott Franklin, Paul Cavallaro, Qi Huang, Justin Meza, Justin\nTeller, and Kaushik Veeraraghavan. 2015. Gorilla: A Fast, Scalable, In-Memory\nTime Series Database. PVLDB 8, 12 (2015), 1816–1827.\n[85] Shangfu Peng and Hanan Samet. 2015. Analytical Queries on Road Networks:\nAn Experimental Evaluation of Two System Architectures. In SIGSPATIAL .\n[86] Orestis Polychroniou and Kenneth A. Ross. 2013. High throughput heavy hitter\naggregation for modern SIMD processors. In DaMoN . 6.\n[87] Orestis Polychroniou and Kenneth A. Ross. 2014. A comprehensive study of\nmain-memory partitioning and its application to large-scale comparison- and\nradix-sort. In SIGMOD . 755–766.\n[88] Orestis Polychroniou and Kenneth A. Ross. 2015. Efficient Lightweight Com-\npression Alongside Fast Scans. In DaMoN . 9:1–9:6.\n[89] Orestis Polychroniou and Kenneth A. Ross. 2019. Towards Practical Vectorized\nAnalytical Query Engines. In DaMoN . 10:1–10:7.\n[90] Iraklis Psaroudakis, Tobias Scheuer, Norman May, Abdelkader Sellami, and\nAnastasia Ailamaki. 2016. Adaptive NUMA-aware data placement and task\nscheduling for analytical workloads in main-memory column-stores. PVLDB\n10, 2 (2016), 37–48.\n[91] Jianzhong Qi, Guanli Liu, Christian S Jensen, and Lars Kulik. 2020. Effectively\nlearning spatial indices. PVLDB 13, 12 (2020), 2341–2354.\n[92] Vijayshankar Raman, Gopi K. Attaluri, Ronald Barber, Naresh Chainani, David\nKalmuk, Vincent KulandaiSamy, Jens Leenstra, Sam Lightstone, Shaorong Liu,Guy M. Lohman, Tim Malkemus, René Müller, Ippokratis Pandis, Berni Schiefer,\nDavid Sharpe, Richard Sidle, Adam J. Storm, and Liping Zhang. 2013. DB2 with\nBLU Acceleration: So Much More than Just a Column Store. PVLDB 6, 11 (2013),\n1080–1091.\n[93] Peter Sanders and Dominik Schultes. 2005. Highway Hierarchies Hasten Exact\nShortest Path Queries. In ESA. 568–579.\n[94] Jagan Sankaranarayanan and Hanan Samet. 2009. Distance Oracles for Spatial\nNetworks. In ICDE . 652–663.\n[95] Nadathur Satish, Changkyu Kim, Jatin Chhugani, Anthony D. Nguyen, Victor W.\nLee, Daehyun Kim, and Pradeep Dubey. 2010. Fast sort on CPUs and GPUs: a\ncase for bandwidth oblivious SIMD sort. In SIGMOD . 351–362.\n[96] Raghav Sethi, Martin Traverso, Dain Sundstrom, David Phillips, Wenlei Xie,\nYutian Sun, Nezih Yegitbasi, Haozhun Jin, Eric Hwang, Nileema Shingte, and\nChristopher Berner. 2019. Presto: SQL on Everything. In ICDE . 1802–1813.\n[97] Sina Shaham, Gabriel Ghinita, Ritesh Ahuja, John Krumm, and Cyrus Shahabi.\n2021. HTF: Homogeneous Tree Framework for Differentially-Private Release of\nLocation Data. In SIGSPATIAL . 184–194.\n[98] Shashi Shekhar, Chang-Tien Lu, and Pusheng Zhang. 2003. A Unified Approach\nto Detecting Spatial Outliers. GeoInformatica 7, 2 (2003), 139–166.\n[99] Jaewoo Shin, Jianguo Wang, and Walid G. Aref. 2021. The LSM RUM-Tree: A\nLog Structured Merge R-Tree for Update-intensive Spatial Workloads. In ICDE .\n2285–2290.\n[100] Jeff Shute, Radek Vingralek, Bart Samwel, Ben Handy, Chad Whipkey, Eric\nRollins, Mircea Oancea, Kyle Littlefield, David Menestrina, Stephan Ellner, John\nCieslewicz, Ian Rae, Traian Stancescu, and Himani Apte. 2013. F1: A Distributed\nSQL Database That Scales. PVLDB 6, 11 (2013), 1068–1079.\n[101] Konstantin Shvachko, Hairong Kuang, Sanjay Radia, and Robert Chansler. 2010.\nThe Hadoop Distributed File System. In MSST . 1–10.\n[102] Yasin N. Silva, Walid G. Aref, Per-Åke Larson, Spencer Pearson, and Mohamed H.\nAli. 2013. Similarity queries: their conceptual evaluation, transformations, and\nprocessing. VLDB J. 22, 3 (2013), 395–420.\n[103] Yasin N. Silva, Xiaopeng Xiong, and Walid G. Aref. 2009. The RUM-tree: sup-\nporting frequent updates in R-trees using memos. VLDB J. 18, 3 (2009), 719–738.\n[104] Seok Il Song, Young Ho Kim, and Jae Soo Yoo. 2004. An Enhanced Concurrency\nControl Scheme for Multidimensional Index Structures. IEEE TKDE 16, 1 (2004),\n97–111.\n[105] Michael Stonebraker and Lawrence A. Rowe. 1986. The Design of POSTGRES.\nInSIGMOD . 340–355.\n[106] Michael Stonebraker and Ariel Weisberg. 2013. The VoltDB Main Memory\nDBMS. IEEE Data Eng. Bull. 36 (2013), 21–27.\n[107] Ruby Y. Tahboub and Tiark Rompf. 2016. On supporting compilation in spatial\nquery engines: (vision paper). In SIGSPATIAL . 9:1–9:4.\n[108] MingJie Tang, Yongyang Yu, Qutaibah M. Malluhi, Mourad Ouzzani, and Walid G.\nAref. 2016. LocationSpark: A Distributed In-Memory Data Management System\nfor Big Spatial Data. PVLDB 9, 13 (2016), 1565–1568.\n[109] Wenbo Tao, Xiaoyu Liu, Yedi Wang, Leilani Battle, Çagatay Demiralp, Remco\nChang, and Michael Stonebraker. 2019. Kyrix: Interactive Pan/Zoom Visualiza-\ntions at Scale. Comput. Graph. Forum 38, 3 (2019), 529–540.\n[110] Ignacio G. Terrizzano, Peter M. Schwarz, Mary Roth, and John E. Colino. 2015.\nData Wrangling: The Challenging Yourney from the Wild to the Lake. In CIDR .\n[111] Hien To, Cyrus Shahabi, and Li Xiong. 2018. Privacy-Preserving Online Task\nAssignment in Spatial Crowdsourcing with Untrusted Server. In ICDE . 833–844.\n[112] Dimitrios Tsitsigkos, Panagiotis Bouros, Nikos Mamoulis, and Manolis Terrovitis.\n2019. Parallel In-Memory Evaluation of Spatial Joins. In SIGSPATIAL . 516–519.\n[113] Tin Vu, Alberto Belussi, Sara Migliorini, and Ahmed Eldawy. 2021. A Learned\nQuery Optimizer for Spatial Join. In SIGSPATIAL . 458–467.\n[114] Ruihong Wang, Jianguo Wang, Stratos Idreos, M. Tamer Özsu, and Walid G. Aref.\n2022. The Case for Distributed Shared-Memory Databases with RDMA-Enabled\nMemory Disaggregation. CoRR abs/2207.03027 (2022).\n[115] Thomas Willhalm, Nicolae Popovici, Yazan Boshmaf, Hasso Plattner, Alexander\nZeier, and Jan Schaffner. 2009. SIMD-Scan: Ultra Fast in-Memory Table Scan\nusing on-Chip Vector Processing Units. PVLDB 2, 1 (2009), 385–394.\n[116] Dong Xie, Feifei Li, Bin Yao, Gefei Li, Liang Zhou, and Minyi Guo. 2016. Simba:\nEfficient In-Memory Spatial Analytics. In SIGMOD . 1071–1085.\n[117] Yang Ye, Kenneth A. Ross, and Norases Vesdapunt. 2011. Scalable aggregation\non multicore processors. In DaMoN . 1–9.\n[118] Jin Soung Yoo, Shashi Shekhar, and Mete Celik. 2005. A Join-Less Approach for\nCo-Location Pattern Mining: A Summary of Results. In ICDM . 813–816.\n[119] Jia Yu, Jinxuan Wu, and Mohamed Sarwat. 2015. GeoSpark: a cluster computing\nframework for processing large-scale spatial data. In SIGSPATIAL . 70:1–70:4.\n[120] Xiangyao Yu, George Bezerra, Andrew Pavlo, Srinivas Devadas, and Michael\nStonebraker. 2014. Staring into the Abyss: An Evaluation of Concurrency\nControl with One Thousand Cores. PVLDB 8, 3 (2014), 209–220.\n[121] Jing Yuan, Yu Zheng, Chengyang Zhang, Xing Xie, and Guangzhong Sun. 2010.\nAn Interactive-Voting Based Map Matching Algorithm. In MDM . 43–52.\n[122] Matei Zaharia, Mosharaf Chowdhury, Michael J. Franklin, Scott Shenker, and\nIon Stoica. 2010. Spark: Cluster Computing with Working Sets. In HotCloud .\n\nILX: Intelligent \"Location+X\" Data Systems (Vision Paper)\n[123] Sepanta Zeighami, Ritesh Ahuja, Gabriel Ghinita, and Cyrus Shahabi. 2022. A\nNeural Database for Differentially Private Spatial Range Queries. PVLDB 15, 5\n(2022), 1066–1078.[124] Jingren Zhou and Kenneth A. Ross. 2002. Implementing database operations\nusing SIMD instructions. In SIGMOD . 145–156.",
  "textLength": 59227
}