{
  "paperId": "ebe6b817ba8a44d0481598575904231c8324932e",
  "title": "Mixture of A Million Experts",
  "pdfPath": "ebe6b817ba8a44d0481598575904231c8324932e.pdf",
  "text": "Mixture of A Million Experts\nXu Owen He hexu@google.com\nGoogle DeepMind\nAbstract\nThe feedforward (FFW) layers in standard transformer architectures incur a linear increase\nin computational costs and activation memory as the hidden layer width grows. Sparse\nmixture-of-experts (MoE) architectures have emerged as a viable approach to address this\nissue by decoupling model size from computational cost. The recent discovery of the fine-\ngrained MoE scaling law shows that higher granularity leads to better performance. How-\never, existing MoE models are limited to a small number of experts due to computational\nand optimization challenges. This paper introduces PEER (parameter efficient expert re-\ntrieval), a novel layer design that utilizes the product key technique for sparse retrieval\nfrom a vast pool of tiny experts (over a million). Experiments on language modeling tasks\ndemonstrate that PEER layers outperform dense FFWs and coarse-grained MoEs in terms\nof performance-compute trade-off. By enabling efficient utilization of a massive number of\nexperts, PEER unlocks the potential for further scaling of transformer models while main-\ntaining computational efficiency.\n(a)6e18FLOPs\n (b)2e19FLOPs\nFigure 1: Isoflop comparison on the C4 dataset between PEER and other baselines with two different FLOP\nbudgets ( 6e18and2e19FLOPs). The xaxis is in log scale.\n1 Introduction\nThe past few years have seen the power of scaling (Kaplan et al., 2020; Hoffmann et al., 2022): increasing\nthe number of parameters, amount of training data, or the computational budget has proven to be a reliable\n1arXiv:2407.04153v1  [cs.LG]  4 Jul 2024\n\nway to improve model performance. Notably, feedforward (FFW) layers, responsible for storing factual\nknowledge(Gevaetal.,2021;Daietal.,2022), accountfortwo-thirdsofthetotalparametersinatransformer.\nHowever, one drawback of these dense FFWs is that their computational footprint (FLOPs and device\nmemory consumption) is linearly proportional to their parameter count.\nTo break the coupling between computational cost and parameter count, many recent works (Shazeer et al.,\n2017; Lepikhin et al., 2020; Fedus et al., 2022; Zhou et al., 2022) have adopted the Mixture-of-Experts (MoE)\narchitecture, which uses a set of sparsely activated expert modules (often FFWs) in place of a single dense\nFFW. Clark et al. (2022) studied the scaling law of MoE language models and showed that increasing the\nnumber of experts is an effective way to improve performance without increasing the inference cost. However,\ntheir experiments showed that the efficiency gains provided by MoEs plateau after a certain model size is\nreached. More recently, Krajewski et al. (2024) discovered that this plateau was caused by using a fixed\nnumber of training tokens. When the number of training tokens is compute-optimal, MoEs consistently\noutperform dense models in terms of FLOP efficiency. Moreover, they introduced granularity (the number\nof active experts) as a new scaling axis and empirically showed that using higher granularity improves\nperformance. Extrapolating this fine-grained MoE scaling law suggests that continued improvement of\nmodel capacity will ultimately lead to a large model with high granularity, corresponding to an architecture\nof an immense number of tiny experts.\nBeyond efficient scaling, another reason to have a vast number of experts is lifelong learning, where MoE\nhas emerged as a promising approach (Aljundi et al., 2017; Chen et al., 2023; Yu et al., 2024; Li et al.,\n2024). For instance, Chen et al. (2023) showed that, by simply adding new experts and regularizing them\nproperly, MoE models can adapt to continuous data streams. Freezing old experts and updating only new\nones prevents catastrophic forgetting and maintains plasticity by design. In lifelong learning settings, the\ndata stream can be indefinitely long or never-ending (Mitchell et al., 2018), necessitating an expanding pool\nof experts.\nAlthough both efficient scaling and lifelong learning require MoE designs capable of handling a vast number\nof experts, to the best of our knowledge, the only architecture supporting more than ten thousands of experts\nis the Mixture of Word Experts (MoWE) (dos Santos et al., 2023). However, MoWE is language-specific\nand uses a fixed routing scheme. Theoretical and empirical evidence (Clark et al., 2022; Dikkala et al., 2023)\nhighlights the advantages of learned routers over non-trainable ones. Thus, an MoE design with a learned\nrouter scalable to over a million experts remains an open area for exploration.\nThis work introduces the Parameter Efficient Expert Retrieval (PEER) architecture, leveraging product\nkey retrieval (Lample et al., 2019) for efficient routing to an extremely large number of experts, decoupling\ncomputational cost from parameter count. This design demonstrates a superior compute-performance trade-\noff in our experiments, positioning it as a competitive alternative to dense FFW layers for scaling foundation\nmodels. The main contributions of this work are:\n•Exploration of Extreme MoE Setting: Deviating from the focus on a small number of large experts\nin previous MoE research, this work investigates the under-explored case of numerous tiny experts.\n•LearnedIndexStructureforRouting: Demonstratingforthefirsttimethatalearnedindexstructure\n(Kraska et al., 2018) can efficiently route to over a million experts.\n•New Layer Design: Combining product key routing with single-neuron experts, we introduce the\nPEER layer that expands layer capacity without significant computational overheads. Empirical re-\nsults demonstrate its superior efficiency compared to dense FFW, coarse-grained MoEs and Product\nKey Memory (PKM) layers.\n•Comprehensive Ablation Studies: We investigate the impact of different design choices of PEER\nsuch as number of experts, active parameters, number of heads and query batch normalization on\nlanguage modeling tasks.\n2\n\nParameter Efficient Experts \nInput Retrieval \nQuery Transformer \nBackbone \nTop k Indices \nCompute \nSimilarity Product Keys Mixture Figure 2: Illustration of the PEER layer. A PEER layer can be inserted in the middle of a transformer\nbackbone or can be used to replace FFW layers. Given the state vector xfrom the previous layer, a query\nnetworkqmaps it to a query vector q(x), which is then compared with the product keys to compute the\nrouter scores and to retrieve the top kexpertse1,...,ek. After the retrieved experts make their predictions\nei(x), their outputs are linearly combined using the softmax-normalized router scores as weights.\n2 Method\nIn this section, we introduce the Parameter Efficient Expert Retrieval (PEER) layer, which is a Mixture\nof Experts architecture using product keys (Lample et al., 2019) in the router and single-neuron MLPs as\nexperts. Fig. 2 illustrates the computational process within a PEER layer.\nPEER Overview Formally, a PEER layer is a function f:Rn→Rmthat consists of three parts: a pool of\nNexperts E:={ei}N\ni=1, where each expert ei:Rn→Rmshares the same signature as f, a corresponding\nset ofNproduct keys K:={ki}N\ni=1⊂Rd, and a query network q:Rn→Rdthat maps the input vector\nx∈Rnto a query vector q(x). LetTkdenote the top-k operator. Given an input x, we first retrieve a subset\nofkexperts whose corresponding product keys have the highest inner products with the query q(x).\nI=Tk/parenleftbig\n{q(x)Tki}N\ni=1/parenrightbig\n# Retrieve top kexperts (1)\nThen we apply nonlinear activations (such as softmax or sigmoid) to the query-key inner products of these\ntopkexperts to obtain the router scores.\ngi(x) =s(q(x)Tki) # Compute router scores (2)\nFinally, we compute the output by linearly combining the expert outputs weighted by the router scores.\nf(x) =/summationdisplay\ni∈Igi(x)ei(x) # Aggregate expert outputs (3)\nProduct Key Retrieval Since we intend to use a very large number of experts ( N≥106), naively computing\nthe topkindices in Eq. 1 can be very expensive. Hence we apply the product key retrieval technique here.\nInstead of using Nindependent d-dimensional vectors as our keys ki, we create them by concatenating\nvectors from two independent sets ofd\n2-dimensional sub-keys C,C′⊂Rd\n2:\nK={/bracketleftbiggc\nc′/bracketrightbigg\n|c∈C,c′∈C′} (4)\nNote that here C,C′have cardinality√\nNandc,c′have dimensionalityd\n2. So in practice, we choose Nto\nbe a perfect square and dto be an even number.\n3\n\nThis Cartesian product structure of Kallows us to find the top kexperts efficiently. Instead of comparing\nq(x)to allNkeys in Kand selecting the top k matches, we can split the query vector q(x)into two sub-\nqueriesq1andq2and apply the top k operations to the inner products between the sub-queries and sub-keys\nrespectively:\nIC=Tk/parenleftbig\n(qT\n1ci)/parenrightbig\n,IC′=Tk/parenleftbig\n(qT\n2c′\nj)/parenrightbig\n(5)\nThis results in a set of k2candidate keys K′:={/bracketleftbiggci\ncj/bracketrightbigg\n|i∈IC,j∈I′\nC}, and it is mathematically guaranteed\nthat thekmost similar keys to q(x)fromKare in this candidate set. Moreover, the inner product between\nthe candidate key and q(x)is simply the sum of inner products between the sub-keys and sub-queries:\nq(x)T/bracketleftbiggci\ncj/bracketrightbigg\n=qT\n1ci+qT\n2cj. Hence we can apply the top-k operator again to these k2inner products to get\nthe top k matching keys from the original set of product keys K. As explained in Lample et al. (2019). This\nreduces the complexity of top k expert retrieval in Eq. 1 from O(Nd)as done naively by exhaustive search\ntoO((√\nN+k2)d).\nParameter Efficient Experts and Multi-Head Retrieval Unlike other MoE architectures, which often set\nthe hidden layer of each expert to the same size as other FFW layers, in PEER, every expert eiis a singleton\nMLP, in other words, it has only one hidden layer with a single neuron:\nei(x) :=σ(uT\nix)vi (6)\nwherevi,uiare not matrices but vectors with the same dimension as x, andσis a nonlinear activation\nfunction such as ReLU or GELU. We omit bias terms here for brevity.\nInstead of varying the size of individual experts, we adjust the expressiveness of a PEER layer by using multi-\nhead retrieval, similar to the multi-head attention mechanism in transformers and the multi-head memory\nin PKMs. In particular, we use hindependent query networks instead of one, each computes its own query\nand retrieves a separate set of kexperts. However, different heads share the same pool of experts with the\nsame set of product keys. The outputs of these hheads are simply summed up:\nf(x) :=h/summationdisplay\ni=1fi(x) =h/summationdisplay\ni=1/summationdisplay\nj∈Iigj(x)ej(x) (7)\nOne can verify that when only one expert is retrieved ( k= 1) per head, using a PEER layer with hheads\nis the same as using one expert with hhidden neurons:\nf(x) =h/summationdisplay\ni=1ei(x) =h/summationdisplay\ni=1σ(uT\nix)vi=Vσ(WTx); (8)\nwhereW= [u1,···,uh],V= [v1,···,vh]. In other words, PEER dynamically assembles an MLP with h\nneurons by aggregating hsingleton MLPs retrieved from a shared repository. Compared to existing MoE\napproaches that use MLPs with multiple hidden neurons as experts, this design allows shared hidden neurons\namong experts, enhancing knowledge transfer and parameter efficiency.\nAlgorithm 1 shows a simplified implementation of the PEER forward pass, storing parameter-efficient expert\nweights in embedding layers and combining them with einsum operations. This implementation can be\neasily extended to experts of the GLU variants (Shazeer, 2020) by adding additional linear gating weights.\nIn practice, an efficient implementation may require specialized hardware kernels to accelerate embedding\nlookup and fusion with the einsum operations.\nWhy A Large Number of Small Experts? Given an MoE layer, we can characterize it by three hyperparam-\neters: the total number of parameters P, the number of active parameters per token Pactiveand the size of a\nsingle expert Pexpert. Krajewski et al. (2024) showed that the scaling law of MoE models has the following\nform:\nL(P,D,G ) =c+ (g\nGγ+a)1\nPα+b\nDβ, (9)\n4\n\nwhereLis the final test loss, a,b,g,γ,α,β are constants, Dis the total number of training tokens and the\ngranularity Gis the number of active experts:\nG:=Pactive\nPexpert(10)\nIn order to improve model performance, we need to scale up P,D,G. On the other hand, it is essential to\nlimitPactivebecause the computational and memory costs are primarily determined by the active parameters\nduring training and inference. Notably, the memory footprint corresponding to Pactivehas to be multiplied\nby the number of tokens in a batch, while the memory cost of Pis independent of the batch size and sequence\nlength because only one copy of the model needs to be stored.\nAs a result, we want to increase P,Gbut notPactive. Since the expert size Pexpert =Pactive/Gand the\nnumber of experts N=P/P expert =P·G/P active, this implies that we should decrease the size of each\nexpert,Pexpert, and increase the number of experts N. Hence we need a large number of small experts.\nIn general, for experts that are MLPs with a single hidden layer. Pexpert = (2dmodel + 1)dexpertandPactive =\n(2dmodel +1)dactive, wheredmodel,dexpertanddactiveare the hidden dimension of the transformer, the number\nofhiddenneuronsusedinoneexpertandthetotalnumberofhiddenneuronsactivatedpertoken,respectively.\nIn the case of PEER, we use the smallest expert size possible by setting dexpert = 1, and the number of\nactivated neurons is the number of retrieval heads multiplied by the number of experts retrieved per head:\ndactive =hk. Consequently, the granularity of PEER is always G=Pactive/Pexpert =dactive/dexpert =hk.\n1def peer_forward (self , x):\n2 # Embedding layers storing the down /up projection weights of all experts\n3 self . w_down_embed = nn. Embed ( num_embeddings = self . n_experts , features = self . d_model )\n4 self . w_up_embed = nn. Embed ( num_embeddings = self . n_experts , features = self . d_model )\n5\n6 # Retrieve the weights of the top matching experts using product keys\n7 # indices and scores have the shape ’bthk ’, where h is the number of heads\n8 indices , scores = self . get_indices ( self . query_proj (x), self . sub_keys , top_k = self .k)\n9 w_down = self . w_down_embed ( indices )\n10 w_up = self . w_up_embed ( indices )\n11\n12 # Compute weighted average of expert outputs\n13 x = jnp . einsum (’btd , bthkd -> bthk ’, x, w_down )\n14 x = self . activation (x)\n15 x = x * nn. softmax ( scores )\n16 x = jnp . einsum (’bthk , bthkd -> btd ’, x, w_up )\n17 return x\nAlgorithm 1: Pseudo code implementation of a PEER layer forward pass. An example implementation of\nthe get_indices and query_proj functions in Pytorch can be found in Lample et al. (2021)\n3 Experiments\n3.1 Pretraining isoFLOP Analysis\nWe compare PEER with various baselines using isoFLOP analysis (Borgeaud et al., 2022b). We chose a\nfixed FLOP budget ( 6e18and2e19) and jointly varied the model size and the number of training tokens\nfrom the C4 dataset (Raffel et al., 2020) to obtain isoFLOP curves. Each point on an isoFLOP curve has\nthe same computational cost, and we plot them in terms of their model size and final validation perplexity\non C4.\nFor the dense baselines, we varied their size by changing the number of layers, attention heads and model\ndimensions. For MoE, PKM and PEER methods, we took each of the dense models considered and replaced\nthe FFW layer in the middle block (e.g. in a 12 block transformer, we replace the FFN in block 6) by a\nlayer of MoE, PKM and PEER, respectively.\nIn MoE, we used the expert-choice (Zhou et al., 2022) routing algorithm, which effectively addresses the\nexpert load imbalance issue and generally outperforms token-choice MoEs (see Section 4 for a review and\n5\n\ncomparison of these approaches). Each expert has the same size as the original MLPs in the corresponding\ndense model, and we use 128experts to cover the same range of model sizes as our PEER models. This\ntype of MoE represents standard coarse-grained MoE approaches, which consist of a small number of large\nexperts.\nIn PKM, we used 10242memories with h= 8heads and top k= 32memories were selected per head. We\nalso applied query batch normalization, as recommended in the original PKM paper (Lample et al., 2019),\nto enhance memory usage.\nIn PEER, we used 10242experts with h= 8heads and top k= 16experts per head. By default, we also\nenabled query BatchNorm to increase expert usage. Ablation studies in subsection 3.3 investigate the effect\nof these hyperparameters. Unlike the expert-choice MoE baseline, PEER represents a fine-grained approach\nwhere a large number of small experts are employed.\nAcross all model sizes and methods, we maintained a consistent batch size (128) and sequence length (2048).\nWe calculated the number of training steps by dividing the total compute budget by the FLOPs per training\nstep. Fig. 1 presents the isoFLOP profiles. Compared to the dense FFW baseline, the sparse alternatives\nshift the isoFLOP curves downward and to right because they introduce a larger number of total parameters\nPbut utilize a smaller or equal number of active parameters Pactive. Given the same compute budget, a\nPEER model achieves the lowest compute-optimal perplexity.\n3.2 Evaluation on Language Modeling Datasets\nAfter determining the compute-optimal model for each method based on the isoFLOP curves, we evaluated\nthe performance of these pretrained models on several popular language modeling datasets, including Cura-\ntion Corpus (Curation, 2020), Lambada (Paperno et al., 2016), the Pile (Gao et al., 2020), Wikitext (Merity\net al., 2016) and the pretraining dataset C4. Table 1 presents a summary of the evaluation results. We\ngrouped the models based on their FLOP budgets used during training.\nTable 1: Perplexities of the compute-optimal models of each method on language modeling datasets.\nMethod Curation Lambada Pile Wikitext C4\nCorpus\nDense (6e18) 23.26 21.95 24.55 29.14 23.84\nMoE (6e18) 20.98 19.09 23.26 26.10 21.41\nPKM (6e18) 21.80 19.39 20.49 27.09 21.92\nPEER (6e18) 20.68 17.65 19.01 25.48 20.63\nDense (2e19) 17.70 12.28 18.19 21.21 18.31\nMoE (2e19) 16.88 12.97 17.41 20.28 17.12\nPKM (2e19) 17.03 11.18 16.34 20.26 17.36\nPEER (2e19) 16.34 10.33 14.99 19.09 16.45\n3.3 Ablations\nVarying the Number of Total Experts The models in the isoFLOP plot depicted in Fig. 1 all have over\na million ( 10242) experts. Here we conduct an ablation study on the effect of the number of experts N,\nwhich determines the total parameter count Pin Eq. 9. We selected the model at the isoFLOP-optimal\nposition and vary the number of experts ( N= 1282,2562,5122,10242) in the PEER layer while keeping the\nnumber of active experts constant ( h= 8,k= 16). The results are shown in Fig. 3 (a). As can be seen,\nthe isoFLOP curve interpolates between the PEER model with 10242experts and the corresponding dense\nbackbone without replacing the FFW layer in the middle block by a PEER layer. This demonstrates that\nsimply increasing the number experts can improve model performance.\nVarying the Number of Active Experts We also conducted an ablation study on the effect of the number\nof active experts hk, which equals the granularity Gin Eq. 9. We systematically varied the number of\n6\n\n(a) Varying Total Expert Num\n (b) Varying Active Expert Num\nFigure 3: We conduct two ablation studies using the same PEER model configuration. In (a), we vary the\ntotal number of experts Nwhile keeping the same number of active experts hk= 128. In (b), we vary the\nnumber of active experts G=hkby jointly changing handkwhile keeping the total number of experts at\nN= 10242.\nactive experts ( hk= 32,64,128,256,512) while keeping the number of total experts constant ( N= 10242).\nFurthermore, for a given hk, we jointly varied handkto identify the optimal composition. The resulting\nisoFLOP curves, plotted over the number of heads ( h), are shown in Fig. 3 (b).\nThe results indicate that, within the range of values considered, higher hkgenerally leads to improved per-\nformance. Notably, the optimal hincreases as hkincreases. However, the performance gradually saturates,\nand increasing the number of active experts also increases device memory consumption and may necessitate\nadditional accelerator devices. Thus in practice, the appropriate hkvalues should be selected based on the\ntrade-off between performance, device number and computational resource requirements.\nTable 2: KL and expert usage for different memory sizes, with and without query BN. Similar to the findings\nin PKM, using query BN results in a more balanced usage of the experts.\nExpert num N 16k 65k 262k 1M\nBatchNorm No Yes No Yes No Yes No Yes\nPerplexity 23.47 23.47 22.61 22.55 21.54 21.47 20.73 20.64\nExpert Usage (%) 100.0 100.0 100.0 100.0 100.0 100.0 99.8 100.0\nUnevenness ( ↓) 0.45 0.30 0.63 0.44 0.97 0.66 1.52 1.06\nExpert Usage and Query Batch Normalization Given the presence of over a million experts in the PEER\nlayer, it is natural to inquire how many of these experts are actually selected during inference and whether\ntheir usage is evenly distributed. To analyze this, we kept an accumulated router score, denoted as z′\ni=/summationtext\nxgi(x)for each expert eiacross all tokens xwithin the C4 validation set. Here gi(x)is the router score\nused to aggregate the expert output when token xis given as input, with gi(x) = 0if experteiis not selected.\nFrom these accumulated router scores, we can obtain an empirical probability distribution vector, denoted\nasz=z′/||z′||1, representing the distribution of all experts over the C4 validation set. Then we computed\nthe following metrics proposed by Lample et al. (2019) to assess the usage and distribution of experts:\n7\n\n•Expert Usage : the fraction of experts retrieved during inference: #{zi̸= 0}\n•Unevenness : KL divergence between zand the uniform distribution: log(N) +/summationtext\nizilog(zi)\nwhereNis the number of total experts.\nBy default, we also added a batch normalization (BN) layer on top of the query network, as proposed by\nLample et al. (2019) to increase the expert usage during training. Here we study the effect of adding this\nBN layer on the above-mentioned metrics.\nTable 2 presents the expert usage and unevenness for varying numbers of experts, with and without BN. We\ncan see that even for 1M experts, the expert usage is close to 100%, and using BN can lead to more balanced\nutilization of the experts and lower perplexities. These findings demonstrate the effectiveness of the PEER\nmodel in utilizing a large number of experts.\nFigure 4: Query BatchNorm Ablation. IsoFLOP curves of a PEER model with 1M experts on the C4\ndataset, with and without query BatchNorm.\nWe additionally compared isoFLOP curves with and without BN. Fig. 4 shows that the PEER model with\nBN generally achieves lower perplexities. While the difference is not significant, it is most pronounced around\nthe isoFLOP-optimal region.\n4 Related Works\nMixture of Expert Since Shazeer et al. (2017) demonstrated the effectiveness of sparsely-gated Mixtures\nof Experts (MoEs) in efficiently increasing model capacity on GPU clusters, MoEs have emerged as a pop-\nular technique for scaling large models efficiently. Subsequent research (Fedus et al., 2022; Lepikhin et al.,\n2020; Du et al., 2022) has proposed variations to address challenges such as load balancing, communication\noverhead, and training instability. These methods usually replace feedforward (FFW) layers in certain Trans-\nformer blocks with sparsely-gated MoE layers, which consist of multiple FFW layers as experts. Typically\neach expert matches the size of the regular dense FFW layer. Gating scores are calculated for each expert\nand token, and only the top k experts are activated for each token. These methods are known as token-choice\nmethods. More recently, Zhou et al. (2022) introduced the Expert Choice routing method, where experts\nchoose the top k tokens instead of tokens selecting experts. However, both token-choice and expert-choice\nmethods require the top-k operator on a gating score matrix of size N×M(N: number of experts, M:\nnumber of tokens), resulting in a routing cost of at least O(N). This limits their practical application to a\nsmall number of experts (typically less than 128).\n8\n\nInstead of using the top-k operator, some works also proposed using deterministic hash tables as routers\n(Roller et al., 2021; dos Santos et al., 2023). With O(1)average lookup complexity, these methods offer\npotential scalability to a large number of experts. However, these routers are fixed and not learned. Clark\net al. (2022) showed that deterministic routing does not scale as well as trainable routers. Furthermore,\nDikkala et al. (2023) proved theoretically that learned routers offer non-trivial advantages over their fixed\ncounterparts, such as removing spurious directions and identifying latent clusters in data. In contrast to\nprevious works, the proposed PEER layer employs a learned router with sublinear ( O(√\nN)) complexity.\nSince PEER uses lightweight experts, our work is also related to recent studies on parameter-efficient MoEs\n(Wang et al., 2022; Zadouri et al., 2024). These methods utilize parameter efficient fine-tuning (PEFT)\nadapters as experts instead of full-sized FFWs. Their focus is on minimizing the number of parameters\nupdated during fine-tuning, allowing storage of only one copy of the large backbone model. In PEER,\nparameter efficiency refers to the small number of active parameters in the MoE layer, which directly affects\nFLOPs and activation memory consumption during pre-training and inference. However, PEER could\npotentially be adapted to retrieve a large number of PEFT adapters.\nRetrieval-Augmented Models Our proposed method, with its retrieval mechanism for a large number of\nexperts, aligns with the emerging field of retrieval-augmented models. These models facilitate large model\nmemorization by retrieving knowledge from external databases, leading to improved accuracy and efficiency\non knowledge-intensive tasks. Some notable works in this domain include ones by Khandelwal et al. (2019);\nBorgeaudetal.(2022a);Guuetal.(2020). Whilethesemethodsretrievedatainvariousformats, forinstance,\ntokens (Khandelwal et al., 2019), chunks (Borgeaud et al., 2022b) or knowledge graphs (Kang et al., 2023)\n(see (Gao et al., 2023) for a comprehensive survey on this topic), they differ from the proposed method in\nthat they retrieve data rather than learned functions (experts). This distinction sets our parameter-efficient\nexpert retrieval approach apart from existing retrieval-augmented models.\nEfficient Feedforward Layers Enhancing the efficiency of feedforward networks has been a long-standing\narea of research. Similar to PEER, most approaches are based on the idea of conditional computation\n(Bengio, 2013), where a gating mechanism is trained to determine which subset of neurons to compute. For\ninstance, Davis & Arel (2013) utilized low-rank weight matrix approximation to estimate the sign of pre-\nnonlinearity activations. Neurons with negative activations are omitted as they will produce zeros after the\nnonlinearity. Bengio et al. (2015) explored reinforcement learning to develop an activation-dependant policy\nfordroppingblocksofneurons. Morerecently,Belcak&Wattenhofer(2023)introducedtheFastFeedForward\n(FFF) layer that employs a differentiable balanced binary tree to select a neuron block for computation.\nDuring inference, only one leaf (corresponding to one block) is selected, hence it has O(log(N))complexity,\nwhereNis the total number of blocks in the tree. However, during training, all leaves and intermediate\nnodes are activated for gradient calculation, imposing a training complexity of O(N)and limiting the total\nnumber of blocks. The most relevant work to ours is the Product Key Memory (PKM) (Lample et al., 2019),\nwhose retrieval technique is utilized as the router in the PEER layer. However, PKM retrieves memory\nvectors instead of functions, thus their values cannot vary according to the inputs. As we show in Section 3,\nby changing the memory vectors to input-dependent expert networks, PEER can achieve significantly higher\nefficiency than PKM. Finally, Csordás et al. (2023) presented a unified view encompassing FFW, MoE and\nPKM and proposed to change the router normalization function in MoE and PKM from softmax to sigmoid\nor ReLU.\n5 Conclusion\nThis work introduces a fine-grained MoE architecture that decomposes an extremely wide dense feedforward\nlayer into a large number of small experts. This design is supported by the recent discovery of the fine-\ngrained MoE scaling law. To overcome the computational overhead of routing to a large number of experts,\nwe apply the product keys to efficiently select a small subset of hidden neurons within a wide MLP layer.\nEmpirical analysis using language modeling tasks demonstrate that given the same compute budget, PEER\nsignificantly outperforms dense transformers, coarse-grained MoEs and product key memory layers.\n9\n\nAcknowledgments\nThe author would like to thank Adam Santoro, Arthur Guez, Arthur Szlam, Andrei Rusu, Marc’aurelio\nRanzato, Simon Schug, Utku Evci, Doina Precup and Razvan Pascanu for their insightful discussions and\ninvaluable advice. The author is also grateful to Zhitao Gong, Daniel Toyama, Qixuan Feng and Jiajun Shen\nfor their technical assistance. Special thanks are due to Adam Santoro for sharing the isoFLOP analysis\nscripts and to Andy Brock for building and maintaining the internal codebase used to train the models.\nReferences\nRahaf Aljundi, Punarjay Chakravarty, and Tinne Tuytelaars. Expert gate: Lifelong learning with a network\nof experts. In Proceedings of the IEEE conference on computer vision and pattern recognition , pp. 3366–\n3375, 2017.\nPeter Belcak and Roger Wattenhofer. Fast feedforward networks. arXiv preprint arXiv:2308.14711 , 2023.\nEmmanuel Bengio, Pierre-Luc Bacon, Joelle Pineau, and Doina Precup. Conditional computation in neural\nnetworks for faster models. arXiv preprint arXiv:1511.06297 , 2015.\nYoshua Bengio. Deep learning of representations: Looking forward. In International conference on statistical\nlanguage and speech processing , pp. 1–37. Springer, 2013.\nSebastian Borgeaud, Arthur Mensch, Jordan Hoffmann, Trevor Cai, Eliza Rutherford, Katie Millican,\nGeorge Bm Van Den Driessche, Jean-Baptiste Lespiau, Bogdan Damoc, Aidan Clark, Diego De Las Casas,\nAurelia Guy, Jacob Menick, Roman Ring, Tom Hennigan, Saffron Huang, Loren Maggiore, Chris Jones,\nAlbin Cassirer, Andy Brock, Michela Paganini, Geoffrey Irving, Oriol Vinyals, Simon Osindero, Karen\nSimonyan, Jack Rae, Erich Elsen, and Laurent Sifre. Improving language models by retrieving from\ntrillions of tokens. In Kamalika Chaudhuri, Stefanie Jegelka, Le Song, Csaba Szepesvari, Gang Niu,\nand Sivan Sabato (eds.), Proceedings of the 39th International Conference on Machine Learning , vol-\nume 162 of Proceedings of Machine Learning Research , pp. 2206–2240. PMLR, 17–23 Jul 2022a. URL\nhttps://proceedings.mlr.press/v162/borgeaud22a.html .\nSebastian Borgeaud, Arthur Mensch, Jordan Hoffmann, Trevor Cai, Eliza Rutherford, Katie Millican,\nGeorge Bm Van Den Driessche, Jean-Baptiste Lespiau, Bogdan Damoc, Aidan Clark, et al. Improving\nlanguage models by retrieving from trillions of tokens. In International conference on machine learning ,\npp. 2206–2240. PMLR, 2022b.\nWuyang Chen, Yanqi Zhou, Nan Du, Yanping Huang, James Laudon, Zhifeng Chen, and Claire Cui. Life-\nlong language pretraining with distribution-specialized experts. In International Conference on Machine\nLearning , pp. 5383–5395. PMLR, 2023.\nAidanClark, DiegoDeLasCasas, AureliaGuy, ArthurMensch, MichelaPaganini, JordanHoffmann, Bogdan\nDamoc, Blake Hechtman, Trevor Cai, Sebastian Borgeaud, et al. Unified scaling laws for routed language\nmodels. In International Conference on Machine Learning , pp. 4057–4086. PMLR, 2022.\nRóbert Csordás, Kazuki Irie, and Jürgen Schmidhuber. Approximating two-layer feedforward networks for\nefficient transformers. In The 2023 Conference on Empirical Methods in Natural Language Processing ,\n2023.\nCuration. Curation corpus base, 2020.\nDamai Dai, Li Dong, Yaru Hao, Zhifang Sui, Baobao Chang, and Furu Wei. Knowledge neurons in pretrained\ntransformers. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics\n(Volume 1: Long Papers) , pp. 8493–8502, 2022.\nAndrew Davis and Itamar Arel. Low-rank approximations for conditional feedforward computation in deep\nneural networks. arXiv preprint arXiv:1312.4461 , 2013.\n10\n\nNishanth Dikkala, Nikhil Ghosh, Raghu Meka, Rina Panigrahy, Nikhil Vyas, and Xin Wang. On the benefits\nof learning to route in mixture-of-experts models. In The 2023 Conference on Empirical Methods in\nNatural Language Processing , 2023. URL https://openreview.net/forum?id=QV79qiKAjD .\nCicero Nogueira dos Santos, James Lee-Thorp, Isaac Noble, Chung-Ching Chang, and David Uthus. Memory\naugmented language models through mixture of word experts, 2023.\nNan Du, Yanping Huang, Andrew M Dai, Simon Tong, Dmitry Lepikhin, Yuanzhong Xu, Maxim Krikun,\nYanqi Zhou, Adams Wei Yu, Orhan Firat, Barret Zoph, Liam Fedus, Maarten P Bosma, Zongwei Zhou,\nTao Wang, Emma Wang, Kellie Webster, Marie Pellat, Kevin Robinson, Kathleen Meier-Hellstern, Toju\nDuke, Lucas Dixon, Kun Zhang, Quoc Le, Yonghui Wu, Zhifeng Chen, and Claire Cui. GLaM: Efficient\nscaling of language models with mixture-of-experts. In Kamalika Chaudhuri, Stefanie Jegelka, Le Song,\nCsaba Szepesvari, Gang Niu, and Sivan Sabato (eds.), Proceedings of the 39th International Conference\non Machine Learning , volume 162 of Proceedings of Machine Learning Research , pp. 5547–5569. PMLR,\n17–23 Jul 2022. URL https://proceedings.mlr.press/v162/du22c.html .\nWilliam Fedus, Barret Zoph, and Noam Shazeer. Switch transformers: Scaling to trillion parameter models\nwith simple and efficient sparsity. The Journal of Machine Learning Research , 23(1):5232–5270, 2022.\nLeo Gao, Stella Biderman, Sid Black, Laurence Golding, Travis Hoppe, Charles Foster, Jason Phang, Horace\nHe, AnishThite, NoaNabeshima, ShawnPresser, andConnorLeahy. ThePile: An800gbdatasetofdiverse\ntext for language modeling. arXiv preprint arXiv:2101.00027 , 2020.\nYunfan Gao, Yun Xiong, Xinyu Gao, Kangxiang Jia, Jinliu Pan, Yuxi Bi, Yi Dai, Jiawei Sun, and\nHaofen Wang. Retrieval-augmented generation for large language models: A survey. arXiv preprint\narXiv:2312.10997 , 2023.\nMor Geva, Roei Schuster, Jonathan Berant, and Omer Levy. Transformer feed-forward layers are key-\nvalue memories. In Marie-Francine Moens, Xuanjing Huang, Lucia Specia, and Scott Wen-tau Yih (eds.),\nProceedings of the 2021 Conference on Empirical Methods in Natural Language Processing , pp. 5484–5495,\nOnline and Punta Cana, Dominican Republic, November 2021. Association for Computational Linguistics.\ndoi: 10.18653/v1/2021.emnlp-main.446. URL https://aclanthology.org/2021.emnlp-main.446 .\nKelvinGuu, KentonLee, ZoraTung, PanupongPasupat, andMingweiChang. Retrievalaugmentedlanguage\nmodel pre-training. In International conference on machine learning , pp. 3929–3938. PMLR, 2020.\nJordan Hoffmann, Sebastian Borgeaud, Arthur Mensch, Elena Buchatskaya, Trevor Cai, Eliza Rutherford,\nDiego de Las Casas, Lisa Anne Hendricks, Johannes Welbl, Aidan Clark, et al. Training compute-optimal\nlarge language models. arXiv preprint arXiv:2203.15556 , 2022.\nMinki Kang, Jin Myung Kwak, Jinheon Baek, and Sung Ju Hwang. Knowledge graph-augmented language\nmodels for knowledge-grounded dialogue generation. arXiv preprint arXiv:2305.18846 , 2023.\nJared Kaplan, Sam McCandlish, Tom Henighan, Tom B Brown, Benjamin Chess, Rewon Child, Scott Gray,\nAlec Radford, Jeffrey Wu, and Dario Amodei. Scaling laws for neural language models. arXiv preprint\narXiv:2001.08361 , 2020.\nUrvashi Khandelwal, Omer Levy, Dan Jurafsky, Luke Zettlemoyer, and Mike Lewis. Generalization through\nmemorization: Nearest neighbor language models. In International Conference on Learning Representa-\ntions, 2019.\nJakub Krajewski, Jan Ludziejewski, Kamil Adamczewski, Maciej Pióro, Michał Krutul, Szymon Antoniak,\nKamil Ciebiera, Krystian Król, Tomasz Odrzygóźdź, Piotr Sankowski, et al. Scaling laws for fine-grained\nmixture of experts. arXiv preprint arXiv:2402.07871 , 2024.\nTim Kraska, Alex Beutel, Ed H Chi, Jeffrey Dean, and Neoklis Polyzotis. The case for learned index\nstructures. In Proceedings of the 2018 international conference on management of data , pp. 489–504,\n2018.\n11\n\nGuillaumeLample, AlexandreSablayrolles, Marc’AurelioRanzato, LudovicDenoyer, andHervéJégou. Large\nmemory layers with product keys. Advances in Neural Information Processing Systems , 32, 2019.\nGuillaume Lample, Alexandre Sablayrolles, Marc’Aurelio Ranzato, Ludovic Denoyer, and Hervé Jégou. Min-\nimalist implementation of a product-key memory layer. https://github.com/facebookresearch/XLM/\nblob/main/PKM-layer.ipynb , 2021.\nDmitry Lepikhin, HyoukJoong Lee, Yuanzhong Xu, Dehao Chen, Orhan Firat, Yanping Huang, Maxim\nKrikun, Noam Shazeer, and Zhifeng Chen. Gshard: Scaling giant models with conditional computation\nand automatic sharding. arXiv preprint arXiv:2006.16668 , 2020.\nHongbo Li, Sen Lin, Lingjie Duan, Yingbin Liang, and Ness B. Shroff. Theory on mixture-of-experts in\ncontinual learning, 2024. URL https://arxiv.org/abs/2406.16437 .\nStephen Merity, Caiming Xiong, James Bradbury, and Richard Socher. Pointer sentinel mixture models,\n2016.\nTomMitchell, WilliamCohen, EstevamHruschka, ParthaTalukdar, BishanYang, JustinBetteridge, Andrew\nCarlson, Bhavana Dalvi, Matt Gardner, Bryan Kisiel, et al. Never-ending learning. Communications of\nthe ACM , 61(5):103–115, 2018.\nDenis Paperno, Germán Kruszewski, Angeliki Lazaridou, Ngoc Quan Pham, Raffaella Bernardi, Sandro\nPezzelle, MarcoBaroni, GemmaBoleda, andRaquelFernández. TheLAMBADAdataset: Wordprediction\nrequiring a broad discourse context. In Proceedings of the 54th Annual Meeting of the Association for\nComputational Linguistics (Volume 1: Long Papers) , pp. 1525–1534, Berlin, Germany, August 2016.\nAssociation for Computational Linguistics. doi: 10.18653/v1/P16-1144. URL https://www.aclweb.org/\nanthology/P16-1144 .\nColin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou,\nWei Li, and Peter J Liu. Exploring the limits of transfer learning with a unified text-to-text transformer.\nJournal of machine learning research , 21(140):1–67, 2020.\nStephen Roller, Sainbayar Sukhbaatar, Jason Weston, et al. Hash layers for large sparse models. Advances\nin Neural Information Processing Systems , 34:17555–17566, 2021.\nNoam Shazeer. Glu variants improve transformer, 2020. URL https://arxiv.org/abs/2002.05202 .\nNoam Shazeer, *Azalia Mirhoseini, *Krzysztof Maziarz, Andy Davis, Quoc Le, Geoffrey Hinton, and Jeff\nDean. Outrageously large neural networks: The sparsely-gated mixture-of-experts layer. In International\nConference on Learning Representations , 2017. URL https://openreview.net/forum?id=B1ckMDqlg .\nYaqing Wang, Sahaj Agarwal, Subhabrata Mukherjee, Xiaodong Liu, Jing Gao, Ahmed Hassan Awadal-\nlah, and Jianfeng Gao. AdaMix: Mixture-of-adaptations for parameter-efficient model tuning. In Yoav\nGoldberg, Zornitsa Kozareva, and Yue Zhang (eds.), Proceedings of the 2022 Conference on Empiri-\ncal Methods in Natural Language Processing , pp. 5744–5760, Abu Dhabi, United Arab Emirates, De-\ncember 2022. Association for Computational Linguistics. doi: 10.18653/v1/2022.emnlp-main.388. URL\nhttps://aclanthology.org/2022.emnlp-main.388 .\nJiazuo Yu, Yunzhi Zhuge, Lu Zhang, Ping Hu, Dong Wang, Huchuan Lu, and You He. Boosting continual\nlearning of vision-language models via mixture-of-experts adapters. In Proceedings of the IEEE/CVF\nConference on Computer Vision and Pattern Recognition (CVPR) , pp. 23219–23230, June 2024.\nTed Zadouri, Ahmet Üstün, Arash Ahmadian, Beyza Ermis, Acyr Locatelli, and Sara Hooker. Pushing\nmixture of experts to the limit: Extremely parameter efficient moe for instruction tuning. In The Twelfth\nInternational Conference on Learning Representations , 2024. URL https://openreview.net/forum?id=\nEvDeiLv7qc .\nYanqi Zhou, Tao Lei, Hanxiao Liu, Nan Du, Yanping Huang, Vincent Zhao, Andrew M Dai, Quoc V Le,\nJames Laudon, et al. Mixture-of-experts with expert choice routing. Advances in Neural Information\nProcessing Systems , 35:7103–7114, 2022.\n12",
  "textLength": 40331
}