{
  "paperId": "f9ed40c0f2a1119a690f056cdc81cd3a4ddebcf6",
  "title": "Optimizing Health Coverage in Ethiopia: A Learning-augmented Approach and Persistent Proportionality Under an Online Budget",
  "pdfPath": "f9ed40c0f2a1119a690f056cdc81cd3a4ddebcf6.pdf",
  "text": "Optimizing Health Coverage in Ethiopia: A Learning-augmented\nApproach and Persistent Proportionality Under an Online Budget\nDavin Choo∗\nJohn A. Paulson School of Engineering and Applied Sciences\nHarvard University\nYohai Trabelsi∗\nJohn A. Paulson School of Engineering and Applied Sciences\nHarvard University\nFentabil Getnet\nNational Data Management and Analytics Center for Health\nEthiopian Public Health Institute\nSamson Warkaye Lamma\nNational Data Management and Analytics Center for Health\nEthiopian Public Health Institute\nWondesen Nigatu\nPrimary Healthcare and Community Engagement Lead Executive Office\nMinistry of Health\nKasahun Sime\nPrimary Healthcare and Community Engagement Lead Executive Office\nMinistry of Health\nLisa Matay\nDepartment of Global Health and Population\nHarvard T.H. Chan School of Public Health\nMilind Tambe\nJohn A. Paulson School of Engineering and Applied Sciences\nHarvard University\nSt´ ephane Verguet\nDepartment of Global Health and Population\nHarvard T.H. Chan School of Public Health\nSeptember 3, 2025\n1arXiv:2509.00135v1  [cs.AI]  29 Aug 2025\n\nAbstract\nAs part of nationwide efforts aligned with the United Nations’ Sustainable Development Goal 3 on\nUniversal Health Coverage, Ethiopia’s Ministry of Health is strengthening health posts to expand access\nto essential healthcare services. However, only a fraction of this health system strengthening effort can be\nimplemented each year due to limited budgets and other competing priorities, thus the need for an opti-\nmization framework to guide prioritization across the regions of Ethiopia. In this paper, we develop a tool,\nHealth Access Resource Planner ( HARP ), based on a principled decision-support optimization framework\nfor sequential facility planning that aims to maximize population coverage under budget uncertainty while\nsatisfying region-specific proportionality targets at every time step. We then propose two algorithms: (i)\na learning-augmented approach that improves upon expert recommendations at any single-step; and (ii) a\ngreedy algorithm for multi-step planning, both with strong worst-case approximation estimation. In collab-\noration with the Ethiopian Public Health Institute and Ministry of Health, we demonstrated the empirical\nefficacy of our method on three regions across various planning scenarios.\n1 Introduction\nEthiopia, the second most populous country in Africa, is home to over 130 million people across 12 regional\nstates and two chartered cities, further divided into zones, woredas (districts), and kebeles (the smallest admin-\nistrative units) [UNF22, Wor22]. Roughly 76% of the population lives in rural areas, where access to healthcare\nis limited compared to urban settings [HWT+23]. While the physical accessibility of health facilities has sig-\nnificantly improved, the issue is ensuring the quality of essential healthcare service delivery.\nThe Ethiopian healthcare system follows a three-tier structure comprising Primary Health Care Units\n(PHCUs), general hospitals, and specialized hospitals. PHCUs, responsible for 70-80% of essential health\nservices, have been expanded under the Ministry of Health’s (MOH) flagship Health Extension Program (HEP),\nlaunched in 2003/04 [WTRC16]. Unfortunately, persistent challenges remain as the evolution of the HEP is not\naligned with the ever increasing demand of the community to get a comprehensive essential healthcare services\n(health promotion-rehabilitative care) at the health post. This resulted in inadequate staffing and equipment,\nand declining and/or stagnating performance in maternal and child health indicators [TAM+20].\nTo address these gaps, MOH introduced the HEP Optimization Roadmap (2020–2035) [oHE20]. A central\nreform is the reclassification of health posts into three categories: mixed, basic, and comprehensive. Compre-\nhensive health posts are designed to deliver a broader suite of services, including childbirth, postnatal care, and\nchronic disease treatment, and require substantial investments in infrastructure, staffing, and medical supplies.\nThe roadmap calls for the construction (or upgrading) of over 2,000 comprehensive health posts, with\nan estimated cost of USD $300,000- $400,000 per facility excluding staffing and equipment. As of now, 260\nare operational and 183 are under construction. While initial decisions used WHO’s AccessMod platform\n(https://www.accessmod.org/ ), they did not incorporate region-specific prioritization preferences (see below)\nor account for geographic and demographic factors that are known to drive service disparities [GFT+25].\nGiven limited resources and growing health demands, there is a pressing need for a strategic, data-driven\napproach to guide equitable facility placement, e.g., where to build the next comprehensive health post given\nlimited annual budget to augment the existing network of healthcare facilities. This requires integrating\ndiverse datasets, including geolocation of existing facilities, high-resolution population estimates, topographic\nand official district administrative shapefiles, and health service coverage indicators like skilled birth attendance\nand postnatal care. Planning is further complicated by uncertainty in budgets and population forecasts, and\nthe need to ensure fairness at every decision point. Different regions may also impose varying distributional\npreferences: some may prioritize population density while others may target poorer districts.\nOur contributions. In collaboration with the Ethiopian Public Health Institute and Ministry of Health, we\nformalize the problem and develop a Health Access Resource Planner ( HARP ) tool to help regional planners\nnavigate these challenges and customize allocation strategies to local priorities.\n1. In Section 2, we propose and study the new abstract problem of m aximizing a non-decreasing submod-\nular function under o nline p artition and g lobal p roportional constraints ( MOPGP ), which captures the\nreal-world challenge of prioritizing health facility upgrades in Ethiopia. Crucially, our framework accom-\nmodates region-specific distributional goals by encoding proportionality constraints, making it a flexible,\nshared decision-support tool for planners with possibly differing regional priorities.\n∗Equal contribution; Alphabetical ordering\n2\n\nFigure 1: Map of Ethiopia overlaid with population estimates for 2026 (log scale). Left: Brighter yellow areas\nindicate higher population density. Right: Locations of Hospitals, health centers, and comprehensive health\nposts that can provide essential health services are highlighted in red. Many do not currently have 2-hour\naccess [HWT+23].\n2. We design algorithms to solve MOPGP with provable worst-case guarantees. These include a learning-\naugmented algorithm that integrates expert-provided selections, supporting regional planning workflows\nthat start with partial plans and seek principled refinement.\n3. In Section 5, in Appendix F and in Appendix G , we evaluate the HARP tool on some regions of Ethiopia\nusing two possible prioritization rules. We demonstrate that our approach successfully prioritizes coverage\naccording to the specified criteria while maintaining reasonable overall coverage.\nHARP enables regional planners to solve their specific instance of MOPGP using a unified, principled ap-\nproach. While our empirical results offer insight into practical performance, we emphasize that all findings are\nintended as a proof of concept and not official policy recommendations.\n2 Problem formulation\nNotation. We use lowercase letters for scalars, boldface for sets and sequences, and calligraphic letters for\nhigher-order objects (e.g., sets of sets, graphs, matroids). For a set A, let|A|denote its cardinality, and 2A\nits power set. The disjoint union of disjoint sets AandBis denoted A⊎B. We use R≥0for non-negative\nreals,Nfor natural numbers, N>0=N\\ {0}, and [ n] ={1, . . . , n }for any n∈N>0. For any sequence s∈[r]b\nand type q∈[r], let #( q,s) denote the number of times qappear in s, e.g., for s= (1,2,1,3)∈[3]4, we have\n#(1,s) = 2, #(2 ,s) = 1, and #(3 ,s) = 1.\nIn the following, we will formally define MOPGP in full generality and then contextualize to how it assists\nin facility location within any particular region of Ethiopia.\nWe model MOPGP as a sequential subset selection task, where the goal is to maximize a non-decreasing\nsubmodular function (see Section 3 for a formal definition) subject to two constraints: (i) an online budget\nconstraint modeling incremental budget arrivals, and (ii) a global proportional constraint enforcing type-level\nproportionality. Let V=V(1)⊎. . .⊎V(h)denote the ground set partitioned over hrounds. Each element\ne∈Vis associated with a type type( e)∈[r], inducing an second partitioning V=T1⊎. . .⊎Tr, where\nTq={e∈V: type( e) =q}. At each round t∈[h] (a year), a budget b(t)≤ |V(t)|is revealed and we must\nirrevocably select a subset S(t)⊆V(t)of size |S(t)| ≤b(t). We define the cumulative budget and selection up\nto round tasb(1:t)=Pt\nτ=1b(τ)andS(1:t)=⊎t\nτ=1S(τ)respectively. The objective is to maximize f: 2V→R,\na non-decreasing submodular function over the final selection S=S(1:h)⊆V, subject to the follow two\nconstraints:\n1.Online budget constraint :|S(t)| ≤b(t)for all t∈[h].\n3\n\n2.Global proportional constraint : For given proportions p1, . . . , p r∈[0,1] withPr\nq=1pq≤1, the\nselection should satisfy |S∩Tq| ≥pq· |S|for all types q∈[r].\nUnfortunately, it may not be feasible to always meet proportional targets. For instance, if b(1)= 1 and we\nrequire each of r≥2 types to have at least1\n10rproportion, then no single-element selection in the first time step\ncan meet this condition. As such, we define the notion of satisfaction ratio asαq(S) =|S∩Tq|\npq·|S|where αmin(S) =\nminq∈[r]αq(S) and define the best possible such ratio under budget basβ(b) = max A⊆V,|A|=bαmin(A). Note\nthat the proportional constraints on all types canbe satisfied when β(b)≥1.\nTo ensure long-term proportional balance, we insist that any feasible solution is a type feasible selection.\nDefinition 1 (Type feasible selection) .A subset S(1:h)⊆Vof size b(1:h)istype feasible if, for all time steps\nt∈[h]:\n1.αmin(S(1:t)) =β(b(1:t))\n2. Among all such sets, it minimizes |Q(S(1:t))|where\nQ(S(1:t)) =\u001a\nq∈[r] :αq(S(1:t)) =β(|S(1:t)|) and V(t)∩Tq̸=∅\u001b\nIntuitively, the set Q(S(1:t)) contains all types with the minimum satisfaction ratio. Since improving the\nsatisfication ratio αmin(·) requires one to select at least one at least element of each type in Q(·), minimizing\n|Q(·)|serves to hedge against potential budget uncertainty.\nWe are now ready to formally define MOPGP .\nDefinition 2 (MOPGP ).Given a non-decreasing submodular function f: 2V→R, time horizon h∈N,\nnumber of types r∈N>0, ground set V=V(1)⊎. . .⊎V(h)=T1⊎. . .⊎Tr, online budgets b={b(1), . . . , b(h)},\nand type proportions p={p1, . . . , p r}, theMOPGP (f, h, r, V,b,p) problem seeks to compute a type feasible\nselection S⊆Vsuch that |S(t)| ≤b(t)for all time steps t∈[h].\nObserve that MOPGP is a generalization of the well-studied NP-hard maximum coverage problem for a\nsuitably defined set function fwhen t= 1, r= 1, and p1= 0 (i.e., no proportionality constraints). As such,\none cannot expect to be able to compute an optimum selection S∗⊆Vin polynomial time in general. Instead,\nwe will design and analyze efficient approximation algorithms that can compute some selection S⊆Vsuch\nthatf(S)≥α·f(S∗) for some approximation ratio 0 ≤α≤1.\nContextualizing MOPGP to the Ethiopian setting. For our problem, we use the 1km-by-1km grid\npopulation forecasts for each region in Ethiopia [Wor25], as well as geographical information that enables\ncomputation of travel time [WNVR+20].\nLetUdenote the space of grid cells considered. For each year t∈[h], the set V(t)correspond to all grid\ncells in the region for which we can build a comprehensive health post while types correspond to the districts\nwithin the different regions in Ethiopia. Note that V(1), . . . ,V(h)are all defined over the same set of grid cells\nUbut correspond to building a facility at different time steps. For any facility located at grid cell c∈U,\nletcovered (c)⊆Ube the set of grid cells that are reachable from cwithin 2-hours of travel time, which\ndepends on the topological characteristics of the terrain and may vary across locations and directions. For a\nset of facility locations (i.e., subset of grid cells) S, we write covered (S) =S\nc∈Scovered (c)⊆Uto mean\nthe union of the covered cells.\nAs the planning process occurs over a multi-year horizon where facilities continue to provide coverage in all\nfuture time steps once it has been built, we define the objective function fis the number of people who can\naccess a comprehensive health post within a walking time of at most two hours under the proposed selection.\nTo be precise,\nf(S) =hX\nt=1X\nc∈covered (S(1:t))w(t)\nc (1)\nwhere w(t)\ncis the population forecast for year tfor grid cell c. We formally show that the above objective\nEq. (1) is submodular in Appendix B.1. Table 1 summarizes the mapping while Example 3 illustrates our\nformulation visually.\n4\n\nParameters for a region Component in MOPGP\n5-year planning horizon h= 5 time steps\nDistricts within a region rtypes\nAnnual building budget Online budgets b(t)\nLocation, at year t The set V(t)\nPosts built for year t S(t)⊆V(t)with|S(t)| ≤b(t)\n2-hour accessibility goal Determines c∈covered (S(1:t))\nForecast for cell cin year t Population weight w(t)\nc\nCoverage objective fdefined in Eq. (1)\nDistrict prioritization Proportions p1, . . . , p r\nPersistent proportionality Type feasibility in Definition 1\nTable 1: Mapping the Ethiopian context to MOPGP .\nExample 3.Consider the 5 ×5 population grid in Fig. 2 over h= 2 time steps, with b(1)= 2 and b(2)= 1.\nSuppose a facility at any cell provides coverage for any cell that is of Manhattan distance 1 from it. If we build\ntwo health posts at coordinate S(1)={(2,2),(4,3)}at the first time step and another at S(2)={(2,4)}at the\nsecond time step, then we see that f(S) =f(S(1)⊎S(2)) = 110, where we obtain a coverage of 46 from Year\n1 and 64 in Year 2. Observe that the population can change over time and health posts continue to provide\ncoverage in future time steps once built.\nFigure 2: An example illustrating MOPGP notation defined in Section 2. Health post locations are indicated\nby blue circles. Covered cells are colored. Observe that the two facilities built in Year 1 continue to provide\ncoverage in Year 2.\n3 Key concepts and related work\nAfter relating our formulation of MOPGP to the known concepts of submodular optimization and matroid\ntheory, we review related work on optimization under these structures, highlighting limitations of existing\nmethods in addressing the sequential and proportional constraints of MOPGP . Finally, we briefly introduce\nlearning-augmented algorithms. For more related work, see Appendix A.\nSubmodular Functions. LetVbe a finite ground set (e.g., the pairs (location, year) for building health\nposts) and f: 2V→Rbe a set function, e.g., a function that assigns a coverage value to any given set of\nlocations where health posts are built. We say that fis non-decreasing if f(A)≤f(B) for all A⊆B⊆V,\nandfis submodular if for all A⊆B⊆Vande∈V\\B,f(A∪{e})−f(A)≥f(B∪{e})−f(B). It is known\nthat a greedy selection gives a 1 −1/eapproximation for maximizing non-decreasing submodular functions\nunder a cardinality constraint [NWF78]. For notational convenience, we will write the marginal gain function\ngwith respect to fasg(A,B) =f(A⊎B)−f(A) for any two disjoint subsets A,B⊆V.\nMatroids. Matroids encompass a wide range of constraints that enable efficient optimization algorithms that\nadmit provable approximation guarantees. In this work, we are particularly interested in the special class\n5\n\nof partition matroid [Rec73] which has applications like load balancing, scheduling, and constrained subset\nselection.\nDefinition 4 (Partition matroid) .LetV=V1⊎. . .⊎Vrbe a partition of Vandx1, . . . , x r∈Nbe upper\nbounds. Then, the independence set Iof a partition matroid M= (V,I) is defined as I={S⊆V:|S∩Vq| ≤\nxq,∀q∈[r]}.\nIn our Ethiopian setting, budget and proportionality constraints each induce a partition matroid over the\nset of candidate facilities, e.g., budget at time step timposes the constraint that any valid selection Ssatisfies\n|S(t)∩V(t)| ≤b(t).\nOnline maximization under matroid constraints. A closely related problem to MOPGP is that of\nProblem (1.6) of [FNW78], which we present using our notation in Definition 5.\nDefinition 5 (Maximizing a non-decreasing submodular function subject to kmatroid intersections over h\nrounds) .LetV=V(1)⊎. . .⊎V(h)be a set of hdisjoint ground sets, f: 2V→Rbe a non-decreasing\nsubmodular set function, and M1= (V,I1), . . . ,Mk= (V,Ik) bekmatroids over V. The goal is to find a\nsubset S⊆Vthat maximizes f(S) subject to S∩V(t)∈ I1∩. . .∩ Ikfor all t∈[h].\nIf budget uncertainty were absent and only final-round proportional constraints mattered, the problem\ncould be modeled using two partition matroids ( k= 2), allowing the local greedy algorithm of [FNW78] to\nachieve a 1 /(k+ 1) = 1 /3 approximation. However, MOPGP differs fundamentally from Definition 5 in that\nmatroidal constraints – driven by online budget arrivals – are revealed incrementally over time. This renders\ndirect application of their method infeasible.\nFor the single-matroid ( k= 1) case, [CCPV11] achieve a 1 −1/eapproximation via continuous greedy\nmethods, while [GS07] show that local greedy retains a 1 /(α+ 1) approximation even when optimizing a proxy\nfunction gthat approximates the true objective fwithin a factor of α≥1.\nTo address evolving constraints, one may consider online optimization frameworks. The submodular sec-\nretary problem [BIK07, BHZ13] assumes fixed matroids and randomly arriving elements, whereas our setting\nreverses this: the ground set is fixed, but feasibility constraints (budgets) are revealed over time. Recent work\nby [CDKL24, SSZ25] explores online feasibility arrival but focuses on linear objectives and does not support\nglobal, type-based fairness constraints.\nFinally, fairness-aware submodular optimization [CHKV19, TWR+19] has addressed proportionality con-\nstraints, but these methods typically require full input access and use continuous relaxations or local exchanges,\nmaking them unsuitable for our setting of irrevocable, sequential decisions under uncertainty.\nLearning-augmented algorithms. In practice, regional governments may already have existing facility\nselection plans (for any single fixed time step with budget b) that are constructed using domain knowledge,\nheuristics, or political considerations. Such an advice selection often encode valuable local preferences but may\nnot be optimal under the formal objective. Learning-augmented algorithms provide a formal framework to\nimprove decision quality by incorporating advice or predictions, while maintaining worst-case guarantees when\nthe advice is poor [LV21]. The goal is to design algorithms that are both consistent (optimal when the advice\nis perfect) and robust (competitive with the best advice-free baseline), ideally with performance degrading\ngracefully as advice quality worsens. See [MV22] for a survey and Appendix A for further examples. Closest to\nus are the works of [LS24, AB24], which aim to improve update times in dynamic settings. In contrast, we aim\nto improve the approximation ratio achievable by any polynomial-time algorithm in a static selection setting.\n4 Algorithmic contributions\nWe present a learning-augmented1approach for optimizing facility locations at any single time step in Sec-\ntion 4.1 and analyze a greedy approach for multi-step planning under uncertainty in Section 4.2. While our\nlearning-augmented approach applies at every decision point, we only provide guarantees for a single fixed time\nstep.2In Section 4.3, we highlight the importance of Definition 1 by showing that one cannot achieve non-\ntrivial theoretical guarantees for MOPGP under online budgets without additional structure on the problem\ninstance. All proofs are deferred to the appendix.\n1While “learning-augmented” originated from using machine-learned predictions, the framework more broadly encompasses\nany source of advice, such as expert-curated selections in our setting.\n2Single-step guarantees offer interpretable, modular assurances and are especially relevant in dynamic policy settings, where\ndecisions are made incrementally over multiple time steps.\n6\n\n4.1 Learning-augmented single-step planning\nOur goal in this section is to design a learning-augmented algorithm that uses such advice to produce selections\nfromVthat are provably no worse and potentially much better. Here, we present the algorithm for the simple\ncase of r= 1 type (Algorithm 1) and show how to extend it to the more general partition matroid setting with\nr≥1 in Appendix C.\nA key advantage of the learning-augmented approach is its practicality in real-world decision-making en-\nvironments. Rather than discarding or overriding expert input, our method builds on it — treating existing\nrecommendations as a starting point and refining them in a principled way. This makes it particularly at-\ntractive to policymakers and planners, as it respects domain expertise accumulated over years of fieldwork,\nlocal knowledge, and institutional memory. Importantly, our approach offers formal performance guarantees:\nit matches the expert plan when it is already optimal, and improves upon it when possible, without ever doing\nworse than the best advice-free alternative. This balance between respecting human judgment and augmenting\nit with algorithmic rigor makes the method especially compelling in collaborative, policy-driven settings.\nAt the high-level, our algorithmic approach is to augment subsets of the advice selection with greedy\nselections3For any subset A′⊆A, we fill the remaining b− |A′|slots by greedily selecting elements from\nV\\A′to maximize marginal gain with respect to the non-decreasing submodular set function g(·,A′) =\nf(· ∪A′)−f(A′). That is, we greedily choose elements conditioned on already chosen A′.\nAlgorithm 1 Learning-augmented single-step of MOPGP\nInput : Elements V, non-decreasing submodular set function f:V→Rto maximize for, budget b≥1,\nadvice selection A⊆Vof size |A|=b\nOutput : A selection U⊆V\n1:Define subsets A0,A1, . . . ,AbofAwhere |Ai|=ifor sizes i∈ {0,1, . . . , b } ▷A0=∅andAb=A\n2:fori∈ {0,1, . . . , b }do\n3: Initialize Bi=∅\n4: while |Bi|< b−ido\n5: Add e∗= argmax\ne∈V\\(Ai∪Bi)g(Ai∪Bi,{e}) toBi\n6: end while\n7: Define Ui=Ai⊎Bi ▷|Ui|=|Ai|+|Bi|=b\n8:end for\n9:return U i∗, where i∗= argmaxi∈{0,1,...,b}f(Ui)\nTheorem 6. Consider Algorithm 1 and let OPT ⊆Vbe an optimal selection. Then,\nf(U)≥ max\ni∈{0,1,...,b}f(Ai) +1−1\nel\n|OPT\\Ai|\nb−im·g(OPT ,Ai)\nAlgorithm 1 is essentially an algorithm for size-constrained non-decreasing submodular maximization. Ob-\nserve that U0is the advice-free greedy selection S, and Ubis the advice selection A, so we always have\nf(Ui∗)≥max{f(U0), f(A)}and thus the output Ui∗⊆Vof our learning-augmented algorithm is at least\n(1−1\ne)-robust and 1-consistent. This is because f(Ui∗)≥f(U0)≥(1−1\ne)·f(OPT ) by submodularity of f,\nandf(Ui∗) =f(OPT ) when f(A) =f(OPT ). Our approach of Theorem 6 naturally extends to r≥1 types\nfor type-decomposable objective functions, but with the base guarantee of f(U0)≥(1−1\ne)·f(OPT ) degrading\ntof(U0)≥1\n2·f(OPT ) due to the matroidal constraints; see Appendix C for details.\nAs a remark, we would like to point out that there is nothing inherently special about the choice of\nA0, . . . ,Ab. From the proof of Theorem 6 in the appendix, one can see that Algorithm 1 can be modified to\nwork with any polynomial number of subsets of Awhile still being polynomial time.\nExample 7.Fig. 3 shows three possible selections of b= 3 facilities on the first grid of Example 3. As before,\nsuppose a facility at any cell provides coverage for any cell that is of Manhattan distance 1 from it. Greedily\nselecting based on marginal gain produces the selection G= [(3 ,2),(0,3),(1,1)] with f(G) = 62. Meanwhile,\nan advice selection of A= [(2 ,1),(1,3),(3,3)] has f(A) = 60. Running Algorithm 1 with the advice facility\nat coordinate (2 ,1) produces the selection U= [(2 ,1),(3,3),(0,3)] with f(U) = 67, which also happens to be\nan optimum selection.\n3MOPGP generalizes the NP-hard problem of maximum coverage, and greedy selections attain tight approximation guarantees.\n7\n\nFigure 3: Using the facility at (2 ,1) as the partial advice, Algorithm 1 produces a selection with improved\ncoverage. Note: The top-left cell is coordinate (0 ,0).\n4.2 Multi-step planning under budget uncertainty\nWe now show that a variant of the local greedy algorithm from [FNW78], adapted to satisfy type feasibility,\nis both practical and provably robust. A key difficulty in solving MOPGP lies in the abstract nature of type\nfeasibility: Definition 1 specifies high-level desiderata but does not provide a directly actionable definition.\nWhile the objective fis non-decreasing and submodular, the proportional constraints across types introduce\ncombinatorial complexity that does not decompose neatly.\nTo make the notion of type feasibility operational, we introduce a fixed tie-breaking rule σ: [r]→[r] over\ntypes and restrict our attention to a structured subclass of solutions, which we call σ-type feasible selections.\nDefinition 8 (σ-type feasible selection) .Letσ: [r]→[r] be an arbitrary total preference ordering over types.\nA subset S⊆Vof size bis said to be σ-type feasible if it is type feasible and forQ(S(1:t)), favors types\naccording to σ: ifσ(q)< σ(q′), then type qis preferred over q′.\nThis reduction justifies restricting our attention to the class of σ-type feasible solutions: they are not only\neasier to operationalize algorithmically, but also provably approximate any type-feasible solution up to a factor\nthat depends on the granularity of type availability.\nOur next result tells us that any optimum σ-type feasible selection OPT σis competitive against any\noptimum type feasible selection OPT if at least kelements of each type is chosen per round when applying\nMultistepPlanning .\nTheorem 9. LetOPT be an optimal type-feasible selection and let OPT σbe an optimal σ-type feasible\nselection. Fix an integer k∈N>0. If|OPT σ∩V(t)∩Tq| ≥kfor all t∈[h]andq∈[r], then f(OPT )≤\nk+1\nk·f(OPT σ).\nNote that we typically have k≥1: the Ethiopian Ministry of Health is currently building 2 ,000 compre-\nhensive health posts across ∼670 rural districts [ftCoHAO23], and we expect more facilities to be built in the\nfuture.\nOur algorithm MultistepPlanning is presented in Algorithm 2. At each round t∈[h],Multistep-\nPlanning determines how many comprehensive health posts x(t)\nq∈Nfrom each district q∈[r] should be\nselected (line 3), based on the desired global proportion and elements selected so far in S(1:t−1). Note thatP\nq∈[r]x(t)\nq=b(t)≤ |V(t)|. These type-specific quotas define a partition matroid (line 4), over which the\nalgorithm performs greedy selection (lines 5-7) by iteratively adding the element with highest marginal gain\nwhile respecting the matroid. Theorem 10 shows the formal guarantees of MultistepPlanning .\nTheorem 10. Fix an arbitrary tie-breaking ordering σ: [r]→[r]. Assuming the objective function fcan be\nevaluated in constant time given any subset, MultistepPlanning runs in O(Ph\nt=1b(t)·(r+|V(t)|))time and\noutputs S=⊎h\nt=1S(t)such that\n1. For all t∈[h],S(t)⊆V(t)and|S(t)|=b(t).\n2. The output Sis aσ-type feasible selection.\n8\n\nAlgorithm 2 MultistepPlanning\nInput : AnMOPGP (f, h, r, V,b,p) instance and a tie-breaking ordering σ: [r]→[r]\nOutput : Aσ-type feasible selection S=S(1:h)\n1:Define S(1)=. . .=S(h)=∅ ▷Initialize selections\n2:fort= 1, . . . , h do\n3: Forq∈[r], define #( q,s(b(1:0), b(1:0))) = 0 and\nx(t)\nq= #( q,s(b(1:t), b(1:t)))−#(q,s(b(1:t−1), b(1:t−1)))\n4: LetM(t)= (V(t),I(t)) be the partition matroid at\ntime t, where I(t)={S⊆V(t):|S∩Tq| ≤x(t)\nq}.\n5: forb(t)times do\n6: LetS=St\nτ=1S(τ)be the selection so far\n7: Add e∗= argmax\ne∈V(t)\\S\nS(t)∪{e}∈I(t)g(S,{e}) toS(t)\n8: end for\n9:end for\n10:Output S(1)⊎. . .⊎S(h)\n3. For all t∈[h], we have\nf(S(1)⊎. . .⊎S(t))≥1\n2·f(OPT σ(b(1), . . . , b(t)))\nwhere OPT σ(b(1), . . . , b(t))is an optimum σ-type feasible selection restricted to budgets b(1), . . . , b(t).\n4.3 Our theoretical bounds are tight in general\nProposition 11 shows that anysolution to MOPGP violating Definition 1 is brittle against future budget\nuncertainties while Proposition 12 show that the approximation ratio terms for MultistepPlanning are\nessentially tight.\nProposition 11. LetALG be any deterministic algorithm to MOPGP aiming to produce selections S(1), . . . ,S(h)\nthat maximizes β(b(1:t))at each time step t∈[h]. IfALG does not minimize |Q(S(t))|for each t∈[h], then\nthere exists instances where it fails to minimize β(b(1:t))at each t∈[h].\nProposition 12. There exists instances where MultistepPlanning achieves an approximation ratio of ≤1\n2\ndue to budget uncertainties and ≤k\nk+1due to σ-ordering.\n5 Experiments\nWe empirically evaluate the performance of the individual components of our proposed HARP tool. See\nAppendix G for additional experimental details and access to source code and scripts.\n5.1 Experimental setup\n5.1.1 Data.\nTo model facility coverage, we use point-to-point walking distance estimates between 1km-by-1km grid cells\nacross Ethiopia, based on the global friction surface from [WNVR+20], and population forecasts from WorldPop\nprojections for the years 2026–2030 [Wor25].4We are also given a set of existing facilities Sexisting and available\nbudgets were chosen based on expert consultation.\n4Population forecasts are inherently uncertain and the true objective function fis not directly accessible. In Appendix B.2,\nwe show that the impact on facility coverage is not substantial.\n9\n\n5.1.2 Regions analyzed.\nWe focus on rural regions where access remains limited, i.e., major cities such as Addis Ababa are excluded.\nSpecifically, we evaluate our algorithms on the regions of Afar, Benishangul Gumuz, and Somali in the main\npaper, and on the Sidama region in Appendix F. This way we reflect Ethiopia’s two dominant rural livelihood\ntypes.5\nThere are around 30 districts in Afar and Sidama, around 20 in Benishangul Gumuz, and around 70 districts\nin Somali. A larger budget was considered for Somali as it is much larger than the other regions.\n5.1.3 Distributional Policies (DP).\nTo ensure equitable allocation, each region may define a distributional policy by specifying target proportions\np1, . . . , p racross rdistricts. These type-level constraints shape the facility selection process by prioritizing\nareas with greater unmet needs. In our experiments, we evaluate three policy scenarios:\nDP0 No distributional constraint (i.e., p1=. . .=pr= 0), corresponding to unconstrained greedy selection.\nDP1 Proportions pqare set based on unassisted home birth rates, favoring districts with poor maternal care\naccess.\nDP2 Proportions pqare set by the inverse of postnatal care coverage, favoring districts lacking early childhood\nservices.\nBoth DP1 and DP2 target existing healthcare service gaps that can be provided by comprehensive health\nposts. While our framework supports multiple active constraints simultaneously, we focus on one distributional\npolicy at a time to preserve theoretical guarantees and interpretability. In our experiments below, we write\nMP(DPi), for i∈ {0,1,2}, to denote the output of Algorithm 2 applied with the proportional constraints\nimposed by each policy.\n5.2 Experiment 1: Impact of budget on coverage\n6 12 18 24\nYearly Budget00.20.40.60.81.0Bars: fRegion(ALG)Afar\n5 10 15 20\nYearly BudgetBenishangul Gumuz\n15 30 45 60\nYearly BudgetSomali\n1.01.21.41.61.8\nLines: Rel. Efficiency LossMP(DP0)\nMP(DP1)\nMP(DP2)\nRandom\nMP(DP1)\nMP(DP2)\nFigure 4: Coverage under varying annual budgets across the three regions of Afar, Benishangul Gumuz, and\nSomali. Bars show total population coverage by each policy, with the black line indicating existing coverage\nbefore any yearly budget was spent to build additional health posts. The dashed lines above indicate relative\nefficiency loss from enforcing proportional constraints for DP1 and DP2, compared to the unconstrained baseline\n(DP0).\nIn Fig. 4, the bars show how total coverage improves under different allocation strategies and budget levels\nover a five-year planning horizon. As all regions are large relative to the available budget, coverage increases\napproximately linearly with budget in all cases.\nFor indices i∈ {1,2}and regions of Afar, Benishangul Gumuz, and Somali, the dashed and dotted lines in\nFig. 4 show the ratios\nfregion (MP(DP0) ∪Sexisting )−fregion (Sexisting )\nfregion (MP(DPi)∪Sexisting )−fregion (Sexisting ),\nquantifying the trade-off incurred by distributional constraints, where fis the coverage function defined in\nEq. (1).\n5In the main paper, we focus on less populated regions to better highlight the spatial coverage gains achieved by our HARP .\n10\n\nNote that we subtracted away the coverage from existing health posts Sexisting to measure the relative gain\nin coverage as existing health posts are assumed to remain operational throughout. This ratio is similar to the\nnotion of price of fairness [CKKK12]: a ratio close to 1 indicates that enforcing proportional fairness incurs\nminimal efficiency loss, while higher values reflect stronger trade-offs. As expected, these ratios improve with\nincreasing budgets, suggesting that the proportional constraints come at a lower cost when more resources are\navailable.\n5.3 Experiment 2: Evaluating district-level equity\nIn Experiment 1, we demonstrated that imposing proportional constraints does not significantly degrade cov-\nerage. We now show that these constraints improve adherence to the intended proportions. To this end, we\nexamine the minimum satisfaction ratio, αmin(S), achieved under each policy. As shown in Fig. 5, MP(DP1)\nandMP(DP2) outperform all other methods in the DP1 and DP2 metrics respectively, while MP(DP0) con-\nsistently attains αmin= 0. Interestingly, in the Afar region, MP(DP1) yields significant gain under DP1\nthanMP(DP2) does under DP2, whereas the reverse trend is observed in the Benishangul Gumuz and Somali\nregions.\nDP1 DP20.00.51.0αmin(S)\n0Afar\nDP1 DP20Benishangul Gumuz\nDP1 DP20Somali\nMP(DP0) MP(DP1) MP(DP2) MP(Random)\nFigure 5: Minimum satisfaction ratio αminattained under each policy, with proportions defined by DP1 or DP2\nrespectively. Over five-year horizon, annual budgets of 12 facilities were allocated for Afar, 10 for Benishangul\nGumuz, and 30 for Somali.\n5.4 Experiment 3: High quality advice can help\nTo evaluate the practical utility of our learning-augmented approach, we conduct a retrospective analysis using\nthe set of comprehensive health posts Athat were previously constructed by regional planners: we simulate\nthe original decision-making scenario in which |A|health posts must be selected from scratch. We compare\nthree strategies:\n1. Expert selection: Use expert-curated selection A.\n2. Greedy baseline: Apply Algorithm 2 to get G.\n3. Learning-augmented: Use Algorithm 1 to produce U.\nAlthough planning decisions are made at the regional level, our analysis is conducted at the district level to\ncapture localized effects. Across all districts in the Afar, Benishangul Gumuz, and Somali regions, the greedy\nbaseline Gconsistently outperforms the expert selection A. Interestingly, we found 25 districts within these\nregions in which our learning-augmented selection Uoutperforms both, i.e., f(U)> f(G)> f(A). These\nresults were obtained by selecting the best performing Ufrom ten runs of Algorithm 1, each using a different\nrandom permutation of the original advice selection A.\nFig. 6 presents a representative example, showing a zoomed-in subarea of a district where all three strategies\nselect two health posts (the rest of the district is relatively sparse), withf(U)−f(G)\nf(G)≈2% andf(U)−f(A)\nf(A)≈20%.\nThe greedy algorithm, having made its first choice (the left location in G) based solely on immediate marginal\n11\n\ngain, is subsequently limited in its second selection. In contrast, Algorithm 1 could leverage on the leftward\nchoice in Ato produce a more globally effective selection U.\n(a) Population\n (b)G\n (c)A\n (d)U\nFigure 6: (a) 1km-by-1km population grid (log-scale): yellow indicates high population density, darker shades\nindicate lower density. (b,c,d) Red dots indicate the selected health post locations and the colored cells indicate\nthe areas covered by these health posts (on the same log-scale rendering).\n6 Conclusion\nIn partnership with Ethiopia’s Ministry of Health and Public Health Institute, we developed a decision-support\ntool ( HARP ) to guide health facility planning. HARP allows regional planners to solve their own instance of\nMOPGP within a unified, principled framework that models the planning task as a constrained submodular\noptimization with online budget and global proportionality constraints. On the technical front, we are the\nfirst to integrate learning-augmented algorithms with multi-step submodular optimization, enabling principled\nrefinement of expert plans with worst-case guarantees. Using real-world health and demographic data from\nEthiopia, we show that our methods are effective in supporting equitable, data-driven infrastructure decisions\nacross diverse regional contexts.\nAcknowledgements\nThe findings and conclusions in this report are those of the authors and do not represent any recommendations\nor official positions.\nReferences\n[AB24] Arpit Agarwal and Eric Balkanski. Learning-Augmented Dynamic Submodular Maximization.\nInNeural Information Processing Systems (NeurIPS) , pages 14148–14176, 2024.\n[ABG+22] Priyank Agrawal, Eric Balkanski, Vasilis Gkatzelis, Tingting Ou, and Xizhi Tan. Learning-\naugmented mechanism design: Leveraging predictions for facility location. In Proceedings of the\n23rd ACM Conference on Economics and Computation , pages 497–528, 2022.\n[ABWDS23] Abolfazl Asudeh, Tanya Berger-Wolf, Bhaskar DasGupta, and Anastasios Sidiropoulos. Max-\nimizing Coverage While Ensuring Fairness: A Tale of Conflicting Objectives. Algorithmica ,\n85:1287–1331, 2023.\n[ADJ+20] Spyros Angelopoulos, Christoph D¨ urr, Shendan Jin, Shahin Kamali, and Marc Renault. Online\nComputation with Untrusted Advice. In Innovations in Theoretical Computer Science Confer-\nence (ITCS) . Schloss Dagstuhl-Leibniz-Zentrum f¨ ur Informatik, 2020.\n[AF12] Alireza Boloori Arabani and Reza Zanjirani Farahani. Facility location dynamics: An overview\nof classifications and applications. Computers & Industrial Engineering , 62(1):408–420, 2012.\n[AGKK20] Antonios Antoniadis, Themis Gouleakis, Pieter Kleer, and Pavel Kolev. Secretary and On-\nline Matching Problems with Machine Learned Advice. Neural Information Processing Systems\n(NeurIPS) , 33:7933–7944, 2020.\n12\n\n[AJS22] Antonios Antoniadis, Peyman Jabbarzade, and Golnoosh Shahkarami. A Novel Prediction Setup\nfor Online Speed-Scaling. In Scandinavian Symposium and Workshops on Algorithm Theory\n(SWAT) . Schloss Dagstuhl-Leibniz-Zentrum f¨ ur Informatik, 2022.\n[AZ07] Alper Atamt¨ urk and Muhong Zhang. Two-Stage Robust Network Flow and Design Under De-\nmand Uncertainty. Operations Research , 55(4):662–673, 2007.\n[BCGJG25] Arnab Bhattacharyya, Davin Choo, Philips George John, and Themis Gouleakis. Learning\nmultivariate Gaussians with imperfect advice. In International Conference on Machine Learning\n(ICML) , 2025.\n[BDSW24] Vladimir Braverman, Prathamesh Dharangutte, Vihan Shah, and Chen Wang. Learning-\nAugmented Maximum Independent Set. In Approximation, Randomization, and Combinatorial\nOptimization. Algorithms and Techniques (APPROX/RANDOM) , 2024.\n[BHZ13] MohammadHossein Bateni, MohammadTaghi Hajiaghayi, and Morteza Zadimoghaddam. Sub-\nmodular Secretary Problem and Extensions. ACM Transactions on Algorithms (TALG) , 9(4):1–\n23, 2013.\n[BIK07] Moshe Babaioff, Nicole Immorlica, and Robert Kleinberg. Matroids, Secretary Problems, and\nOnline Mechanisms. In Symposium on Discrete Algorithms (SODA) , pages 434–443, 2007.\n[BLMS+22] Giulia Bernardini, Alexander Lindermayr, Alberto Marchetti-Spaccamela, Nicole Megow, Leen\nStougie, and Michelle Sweering. A Universal Error Measure for Input Predictions Applied to\nOnline Graph Problems. In Neural Information Processing Systems (NeurIPS) , 2022.\n[BMN11] Opher Baron, Joseph Milner, and Hussein Naseraldin. Facility Location: A Robust Optimization\nApproach. Production and Operations Management , 20(5):772–785, 2011.\n[BMRS20] ´Etienne Bamas, Andreas Maggiori, Lars Rohwedder, and Ola Svensson. Learning Augmented\nEnergy Minimization via Speed Scaling. Advances in Neural Information Processing Systems\n(NeurIPS) , 33:15350–15359, 2020.\n[CAdG+24] Vincent Cohen-Addad, Tommaso d’Orsi, Anupam Gupta, Euiwoong Lee, and Debmalya Pani-\ngrahi. Learning-Augmented Approximation Algorithms for Maximum Cut and Related Problems.\nInAdvances in Neural Information Processing Systems (NeurIPS) , pages 25961–25980, 2024.\n[CAR21] Chun Cheng, Yossiri Adulyasak, and Louis-Martin Rousseau. Robust facility location under\ndemand uncertainty and facility disruptions. Omega , 103:102429, 2021.\n[CCPV11] Gruia Calinescu, Chandra Chekuri, Martin Pal, and Jan Vondr´ ak. Maximizing a monotone\nsubmodular function subject to a matroid constraint. SIAM Journal on Computing , 40(6):1740–\n1766, 2011.\n[CDKL24] Andr´ es Cristi, Paul D¨ utting, Robert Kleinberg, and Renato Paes Leme. Online Matroid Em-\nbeddings. arXiv preprint arXiv:2407.10316 , 2024.\n[CGB23] Davin Choo, Themis Gouleakis, and Arnab Bhattacharyya. Active causal structure learning\nwith advice. In International Conference on Machine Learning (ICML) , pages 5838–5867, 2023.\n[CGLB24] Davin Choo, Themis Gouleakis, Chun Kai Ling, and Arnab Bhattacharyya. Online bipartite\nmatching with imperfect advice. In International Conference on Machine Learning (ICML) ,\npages 8762–8781, 2024.\n[CHKV19] L. Elisa Celis, Lingxiao Huang, Vijay Keswani, and Nisheeth K. Vishnoi. Classification with\nFairness Constraints: A Meta-Algorithm with Provable Guarantees. In Conference on Fairness,\nAccountability, and Transparency (FAT) , pages 319–328, 2019.\n[CKKK12] Ioannis Caragiannis, Christos Kaklamanis, Panagiotis Kanellopoulos, and Maria Kyropoulou.\nThe Efficiency of Fair Division. Theory of Computing Systems , 50:589–610, 2012.\n13\n\n[CSVZ22] Justin Chen, Sandeep Silwal, Ali Vakilian, and Fred Zhang. Faster Fundamental Graph Al-\ngorithms via Learned Predictions. In International Conference on Machine Learning (ICML) ,\npages 3583–3602, 2022.\n[CVZ11] Chandra Chekuri, Jan Vondr´ ak, and Rico Zenklusen. Submodular Function Maximization via\nthe Multilinear Relaxation and Contention Resolution Schemes. In ACM Symposium on Theory\nof Computing (STOC) , pages 783–792, 2011.\n[DIL+21] Michael Dinitz, Sungjin Im, Thomas Lavastida, Benjamin Moseley, and Sergei Vassilvitskii.\nFaster Matchings via Learned Duals. In Neural Information Processing Systems (NeurIPS) ,\npages 10393–10406, 2021.\n[DLPLV21] Paul D¨ utting, Silvio Lattanzi, Renato Paes Leme, and Sergei Vassilvitskii. Secretaries with\nAdvice. In ACM Conference on Economics and Computation , pages 409–429, 2021.\n[DRSA25] Mohsen Dehghankar, Rahul Raychaudhury, Stavros Sintos, and Abolfazl Asudeh. Fair Set Cover.\nInConference on Knowledge Discovery and Data Mining (KDD) , pages 189–200, 2025.\n[EFS+22] Jon C. Ergun, Zhili Feng, Sandeep Silwal, David Woodruff, and Samson Zhou. Learning-\nAugmented k-means Clustering. In International Conference on Learning Representations\n(ICLR) , 2022.\n[FNW78] M. L. Fisher, G. L. Nemhauser, and L. A. Wolsey. An analysis of approximations for maximizing\nsubmodular set functions – II , volume 8. Springer, 1978.\n[ftCoHAO23] United Nations Office for the Coordination of Humanitarian Affairs (OCHA). Ethiopia - Sub-\nnational Administrative Boundaries, 2023. Available at https://data.humdata.org/dataset/\ncod-ab-eth .\n[GFT+25] Fentabil Getnet, Tom Forzy, Latera Tesfaye, Awoke Misganaw, Solomon Tessema Memirie,\nShewayiref Geremew, Tezera Moshago Berheto, Naod Wendrad, Bantalem Yeshanew Yihun,\nMizan Kiros Mirutse, and et al. Inequalities in tuberculosis control in Ethiopia: A district-level\ndistributional modelling analysis. Tropical Medicine & International Health , 30(1):31–42, 2025.\n[GJ13] Abdolsalam Ghaderi and Mohammad Saeed Jabalameli. Modeling the budget-constrained dy-\nnamic uncapacitated facility location–network design problem and solving it via two efficient\nheuristics: A case study of health care. Mathematical and Computer Modelling , 57(3-4):382–400,\n2013.\n[GKST22] Vasilis Gkatzelis, Kostas Kollias, Alkmini Sgouritsa, and Xizhi Tan. Improved Price of Anarchy\nvia Predictions. In ACM Conference on Economics and Computation (EC) , pages 529–557, 2022.\n[GLS23] Themis Gouleakis, Konstantinos Lakis, and Golnoosh Shahkarami. Learning-Augmented Algo-\nrithms for Online TSP on the Line. In AAAI Conference on Artificial Intelligence (AAAI) , pages\n11989–11996, 2023.\n[GMS22] Swati Gupta, Jai Moondra, and Mohit Singh. Which Lpnorm is the Fairest? Approximations\nfor Fair Facility Location Across All “ p”.arXiv preprint arXiv:2211.14873 , 2022.\n[GP19] Sreenivas Gollapudi and Debmalya Panigrahi. Online Algorithms for Rent-or-Buy with Expert\nAdvice. In International Conference on Machine Learning (ICML) , pages 2319–2327, 2019.\n[GS07] Pranava R. Goundan and Andreas S. Schulz. Revisiting the Greedy Approach to Submodular\nSet Function Maximization. Optimization Online , 2007.\n[HOR+23] Fleur Hierink, Olusola Oladeji, Ann Robins, Maria F. Mu˜ niz, Yejimmawerk Ayalew, and Nicolas\nRay. A geospatial analysis of accessibility and availability to implement the primary healthcare\nroadmap in Ethiopia. Communications Medicine , 3(140), 2023.\n[HWT+23] Nathaniel Hendrix, Samson Warkaye, Latera Tesfaye, Mesfin Agachew Woldekidan, Asrat Arja,\nRyoko Sato, Solomon Tessema Memirie, Alemnesh H Mirkuzie, Fentabil Getnet, and St´ ephane\nVerguet. Estimated travel time and staffing constraints to accessing the Ethiopian health care\nsystem: A two-step floating catchment area analysis. Journal of Global Health , 13:04008, 2023.\n14\n\n[KBC+18] Tim Kraska, Alex Beutel, Ed H. Chi, Jeffrey Dean, and Neoklis Polyzotis. The Case for Learned\nIndex Structures. In International Conference on Management of Data (SIGMOD) , pages 489–\n504, 2018.\n[LLMV20] Silvio Lattanzi, Thomas Lavastida, Benjamin Moseley, and Sergei Vassilvitskii. Online Schedul-\ning via Learned Weights. In ACM-SIAM Symposium on Discrete Algorithms (SODA) , pages\n1859–1877. SIAM, 2020.\n[LMNS10] Jon Lee, Vahab S. Mirrokni, Viswanath Nagarajan, and Maxim Sviridenko. Maximizing Non-\nmonotone Submodular Functions under Matroid or Knapsack Constraints. SIAM Journal on\nDiscrete Mathematics , 23(4):2053–2078, 2010.\n[LS24] Quanquan C. Liu and Vaidehi Srinivas. The Predicted-Updates Dynamic Model: Offline, Incre-\nmental, and Decremental to Fully Dynamic Transformations. In Conference on Learning Theory\n(COLT) , pages 3582–3641. Proceedings of Machine Learning Research (PMLR), 2024.\n[LV21] Thodoris Lykouris and Sergei Vassilvitskii. Competitive Caching with Machine Learned Advice.\nJournal of the ACM (JACM) , 68(4):1–25, 2021.\n[Mit18] Michael Mitzenmacher. A Model for Learned Bloom Filters, and Optimizing by Sandwiching.\nInNeural Information Processing Systems (NeurIPS) , 2018.\n[MV22] Michael Mitzenmacher and Sergei Vassilvitskii. Algorithms with Predictions. Communications\nof the ACM , 65(7):33–35, 2022.\n[NWF78] G. L. Nemhauser, L. A. Wolsey, and M. L. Fisher. An analysis of approximations for maximizing\nsubmodular set functions – I. Mathematical Programming , 14:265–294, 1978.\n[NZH+03] A. M. Noor, D. Zurovac, S. I. Hay, S. A. Ochola, and R. W. Snow. Defining equity in physical\naccess to clinical services using geographical information systems as part of malaria planning\nand monitoring in Kenya. Tropical Medicine and International Health , 8(10):917–926, 2003.\n[OD98] Susan Hesse Owen and Mark S. Daskin. Strategic facility location: A review. European Journal\nof Operational Research , 111(3):423–447, 1998.\n[oHE20] Ministry of Health [Ethiopia]. Realizing Universal Health Coverage through Primary Healthcare:\nA Roadmap for Optimizing the Ethiopian Health Extension Program (2020–2035), 2020.\n[PSK18] Manish Purohit, Zoya Svitkina, and Ravi Kumar. Improving Online Algorithms via ML Predic-\ntions. Neural Information Processing Systems (NeurIPS) , 31, 2018.\n[RE08] Nicolas Ray and Steeve Ebener. AccessMod 3.0: computing geographic coverage and accessibility\nto health care services using anisotropic movement of patients. International Journal of Health\nGeographics , 7(63), 2008.\n[Rec73] Andras Recski. On partitional matroids with applications. Coll. Math. Soc. J. Bolyai , 10:1169–\n1179, 1973.\n[Sny06] Lawrence V. Snyder. Facility location under uncertainty: a review. IIE Transactions , 38(7):547–\n564, 2006.\n[SSZ25] Richard Santiago, Ivan Sergeev, and Rico Zenklusen. Constant-competitiveness for random\nassignment Matroid secretary without knowing the Matroid. Mathematical Programming ,\n210(1):815–846, 2025.\n[TAM+20] A. M. Teklu, Y. K. Alemayehu, G. Medhin, et al. National assessment of the ethiopian health\nextension program: Final master report. Technical report, MERQ Consultancy PLC, Addis\nAbaba, Ethiopia, 2020.\n[TGH06] Frank Tanser, Brice Gijsbertsen, and Kobus Herbst. Modelling and understanding primary\nhealth care accessibility and utilization in rural South Africa: An exploration using a geographical\ninformation system. Social Science & Medicine , 63(3):691–705, 2006.\n15\n\n[TWR+19] Alan Tsang, Bryan Wilder, Eric Rice, Milind Tambe, and Yair Zick. Group-Fairness in Influence\nMaximization. International Joint Conference on Artificial Intelligence (IJCAI) , 2019.\n[UNF22] UNFPA. Ethiopia population, 2022, 2022. Accessed via UNFPA resources.\n[WLW20] Shufan Wang, Jian Li, and Shiqiang Wang. Online Algorithms for Multi-shop Ski Rental with\nMachine Learned Advice. Neural Information Processing Systems (NeurIPS) , 33:8150–8160,\n2020.\n[WNVR+20] D. J. Weiss, A. Nelson, C. A. Vargas-Ruiz, K. Gligori´ c, S. Bavadekar, E. Gabrilovich, A. Bertozzi-\nVilla, J. Rozier, H. S. Gibson, T. Shekel, and et al. Global maps of travel time to healthcare\nfacilities. Nature Medicine , 26:1835–1838, 2020.\n[Wor22] Worldometers. Ethiopia population (2022) – worldometer. https://www.worldometers.info/\nworld-population/ethiopia-population/ , 2022. Accessed July 2025.\n[Wor25] WorldPop. Worldpop population counts 2015–2030: Ethiopia — spatial distribution of popula-\ntion. https://data.humdata.org/dataset/worldpop-population-counts-2015-2030-eth ,\nJanuary 2025. Constrained estimates of total population per 100m grid cell in Ethiopia for\n2015–2030, Geotiff format, CC BY4.0 license.\n[WTRC16] Huihui Wang, Roman Tesfaye, Gandham N. V. Ramana, and Chala Tesfaye Chekagn. Ethiopia\nHealth Extension Program: An Institutionalized Community Approach for Universal Health Cov-\nerage . World Bank, 2016.\n16\n\nA Further related work\nIn this section, we provide additional related work that was not mentioned in Section 3 due to space constraints.\nA.1 Submodular maximization under constraints\nIn Section 3, we also mentioned a locally greedy algorithm of [FNW78] which yields a tight1\nk+1approximation\nto the problem of maximizing a non-decreasing submodular function subject to kmatroid intersections. We\nprovide the pseudocode of this locally greedy algorithm in Algorithm 3.\nAlgorithm 3 LocalGreedy\nInput : Objective function f, time horizon h, elements V=V(1)⊎. . .⊎V(h),kmatroid constraints\nM1= (V,I1), . . . ,Mk= (V,Ik) over V\nOutput :S⊆Vs.t.S∩V(t)∈ I1∩. . .∩ Ik,∀t∈[h]\n1:Initialize S=∅\n2:fort= 1, . . . , h do\n3: while ∃e∈V(t)\\Ss.t.S∪ {e} ∈ ∩k\ni=1Iido\n4: Define e∗= argmax\nS∪{e}∈∩k\ni=1Ii\u001a\nf(S∪ {e})−f(S)\u001b\n5: Add e∗toS\n6: end while\n7:end for\n8:return S\nMaximizing monotone submodular functions under matroid constraints has a rich history in offline settings\n[NWF78, CCPV11, CVZ11]. While work on submodular maximization under multiple matroid constraints\nsuch as [LMNS10] hints at possible modeling of our setting (one matroid for budgets and one for distributional\nconstraints), these are offline formulations with static feasibility and do not capture our problem’s adaptivity or\ntemporal uncertainty. In the online setting, one canonical problem that of the submodular secretary problem\n[BIK07, BHZ13], but it assumes that the matroid is fixed and known, while elements arrive sequentially\nin random or adversarial order. In contrast, our setting inverts the uncertainty: the ground set is known\nin advance, but feasibility constraints (budgets) are revealed over time. Moreover, secretary-style methods\ntypically do not support global type-based constraints across time and assumes that arrivals are in random\norder. More recent work such as those by [CHKV19] and [TWR+19] introduce global representation constraints\ninto this framework in the form of fairness constraints. The state-of-the-art approaches for solving the above-\nmentioned problems typically rely on full knowledge of the input, employ continuous relaxations, or local\nexchange techniques. As such, one cannot directly apply their strategies in our settings where decisions are\nirrevocable and constraints evolve over time.\nA.2 Facility location under temporal and representation constraints\nClassical and robust facility location problems are extensively studied (see e.g., surveys by [AF12, OD98]),\nincluding in dynamic and uncertain environments [Sny06, CAR21, AZ07, BMN11]. However, most of these\nmodels aim to optimize a final objective after uncertainty is resolved. Our approach departs from this paradigm\nby seeking robust decisions at each time step, enabling responsiveness to time-varying demand. Healthcare-\nspecific studies, such as [GMS22], introduce incremental facility placement under multiple normative criteria,\nincluding fairness. However, their work also lacks support for temporally evolving feasibility constraints.\nAdditionally, they assume static facility needs and a metric distance space, which may not hold in contexts\nlike rural Ethiopia. Another work by [GJ13] proposes a budgeted healthcare access model in Iran, but does\nnot consider representation or proportionality constraints across population types.\nA.3 Measure distance to facilities\n[TGH06] proposed a model for measuring the actual distances to health facilities. [NZH+03] incorporated\nequity considerations into their model to enhance the planning and monitoring of health facilities. Using\nthe AccessMod [RE08] tool for computing the coverage of health facilities, [HOR+23] analyze the coverage\n17\n\nin Ethiopia, and specifically in the Somali region. They suggest that the coverage in the Somali region is\ninsufficient. Recently, [WNVR+20] proposed a method to quantify access to health facilities globally. Using\nHowever, these works emphasize the importance of locating the facilities appropriately, but do not provide\nalgorithmic methods for doing so. Our model explicitly incorporates time-sensitive population variation and\nprovides algorithmic support for adaptive placement subject to budget and distributional considerations.\nA.4 Representation-constrained coverage and online constraints\nRepresentation constraints have also been studied in coverage problems. For example, [ABWDS23] consider a\nmax- k-coverage problem with group fairness constraints but enforce rigid group-wise coverage parity, which can\nlead to infeasibility. In contrast, our model allows flexible type-level bounds, maintaining feasibility and realism.\n[DRSA25] explore proportionality in set cover, applying constraints to the sets rather than the elements. Their\nformulation targets minimum-cost full coverage, which diverges from our goal of budget-constrained partial\ncoverage under temporal uncertainty. More recently, [CDKL24] and [SSZ25] explore online problems where\nconstraints, rather than elements, arrive over time, similar to our evolving feasibility model. However, these\npapers focus on maximizing simple linear (weight-based) objectives and do not directly extend to submodular\nobjectives or type-based distributional constraints.\nA.5 Learning-augmented algorithms\nSince the seminal work of [LV21], there has been growing interest in designing algorithms that incorporate\nunreliable advice, with performance guarantees that degrade gracefully with advice quality. This frame-\nwork has been especially influential in online optimization, where advice can serve as a proxy for unknown\nfuture inputs. Notable applications include ski-rental [GP19, WLW20, ADJ+20], non-clairvoyant schedul-\ning [PSK18], job scheduling [LLMV20, BMRS20, AJS22], data structures with predictions (e.g., learned\nindexes [KBC+18], Bloom filters [Mit18]), online selection and matching [AGKK20, DLPLV21, CGLB24],\nand online TSP [BLMS+22, GLS23]. More recent work has expanded this paradigm to graph algorithms\n[DIL+21, CSVZ22], causal discovery [CGB23], mechanism design [ABG+22, GKST22], improving approx-\nimation guarantees in offline NP-hard problems [EFS+22, BDSW24, CAdG+24], and distribution learning\n[BCGJG25]. For a broader overview, we refer the reader to the survey by [MV22] and the website https:\n//algorithms-with-predictions.github.io/ which tracks papers on this research topic.\nB Deferred technical details for Section 2\nB.1 Showing that objective function Eq. (1) is non-decreasing and submodular\nProposition 13. The objective function defined in Eq. (1)is non-decreasing and submodular.\nProof. Recall from Eq. (1) that\nf(S) =hX\nt=1X\nc∈covered (S(1:t))w(t)\nc\nSince population counts are non-negative, we see that f(A)≤f(B) for any two selections A⊆B, sofis\nnon-decreasing. Meanwhile, to see that fis submodular, fix any A⊆B⊆Vande∈V\\B. Let τ∈[h] be\nthe time step for which e∈V(τ). Then,\nf(A∪ {e})−f(A) =X\nτ≤t≤h\u0012X\nc∈covered ({e}\\A(1:t))w(t)\nc\u0013\n(Definition of f)\n≥X\nτ≤t≤h\u0012X\nc∈covered ({e}\\B(1:t))w(t)\nc\u0013\n(Since A⊆B)\n≥f(B∪ {e})−f(B) (Definition of f)\nSince f(A∪ {e})−f(A)≥f(B∪ {e})−f(B), we see that fis submodular.\n18\n\nB.2 Noisy estimate of the true objective function\nSuppose we do not have access to the true objective function finMOPGP but are instead given a proxy\nfunction efsuch that (1 −ε)·f(S)≤ef(S)≤(1 +ε)·f(S) for all S⊆V, for some multiplicative error ε∈[0,1].\nGiven an algorithm ALG that has provable guarantees for MOPGP , the next theorem shows that one\ncan obtain provable approximation guarantees with respect to εby running ALG in a blackbox manner while\ntreating efas the true objective function. In particular, the αin Theorem 14 is1\n2·k\nk+1if at least kelements\nof each type is chosen per round when applying MultistepPlanning .\nTheorem 14. Suppose we do not have access to ffor an MOPGP (f, h, r, V,b,p)instance. Instead, we\nare given a proxy function ef: 2V→Rwith known bounded multiplicative error ε∈[0,1]such that (1−ε)·\nf(S)≤ef(S)≤(1 + ε)·f(S)for all S⊆V. IfALG (f)is an algorithm that achieves α-approximation to\nMOPGP (f, h, r, V,b,p), for some α∈[0,1], then ALG (ef\n1−ε)achieves an approximation ratio of α·1−ε\n1+εto\nMOPGP (f, h, r, V,b,p).\nProof. Besides the objective function f, let us fix all other parameters h,q,V,b, and parbitrarily. So,\nfor notational convenience, we simply write MOPGP (f) to mean MOPGP (f, h, q, V,b,p) in the rest of this\nproof.\nFor any function f, letSOPT(f) denote the optimum type-feasible selection for MOPGP (f) and SALG(f) de-\nnote type-feasible selection produced by ALG (f). For any type-feasible selection S⊆V, we write obj( S,MOPGP (f))\nto denote the objective value attained by Swith respect to the objective function f. Using this notation, we\nhave\n1\nα·obj(SALG(f),MOPGP (f))≥obj(SOPT(f),MOPGP (f)) (Since ALG isα-approximate)\n= max\nS⊆V\nSis type-feasibleobj(S,MOPGP (f)) (By optimality of SOPT)\nTherefore, using the proxy function ef, we see that\nα·obj(SOPT(f),MOPGP (f))≤α·obj \nSOPT(f),MOPGP ef\n1−ε!!\n(Since (1 −ε)·f≤ef)\n≤α·obj \nSOPT ef\n1−ε!\n,MOPGP ef\n1−ε!!\n(Definition of optimum selection)\n≤obj \nSALG ef\n1−ε!\n,MOPGP ef\n1−ε!!\n(ALG isα-approximate)\n≤obj \nSALG ef\n1−ε!\n,MOPGP\u00121 +ε\n1−ε·f\u0013!\n(Since ef≤(1 +ε)·f)\n= obj\u0012\nSALG(ef),MOPGP\u00121 +ε\n1−ε·f\u0013\u0013\n(εis an unknown constant )\n=1 +ε\n1−ε·obj\u0012\nSALG(ef),MOPGP\u00121 +ε\n1−ε·f\u0013\u0013\n(Since ef≤(1 +ε)·f)\nThat is, running ALG on the proxy function efyields an approximation ratio of α·1−ε\n1+ε.\nC Deferred technical details for Section 4.1\nIn this section, we first prove Theorem 6 where there is only k= 1 type, i.e., we are essentially solving size-\nconstrained submodular maximization, and then show how to adapt to the setting with k≥1 types Theorem 17.\nFor convenience, we reproduce Algorithm 1 below.\nThe proof of Theorem 6 follows from the following two lemmas: Lemma 15 and Lemma 16.\n19\n\nAlgorithm 4 Learning-augmented algorithm for size-constrained non-decreasing submodular maximization\nInput : Elements V, non-decreasing submodular set function f:V→Rto maximize for, budget b≥1,\nadvice selection A⊆Vof size |A|=b\nOutput : A selection U⊆V\n1:Define subsets A0,A1, . . . ,AbofAwhere |Ai|=ifor sizes i∈ {0,1, . . . , b } ▷A0=∅andAb=A\n2:fori∈ {0,1, . . . , b }do\n3: Initialize Bi=∅\n4: while |Bi|< b−ido\n5: Add e∗= argmax\ne∈V\\(Ai∪Bi)g(Ai∪Bi,{e}) toBi\n6: end while\n7: Define Ui=Ai⊎Bi ▷|Ui|=|Ai|+|Bi|=b\n8:end for\n9:return U i∗, where i∗= argmaxi∈{0,1,...,b}f(Ui)\nLemma 15. Fix any optimal selection OPT ⊆Vof size |OPT|=kand any arbitrary selection S⊆Vof\nsize|S| ≤k. Define Bas the best selection in OPT\\Ssuch that\nf(B∪S) = max\nZ⊆OPT\\S\n|Z|=k−|S|f(Z∪S)\nThen, for any non-empty subset C⊆OPT\\S, we have\nf(C∪S)−f(S)≤\u0018|C|\n|B|\u0019\n·(f(B∪S)−f(S))\nProof. Break up Cintoℓ=l\n|C|\n|B|m\npartitions C=C1⊎. . .⊎Cℓ, each of size at most |B|. Then,\nf(C∪S)−f(S)≤ℓX\ni=1\u0012\nf(Ci∪S)−f(S)\u0013\n(By submodularity of f)\n≤ℓX\ni=1\u0012\nf(B∪S)−f(S)\u0013\n(By maximality of B)\n=\u0018|C|\n|B|\u0019\n·\u0012\nf(B∪S)−f(S)\u0013\n(Since ℓ=l\n|C|\n|B|m\n)\nThe claim follows by rearranging the terms.\nLemma 16. Fix any optimal selection OPT ⊆Vand advice selection A⊆Vof size |OPT|=|A|=k.\nFix an arbitrary subset A′⊆AofA. Let B′⊆V\\A′be the output produced from greedy selection and\nOPT′⊆V\\A′be the optimum selection with respect to the set function f(S∪A′)−f(A′)for any subset\nS⊆V\\A′, where |B′|=|OPT′|=k− |A′|. Then,\nf(B′∪A′)≥f(A′) +1−1\nel\n|OPT\\A′|\nk−|A′|m·\u0012\nf(OPT∪A′)−f(A′)\u0013\nProof. Define B⊆OPT\\A′such that\nf(B∪A′) = max\nZ⊆OPT\\A′\n|Z|=k−|A′|f(Z∪A′)\n20\n\nThen, we have\nf(OPT∪A′)−f(A′)≤\u0018|OPT\\A′|\nk− |A′|\u0019\n·\u0012\nf(B∪A′)−f(A′)\u0013\n(∗)\n≤\u0018|OPT\\A′|\nk− |A′|\u0019\n·\u0012\nf(OPT′∪A′)−f(A′)\u0013\n(Since OPT\\A′⊆V\\A′and by optimality of OPT′)\n≤1\n1−1\ne·\u0018|OPT\\A′|\nk− |A′|\u0019\n·\u0012\nf(B′∪A′)−f(A′)\u0013\n(‡)\nwhere ( ∗) is via Lemma 15 while ( ‡) is due to the greedy construction of B′while satisfying the size constraint\nk; see [NWF78]. The claim follows by rearranging the terms.\nTheorem 6. Consider Algorithm 1 and let OPT ⊆Vbe an optimal selection. Then,\nf(U)≥ max\ni∈{0,1,...,b}f(Ai) +1−1\nel\n|OPT\\Ai|\nb−im·g(OPT ,Ai)\nProof. By Lemma 16, we have\nf(Ui)≥f(Ai) +1−1\nel\n|OPT\\Ai|\nk−im·\u0012\nf(OPT∪Ai)−f(Ai)\u0013\nfor all i∈ {0,1, . . . , k }. The claim follows since Uis the best selection out of U0,U1, . . . ,Uk.\nTo extend Theorem 6 to r≥1 types, consider an alternative objective set function f′which computes f\nadditively across each type: f′(S) =Pr\nq=1f(S∩Tq) for any S⊆V. By construction, f′never underestimates\nf. That is, f′(S)≥f(S)≥βf,S·f′(S) for some βf,S∈[0,1] that depends on fandS. Operating under the\nassumption that fdecomposes with respect to the types simplifies analysis while worsening the approximation\nratio by a multiplicative factor proportional to max S⊆Vβf,S; we can invoke the result of Appendix B.2 to f′.\nUsing f′as a proxy of fis justified because each facility primarily serves the population of that same district.\nFor instance, in the Sidama region of Ethiopia, an average of 81% of the population within a two-hour walking\ndistance from a cell belongs to the same district.\nTheorem 17. Suppose the objective fis type-decomposable and we need to produce a selection subject to a\npartition matroid over the types with I={S⊆V:|S∩Tq| ≤xq,∀q∈[r]}, for some x1, . . . , x q∈N. Let\nOPT ⊆VandA⊆Vbe any optimal and advice selection such that |OPT∩Tq|=|A∩Tq|=xqfor all types\nq∈[r]. Then, for any subset A′⊆A, there is a polynomial time algorithm that producing B′⊆V\\A′such\nthatB′∪A′∈ Iand\nf(B′∪A′)≥f(A′) +1−1\ne\nmax\nq∈[r]l\n|(OPT\\A′)∩Tq|\nxq−|A′∩Tq|m·\u0012\nf(OPT∪A′)−f(A′)\u0013\nProof. Define B⊆OPT\\Asuch that B∪A∈ Iand\nf(B∪A′) = max\nZ⊆OPT\\A′\nZ∪A′∈If(Z∪A′)\nSince fdecomposes additively across types, we get\nf\u0000\n(B∪A′)∩Tq\u0001\n= max\nZ⊆OPT\\A′\n|Z∩Tq|≤xq−|A′∩Tq|f\u0000\n(Z∪A′)∩Tq\u0001\nfor each type q∈[r]. We define B′to be the greedy selection produced by LocalGreedy (Algorithm 3) over\nthe matroid Ihaving already selected A′. For readability, let us define\n□q=\u0018|(OPT\\A′)∩Tq|\nxq− |A′∩Tq|\u0019\n21\n\nfor each type q∈[r]. Then, we have\nf(OPT∪A′)−f(A′) =rX\nq=1f\u0000\n(OPT∪A′)∩Tq\u0001\n−f\u0000\nA′∩Tq\u0001\n(Since fdecomposes additively across types)\n≤rX\nq=1□q·\u0012\nf\u0000\n(B∪A′)∩Tq\u0001\n−f\u0000\nA′∩Tq\u0001\u0013\n(∗)\n≤\u0012\nmax\nq∈[r]□q\u0013\n·\u0012\nf(B∪A′)−f(A′)\u0013\n(Since fdecomposes additively across types)\n≤\u0012\nmax\nq∈[r]□q\u0013\n·\u0012\nf(OPT′∪A′)−f(A′)\u0013\n(Since OPT\\A′⊆V\\A′and by optimality of OPT′)\n≤1\n1−1\ne·\u0012\nmax\nq∈[r]□q\u0013\n·\u0012\nf(B′∪A′)−f(A′)\u0013\n(‡)\nwhere ( ∗) is via Lemma 15 while ( ‡) is due to the greedy construction of B′while satisfying the matroid\nconstraint I; see [FNW78]. The claim follows by rearranging the terms.\nMotivated by our analyses, one can define the following learning-augmented variant of MultistepPlan-\nning in Algorithm 5. While one can use similar approaches to obtain theoretical guarantees for Algorithm 5, the\nresulting guarantees are unwieldly and do not provide any intuition. As such, we do not make any theoretical\nclaims and simply present Algorithm 5 as a heuristic algorithm.\nD Deferred technical details for Section 4.2\nIn this section, we work towards proving Theorem 10. We begin by proving Theorem 9, along with some\nadditional results about σ-type feasible selections (Definition 8) that will be useful for proving algorithmic\nguarantees subsequently.\nNote that any σ-type feasible selection (Definition 8) is also type feasible (Definition 1), though the latter\ncan tie-break arbitrarily when selecting items from the set of types with minimal satisfaction ratio. We now\nshow that a σ-type feasible optimum selection OPT σis competitive against a type feasible optimum selection\nOPT if at least kelements of each type is chosen per round when applying MultistepPlanning .\nThe following lemma about σ-type feasible subsets of a type feasible selections will be useful for proving\nour main result for this section (Theorem 9).\nLemma 18. Fix an MOPGP problem instance P. Let OPT σbe a σ-type feasible optimal selection to P\nandOPT be a type feasible optimal selection to P. LetI ⊆2Vbe the independence set corresponding to the\ntie-broken type feasibility of OPT σand define W⊆OPT to minimize the marginal gain:\ng(OPT\\W,W) = min\nA⊆OPT⊆V\n(OPT\\A)∈Ig(OPT\\A,A)\nThen, |W∩V(t)∩Tq| ≤1for any t∈[h]andq∈[r].\nProof. Note that the minimality of Wwould try to make OPT\\Woverlap with OPT σ, in terms of element\ntypes at each time step, as much as possible. More formally, for any time step t∈[h] and type q∈[r], we have\n|(OPT\\W)∩V(t)∩Tq|= min\u001a\n|OPT σ∩V(t)∩Tq|,|OPT∩V(t)∩Tq|\u001b\n(2)\nCase 1: |OPT σ∩V(t)∩Tq|>|OPT∩V(t)∩Tq|.\nBy Eq. (2), we have |(OPT\\W)∩V(t)∩Tq|=|OPT∩V(t)∩Tq|. So,\n|W∩V(t)∩Tq|=|OPT∩V(t)∩Tq| − |(OPT\\W)∩V(t)∩Tq|\n=|OPT∩V(t)∩Tq| − |OPT∩V(t)∩Tq| (By Eq. (2))\n= 0≤1\n22\n\nAlgorithm 5 MultistepPlanningWithAdvice\nInput : Objective function f, time horizon h, elements Vover rtypes, budgets b(1), . . . , b(h)∈Nthat\narrive over time, advice selections A(1), . . . ,A(h)that arrive over time, proportions p1, . . . , p r∈[0,1] for\neach type, tie-breaking ordering σ: [r]→[r]\nOutput : A selection S=S(1)⊎. . .⊎S(h)\n1:Define S(1)=. . .=S(h)=∅ ▷Initialize selections\n2:fort= 1, . . . , h do\n3: Forq∈[r], define #( q,s(b(1:0), b(1:0))) = 0 and\nx(t)\nq= #( q,s(b(1:t), b(1:t)))−#(q,s(b(1:t−1), b(1:t−1)))\n4: LetM(t)= (V(t),I(t)) be the partition matroid at\ntime t, where I(t)={S⊆V(t):|S∩Tq| ≤x(t)\nq}.\n5: Define subsets A(t)\n0,A(t)\n1, . . . ,A(t)\nb(t)ofA(t)where\n|A(t)\ni|=ifor sizes i∈ {0,1, . . . , b(t)}\n6: fori∈ {0,1, . . . , b(t)}do\n7: Initialize B(t)\ni=∅\n8: while |B(t)\ni|< b(t)−ido\n9: Add e∗toB(t)\ni, where\ne∗= argmax\ne∈V(t)\\(A(t)\ni∪B(t)\ni)\nS(1:t−1)∪A(t)\ni∪B(t)\ni∪{e}∈I(t)g(S(1:t−1)∪A(t)\ni∪B(t)\ni,{e})\n10: end while\n11: Define U(t)\ni=A(t)\ni⊎B(t)\ni ▷|U(t)\ni|=b(t)\n12: end for\n13: Define S(t)=U(t)\ni∗, where\ni∗= argmax\ni∈{0,1,...,b(t)}f(U(t)\ni)\n14:end for\n15:Output S(1)⊎. . .⊎S(h)\nCase 2: |OPT σ∩V(t)∩Tq| ≤ |OPT∩V(t)∩Tq|.\nSuppose, for a contradiction, that |W∩V(t)∩Tq| ≥2. By Eq. (2), we have |(OPT \\W)∩V(t)∩Tq|=\n|OPT σ∩V(t)∩Tq|. So,\n|OPT∩V(t)∩Tq|=|W∩V(t)∩Tq|+|(OPT\\W)∩V(t)∩Tq|\n≥2 +|(OPT\\W)∩V(t)∩Tq| (Since |W∩V(t)∩Tq| ≥2)\n= 2 + |OPT σ∩V(t)∩Tq| (By Eq. (2))\nLetebe an arbitrary element in W∩V(t)∩Tq. Note that W⊆OPT ,αmin((OPT ∩V(1:t))\\ {e})≤\nαmin(OPT ∩V(1:t)), and the inequality is strict only when removing ecauses the min-ratio to worsen. As\nOPT σandOPT are both type feasible, we have αmin(OPT σ∩V(1:t)) =αmin(OPT ∩V(1:t)) for any time\nstept∈[h], and so\f\f\f\f|OPT σ∩V(1:t)∩Tq| − |OPT∩V(1:t)∩Tq|\f\f\f\f≤1\nfor all t∈[h] and q∈[r]. In particular, we have\n\f\f\f\f|OPT σ∩V(1:t−1)∩Tq| − |OPT∩V(1:t−1)∩Tq|\f\f\f\f≤1\nat time step t−1 and any q∈[r]. Now, since we have |OPT ∩V(t)∩Tq| ≥2 +|OPT σ∩V(t)∩Tq|from\n23\n\nabove, so it must be the case that removing eof type( e) =qdoes notworsen the min-ratio. So,\nαmin((OPT∩V(1:t))\\ {e}) =αmin(OPT∩V(1:t)) (3)\nLetemin∈V(1:t)\\OPT be an element with type( emin)∈Q(OPT∩V(1:t)). Then, the set S= (OPT∩\nV(1:t))\\ {e} ∪ {emin}satisfies |S|=|OPT∩V(1:t)|and\nαmin(S)≥αmin((OPT∩V(1:t))\\ {e}) (Since ( OPT∩V(1:t))\\ {e} ⊂S)\n=αmin(OPT∩V(1:t)) (By Eq. (3))\nWe should not have αmin(S)> α min(OPT ∩V(1:t)) since OPT is supposed to be type feasible. However, if\nαmin(S) =αmin(OPT∩V(1:t)), then we have |Q(S)|<|Q(OPT∩V(1:t))|because Shas the additional element\neminwith type( emin)∈Q(OPT∩V(1:t)). This contradicts the lemma assumption that OPT is type feasible.\nSo, we cannot have|W∩V(t)∩Tq| ≥2, i.e., |W∩V(t)∩Tq| ≤1.\nTheorem 9. LetOPT be an optimal type-feasible selection and let OPT σbe an optimal σ-type feasible\nselection. Fix an integer k∈N>0. If|OPT σ∩V(t)∩Tq| ≥kfor all t∈[h]andq∈[r], then f(OPT )≤\nk+1\nk·f(OPT σ).\nProof. LetI ⊆2Vbe the independence set corresponding to the type feasibility of OPT σand define W⊆OPT\nto minimize the marginal gain:\ng(OPT\\W,W) = min\nA⊆OPT⊆V\n(OPT\\A)∈Ig(OPT\\A,A)\nSince fis non-decreasing, the optimization will try to pick a Wthat is as small as possible, subject to OPT\\W\nsatisfying the independence set constraints of I.\nFix a time step t∈[h] and type q∈[r]. By minimality of W, we know that |W∩V(t)∩Tq| ≤ |OPT∩\nV(t)∩Tq| − |OPT σ∩V(t)∩Tq|. Putting together, we get\n|(OPT\\W)∩V(t)∩Tq|=|OPT∩V(t)∩Tq| − |W∩V(t)∩Tq|\n≥ |OPT σ∩V(t)∩Tq| (Minimality of W)\n≥k (By assumption)\nBy Lemma 18, we know that |W∩V(t)∩Tq| ≤1, and therefore there exist kdisjoint subsets Y1, . . . ,Yk⊆\n(OPT\\W)∩V(t)∩Tqsuch that |Yi∩V(t)∩Tq|=|W∩V(t)∩Tq|andOPT\\Yi∈ Ifor each index i∈[k].\nWriting Z=OPT\\W, observe that\nf(Z)≥f(⊎k\ni=1Yi) ( ∗)\n=kX\ni=1g(⊎i−1\nj=1Yj,Yi) (By definition of g)\n≥kX\ni=1g(OPT\\Yi,Yi) ( ‡)\n≥kX\ni=1g(Z,W) (Minimality of W)\n=k·g(Z,W)\nwhere ( ∗) is because ⊎k\ni=1Yi⊆Zandfis non-decreasing, and ( ‡) is because ⊎i−1\nj=1Yj⊆OPT\\Yiandfis\nsubmodular. Therefore,\nf(OPT ) =f(Z) +g(Z,W) (By definition of gandZ)\n≤f(Z) +1\nk·f(Z) (From above)\n≤k+ 1\nk·f(OPT σ)\nwhere the last inequality is due to optimality of OPT σand since Z=OPT\\W∈ Iby choice of W. That is,\nZsatisfies the type feasible constraints of OPT σ.\n24\n\nWe now prove some additional properties about σ-type feasible selections (Definition 8) that will be useful\nin our proofs in later sections.\nDefinition 19 (b-minimal σ-type feasible set) .For any b∈N, we say that a subset S⊆Vis ab-minimal\nσ-type feasible set if 1 ≤ |S| ≤band\nmin\nq∈[r]|S∩Tq|\npq·b>max\ne∈Smin\nq∈[r]|(S\\ {e} ∩Tq|\npq·b≥0\nLemma 20. LetSbe aσ-type feasible set of size |S|=b. Then, we have S′⊆Sfor any b-minimal σ-type\nfeasible set S′such that\nmin\nq∈[r]|S′∩Tq|\npq·b≤min\nq∈[r]|S∩Tq|\npq·b(4)\nProof. Suppose, for a contradiction, that there is some ( a′, b)-minimal σ-type feasible set S′such that S′̸⊆\nS. Then, there exists some element e∈S′\\Ssuch that q∗= type( e) and |S′∩Tq∗|>|S∩Tq∗|. So,\n|(S′\\ {e})∩Tq∗| ≥ |S∩Tq∗|. Then, we see that\nmin\nq∈[r]|S∩Tq|\npq·b≤|S∩Tq∗|\npq∗·b(By definition of minimum)\n≤|(S′\\ {e})∩Tq∗|\npq∗·b(From above)\n<min\nq∈[r]|S′∩Tq|\npq·b(Since S′isb-minimal)\nHowever, this is a contradiction to Eq. (4).\nLemma 21 implies that any σ-type feasible solution of length bis an extension of another σ-type feasible\nsolution of length b−1.\nLemma 21. For any length b∈N>0, letSbbe a σ-type feasible selection of length bandSb−1be a σ-type\nfeasible selection of length b−1. Then, |Sb\\Sb−1|= 1.\nProof. We first show that\nmin\nq∈[r]|Sb−1∩Tq|\npq·b≤min\nq∈[r]|Sb∩Tq|\npq·b(5)\nSuppose, for a contradiction, that Eq. (5) is false. Then, any strict superset of A⊃Sb−1of size bwill have\nmin\nq∈[r]|A∩Tq|\npq·b≥min\nq∈[r]|Sb−1∩Tq|\npq·b>min\nq∈[r]|Sb∩Tq|\npq·b\nsince adding elements can only increase the numerator. This contradicts the assumption that Sbis aσ-type\nfeasible selection of size b, so Eq. (5) must be true.\nNow, suppose that min q∈[r]|Sb−1∩Tq|\npq·b= 0. Then,\nαmin(Sb−1) =b\nb−1·min\nq∈[r]|Sb−1∩Tq|\npq·b= 0\nSince Sb−1isσ-type feasible, it must be the case that Sb−1⊆Q(∅) and Sb−1comprises of elements following the\nσordering. If αmin(Sb) = 0 as well, then so does Sb. Otherwise, if αmin(Sb)>0, then we must have Q(∅)⊆Sb.\nBoth cases implies that Sb−1⊂Sband so |Sb\\Sb−1|= 1. Note that we cannot have αmin(Sb−1)> α min(Sb)\ndue to Eq. (5).\nGiven the argument above, we may assume that min q∈[r]|Sb−1∩Tq|\npq·b>0 in the remaining of the proof. This\nimplies that there will exist non-empty b-minimal σ-type feasible sets which is a necessary condition for us to\ninvoke Eq. (5).\nSuppose Sb−1is ab-minimal σ-type feasible set. Then, under Eq. (5), Lemma 20 yields Sb−1⊆S, so\n|Sb\\Sb−1|= 1.\n25\n\nNow, suppose that Sb−1isnotab-minimal σ-type feasible set.\nCase 1 : Suppose min q∈[r]|Sb−1∩Tq|\npq·b= min q∈[r]|Sb∩Tq|\npq·b.\nLetAbe a b-minimal σ-type feasible subset such that\nmin\nq∈[r]|A∩Tq|\npq·b= min\nq∈[r]|S∩Tq|\npq·bCase 1= min\nq∈[r]|S′∩Tq|\npq·b\nBy Lemma 20, we have both A⊆Sb−1andA⊆Sb. Since Sb−1isσ-type feasible, it maximizes β(b−1) where\nβ(b−1) = min\nq∈[r]|Sb−1∩Tq|\npq·(b−1)=b\nb−1·min\nq∈[r]|A∩Tq|\npq·b\nSinceb\nb−1is a constant independent of q∈[r], we see that Aalso maximizes β(b−1). Since a σ-type feasible\nselection must minimize |Q(S)|andAis a minimal subset, we see that S′\\A⊂Q(A). Crucially, note that\nQ(A)\\S′̸=∅, otherwise min q∈[r]|A∩Tq|\npq·b<minq∈[r]|S′∩Tq|\npq·b. Following a similar argument, one can show that\nSb\\A⊂Q(A). Now, since both Sb−1andSbareσ-type feasible, they must select from Q(A) in the ordering\nofσ. In other words, we have Sb−1\\A⊆Sb\\A, soSb−1⊆Sb, and thus |Sb\\Sb−1|= 1.\nCase 2 : Suppose min q∈[r]|Sb−1∩Tq|\npq·b<minq∈[r]|Sb∩Tq|\npq·b.\nLetBbe a b-minimal σ-type feasible subset such that\nmin\nq∈[r]|B∩Tq|\npq·b= min\nq∈[r]|S′∩Tq|\npq·bCase 2<min\nq∈[r]|S∩Tq|\npq·b\nBy Lemma 20, we have both B⊆Sb−1andB⊆Sb. Following a similar argument as Case 1, we see that\nSb−1\\B⊂Q(B). However, since min q∈[r]|B∩Tq|\npq·b<minq∈[r]|Sb∩Tq|\npq·b, we must have Q(B)⊆S. In other words,\nwe get Sb−1⊆Sband thus |Sb\\Sb−1|= 1.\nTo operationalize the abstract requirements of σ-type feasible selections (Definition 8), let us define the\nnotion of min-ratio type sequences (Definition 22).\nDefinition 22 (Min-ratio type sequence) .Letp= (p1, . . . , p r)∈Rr\n≥0be a vector of lower distributional\nbounds, σ: [r]→[r] be a total order over types, bbe a size and let d∈Nbe a fixed denominator. The\nmin-ratio type sequence s(p, σ, b, d )∈[r]Nis defined by starting with the empty sequence and repeating the\nfollowing steps btimes: append to the end of s(p, σ, b, d ) the type q∈[r] that minimizes#(q,s(p,σ,b,d ))\npq·d, breaking\nties according to the preference ordering σ. Since pandσare fixed inputs to any problem instance, we simply\nwrite s(b, d) to mean s(p, σ, b, d ).\nLemma 23 shows that Definition 22 is independent of the denominator, which will be useful in our analysis\nlater.\nLemma 23. For fixed p∈Rr\n≥0,σ: [r]→[r], and b∈N, we have s(b, d1) =s(b, d2)for any d1, d2∈N>0.\nProof. We will prove this by induction over b∈N.\nBase case (b= 0): When b= 0, we trivially have both s(0, d1) and s(0, d2) being the empty sequence.\nInductive case (b >0): By induction hypothesis, we know that s(b−1, d1) =s(b−1, d2), so #( q,s(b−1, d1)) =\n#(q,s(b−1, d2)) for any q∈[r]. Since#(q,s(b−1,d1))\npq·d1=d2\nd1·#(q,s(b−1,d2))\npq·d2for any q∈[r] andd2\nd1is a constant\nindependent of q, we have argminq∈[r]#(q,s(b−1,d1))\npq·d1= argminq∈[r]#(q,s(b−1,d2))\npq·d2, and thus both sequences will\nappend the same b-th type, resulting in s(b, d1) =s(b, d2).\nObserve that Definition 8 and Definition 22 are both defined independently of the budget constraints across\ntime. The former is an abstract axiomatic definition of the desired properties motivated from our Ethiopian\napplication while the latter is a specific concrete way of choosing a sequence of types. Interestingly, Lemma 24\ntells us that multisets of types produced by the two definitions are the same.\nLemma 24. For any length b∈N, there is a unique length b σ-type feasible selection S⊆Vsatisfying\n{{type( e)∈[r] :e∈S}}={{q∈[r] :q∈s(b, b)}}\n26\n\nProof. The claim trivially holds when r= 1, so we shall consider r >1. We will prove this by induction over\nb∈N.\nBase case (b= 1): Let Sbe any type feasible solution of size |S|= 1 according to Definition 1. Since r >1,\nwe have β(1) = 0, there exists some q∈[r] such that S∩Tq=∅, and|Q(S)|=r−1. Since Sis type feasible,\nit has to break ties according to σ. Thus, S={q∈[r] :σ(q) = 1}is the unique type feasible solution of size\n1. Meanwhile, Definition 22 produces s(1,1) = ( q∗), where σ(q∗) = 1. This is because all ratios are 0 initially\nand ties are broken according to σ. So,S=s(1,1) as desired.\nInductive case (b > 1): Let Sb−1be any type feasible solution of length |Sb−1|=b−1. By induction\nhypothesis, Sb−1is unique and Sb−1=s(b−1, b−1). By Lemma 23, we know that s(b−1, b−1) =s(b−1, b).\nSince Sb−1=s(b−1, b), we have |Sb−1∩Tq|= #( q,s(b−1, b)) for all types q∈[r]. By definition, both\ns(b−1, b) will extend by choosing something from Q(Sb−1) and break ties according to σ. Meanwhile, we\nknow from Lemma 21 that Sb−1⊂Sb, so we can also obtain Sbby extending Sb−1by choosing something from\nQ(Sb−1) and break ties according to σ. As such, both sequences will extend by appending the same type, we\nhaveS=s(b, b) as desired.\nFor convenience, we reproduce MultistepPlanning below, which was designed with Definition 22 in\nmind. Lemma 25 below tells us that any choice of independent set of size b(t)at each time step by Multi-\nstepPlanning results in the same multiset of types as the prefix of the min-ratio type sequence of lengthPh\nt=1b(t). Note that MultistepPlanning may not choose the elements whose type sequence agrees exactly\nwith Definition 22, but the total counts will agree for any given budget.\nAlgorithm 6 MultistepPlanning\nInput : AnMOPGP (f, h, r, V,b,p) instance and a tie-breaking ordering σ: [r]→[r]\nOutput : Aσ-type feasible selection S=S(1:h)\n1:Define S(1)=. . .=S(h)=∅ ▷Initialize selections\n2:fort= 1, . . . , h do\n3: Forq∈[r], define #( q,s(b(1:0), b(1:0))) = 0 and\nx(t)\nq= #( q,s(b(1:t), b(1:t)))−#(q,s(b(1:t−1), b(1:t−1)))\n4: LetM(t)= (V(t),I(t)) be the partition matroid at\ntime t, where I(t)={S⊆V(t):|S∩Tq| ≤x(t)\nq}.\n5: forb(t)times do ▷P\nq∈[r]x(t)\nq=b(t)≤ |V(t)|\n6: LetS=Sh\nt=1S(t)be the selection so far\n7: Lete∗= argmax\ne∈V(t)\\S\nS(t)∪{e}∈I(t)g(S,{e}) toS(t)\n8: end for\n9:end for\n10:Output S(1)⊎. . .⊎S(h)\nLemma 25. For any time step t∈[h], letb(1:t)=Pt\nτ=1b(t)andM(t)= (V(t),I(t))be the matroid defined in\nMultistepPlanning . Then, we have mt\n1=mt\n2for all t∈[h], where multisets mt\n1,mt\n2∈[r]b(1:t)are defined\nas\nmt\n1={{q∈[r] :q∈s(p, σ, b(1:t), b(1:t))}}\nand\nmt\n2={{type( e)∈[r] :e∈t[\nτ=1S(τ),where S(τ)∈ I(τ)and|S(τ)|=bτ∀τ∈[t]}}\nProof. We will prove this claim via an induction over t∈ {1, . . . , h }.\nBase case (t= 1): By definition of M(1), any independent set of size b(1)inI(1)involves x(1)\nq= #( q,s(b(1), b(1)))\n27\n\nitems of type q∈[r] such thatP\nq∈[r]x(1)\nq=b(1). So, the multisets m(t)\n2=m(t)\n1both count the types appearing\nins(b1, b1).\nInductive case (t >1): By definition of M(t), any independent set of size b(t)inI(t)involves\nx(t)\nq= #( q,s(b(1:t), b(1:t)))−#(q,s(b(1:t−1), b(1:t−1))) (By definition of x(t)\nqin Algorithm 2)\n= #( q,s(b(1:t), b(1:t)))−#(q,s(b(1:t−1), b(1:t))) (By Lemma 23)\nitems of type q∈[r] such thatP\nq∈[r]x(t)\nq=b(t). Let x(t)be the multiset of size b(t)such that q∈[r] appears\nx(t)\nqtimes. That is, the multiset x(t)counts the types appearing in the length b(t)=b(1:t)−b(1:t−1)suffix of\ns(b(1:t), b(1:t)).\nBy Lemma 23, we also know that s(b(1:t−1), b(1:t−1)) =s(b(1:t−1), b(1:t)), sos(b(1:t−1), b(1:t−1)) is simply the\nlength b(1:t−1)prefix of s(b(1:t), b(1:t)) according to Definition 22. By induction hypothesis, this means that\nm(t−1)\n2 is the multiset counting the types appearing in the length b(1:t−1)prefix of s(b(1:t), b(1:t)). So, the\nmultisets m(t)\n2=m(t−1)\n2∪x(t)=m(t)\n1both count the types appearing in s(b(1:t), b(1:t)).\nWe are now ready to prove our Theorem 10 which states the theoretical guarantees of MultistepPlanning\nwith respect to σ-type feasible selections.\nTheorem 10. Fix an arbitrary tie-breaking ordering σ: [r]→[r]. Assuming the objective function fcan be\nevaluated in constant time given any subset, MultistepPlanning runs in O(Ph\nt=1b(t)·(r+|V(t)|))time and\noutputs S=⊎h\nt=1S(t)such that\n1. For all t∈[h],S(t)⊆V(t)and|S(t)|=b(t).\n2. The output Sis aσ-type feasible selection.\n3. For all t∈[h], we have\nf(S(1)⊎. . .⊎S(t))≥1\n2·f(OPT σ(b(1), . . . , b(t)))\nwhere OPT σ(b(1), . . . , b(t))is an optimum σ-type feasible selection restricted to budgets b(1), . . . , b(t).\nProof. In each time step t∈[h],MultistepPlanning can compute the x(t)\nqvalues in O(r·b(t)) time by\nappropriate bookkeeping, then perform b(t)greedy selections, each requiring the calculation of at most |V(t)|\nmarginal gains. The overall running time across all time steps is O(Ph\nt=1b(t)·(r+|V(t)|)).\nWe now show the three items separately.\n1. We always choose an independent set containing elements from V(t)at each time step t∈[h], up to size\nb(t).\n2. Lemma 24 and Lemma 25 jointly ensures that anyoutput of MultistepPlanning is aσ-type feasible\nselection.\n3. Lemma 24 and Lemma 25 jointly ensures that anyσ-type feasible solution is a possible output of Algorithm 2.\nAsV(1), . . . ,V(h)are disjoint, I1, . . . ,Ihjointly induce a single partition matroid which enforcesPr\nq=1x(t)\nq=\nb(t)at each time step t∈[h]. Since MultistepPlanning is performs greedy selection at each time step over\na single matroid, it yields a1\n2-approximation to the offline optimum selection at any time step t∈[h]; just like\nLocalGreedy with k= 1.\nE Deferred technical details for Section 4.3\nHere, we provide the full proofs of the impossibility results stated in Section 4.3.\nProposition 11. LetALG be any deterministic algorithm to MOPGP aiming to produce selections S(1), . . . ,S(h)\nthat maximizes β(b(1:t))at each time step t∈[h]. IfALG does not minimize |Q(S(t))|for each t∈[h], then\nthere exists instances where it fails to minimize β(b(1:t))at each t∈[h].\n28\n\nProof. Consider an arbitrary MOPGP instance Mwith rtypes for which there is some timestep tsuch that\nALG maximizes β(b(1:t)) but did not minimize |Q(S(t))|. Suppose |Q(S(t))|=k≤rwhile it could have been\nof size ℓ < k . We now define a new MOPGP instance M′obtained by using the prefix of Mup to time t, and\nadding one additional time step b(t+1)=ℓ. Since MandM′are indistinguishable up to time step t, and ALG\nis deterministic, ALG must choose the same selections up to time step t, resulting in |Q(S(t))|=k > ℓ . Thus,\nfor the final time step t+ 1 for M′,ALG would have β(b(1:t+1)) =β(b(1:t)) instead of being able to improve\nthe satisfaction ratio if it had minimized |Q(S(t))|at time step tto be of size ℓ.\nWe prove Proposition 12 (reproduced below for convenience) separately for the bound of1\n2andk\nk+1in\nProposition 26 and Proposition 27 respectively.\nProposition 12. There exists instances where MultistepPlanning achieves an approximation ratio of ≤1\n2\ndue to budget uncertainties and ≤k\nk+1due to σ-ordering.\nProof. See Proposition 26 and Proposition 27.\nProposition 26. There exists instances where MultistepPlanning achieves an approximation ratio of at\nmost1\n2due to budget uncertainties.\nProof. Fix values x, ε≥0, where εis to be treated as a vanishingly small value. Suppose r= 1, h= 2,\nb(1)=b(2)= 1,V(1)={a, b},V(2)={c}, and\nf(S) =\n\n0 if S=∅\nx+ε ifS={a}\nx ifS={b}\nx+ 2εifS={c}orS={a, c}\n2x+ 2εifS={b, c}\nOne can verify that fis a non-decreasing submodular function. MultistepPlanning will greedily select\nS(1)={a}andS(2)={c}, obtaining an objective value of f({a, c}) =x+ 2ε. Meanwhile, an optimal selection\nthat operates without budget uncertainty will select S(1)={b}andS(2)={c}, obtaining an objective value\noff({a, c}) = 2 x+ 2ε. We see that the competitive ratio is lim ε→0x+2ε\n2x+2ε=1\n2.\nProposition 27. There exists instances where MultistepPlanning achieves an approximation ratio of at\nmostk\nk+1due to σ-ordering.\nProof. Fixk∈Nand the ordering σ: [r]→[r] which favors smaller indexed types. That is, when tie-breaking\nfor satisfaction ratio, the unselected type(s) have large indices. Suppose |OPT σ∩V(t)∩Tq| ≥kfor all t∈[h]\nandq∈[r]. Now suppose h= 1, b(1)=rk+ 1, f(S) =|S∩Tr|, and there are more than b(1)elements of\neach type. One can check that that fis a non-decreasing submodular function. Then, MultistepPlanning\nwill select kelements of each type and then one element of type 1 due to σ, obtaining an objective value of k.\nMeanwhile, an optimal selection will select kelements of each type and then one element of type r, obtaining\nan objective value of k+ 1. Thus, the competitive ratio isk\nk+1.\nF Results for Sidama Region\nF.1 Experiment 1: Impact of budget on coverage\nIn Fig. 7, the bars show how total coverage improves under different allocation strategies and budget levels over\na five-year planning horizon. Since the initial coverage is already high, the measured improvement is marginal.\nF.2 Experiment 2: Evaluating district-level equity\nHere we examine the minimum satisfaction ratio, αmin(S), achieved under each policy. As shown in Fig. 8,\nMP(DP1) and MP(DP2) outperform all other methods in the DP1 and DP2 metrics respectively, while\nMP(DP0) consistently attains αmin= 0. Interestingly, although in Fig. 7, building facilities resulted in mild\neffect on the coverage, the effect on the district-level equity is more noticeable.\n29\n\n6 12 18 24\nYearly Budget00.20.40.60.81.0Bars: fRegion(ALG)Sidama\n1.01.21.41.61.8\nLines: Rel. Efficiency LossMP(DP0)\nMP(DP1)\nMP(DP2)\nRandom\nMP(DP1)\nMP(DP2)Figure 7: Coverage under varying annual budgets for Sidama region. Bars show total population coverage\nby each policy, with the black line indicating existing coverage before any yearly budget was spent to build\nadditional health posts. The dashed line above indicate relative efficiency loss from enforcing proportional\nconstraints for DP1 and DP2, compared to the unconstrained baseline (DP0).\nF.3 Experiment 3: High quality advice can help\nThe results in this section are similar to the results in the main paper. Out of around 30 districts in Sidama,\nwe found 11 districts in which our learning-augmented selection Uoutperforms both the greedy baseline G\nand the expert selection A, i.e., f(U)> f(G)> f(A).\nG Further experimental details\nAll experiments were conducted using Python 3.12 on two systems: (i) a Linux-based server with 48-core Intel\nXeon CPUs and 190GB of RAM, and (ii) a Windows laptop running WSL with 8 cores and 16GB of RAM.\nPopulation projections were obtained from the WorldPop dataset6. Friction surface data for walking time\ncomputation was sourced from the MalariaAtlas GitHub repository7, using an R script we provide. Admin-\nistrative shapefiles were downloaded from the United Nations Office for the Coordination of Humanitarian\nAffairs (OCHA)8.\nFor Experiment 3 (retrospective analysis), we fixed a random seed of 0, and generated 10 permutations of\nthe original advice set to serve as inputs to our learning-augmented algorithm.\nSeveral data inputs (such as district-level rates of home births and postnatal care, as well as facility reg-\nistries) request permission and thus cannot be shared. To ensure usability, we include code that generates\nsynthetic examples, allowing others to replicate our methods.\n6https://data.worldpop.org/GIS/Population/Global_2015_2030/R2024B/2026/ETH/v1/1km_ua/constrained/eth_pop_2026_\nCN_1km_R2024B_UA_v1.tif\n7https://github.com/malaria-atlas-project/malariaAtlas\n8https://data.humdata.org/dataset/cb58fa1f-687d-4cac-81a7-655ab1efb2d0/resource/63c4a9af-53a7-455b-a4d2-adcc22b48d28/\ndownload/eth_adm_csa_bofedb_2021_shp.zip\n30\n\nDP1 DP20.00.51.0αmin(S)\n0Sidama\nMP(DP0)\nMP(DP1)\nMP(DP2)\nMP(Random)Figure 8: Minimum satisfaction ratio αminattained under each policy, with proportions defined by DP1 or\nDP2 respectively. Over five-year horizon, annual budgets of 12 facilities were allocated for Sidama.\nReproducibility focus. Our goal is to make our methodological contribution reproducible and reusable.\nAll core components of our tool are fully data-agnostic and will yield the same visualizations and planning\noutputs when provided with actual Ethiopia-specific data. Once these data become publicly available, all\nresults in the main paper can be replicated by plugging them into our codebase. The code is available at\nhttps://github.com/yohayt/Optimizing-Health-Coverage-in-Ethiopia .\n31",
  "textLength": 89745
}