{
    "paperId": "265f78f2682e8cff424ee98d0b24579cb5918811",
    "title": "A Survey on Big IoT Data Indexing: Potential Solutions, Recent Advancements, and Open Issues",
    "year": 2021,
    "venue": "Future Internet",
    "authors": [
        "Zineddine Kouahla",
        "Ala-Eddine Benrazek",
        "M. Ferrag",
        "Brahim Farou",
        "Hamid Seridi",
        "M. Kurulay",
        "A. Anjum",
        "Alia Asheralieva"
    ],
    "doi": "10.3390/fi14010019",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/265f78f2682e8cff424ee98d0b24579cb5918811",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/1999-5903/14/1/19/pdf?version=1641800004",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The past decade has been characterized by the growing volumes of data due to the widespread use of the Internet of Things (IoT) applications, which introduced many challenges for efficient data storage and management. Thus, the efficient indexing and searching of large data collections is a very topical and urgent issue. Such solutions can provide users with valuable information about IoT data. However, efficient retrieval and management of such information in terms of index size and search time require optimization of indexing schemes which is rather difficult to implement. The purpose of this paper is to examine and review existing indexing techniques for large-scale data. A taxonomy of indexing techniques is proposed to enable researchers to understand and select the techniques that will serve as a basis for designing a new indexing scheme. The real-world applications of the existing indexing techniques in different areas, such as health, business, scientific experiments, and social networks, are presented. Open problems and research challenges, e.g., privacy and large-scale data mining, are also discussed.",
    "citationCount": 12,
    "referenceCount": 272
}