{
    "paperId": "363b3ba2e55ed7dc040e4a23fef1c38ed237b666",
    "title": "How Does Updatable Learned Index Perform on Non-Volatile Main Memory?",
    "year": 2021,
    "venue": "2021 IEEE 37th International Conference on Data Engineering Workshops (ICDEW)",
    "authors": [
        "Leying Chen",
        "Shimin Chen"
    ],
    "doi": "10.1109/ICDEW53142.2021.00019",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/363b3ba2e55ed7dc040e4a23fef1c38ed237b666",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Recent work on learned index opens a new research direction for index structures. By exploiting the data distribution, a read-only learned index can achieve much better time and space performance than B+-Trees. A number of recent studies propose enhanced learned index structures that provide various levels of support for insertions and deletions. Among them, ALEX, an updatable adaptive learned index, provides the most comprehensive support, allowing on-the-fly insertions and dynamically adjusting the index structure similar to the B+-Tree. In this paper, we study learned index from a new perspective, trying to understand how ALEX performs on Non-Volatile Main Memory (NVM). We analyze the insertion behaviors of ALEX and experimentally evaluate its performance on a real machine equipped with Intel Optane DC Persistent Memory. We find that learning data distributions in learned index makes it feasible to create very large leaf nodes, and reduce the tree height drastically for better search performance. However, this design choice causes a large number of NVM writes for insertion operations, even for the well optimized ALEX design.",
    "citationCount": 9,
    "referenceCount": 16
}