{
    "paperId": "3afcc4d3d4a358e2f311e718bf873006364eafa8",
    "title": "Visual Analytics for Profiling Land Use Changes",
    "year": 2023,
    "venue": "SIBGRAPI Conference on Graphics, Patterns and Images",
    "authors": [
        "Claudio Santos",
        "Maryam Hosseini",
        "João Rulff",
        "Fabio Miranda",
        "Luc Wilson",
        "Cláudio T. Silva",
        "Nivan Ferreira",
        "Marcos Lage"
    ],
    "doi": "10.1109/SIBGRAPI59091.2023.10347138",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/3afcc4d3d4a358e2f311e718bf873006364eafa8",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The growth of cities calls for regulations and zoning rules on how each piece of urban space will be used. Tracking land use can reveal a wealth of information about urban development. For that matter, cities have been releasing data sets describing the historical evolution of the shape and the attributes of land units. The complex nature of land-use data, however, makes the analysis of such data challenging and time-consuming. To address these challenges, we propose Urban Chronicles, a visual analytics system that enables interactive exploration of land-use changes. Using New York City's Primary Land Use Tax Lot Output (PLUTO), we show the system's capabilities to explore the data from several years at different scales. UrbanChron-iclessupports on-the-fly aggregation and filtering operations that leverage the hierarchical nature of the data set to index the shape and attributes of geographical regions that change over time. Finally, we demonstrate the system's utility through case studies that analyze the impact of Hurricane Sandy on land use attributes and the effects of rezoning plans in Brooklyn.",
    "citationCount": 1,
    "referenceCount": 32
}