{
    "paperId": "4007ea090b43d7c269409a0f02b9b1582ad529f9",
    "title": "The Supermarket Model with Known and Predicted Service Times",
    "year": 2019,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "M. Mitzenmacher",
        "Matteo Dell'Amico"
    ],
    "doi": "10.1109/TPDS.2022.3146195",
    "arxivId": "1905.12155",
    "url": "https://www.semanticscholar.org/paper/4007ea090b43d7c269409a0f02b9b1582ad529f9",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.1109/tpds.2022.3146195",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The supermarket model refers to a system with a large number of queues, where arriving customers choose d queues at random and join the queue with the fewest customers. The supermarket model demonstrates the power of even small amounts of choice, as compared to simply joining a queue chosen uniformly at random, for load balancing systems. In this work we perform simulation-based studies to consider variations where service times for a customer are predicted, as might be done in modern settings using machine learning techniques or related mechanisms. Our primary takeaway is that using even seemingly weak predictions of service times can yield significant benefits over blind First In First Out queueing in this context. However, some care must be taken when using predicted service time information to both choose a queue and order elements for service within a queue; while in many cases using the information for both choosing and ordering is beneficial, in many of our simulation settings we find that simply using the number of jobs to choose a queue is better when using predicted service times to order jobs in a queue. In our simulations, we evaluate both synthetic and real-world workloads--in the latter, service times are predicted by machine learning. Our results provide practical guidance for the design of real-world systems; moreover, we leave many natural theoretical open questions for future work, validating their relevance to real-world situations.",
    "citationCount": 13,
    "referenceCount": 36
}