{
    "paperId": "54525759533286c73c6bdad52ded0048d3688cb4",
    "title": "Automatic configuration of the Cassandra database using irace",
    "year": 2021,
    "venue": "PeerJ Computer Science",
    "authors": [
        "Moisés Silva-Muñoz",
        "A. Franzin",
        "H. Bersini"
    ],
    "doi": "10.7717/peerj-cs.634",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/54525759533286c73c6bdad52ded0048d3688cb4",
    "isOpenAccess": true,
    "openAccessPdf": "https://doi.org/10.7717/peerj-cs.634",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Database systems play a central role in modern data-centered applications. Their performance is thus a key factor in the efficiency of data processing pipelines. Modern database systems expose several parameters that users and database administrators can configure to tailor the database settings to the specific application considered. While this task has traditionally been performed manually, in the last years several methods have been proposed to automatically find the best parameter configuration for a database. Many of these methods, however, use statistical models that require high amounts of data and fail to represent all the factors that impact the performance of a database, or implement complex algorithmic solutions. In this work we study the potential of a simple model-free general-purpose configuration tool to automatically find the best parameter configuration of a database. We use the irace configurator to automatically find the best parameter configuration for the Cassandra NoSQL database using the YCBS benchmark under different scenarios. We establish a reliable experimental setup and obtain speedups of up to 30% over the default configuration in terms of throughput, and we provide an analysis of the configurations obtained.",
    "citationCount": 8,
    "referenceCount": 74
}