{
    "paperId": "65e69ab8ea09e73620ccfaf6d71657a4e5847da9",
    "title": "LiLIS: Enhancing Big Spatial Data Processing with Lightweight Distributed Learned Index",
    "year": 2025,
    "venue": "arXiv.org",
    "authors": [
        "Zhongpu Chen",
        "Wanjun Hao",
        "Ziang Zeng",
        "Long Shi",
        "Yi Wen",
        "Zhi-Jie Wang",
        "Yu Zhao"
    ],
    "doi": "10.48550/arXiv.2504.18883",
    "arxivId": "2504.18883",
    "url": "https://www.semanticscholar.org/paper/65e69ab8ea09e73620ccfaf6d71657a4e5847da9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The efficient management of big spatial data is crucial for location-based services, particularly in smart cities. However, existing systems such as Simba and Sedona, which incorporate distributed spatial indexing, still incur substantial index construction overheads, rendering them far from optimal for real-time analytics. Recent studies demonstrate that learned indices can achieve high efficiency through well-designed machine learning models, but how to design a learned index for distributed spatial analytics remains unaddressed. In this paper, we present LiLIS, a Lightweight Distributed Learned Index for big spatial data. LiLIS combines machine-learned search strategies with spatial-aware partitioning within a distributed framework, and efficiently implements common spatial queries, including point query, range query, k-nearest neighbors (kNN), and spatial joins. Extensive experimental results over real-world and synthetic datasets show that LiLIS outperforms state-of-the-art big spatial data analytics by $2-3$ orders of magnitude for most spatial queries, and the index building achieves $1.5-2\\times$ speed-up. The code is available at https://github.com/SWUFE-DB-Group/learned-index-spark.",
    "citationCount": 0,
    "referenceCount": 54
}