{
    "paperId": "782283b30081dc55438cfb4c3a74d0d331dd3206",
    "title": "Understanding ML Driven HPC: Applications and Infrastructure",
    "year": 2019,
    "venue": "eScience",
    "authors": [
        "Geoffrey Fox",
        "S. Jha"
    ],
    "doi": "10.1109/eScience.2019.00054",
    "arxivId": "1909.02363",
    "url": "https://www.semanticscholar.org/paper/782283b30081dc55438cfb4c3a74d0d331dd3206",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1909.02363",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We recently outlined the vision of \"Learning Everywhere\" which captures the possibility and impact of how learning methods and traditional HPC methods can be coupled together. A primary driver of such coupling is the promise that Machine Learning (ML) will give major performance improvements for traditional HPC simulations. Motivated by this potential, the ML around HPC class of integration is of particular significance. In a related follow-up paper, we provided an initial taxonomy for integrating learning around HPC methods. In this paper which is part of the Learning Everywhere series, we discuss ``how'' learning methods and HPC simulations are being integrated to enhance effective performance of computations. This paper describes several modes --- substitution, assimilation, and control, in which learning methods integrate with HPC simulations and provide representative applications in each mode. This paper discusses some open research questions and we hope will motivate and clear the ground for MLaroundHPC benchmarks.",
    "citationCount": 13,
    "referenceCount": 49
}