{
    "paperId": "7cda5ee0fbbfe14ad4339412d75c2aa720ecdd9e",
    "title": "Massivizing Computer Systems: A Vision to Understand, Design, and Engineer Computer Ecosystems Through and Beyond Modern Distributed Systems",
    "year": 2018,
    "venue": "IEEE International Conference on Distributed Computing Systems",
    "authors": [
        "A. Iosup",
        "Alexandru Uta",
        "L. Versluis",
        "George Andreadis",
        "Erwin Van Eyk",
        "T. Hegeman",
        "Sacheendra Talluri",
        "V. V. Beek",
        "L. Toader"
    ],
    "doi": "10.1109/ICDCS.2018.00122",
    "arxivId": "1802.05465",
    "url": "https://www.semanticscholar.org/paper/7cda5ee0fbbfe14ad4339412d75c2aa720ecdd9e",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/1802.05465",
    "publicationTypes": [
        "JournalArticle",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Our society is digital: industry, science, governance, and individuals depend, often transparently, on the inter-operation of large numbers of distributed computer systems. Although the society takes them almost for granted, these computer ecosystems are not available for all, may not be affordable for long, and raise numerous other research challenges. Inspired by these challenges and by our experience with distributed computer systems, we envision Massivizing Computer Systems, a domain of computer science focusing on understanding, controlling, and evolving successfully such ecosystems. Beyond establishing and growing a body of knowledge about computer ecosystems and their constituent systems, the community in this domain should also aim to educate many about design and engineering for this domain, and all people about its principles. This is a call to the entire community: there is much to discover and achieve.",
    "citationCount": 28,
    "referenceCount": 184
}