{
    "paperId": "b616b27c27a184715813b78a40684691c743ef40",
    "title": "Proteus: A Self-Designing Range Filter",
    "year": 2022,
    "venue": "SIGMOD Conference",
    "authors": [
        "Eric R. Knorr",
        "Baptiste Lemaire",
        "Andrew Lim",
        "Siqiang Luo",
        "Huanchen Zhang",
        "Stratos Idreos",
        "M. Mitzenmacher"
    ],
    "doi": "10.1145/3514221.3526167",
    "arxivId": "2207.01503",
    "url": "https://www.semanticscholar.org/paper/b616b27c27a184715813b78a40684691c743ef40",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2207.01503",
    "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We introduce Proteus, a novel self-designing approximate range filter, which configures itself based on sampled data in order to optimize its false positive rate (FPR) for a given space requirement. Proteus unifies the probabilistic and deterministic design spaces of state-of-the-art range filters to achieve robust performance across a larger variety of use cases. At the core of Proteus lies our Contextual Prefix FPR (CPFPR) model - a formal framework for the FPR of prefix-based filters across their design spaces. We empirically demonstrate the accuracy of our model and Proteus' ability to optimize over both synthetic workloads and real-world datasets. We further evaluate Proteus in RocksDB and show that it is able to improve end-to-end performance by as much as 5.3x over more brittle state-of-the-art methods such as SuRF and Rosetta. Our experiments also indicate that the cost of modeling is not significant compared to the end-to-end performance gains and that Proteus is robust to workload shifts.",
    "citationCount": 29,
    "referenceCount": 53
}