{
    "paperId": "b9804fed72a26751e2103007004944c01e6bc0e8",
    "title": "A Survey on Deep Reinforcement Learning for Data Processing and Analytics",
    "year": 2021,
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "authors": [
        "Qingpeng Cai",
        "Can Cui",
        "Yiyuan Xiong",
        "Wei Wang",
        "Zhongle Xie",
        "Meihui Zhang"
    ],
    "doi": "10.1109/TKDE.2022.3155196",
    "arxivId": "2108.04526",
    "url": "https://www.semanticscholar.org/paper/b9804fed72a26751e2103007004944c01e6bc0e8",
    "isOpenAccess": true,
    "openAccessPdf": "https://arxiv.org/pdf/2108.04526",
    "publicationTypes": [
        "JournalArticle",
        "Review"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Data processing and analytics are fundamental and pervasive. Algorithms play a vital role in data processing and analytics where many algorithm designs have incorporated heuristics and general rules from human knowledge and experience to improve their effectiveness. Recently, reinforcement learning, deep reinforcement learning (DRL) in particular, is increasingly explored and exploited in many areas because it can learn better strategies in complicated environments it is interacting with than statically designed algorithms. Motivated by this trend, we provide a comprehensive review of recent works focusing on utilizing DRL to improve data processing and analytics. First, we present an introduction to key concepts, theories, and methods in DRL. Next, we discuss DRL deployment on database systems, facilitating data processing and analytics in various aspects, including data organization, scheduling, tuning, and indexing. Then, we survey the application of DRL in data processing and analytics, ranging from data preparation, natural language processing to healthcare, fintech, etc. Finally, we discuss important open challenges and future research directions of using DRL in data processing and analytics.",
    "citationCount": 37,
    "referenceCount": 131
}