{
    "paperId": "bb01af4ea02f1d10a8ee2c95b4a6276a7dc5c530",
    "title": "Similarity Metrics Enforcement in Seasonal Agriculture Areas Classification",
    "year": 2020,
    "venue": "Remote Sensing",
    "authors": [
        "Marcio A. S. Santos",
        "E. Assad",
        "A. Gurgel",
        "Nizam Omar"
    ],
    "doi": "10.3390/rs12111791",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bb01af4ea02f1d10a8ee2c95b4a6276a7dc5c530",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2072-4292/12/11/1791/pdf",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Agricultural and Food Sciences",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "Accurate identification of agriculture areas is a key piece in the building blocks strategy of environment and economics resources management. The challenge requires one to deal with landscape complexity, sensors and data acquisition limitations through a proper computational approach to timely deliver accurate information. In this paper, a Machine Learning (ML) based method to enhance the classification process of areas dedicated to seasonal crops (row crops) is proposed. To this objective, a broad exploration of data from Moderate Resolution Imaging Spectro-radiometer sensors (MODIS) was made using pixel time-series combined with time-series similarity metrics. The experiment was performed in Brazil, covered 61% of the total agriculture areas, five different states specifically selected to demonstrate biome differences and the country’s diversity. The validation was made against independent data from EMBRAPA (Brazilian Agriculture Research Corporation), RapidEye Sensor Scene Maps. For the eight tested algorithms, the results were enhanced and demonstrate that the method can rate the classification accuracy up to 98.5%, average value for the tested algorithms. The process can be used to timely monitor large areas dedicated to row crops and enables the application of state of art classification techniques, two levels classification process, to identify crops according to each specific need within the areas.",
    "citationCount": 1,
    "referenceCount": 49
}