{
    "paperId": "bc3c85274a65541fe0826a8956055b0f03251f67",
    "title": "Learning Correlation Space for Time Series",
    "year": 2018,
    "venue": "arXiv.org",
    "authors": [
        "Han Qiu",
        "Hoang Thanh Lam",
        "F. Fusco",
        "M. Sinn"
    ],
    "doi": null,
    "arxivId": "1802.03628",
    "url": "https://www.semanticscholar.org/paper/bc3c85274a65541fe0826a8956055b0f03251f67",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Mathematics",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "We propose an approximation algorithm for efficient correlation search in time series data. In our method, we use Fourier transform and neural network to embed time series into a low-dimensional Euclidean space. The given space is learned such that time series correlation can be effectively approximated from Euclidean distance between corresponding embedded vectors. Therefore, search for correlated time series can be done using an index in the embedding space for efficient nearest neighbor search. Our theoretical analysis illustrates that our method's accuracy can be guaranteed under certain regularity conditions. We further conduct experiments on real-world datasets and the results show that our method indeed outperforms the baseline solution. In particular, for approximation of correlation, our method reduces the approximation loss by a half in most test cases compared to the baseline solution. For top-$k$ highest correlation search, our method improves the precision from 5\\% to 20\\% while the query time is similar to the baseline approach query time.",
    "citationCount": 4,
    "referenceCount": 45
}