{
    "paperId": "bec0ca9629f4026716ec138085b8d3abb9601510",
    "title": "G-Learned Index: Enabling Efficient Learned Index on GPU",
    "year": 2024,
    "venue": "IEEE Transactions on Parallel and Distributed Systems",
    "authors": [
        "Jiesong Liu",
        "Feng Zhang",
        "Lv Lu",
        "Chang Qi",
        "Xiaoguang Guo",
        "Dong Deng",
        "Guoliang Li",
        "Huanchen Zhang",
        "Jidong Zhai",
        "Hechen Zhang",
        "Yuxing Chen",
        "Anqun Pan",
        "Xiaoyong Du"
    ],
    "doi": "10.1109/TPDS.2024.3381214",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/bec0ca9629f4026716ec138085b8d3abb9601510",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "AI and GPU technologies have been widely applied to solve Big Data problems. The total data volume worldwide reaches 200 zettabytes in 2022. How to efficiently index the required content among massive data becomes serious. Recently, a promising learned index has been proposed to address this challenge: It has extremely high efficiency while retaining marginal space overhead. However, we notice that previous learned indexes have mainly focused on CPU architecture, while ignoring the advantages of GPU. Because traditional indexes like B-Tree, LSM, and bitmap have greatly benefited from GPU acceleration, a combination of a learned index and GPU has great potentials to reach tremendous speedups. In this paper, we propose a GPU-based learned index, called G-Learned Index, to significantly improve the performance of learned index structures. The primary challenges in developing G-Learned Index lie in the use of thousands of GPU cores including minimization of synchronization and branch divergence, data structure design for parallel operations, and usage of memory bandwidth including limited memory transactions and multi-memory hierarchy. To overcome these challenges, a series of novel technologies are developed, including efficient thread organization, succinct data structures, and heterogeneous memory hierarchy utilization. Compared to the state-of-the-art learned index, the proposed G-Learned Index achieves an average of 174× speedup (and 107× of its parallel version). Meanwhile, we attain 2× less query time over the state-of-the-art GPU B-Tree. Our further exploration of range queries shows that G-Learned Index is <inline-formula><tex-math notation=\"LaTeX\">$17\\times$</tex-math><alternatives><mml:math><mml:mrow><mml:mn>17</mml:mn><mml:mo>×</mml:mo></mml:mrow></mml:math><inline-graphic xlink:href=\"zhang-ieq1-3381214.gif\"/></alternatives></inline-formula> faster than CPU multi-dimensional learned index.",
    "citationCount": 7,
    "referenceCount": 83
}