{
    "paperId": "c984bbd24808dcec3a05bd4c1f3438e0e7078312",
    "title": "DENIMS: A Distance-Driven Learned Index for Multi-Dimensional Skewed Data",
    "year": 2024,
    "venue": "2024 Sixth International Conference on Next Generation Data-driven Networks (NGDN)",
    "authors": [
        "Na Guo",
        "Haonan Jiang",
        "Xiufeng Xia"
    ],
    "doi": "10.1109/NGDN61651.2024.10744117",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/c984bbd24808dcec3a05bd4c1f3438e0e7078312",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "Conference"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "The future of network development is inseparable from the advancement of data-driven capabilities. Effective and efficient data access is an integral part of future network applications. In the digital era, artificial intelligence meets traditional database, and they benefit from each other. Artificial intelligence assisted database discover a new development idea, in which learned index is an important branch. Learned index not only occupy less storage space but also enhance query performance. However, opportunities always come with challenges, and dealing with increasing dimensions remains an arduous task for learned indexes. Moreover, current learned indexes suffer from the skewed data distribution. In this paper, we propose a new index structure named DENIMS that can avoid the influence of skewed data in muti-dimension. We adopt a data partition strategy based on clustering algorithms. We propose a new way of dimensionality reduction by means of coordinate converting, which can preserve original adjacency. And in each cluster data sorting according to polar coordinates, so advanced 1-dimension indexing techniques can be used. Range query and KNN query are executed depending on the predicted locations of the learned model. Extensive experiments on real-world and synthetic datasets demonstrate that DENIMS outperforms traditional indexes and state-of-the-art learned indexes when faced with skewed data.",
    "citationCount": 0,
    "referenceCount": 15
}