{
    "paperId": "db0c649cd0972e11cd5478d72a524b795bf927b9",
    "title": "FSA-Hash: Flow-Size-Aware Sketch Hashing for Software Switches",
    "year": 2025,
    "venue": "IEEE transactions on computers",
    "authors": [
        "Fuliang Li",
        "Kejun Guo",
        "Yiming Lv",
        "Jiaxing Shen",
        "Yuting Liu",
        "Xingwei Wang",
        "Jiannong Cao"
    ],
    "doi": "10.1109/TC.2025.3603716",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/db0c649cd0972e11cd5478d72a524b795bf927b9",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In modern data centers and enterprise networks, software switches have become critical components for achieving flexible and efficient network management. Due to resource constraints in software switches, sketches have emerged as a promising approach for network traffic measurement. However, their accuracy is often impacted by hash collisions. Existing hash functions treat all collisions equally, failing to account for the differing impacts of collisions involving elephant flows versus mouse flows. We propose FSA-Hash, a novel flow-size-aware hashing scheme that separates elephant flows from each other and from mouse flows, minimizing the most detrimental collisions. FSA-Hash is designed based on two insights: separating elephant flows from mouse flows avoids overestimating mouse flows, while separating elephant flows from each other enables accurate heavy-hitter detection. We implement FSA-Hash using machine learning models trained on network traffic data (LFSA-Hash), and also design a lightweight online variant (OLFSA-Hash) that learns the hash model solely from sketch queries on the software switch, obviating traffic collection overheads. Evaluations across four sketches and two tasks demonstrate FSA-Hash’s superior accuracy over standard hash functions. Moreover, OLFSA-Hash closely matches LFSA-Hash’s performance, making it an attractive option for adaptively refining the hash model without monitoring traffic.",
    "citationCount": 0,
    "referenceCount": 37
}