{
    "paperId": "e53fed6d71f946d7d73f3121c1fbc8240c5be731",
    "title": "An HBase-Based Optimization Model for Distributed Medical Data Storage and Retrieval",
    "year": 2023,
    "venue": "Electronics",
    "authors": [
        "Chengzhang Zhu",
        "Zixi Liu",
        "Beiji Zou",
        "Yalong Xiao",
        "Meng Zeng",
        "Han Wang",
        "Ziang Fan"
    ],
    "doi": "10.3390/electronics12040987",
    "arxivId": null,
    "url": "https://www.semanticscholar.org/paper/e53fed6d71f946d7d73f3121c1fbc8240c5be731",
    "isOpenAccess": true,
    "openAccessPdf": "https://www.mdpi.com/2079-9292/12/4/987/pdf?version=1676540883",
    "publicationTypes": null,
    "s2FieldsOfStudy": [
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "In medical services, the amount of data generated by medical devices is increasing explosively, and access to medical data is also put forward with higher requirements. Although HBase-based medical data storage solutions exist, they cannot meet the needs of fast locating and diversified access to medical data. In order to improve the retrieval speed, the recognition model S-TCR and the dynamic management algorithm SL-TCR, based on the behavior characteristics of access, were proposed to identify the frequently accessed hot data and dynamically manage the data storage medium as to maximize the system access performance. In order to improve the search performance of keys, an optimized secondary index strategy was proposed to reduce I/O overhead and optimize the search performance of non-primary key indexes. Comparative experiments were conducted on real medical data sets. The experimental results show that the optimized retrieval model can meet the needs of hot data access and diversified medical data retrieval.",
    "citationCount": 4,
    "referenceCount": 32
}