{
    "paperId": "e80aba67e92aec3ef06ed31193832c6f81e9a2ed",
    "title": "INODE",
    "year": 2021,
    "venue": "SIGMOD record",
    "authors": [
        "S. Amer-Yahia",
        "Georgia Koutrika",
        "Frédéric B. Bastian",
        "Theofilos Belmpas",
        "Martin Braschler",
        "Ursin Brunner",
        "Diego Calvanese",
        "M. Fabricius",
        "Orest Gkini",
        "Catherine Kosten",
        "D. Lanti",
        "Antonis Litke",
        "Hendrik Lücke-Tieke",
        "F. Massucci",
        "T. M. Farias",
        "A. Mosca",
        "Francesco Multari",
        "N. Papadakis",
        "D. Papadopoulos",
        "Yogendra Patil",
        "Aurélien Personnaz",
        "Guillem Rull",
        "A. Sima",
        "Ellery Smith",
        "Dimitrios Skoutas",
        "S. Subramanian",
        "G. Xiao",
        "Kurt Stockinger"
    ],
    "doi": "10.1145/3516431.3516436",
    "arxivId": "2104.04194",
    "url": "https://www.semanticscholar.org/paper/e80aba67e92aec3ef06ed31193832c6f81e9a2ed",
    "isOpenAccess": false,
    "openAccessPdf": "",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "A full-fledged data exploration system must combine different access modalities with a powerful concept of guiding the user in the exploration process, by being reactive and anticipative both for data discovery and for data linking. Such systems are a real opportunity for our community to cater to users with different domain and data science expertise. We introduce INODE - an end-to-end data exploration system - that leverages, on the one hand, Machine Learning and, on the other hand, semantics for the purpose of Data Management (DM). Our vision is to develop a classic unified, comprehensive platform that provides extensive access to open datasets, and we demonstrate it in three significant use cases in the fields of Cancer Biomarker Research, Research and Innovation Policy Making, and Astrophysics. INODE offers sustainable services in (a) data modeling and linking, (b) integrated query processing using natural language, (c) guidance, and (d) data exploration through visualization, thus facilitating the user in discovering new insights. We demonstrate that our system is uniquely accessible to a wide range of users from larger scientific communities to the public. Finally, we briefly illustrate how this work paves the way for new research opportunities in DM.",
    "citationCount": 12,
    "referenceCount": 53
}