{
    "paperId": "ecbb7ac427e514e0ca499215d095aa0e857a44c2",
    "title": "Blueprinting the Cloud: Unifying and Automatically Optimizing Cloud Data Infrastructures with BRAD",
    "year": 2024,
    "venue": "Proceedings of the VLDB Endowment",
    "authors": [
        "Geoffrey X. Yu",
        "Ziniu Wu",
        "Ferdinand Kossmann",
        "Tianyu Li",
        "Markos Markakis",
        "Amadou Latyr Ngom",
        "Samuel Madden",
        "Tim Kraska"
    ],
    "doi": "10.14778/3681954.3682026",
    "arxivId": "2407.15363",
    "url": "https://www.semanticscholar.org/paper/ecbb7ac427e514e0ca499215d095aa0e857a44c2",
    "isOpenAccess": true,
    "openAccessPdf": "http://arxiv.org/pdf/2407.15363",
    "publicationTypes": [
        "JournalArticle"
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "abstract": "\n Modern organizations manage their data with a wide variety of specialized cloud database engines (e.g., Aurora, BigQuery, etc.). However, designing and managing such infrastructures is hard. Developers must consider many possible designs with non-obvious performance consequences; moreover, current software abstractions tightly couple applications to specific systems (e.g., with engine-specific clients), making it difficult to change after initial deployment. A better solution would\n virtualize\n cloud data management, allowing developers to declaratively specify their workload requirements and rely on automated solutions to design and manage the physical realization. In this paper, we present a technique called\n blueprint planning\n that achieves this vision. The key idea is to project data infrastructure design decisions into a unified design space (blueprints). We then systematically search over candidate blueprints using cost-based optimization, leveraging learned models to predict the utility of a blueprint on the workload. We use this technique to build BRAD, the first cloud data virtualization system. BRAD users issue queries to a single SQL interface that can be backed by multiple cloud database services. BRAD automatically selects the most suitable engine for each query, provisions and manages resources to minimize costs, and evolves the infrastructure to adapt to workload shifts. Our evaluation shows that BRAD meet user-defined performance targets and improve cost-savings by 1.6--13× compared to serverless auto-scaling or HTAP systems.\n",
    "citationCount": 5,
    "referenceCount": 101
}