{
  "paperId": "32f33694bced4b0fb5190d1f7c70bbc6aa6b257a",
  "title": "FB+-tree: A Memory-Optimized B+-tree with Latch-Free Update",
  "abstract": "\n B\n +\n -trees are prevalent in traditional database systems due to their versatility and balanced structure. While binary search is typically utilized for branch operations, it may lead to inefficient cache utilization in main-memory scenarios. In contrast, trie-based index structures drive branch operations through prefix matching. While these structures generally produce fewer cache misses and are thus increasingly popular, they may underperform in range scans because of frequent pointer chasing.\n \n \n This paper proposes a new high-performance B\n +\n -tree variant called\n \n Feature B\n +\n -tree (FB\n +\n -tree\n \n ). Similar to employing bit or byte for branch operation in tries, FB\n +\n -tree progressively considers several bytes following the common prefix on each level of its inner nodes—referred to as features, which allows FB\n +\n -tree to benefit from prefix skewness. FB\n +\n -tree blurs the lines between B\n +\n -trees and tries, while still retaining balance. In the best case, FB\n +\n -tree almost becomes a trie, whereas in the worst case, it continues to function as a B\n +\n -tree. Meanwhile, a crafted synchronization protocol that combines the link technique and optimistic lock is designed to support efficient concurrent index access. Distinctively, FB\n +\n -tree leverages subtle atomic operations seamlessly coordinated with optimistic lock to facilitate latch-free updates, which can be easily extended to other structures. Intensive experiments on multiple workload-dataset combinations demonstrate that FB\n +\n -tree shows comparable lookup performance to state-of-the-art trie-based indexes and outperforms popular B\n +\n -trees by 2.3x ~ 3.7x under 96 threads. FB\n +\n -tree also exhibits significant potential on other workloads, especially update workloads under contention and scan workloads.\n",
  "tags": [
    "B-tree",
    "Database",
    "Main-memory",
    "Updatable"
  ]
}