{
  "paperId": "42b7a0c9e6cbd1b237e84416feb6abb7e5d4ba10",
  "title": "GridTables: A One-Size-Fits-Most H2TAP Data Store",
  "abstract": "Heterogeneous HybridTransactionalAnalytical Processing (H2\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\mathrm{H}^{2}$$\\end{document}TAP) database systems have been developed to match the requirements for low latency analysis of real-time operational data. Due to technical challenges, these systems are hard to architect, non-trivial to engineer, and complex to administrate. Current research has proposed excellent solutions to many of those challenges in isolation – a unified engine enabling to optimize performance by combining these solutions is still missing. In this concept paper, we suggest a highly flexible and adaptive data structure (called gridtable) to physically organize sparse but structured records in the context of H2\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\mathrm{H}^{2}$$\\end{document}TAP. For this, we focus on the design of an efficient highly-flexible storage layout that is built from scratch for mixed query workloads. The key challenges we address are: (1) partial storage in different memory locations, and (2) the ability to optimize for mixed OLTP-/OLAP access patterns. To guarantee safe and well-specified data definition or manipulation, as well as fast querying with no compromises on performance, we propose two dedicated access paths to the storage. In this paper, we explore the architecture and internals of gridtables showing design goals, concepts and trade-offs. We close this paper with open research questions and challenges that must be addressed in order to take advantage of the flexibility of our solution.",
  "tldr_ja": "本論文では、リアルタイムデータの低遅延分析に対応するためのH2TAPデータベースシステムにおける新しいデータ構造「グリッドテーブル」を提案します。この構造は、混合クエリワークロードに最適化された柔軟なストレージレイアウトを提供し、異なるメモリ位置への部分的な保存やOLTP/OLAPアクセスパターンの最適化を実現します。設計目標や課題についても考察し、今後の研究課題を提示します。"
}