{
  "paperId": "54da1d1e0e42da12b4cf144a533533ea8c5dbdcb",
  "title": "Two Birds With One Stone: Boosting Both Search and Write Performance for Tree Indices on Persistent Memory",
  "abstract": "The advance of byte-addressable persistent memory (PM) makes it a hot topic to revisit traditional tree indices such as B+-tree and radix tree, and a few new persistent memory-friendly tree indices have been proposed. However, due to the special features of persistent memory compared to DRAM and the limitations of B+-tree-like indices, it is much harder to optimize both search and write performance for tree indices on persistent memory. As a result, most existing indices for persistent memory, e.g., WB-tree, proposed to improve write performance while sacrificing search performance. Aiming to optimize both write and search performance for tree indices on persistent memory, in this paper, we first propose a novel Two-Layer Architecture (TLA) for constructing tree indices on persistent memory. The key idea, of TLA is to organize the index with a search-optimized top layer and a write-optimized bottom layer, letting the top layer optimize search performance and the bottom layer improve write performance. By adopting efficient structures for the two layers, TLA can boost both write and search performance for tree indices on persistent memory. Following the TLA architecture, we present a new index called TLBtree (Two-Layer B+-tree) offering high search and write performance for persistent memory. Moreover, we develop a concurrent TLBtree to support non-blocking read operations in multi-core environment. We evaluate our proposals under a server equipped with real Intel Optane persistent memory. The results show that TLBtree outperforms the state-of-the-art tree indices, including WB-tree, Fast&Fair, and FPTree, in both search and write performance. Also, the concurrent TLBtree can achieve up to 3.7x speedup than its competitors under the multi-core environment.",
  "tldr_ja": "持続可能なメモリ上のツリーインデックスの検索と書き込み性能を同時に向上させるために、新しい二層アーキテクチャ（TLA）を提案し、これに基づくTLBtreeを開発。実験結果では、TLBtreeが既存のインデックスよりも優れた性能を示し、マルチコア環境でも最大3.7倍の速度向上を実現。"
}