{
  "paperId": "ab74094fceff93d315cd5fd01b691842935a9579",
  "title": "The role of classifiers and data complexity in learned Bloom filters: insights and recommendations",
  "abstract": "Bloom filters, since their introduction over 50 years ago, have become a pillar to handle membership queries in small space, with relevant application in Big Data Mining and Stream Processing. Further improvements have been recently proposed with the use of Machine Learning techniques: learned Bloom filters. Those latter make considerably more complicated the proper parameter setting of this multi-criteria data structure, in particular in regard to the choice of one of its key components (the classifier) and accounting for the classification complexity of the input dataset. Given this State of the Art, our contributions are as follows. (1) A novel methodology, supported by software, for designing, analyzing and implementing learned Bloom filters that account for their own multi-criteria nature, in particular concerning classifier type choice and data classification complexity. Extensive experiments show the validity of the proposed methodology and, being our software public, we offer a valid tool to the practitioners interested in using learned Bloom filters. (2) Further contributions to the advancement of the State of the Art that are of great practical relevance are the following: (a) the classifier inference time should not be taken as a proxy for the filter reject time; (b) of the many classifiers we have considered, only two offer good performance; this result is in agreement with and further strengthens early findings in the literature; (c) Sandwiched Bloom filter, which is already known as being one of the references of this area, is further shown here to have the remarkable property of robustness to data complexity and classifier performance variability.",
  "tldr_ja": "学習されたブルームフィルタの設計と実装に関する新しい方法論を提案し、分類器の選択やデータの複雑性を考慮した実験結果を示す。また、分類器の推論時間はフィルタの拒否時間の代理としては不適切であり、性能の良い分類器は限られていることを確認。サンドイッチブルームフィルタはデータの複雑性や分類器の性能変動に対して堅牢であることが示された。"
}