{
  "paperId": "f58fecc48ad0b478bce32ea42081f403c93251d5",
  "title": "From LeanStore to LearnedStore: Using a Learned Index to Improve Database Index Search",
  "abstract": "In the realm of database systems, optimizing B+-tree index performance is of paramount importance to overall database performance. LeanStore, a high-performance OLTP storage engine, has extensively optimized its in-memory B+-tree component as well as its B+-tree -indexed database on the disk. However, B+-tree's lookup time increases linearly with the tree height. This is especially problematic when all or part of its lookup path is on the disk. Recently proposed learned index technique has the potential to significantly improve the performance of the B+-tree -based index by predicting location of the search key, instead of the level-by-Ievel path walk. However, this machine-learning-model-based index has prediction errors that require a local search within the sorted keys. When the keys are on the disk, this search can be very expensive. The errors increase with write requests, which makes the search increasingly more expensive. We propose LearnedStore, in which the learned index technique is leveraged to improve the LeanStore database while the deterioration of learned-index's search performance is curbed. Instead of replacing the B+-tree index in LeanStore, Learned-Store opportunistically employs a learned index when it offers a performance advantage over the B+-tree index. Otherwise, it reverts to using the B+-tree index. By seamlessly integrating the learned index with LeanStore's B+-tree structure, LearnedStore takes advantage of the learned index while effectively addressing its challenges. We have implemented LearnedStore and exten-sively evaluated its performance. Experiment results show that LearnedStore improves throughput by up to 2.29 times for read-only workloads when the index and data set are all in memory. It reduces tail latency by up to 6.84 times when the index and data set are partially in the memory. Even when the entire index and data set are on the disk, LearnedStore can improve startup time by 3.05 times.",
  "tldr_ja": "LeanStoreのB+-treeインデックス性能を向上させるために、学習インデックス技術を活用したLearnedStoreを提案。学習インデックスの利点を生かしつつ、検索性能の低下を抑え、B+-treeインデックスと併用。実験結果では、メモリ内データでスループットが最大2.29倍、部分メモリで待機時間が最大6.84倍改善され、ディスク上でも起動時間が3.05倍向上。"
}