{
  "paperId": "f26c6b76a0f72bb300acdd28fca58af84c2bbc0f",
  "title": "Learning Road Network Index Structure for Efficient Map Matching",
  "abstract": "Map matching aims to align GPS trajectories to their actual travel routes on a road network, which is an essential pre-processing task for most of trajectory-based applications. Many map matching approaches utilize Hidden Markov Model (HMM) as their backbones. Typically, HMM treats GPS samples of a trajectory as observations and nearby road segments as hidden states. During map matching, HMM determines candidate states for each observation with a fixed searching range, and computes the most likely travel route using the <italic>Viterbi</italic> algorithm. Although HMM-based approaches can derive high matching accuracy, they still suffer from high computation overheads. By inspecting the HMM process, we find that the computation bottleneck mainly comes from improper candidate sets, which contain many irrelevant candidates and incur unnecessary computations. In this paper, we present <inline-formula><tex-math notation=\"LaTeX\">$\\mathtt {LiMM}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"monospace\">LiMM</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq1-3485195.gif\"/></alternatives></inline-formula> – a learned road network index structure for efficient map matching. <inline-formula><tex-math notation=\"LaTeX\">$\\mathtt {LiMM}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"monospace\">LiMM</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq2-3485195.gif\"/></alternatives></inline-formula> improves existing HMM-based approaches from two aspects. First, we propose a novel learned index for road networks, which considers the characteristics of road data. Second, we devise an adaptive searching range mechanism to dynamically adjust the searching range for GPS samples based on their locations. As a result, <inline-formula><tex-math notation=\"LaTeX\">$\\mathtt {LiMM}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"monospace\">LiMM</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq3-3485195.gif\"/></alternatives></inline-formula> can provide refined candidate sets for GPS samples and thus accelerate the map matching process. Extensive experiments are conducted with three large real-world GPS trajectory datasets. The results demonstrate that <inline-formula><tex-math notation=\"LaTeX\">$\\mathtt {LiMM}$</tex-math><alternatives><mml:math><mml:mi mathvariant=\"monospace\">LiMM</mml:mi></mml:math><inline-graphic xlink:href=\"liu-ieq4-3485195.gif\"/></alternatives></inline-formula> significantly reduces computation overheads by achieving an average speedup of <inline-formula><tex-math notation=\"LaTeX\">$11.7\\times$</tex-math><alternatives><mml:math><mml:mrow><mml:mn>11</mml:mn><mml:mo>.</mml:mo><mml:mn>7</mml:mn><mml:mo>×</mml:mo></mml:mrow></mml:math><inline-graphic xlink:href=\"liu-ieq5-3485195.gif\"/></alternatives></inline-formula> than baseline methods, merely with a subtle accuracy loss of 1.8%.",
  "tldr": "The paper introduces LiMM, a learned road network index structure that enhances map matching efficiency by refining candidate sets and adapting search ranges for GPS data. It achieves an 11.7x speedup over traditional HMM methods with only a 1.8% accuracy loss."
}