{
  "paperId": "01f2c568368b7ab427bd8d05d2a94bf0889fcc16",
  "title": "Learned Sorted Table Search and Static Indexes in Small-Space Data Models",
  "abstract": "Machine-learning techniques, properly combined with data structures, have resulted in Learned Static Indexes, innovative and powerful tools that speed up Binary Searches with the use of additional space with respect to the table being searched into. Such space is devoted to the machine-learning models. Although in their infancy, these are methodologically and practically important, due to the pervasiveness of Sorted Table Search procedures. In modern applications, model space is a key factor, and a major open question concerning this area is to assess to what extent one can enjoy the speeding up of Binary Searches achieved by Learned Indexes while using constant or nearly constant-space models. In this paper, we investigate the mentioned question by (a) introducing two new models, i.e., the Learned k-ary Search Model and the Synoptic Recursive Model Index; and (b) systematically exploring the time–space trade-offs of a hierarchy of existing models, i.e., the ones in the reference software platform Searching on Sorted Data, together with the new ones proposed here. We document a novel and rather complex time–space trade-off picture, which is informative for users as well as designers of Learned Indexing data structures. By adhering to and extending the current benchmarking methodology, we experimentally show that the Learned k-ary Search Model is competitive in time with respect to Binary Search in constant additional space. Our second model, together with the bi-criteria Piece-wise Geometric Model Index, can achieve speeding up of Binary Search with a model space of 0.05% more than the one taken by the table, thereby, being competitive in terms of the time–space trade-off with existing proposals. The Synoptic Recursive Model Index and the bi-criteria Piece-wise Geometric Model complement each other quite well across the various levels of the internal memory hierarchy. Finally, our findings stimulate research in this area since they highlight the need for further studies regarding the time–space relation in Learned Indexes.",
  "tldr_ja": "本論文では、機械学習を用いた新しいデータ構造「学習済み静的インデックス」が、バイナリ検索の高速化に寄与することを探求しています。特に、定数またはほぼ定数の空間モデルでの性能向上を評価し、新たに提案した「学習k-ary検索モデル」と「総合再帰モデルインデックス」が、従来の手法と競争力を持つことを示しました。これにより、学習インデックスの時間-空間トレードオフに関するさらなる研究の必要性が浮き彫りになりました。"
}