{
  "paperId": "653e829635bb7f19cf0ee0c66dd5d7fe955d4d04",
  "title": "AnnotatedTables: A Large Tabular Dataset with Language Model Annotations",
  "abstract": "Tabular data is ubiquitous in real-world applications and abundant on the web, yet its annotation has traditionally required human labor, posing a significant scalability bottleneck for tabular machine learning. Our methodology can successfully annotate a large amount of tabular data and can be flexibly steered to generate various types of annotations based on specific research objectives, as we demonstrate with SQL annotation and input-target column annotation as examples. As a result, we release AnnotatedTables, a collection of 32,119 databases with LLM-generated annotations. The dataset includes 405,616 valid SQL programs, making it the largest SQL dataset with associated tabular data that supports query execution. To further demonstrate the value of our methodology and dataset, we perform two follow-up research studies. 1) We investigate whether LLMs can translate SQL programs to Rel programs, a database language previously unknown to LLMs, while obtaining the same execution results. Using our Incremental Prompt Engineering methods based on execution feedback, we show that LLMs can produce adequate translations with few-shot learning. 2) We evaluate the performance of TabPFN, a recent neural tabular classifier trained on Bayesian priors, on 2,720 tables with input-target columns identified and annotated by LLMs. On average, TabPFN performs on par with the baseline AutoML method, though the relative performance can vary significantly from one data table to another, making both models viable for practical applications depending on the situation. Our findings underscore the potential of LLMs in automating the annotation of large volumes of diverse tabular data.",
  "tldr_ja": "本研究では、タブularデータの自動アノテーション手法を提案し、32,119のデータベースと405,616のSQLプログラムからなるAnnotatedTablesデータセットを公開しました。LLMを用いたアノテーションにより、SQLからRelプログラムへの翻訳や、TabPFNの性能評価を行い、実用的なタブular機械学習の可能性を示しました。"
}