{
  "paperId": "77b3d679f25ec2123e8acac9fefdd508819bba8a",
  "title": "ActiveReach: an active learning framework for approximate reachability query answering in large-scale graphs",
  "abstract": "With graph reachability query, one can answer whether there exists a path between two query vertices in a given graph. The existing reachability query processing solutions use traditional reachability index structures and can only compute exact answers, which may take a long time to resolve in large graphs. In contrast, with an approximate reachability query, one can offer a compromise by enabling users to strike a trade-off between query time and the accuracy of the query result. In this study, we propose a framework, dubbed ActiveReach, for learning index structures to answer approximate reachability query. ActiveReach is a two-phase framework that focuses on embedding nodes in a reachability space. In the first phase, we leverage node attributes and positional information to create reachability-aware embeddings for each node. These embeddings are then used as nodes' attributes in the second phase. In the second phase, we incorporate the new attributes and include reachability information as labels in the training data to generate embeddings in a reachability space. In addition, computing reachability for all training data may not be practical. Therefore, selecting a subset of data to compute reachability effectively and enhance reachability prediction performance is challenging. ActiveReach addresses this challenge by employing an active learning approach in the second phase to selectively compute reachability for a subset of node pairs, thus learning the approximate reachability for the entire graph. Our extensive experimental study with various real attributed large-scale graphs demonstrates the effectiveness of each component of our framework.",
  "tldr_ja": "本研究では、大規模グラフにおける近似到達可能性クエリを解決するためのフレームワーク「ActiveReach」を提案します。二段階のアプローチでノードの埋め込みを生成し、アクティブラーニングを用いて選択的に到達可能性を計算することで、クエリ時間と精度のトレードオフを実現します。実験により、フレームワークの各要素の有効性が示されました。"
}